[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236585/portabella-and-artichoke-stuffed-chicken/",
        "name": "Portabella and Artichoke Stuffed Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6348316.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2018-06-08T14:12:56.000Z",
        "description": "Skinless, boneless chicken breasts are split and stuffed with mushrooms, ricotta, and feta cheeses and marinated artichokes and sprinkled with Italian seasonings and Parmesan! To add Italian flair, serve the chicken over pasta with your favorite sauce. Make sure the mushrooms are sliced thin, and don't rinse the artichoke hearts, just drain them. You can substitute goat cheese for the feta cheese.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "40 servings",
        "recipeIngredient": [
            "1 cup extra-virgin olive oil",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "1 teaspoon paprika",
            "½ teaspoon ground thyme",
            "5 cups ricotta cheese",
            "1 cup crumbled feta cheese",
            "6 eggs, beaten",
            "3 cups sliced baby portabella mushrooms",
            "2 (6.5 ounce) jars marinated artichoke hearts, drained and chopped",
            "20 cloves garlic, minced",
            "3 tablespoons ground black pepper",
            "4 teaspoons onion powder",
            "4 teaspoons garlic powder",
            "1 tablespoon dried basil",
            "1 tablespoon ground cumin",
            "1 tablespoon dried thyme",
            "40 skinless, boneless chicken breast halves",
            "2 cups grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place 1 teaspoon salt, 1 teaspoon black pepper, paprika, and 1/2 teaspoon thyme together in a small bowl or bottle; pour olive oil into bowl. Cover the bowl tightly and refrigerate until oil is infused, at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease enough baking dishes to fit all of the stuffed chicken breasts in a single layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir ricotta cheese, feta cheese, eggs, mushrooms, artichoke hearts, garlic, black pepper, onion powder, garlic powder, basil, cumin, and 1 tablespoon thyme together in a large bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken breasts on a flat work surface. Use a paring or boning knife to cut from one side of a chicken breast through the middle of the breast to within 1/2-inch of the other side, creating a deep pocket. Spoon mushroom and artichoke mixture into chicken until pocket is full; use toothpick to close and secure the pocket. Repeat with remaining chicken breasts and filling. Place stuffed chicken in prepared baking dishes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush each chicken breast with about 1 teaspoon infused olive oil and sprinkle Parmesan cheese over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake chicken in the preheated oven until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cool slightly before serving, about 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 4,
            "itemReviewed": "Portabella and Artichoke Stuffed Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "242 calories",
            "carbohydrateContent": "3.2 g",
            "cholesterolContent": "104.2 mg",
            "fatContent": "12.2 g",
            "fiberContent": "0.8 g",
            "proteinContent": "28.7 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "294.2 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2019-02-07T16:37:16.333Z",
                "reviewBody": "I used Panko Breadcrumbs after an egg wash on the chicken and I only stuffed it with thinly sliced mozzarella, crushed bacon, and diced mushrooms. Then, I added salt and pepper to the top of the chicken and baked for 35 min on 350. Came out perfect which surprised me because the chicken breasts I used were really thick. Husband loved it! Made some mashed potatoes for a side, came out well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Xena Alvarez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25043846/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-21T23:49:23.983Z",
                "reviewBody": "I forgot the parmesan cheese so MY dish was really only 3 stars. I am giving it 4 stars because I imagine the cheese would have helped considerably! Also only had artichokes in water but it calls for marinated artichokes. That would have added flavor also. Scaled this back to 4 servings so had to estimate some of the seasonings. I used only 1/2 tsp pepper in ricotta mix. May try it again with correct ingredients! NOTE THAT IT TAKES APPROX 60 MINUTES to cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JoannZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4269159/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-27T09:20:29.83Z",
                "reviewBody": "I never leave a comment usually! This was a good base for something I thought turned out awesome! Hammered out the chicken.. didn't make the oil because I forgot too. Made 2 chicken breasts. Used about a half a cup of cottage cheese one egg added the rest of the spices. Rolled up the chicken salt pepper drizzled olive oil and put the rest of the filling on top. Served with bow tie pasta. Was pretty good! Will make this again! Think next time I'll add some pesto though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Manda Tronborg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15035429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-09T22:12:47.82Z",
                "reviewBody": "This recipe was good but there are definitely adjustments that need to be made. First I changed the number of portions to 4 which I was able to stuff 3 chicken breasts. I used smaller whole chicken breasts instead of the halves like the recipe called for. I was afraid that the chicken would be too dry if I used halves. The breasts worked better and were a bit more juicier than had I followed the recipe. The stuffing was ok. Too much pepper and no salt. The type of marinated artichokes I bought were not something I liked and will be using plain in the future. This way I can adjust the seasoning and add salt to be more to my liking. It also was a bit dry I will probably add some mozzarella to help balance out the moisture. The infused oil was good although I didn't read the recipe fully to see that it needed to sit a while. I left it out at room temperature to infuse. It can also be done on low heat. The warmth helps release the oils in the spices refrigeratoring it extends the infusion process. I gave the 3 rating because of the things mentioned above. If there were categories for the ratings the versatility of the recipe would be a 4-5. It is very easy to change up to individual tastes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena Landowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21938948/"
                }
            }
        ]
    }
]