[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/74989/homemade-vanilla-extract/",
        "name": "Homemade Vanilla Extract",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1123115.jpg",
            "width": 1920,
            "height": 1080
        },
        "datePublished": "2018-05-04T13:01:27.000Z",
        "description": "Homemade vanilla extract! What could be better and cheaper! I use Madagascar vanilla beans.",
        "prepTime": "P0DT0H5M",
        "cookTime": null,
        "totalTime": "P21DT0H5M",
        "recipeYield": "1 teaspoon servings",
        "recipeIngredient": [
            "10 vanilla beans, split lengthwise",
            "1 liter vodka"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the vanilla beans in the bottle of vodka and seal. Store in a cool, dark area such as a kitchen cabinet for 3 weeks, shaking the bottle every week. Three weeks is the minimum, store it 6 months for the best flavor. After using, replace with more vodka. The same beans will continue to flavor the vanilla for up to a year.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "RE_BEKAH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.672566371681416,
            "ratingCount": 113,
            "itemReviewed": "Homemade Vanilla Extract",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "13.6 calories",
            "carbohydrateContent": "0.7 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": null,
            "proteinContent": null,
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": null,
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-17T20:44:39.51Z",
                "reviewBody": "I stumbled upon a Vanilla Extract recipe years ago and have always wanted to try it; most recipes seem very similar to one another. I used a 1.75 liter bottle of Svedka and 25 Madagascar Vanilla Beans that I purchased from Beanilla along with some small bottles to bottle my extract for gift giving. The beans were very plump and seemed to be very nice quality. I split them and scraped out the seeds and placed seeds and beans into the 1.75 liter bottle of Vodka to age for 3 months, stored it in a dark area and gave it a little shake about once a week. After it aged for 3 months, I filtered it through a gold coffee filter to separate the seeds and bean fibers from the liquid, Don’t discard the beans, save them to place into the individual bottles. Gold coffee filters can be found at Walmart for about $5, they are very fine and make an excellent filter and they don’t absorb the extract. I placed one vanilla bean into each bottle so that it will continue to strengthen in the months to come. Used a small funnel to fill each individual bottle, added my custom labels, a gift tag and bow and I have a wonderful little gift to give to family and friends. I filled 10, 4 oz bottles and 1, 8 oz bottle and had about a cup of extract left over that I saved for myself. I would recommend using a 4 oz bottle; it seemed the perfect size for gift giving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Texastwinkie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/360413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T18:56:37.737Z",
                "reviewBody": "I love the idea of making my own vanilla, and now that I've done it, I will never buy vanilla again.  HOWEVER, after substantial reading across a number of site, this has too few vanilla beans in it to reach the desired alcohol content to technically be vanilla extract.  You also need the beans to sit in there a full 6 months for this ratio to be reached.  For 1L of vodka, you will want 1/4 lb beans.  But you can get a quarter pound on ebay for cheap (~$12).  Also, buy the grade B beans, those are extract beans.  Grade A won't give you as much flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "catwhispererPhD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4198931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-28T20:53:56.65Z",
                "reviewBody": "I started making my own pure vanilla using this method. It's wonderful! I use only vodka (tried rum once, didn't care for the result). You can just cut the vanilla beans into thirds and slip them into the vodka; shake several times weekly and notice the color changing. As stated, the minimum time is weeks, but leave it as long as you can... months would be preferable. My guideline is once I can't smell the alcohol, it's pretty much ready. Homemade vanilla can take on a bit of a cloudy appearance, so don't be alarmed. You can strain a little of it at a time into a smaller bottle using a coffee filter, and let the rest hang out and get even stronger and better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen_M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-12T16:31:10.027Z",
                "reviewBody": "I've been making vanilla extracts and sugars for many years. Here are a few tips:  You want to purchase the grade B beans not because they are cheaper (which they are) but because they have a lower water content.  That is the grade used commercially.  By splitting your beans, or snipping into small bits, you expose more surface area, which makes a better extract.  Commercial V.E. is macerated.  Since my big pantry bottle of extract contains lots of chopped beans, I strain what I need into a smaller bottle for my cupboard, and for gifts.  Don't be afraid to add more beans. I prefer a double-strength extract myself.  When your extract runs low; no need to toss your beans out.  You can continue to use them by adding more vodka and beans to the existing batch if desired.  If you feel your vanilla extract is too weak, just add a few more beans (the drier grade B beans).    Go ahead and experiment.  Madagascar a.k.a. Bourbon beans provide the traditional vanilla scent you are probably expecting.  Tahitian vanilla beans are softer and more floral.  Mexican vanilla extract pairs very well with chocolate.    Hope that was helpful!  Want to learn more?  Search Wikipedia, or check out the FDA quidelines for making commercial extracts which are posted online fda_dot_gov.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nanc_b",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2649045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-12T19:13:37.827Z",
                "reviewBody": "I use Martha Stewarts recipe which calls for 1 cup at a time. Her recipe is 1 c. good vodka to 2 split vanilla beans and let it set for 3 months. I have 4 c. of it made now for Christmas gifts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K.M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/679453/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-21T18:21:02.19Z",
                "reviewBody": "I used about 8 pods split lengthwise in a bottle of Smirnoff exactly like the one in the picture (I think it is 750 ml).  After 3 weeks it is so dark you have to hold it up to the light to see the pods inside.  It smells wonderful, just slightest smell of Vodka left but I don’t think it will be there much longer.  I have to try very hard to wait until it is ready before I try it.  I will be putting it though a coffee filter to get all the seeds and stuff out.  I read that if you dry out the pods when you are done and add them to a plastic bag with sugar it will flavor the sugar, good for baking and decorating cookies and cakes.  I will be trying that when my vanilla is done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "norahS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4607735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-22T15:26:41.57Z",
                "reviewBody": "I recently decided to make my own vanilla extract for gifts and resale (I want to start a business someday and am experimenting with some of the products I will carry).  I have read a lot about the proper way to make it and cam across a site that states requirements (by the FDA) of vanilla extract.  Apparently, it needs to be 6 beans per cup of alcohol, and anything less than that is just flavored liquor.  Since I'll be selling mine eventually, this is the ratio I will go by.  Also, it technically needs to be 70 proof (35%) alcohol.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CulinaryRookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3975563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-24T00:23:47.283Z",
                "reviewBody": "This is the best way to make your own vanilla extract! Don't buy those little expensive bottles in the grocery store. Make your own!  So much cheaper. I bought twelve 8 inch long vanilla beans on ebay for 99 cents and had enough to share with everybody in my family!  Just slice the bean, put it in the vodka and sit it in your cabinet.  They say vanilla is a sexual aphrodisiac. I believe it, after a month, I uncorked the bottle to smell it and good lord, talk about a heavenly smell.  Make your own, you will know what is in it, how fresh it is and it will make you feel good that you are making your own homemade products for your family.  I will never go back to buying my own extract ever again. This was too easy and fun to do !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "karie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1803167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-13T13:44:35.867Z",
                "reviewBody": "My 6 months are finally up!  This worked SO WELL!  I made 2 kinds - vodka and bourbon.  Lvu 'em both!  So-long store bought!  See ya! ***update***  I have added to my stash and find that I prefer the bourbon to the vodka.  I now use about 10 beans per cup and I have a much truer extract as opposed to flavored alcohol. I also split and scrape the paste out of each bean.  This makes the process quicker and I really like more flecks of the vanilla in my recipes.  If you have trouble cutting your beans I have found that  placing the bean on the cutting board, pierce the stem end with a very sharp knife, keep the knife in the board, hold the stem and then pull the bean across the blade.  This is easier than trying to split the bean as it rolls around moving the knife through it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "What's for dinner, mom?",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whats-4-dinner-mom/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Homemade Vanilla Extract",
            "description": "See how easy it is to make vanilla extract from scratch.",
            "uploadDate": "2013-10-18T20:22:06.489Z",
            "duration": "PT1M9.708S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F694a726b-1559-40eb-a8cf-c6f917212708%2Fc48b7757-1275-4e6a-b25b-b03f01d2001e%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2753386966001"
        }
    }
]