[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/169974/lime-curry-tofu-stir-fry/",
        "name": "Lime-Curry Tofu Stir-Fry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2526560.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2018-07-06T23:55:57.000Z",
        "description": "This is a quick and tasty sweet and sour dish. I like to marinate the tofu in the same sauce used on the dish, and then bake it at 375 degrees for 20 minutes--it makes the tofu really take on the flavor of the sauce.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons peanut oil",
            "1 (16 ounce) package extra-firm tofu, cut into bite-sized cubes",
            "1 tablespoon minced fresh ginger root",
            "2 tablespoons red curry paste",
            "1 pound zucchini, diced",
            "1 red bell pepper, diced",
            "3 tablespoons lime juice",
            "3 tablespoons soy sauce",
            "2 tablespoons maple syrup",
            "1 (14 ounce) can coconut milk",
            "½ cup chopped fresh basil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the peanut oil in a wok or large skillet over high heat. Add the tofu and stir-fry until golden brown. Remove the tofu and set aside, leaving the remaining oil in the wok.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the ginger and curry paste into the hot oil for a few seconds until the curry paste is fragrant and the ginger begins to turn golden. Add the zucchini and bell pepper; cook and stir for 1 minute. Pour in the lime juice, soy sauce, maple syrup, coconut milk, and tofu. Bring the coconut milk to a simmer, and cook a few minutes until the vegetables are tender and the tofu is hot. Stir in the chopped basil just before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kate Przybylo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.527777777777778,
            "ratingCount": 144,
            "itemReviewed": "Lime-Curry Tofu Stir-Fry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "425 calories",
            "carbohydrateContent": "20.9 g",
            "cholesterolContent": null,
            "fatContent": "38.8 g",
            "fiberContent": "3.6 g",
            "proteinContent": "18.4 g",
            "saturatedFatContent": "20.6 g",
            "servingSize": null,
            "sodiumContent": "856.2 mg",
            "sugarContent": "10.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-05-11T18:19:19.957Z",
                "reviewBody": "This recipe is very good and can be used with a variety of vegetables. But I made one significant change: I strongly recommend that you use fish sauce rather than soy sauce, if you can find it. I believe it is called nuoc mam in Vietnam, and nam pla in Thailand; those with expertise please feel free to correct me. Fish sauce gives the curry a characteristic flavor and aroma like what you find in Thai restaurant curries. IMHO soy sauce muddies the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Birdo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1932109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-19T14:12:44.657Z",
                "reviewBody": "Great recipe - but not quite perfect.  To avoid frying my tofu, I marinated it in the soy sauce, maple syrup and lime juice for about an hour and a half, and then baked for an hour at about 325 degrees, turning over once halfway through.  (Sounds excessive, I know, but it totally transforms the tofu - makes it chewier and more flavorful.)  Since I wasn't frying the tofu, I only used one tablespoon of oil.  I used lite coconut milk and it was fine.  I somehow managed to resist the incredibly strong urge to use fish sauce instead of soy sauce, figuring that (at least the first time) I should trust the recipe author; next time, I'll save my willpower for something with chocolate in it.  Although the soy sauce was totally fine, fish sauce would be better.  And I'm looking forward to adding a greater variety of veggies.  Still, this was a really good, simple recipe, and my favorite use to date of curry paste!  Thanks so much!  EDIT:  The second time I made this, I tried it with all fish sauce.  DON'T DO IT.  It's too much.  I had to throw the marinade away and start over.  2 T of soy sauce and 1 T of fish sauce seems to be about right; a pinch of salt really livens things up.  Still a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ZeldaSayre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/102702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-12T04:25:14.11Z",
                "reviewBody": "This dish was really tasty. I cooked for my steak and potatoes fiance (who hates bell peppers) and he loved it. We are trying to get healthier and slimmer for our wedding and this fit the bill. I would add 1 1/2 tablespoon more of the curry paste and 1 tablespoon more of the ginger. Also I would use only 3/4 of a pound of zucchini and add a fresh diced tomato. Otherwise this was WONDERFUL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "devinyates",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3278682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-16T17:36:43.997Z",
                "reviewBody": "This is a super easy curry to make!! The only thing I did differently was I added only 1 tablespoon of soy sauce and 2 tablespoons of fish sauce. You need the fish sauce to give it that authentic thai flavor. I also added garlic and green onions with the ginger. I will definitely make this again!!! Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Skye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3583094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-03T04:32:10.88Z",
                "reviewBody": "This dish was really flavorful--sweet and sour it's the perfect non-spicy Thai dish. The one thing I would add is that it works really well served over brown rice. On its own the stir fry can be a little too soupy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gabrielleattack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3254832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T19:46:06.553Z",
                "reviewBody": "Delicious. I did substitute fish sauce for the soy sauce. This was the first time I had used fish sauce and I think it made a huge difference in the flavor of the curry. Other than that I didn't change much. I thought the basil was a little heavy but the hubby disagreed and said he wanted more so I guess this was a good compromise. Will be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2970430/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-14T21:26:29.22Z",
                "reviewBody": "Amazing! This is easily one of my new favs! I fried the tofu up with garlic ginger and a dash of soya sauce. Also added garlic to the recipe and did sub in fish sauce which I think made a huge difference... My boyfriend does not like seafood but doesn't even notice a fish taste at all. The end result was delicious and I have a feeling I am going to be making this a lot more! Thank-you for the wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PUNKYBJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/904018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-01T01:29:03.137Z",
                "reviewBody": "Yum!! We really enjoyed this. I did marinate and bake the tofu first and I subbed 2 T. of Thai fish sauce as suggested. I also used agave syrup instead of maple (and way less of it...maybe 2 tsp.). We didn't have any basil so I used cilantro instead but not a ton of it (just a few leaves sprinkled over the top as a garnish). Oh and I let the veggies simmer a little bit longer than the recipe instructs. The combination of flavors in this dish is excellent. I served in shallow bowls over brown rice with plenty of the sauce for slurping.:) Be sure to drain your tofu really well before chopping and don't use any substitutions for the red curry paste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Hill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/993113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-06T18:38:38.91Z",
                "reviewBody": "GREAT recipe-- this was delicious. A few changes: 1) I used string beans instead of bell pepper because that's what I had on hand. 2) I also used cilantro instead of basil and 3) I minced a couple cloves of garlic and stir-fried it along with the ginger and curry paste. I make coconut/curry stir fries a lot and I never thought to use zucchini. It worked so well with the flavors in this dish. I love the \"soupy\"-ness of this; it reminds me of the hot pots I've had at Thai/Malaysian restaurants. Will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FoodByLauren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3005383/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-04T14:57:57.297Z",
                "reviewBody": "The flavor of this was pretty good but the way the milk curdled up when mixed with the lime juice made it pretty unappealing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Brie Kress",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/briennerose/"
                }
            }
        ]
    }
]