[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15009/desserts/specialty-desserts/liqueur-desserts/orange-liqueur/",
                    "name": "Orange Liqueur",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9442/chocolate-orange-truffles/",
        "name": "Chocolate Orange Truffles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F62642.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-11-09T02:12:37.000Z",
        "description": "Use orange liqueur or orange juice to flavor these dipped truffles. This is a very easy recipe, requiring no candy thermometer and no sensitive tempering of the chocolate.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT5H30M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "¼ cup unsalted butter",
            "3 tablespoons heavy cream",
            "4 (1 ounce) squares semisweet chocolate, chopped",
            "2 tablespoons orange liqueur ",
            "1 teaspoon grated orange zest",
            "4 (1 ounce) squares semisweet chocolate, chopped",
            "1 tablespoon vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium-high heat, combine butter and cream. Bring to a boil, and remove from heat. Stir in 4 ounces chopped chocolate, orange liqueur, and orange zest; continue stirring until smooth. Pour truffle mixture into a shallow bowl or a 9X5 in loaf pan. Chill until firm, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a baking sheet with waxed paper. Shape chilled truffle mixture by rounded teaspoons into small balls (a melon baller also works well for this part).  Place on prepared baking sheet. Chill until firm, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the top of a double boiler over lightly simmering water, melt remaining 4 ounces chocolate with the oil, stirring until smooth. Cool to lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop truffles, one at a time, into melted chocolate mixture. Using 2 forks, lift truffles out of the chocolate, allowing any excess chocolate to drip back into the pan before transferring back onto baking sheet. Chill until set.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Orange Liqueur"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Terry"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.476190476190476,
            "ratingCount": 84,
            "itemReviewed": "Chocolate Orange Truffles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "158.6 calories",
            "carbohydrateContent": "11.8 g",
            "cholesterolContent": "15.3 mg",
            "fatContent": "12.4 g",
            "fiberContent": "1.4 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "2.1 mg",
            "sugarContent": "10.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-05T15:18:33.357Z",
                "reviewBody": "The flavor of the filling is very good! I would recommend adding 1 Tbs. of either glucose or corn syrup to the unmelted chocolate and store in a seperate bowl. Heat the cream and butter as directed and pour it over the chocolate and zest. Cover and let sit for 10 minutes then stir. Add the liquor last. Let the mixture sit in the fridge overnight... it will be more firm and have better orange flavor the next day. I would not recommend adding oil to the chocolate used for coating as it slows it from hardening. Also do not be tempted to freeze the filling... the chocolate shell will crack if the filling is frozen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VANILLA MOON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/835005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-05T15:21:05Z",
                "reviewBody": "A HUGE hit for Christmas! Definitely chill well between steps and I put the balls in the freezer for 30 minutes before dipping in the chocolate which gave them a very professional look as the chocolate coating firmed up immediately. This one is perfect for a busy cook as the steps can take place over the course of a couple of days. Double the recipe because everyone will want them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BUBINK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/414161/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T02:29:02.57Z",
                "reviewBody": "Very delicious and easy!  I made these to give as homemade Valentine's Day candy.  I would make the following recommendations to the recipe:  double the recipe, I ended up with 28 very small chocolates.  I would double the recipe and make larger balls.  I had trouble getting my filling to get firm enough.  Even after 2+ hours of chilling it wasn't firm enough to roll.  So I scooped out the size balls I wanted onto a lined cookie sheet, then placed them in the FREEZER for 30 minutes, then I rolled them into balls, and \"froze\" for another 15 minutes longer before rolling them in the cooled chocolate coating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "springschel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/417803/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-25T05:12:58.233Z",
                "reviewBody": "Contrary to what may have been written by others this recipe is very good and not too difficult to complete. The key is patience. I followed the recipe exactly and these truffles came out very well. But you must be sure to refrigerate the chocolate for at least 2 hours then again after scooping and after rolling. That makes a huge difference in the end result. My only complaint was that I found the chocolates needed more sugar and a stronger flavor. The liquier just couldn't compete with the strength of the semi-sweet chocolate. ADDITIONAL NOTE: You must keep these refrigerated. If they get to room temperature the ganache melts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HRNEWBIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/943763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T02:22:00.327Z",
                "reviewBody": "I made these using grand marnier. Instead of dipping in chocolate I prefer my truffles rolled in cocoa this worked fine. These are excellent distinct orange flavor but not too much. Melt in your mouth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FrenchChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/233666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-18T05:10:40.08Z",
                "reviewBody": "These were very good! I have to say though that I missed the professional look of tempered chocolate. I rolled half of them in pecans and the other half in cocoa. Freezing the balls for thirty minutes before coating them in chocolate made them very easy to work with. I just read in a magazine that in order to avoid the foot that comes from coating with too much chocolate pour some chocolate in your hand and roll the truffle in it. You have more control than dipping in chocolate. I doubled the recipe; the original recipe doesn t make many truffles. Very nice and easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookin'mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/249327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-05T15:22:23.64Z",
                "reviewBody": "Made these last night. Oh My God Are They Good!!! Had a bit of a hard time getting the filling to chill stiff enough. But they turned out great. I also made a batch with Kahlua and instant coffee and they were good as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/408649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-30T04:35:35.517Z",
                "reviewBody": "I could hardly believe it but it worked: I substituted organic coconut milk for the cream and organic palm oil shortening for the butter. Added two tablespoons of homemade vanilla extract (it's not as strong as store-bought) instead of the orange flavor: and it all worked. And my dairy-allergic and corn-allergic family can enjoy truffles! I am one happy momma. Thank you thank you for this forgiving and adaptable recipe!! Now if I can just stop eating them myself...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CALLALILLIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1362524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-10T17:56:48.947Z",
                "reviewBody": "This recipe is delicious. I made them for my mom because her favorite thing is orange and chocolate. Be patient with this recipe. Here are some things I did to alter it that work wonderfully: 1. Get the most use out of the orange you bought by zesting 1 teaspoon like the recipe calls for and additionally peeling a little more than a dozen flakes with the peeler to use as decoration at the end. Instead of using liqueur I used juice from the orange reserving what's left for the decoration at the end as well. 2. Add at least an extra tablespoon of orange juice to the filling maybe even 1 1/2 like I did. It makes them more orangey. 3. I added a little under 1/2 cup of powdered sugar to the filling. It helps with the bitter flavor and makes it sweet. 4. I used olive oil instead of vegetable oil for the chocolate coating this works well. 5. After I dipped all the filling in chocolate I re-heated the remaining chocolate and added 3/4 cup of powdered sugar and 2-3 tblspns of orange juice (I should have used the leftover juice but I accidentally threw it out.) I dipped my fork in to the mixture once it was mixed smooth and drizzled it over the top of the truffles. In the drizzle on top of each one I placed an orange zest flake set aside form the beginning. They turned out magnificently.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VeggieKitty420",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6005463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-05T15:20:11.013Z",
                "reviewBody": "WHAT A MESS!!! In my opinion there is way too much liquid in this recipe. I planned to make these for my husband for Valentine's Day. I followed the recommendations submitted by other reviewers and chilled well/froze etc. I understand that weather conditions etc. can play a big part in the success or failure of a recipe but I could tell from the very beginning that this was not going to work because there was too much liquid. I had planned on a \"love basket\" and these were going to be the center piece... in a lovely container. I actually made 2 batches neither of which came out. (You definately want to double this recipe unless you want VERY tiny little truffles). I was desperate..... at this point my husband would be home in 1 hour and I was NOT going to the mall to pay way too much for the name brand chocolate. I managed to find some more chocolate and started over. I doubled the recipe. I cut the butter and the cream in half. I kept the liquor the same. I followed the directions as usual up to this point where you \"try to shape them into balls.\" After all the ingredients were mixed I got out my large tub of powdered sugar and just started adding it. I added and added and added until I came up with something that I could work with. I shaped them into balls and then froze them for approx. 10 minutes. I then dipped then in the chocolate. The recipe needs a lot of work but the taste if WONDERFUL. My husband is somewhat particular and said immediately th",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SDSANDER3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633816/"
                }
            }
        ]
    }
]