[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/155074/beccas-chicken-fried-pork-chops/",
        "name": "Becca's Chicken-Fried Pork Chops",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3866074.jpg",
            "width": 4160,
            "height": 2340
        },
        "datePublished": "2018-07-27T01:20:54.000Z",
        "description": "These are the best fried pork chops you will ever eat. You can also try this with cube steak for chicken-fried steak, or with chicken breast!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "1 ½ teaspoons ground paprika",
            "½ teaspoon garlic powder",
            "2 eggs",
            "½ cup milk",
            "½ (16 ounce) package saltine crackers, crushed",
            "½ cup dry potato flakes",
            "½ cup all-purpose flour",
            "4 (3/4 inch) thick pork chops",
            "salt and pepper to taste",
            "1 ½ cups vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a shallow bowl, mix 1 1/2 cup of flour, paprika, and garlic powder. In a second shallow bowl, whisk together the eggs and milk until thoroughly blended. In a third bowl, combine the crushed cracker crumbs, potato flakes, and 1/2 cup of flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a fork, prick the pork chops thoroughly to tenderize the meat. Season the chops with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently press the pork chops into the flour to coat, and shake off the excess flour. Dip into the beaten egg mixture, then press each chop into the cracker crumb mixture. Gently toss between your hands so any crumbs that haven't stuck can fall away\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large, deep skillet over medium heat, and gently place the pork chops into the hot oil. Fry the chops until the meat is no longer pink in the center and the crust is crisp and golden brown, about 5 minutes per side. Remove the chops from the pan, and drain the excess oil on paper towels.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rebecca Laymance"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.608695652173913,
            "ratingCount": 115,
            "itemReviewed": "Becca's Chicken-Fried Pork Chops",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "831.2 calories",
            "carbohydrateContent": "94.6 g",
            "cholesterolContent": "164.6 mg",
            "fatContent": "29.2 g",
            "fiberContent": "4.1 g",
            "proteinContent": "44.2 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "745.8 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-06-17T21:01:05.12Z",
                "reviewBody": "I was looking for a fried pork chop recipe that was different than what I normally use and found this. I made this for dinner tonight and it was great! The only thing I changed was that I fried them in a mid/high heat and then baked them for the remaining time. We tend to like our chops a bit more done. It was nice and crispy on the outside and juicy on the inside. Yum! Thank you!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "foxyfoote",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3795339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-17T15:09:13.16Z",
                "reviewBody": "I used Bisquick instead of flour.  I doubled the spices (paprika & garlic powder).  I also added a tablespoon of salt to the breading since I had no crushed crackers.  I used 1/2 inch pork chops and fried 2 minutes per side.  No baking.  These came out super moist and tasty.  I served the pork chops with rice and broccoli.  This was a quick and tasty supper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jane Guzauskas Ruby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2355486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-15T21:37:31.89Z",
                "reviewBody": "This was really great! Both my kids ate it! I added some pepper and chili powder to the flour mixture. I put both the dry combination's in large baggies and shook them, instead of using bowls. I could only fit three pork chops in my iron skillet, so I only put in 1 cup of oil. For those of you who had problems, if the oil is too hot, the outside of the pork will cook faster than the inside. If the breading of falling off, that probably means you don't have enough oil. When you're frying, you can't skimp on the oil! Thank you for posting this. We had a lovely dinner tonight!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bevarly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1946009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-16T14:12:10.753Z",
                "reviewBody": "I actually tried this last night and, while it was good, great even, it didn't really have the kick I'm looking for.  I'll play around with the seasonings and see if I can get some flavor-induced spiciness out of it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AppleJuice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3794239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-19T16:47:15.983Z",
                "reviewBody": "My boyfriend is very picky and i like to try different things i tried this one night and didnt tell him what the batter was till after, he loved it so much he keeps asking me when we are going to have it again, this is one of the best recipes i've found, and the chops are still really juicy, its great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Lynne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5076267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-19T17:29:21.553Z",
                "reviewBody": "I Love this recipe, the pork was tender while the coating was nice and crispy, just how we like it in our home. The only thing I would do, is add more seasoning to the flour coating and maybe add a little more on the one side as I brown it in the pan, As we do like a lot of spices on everything.    And since I like my husbands meals hot when he walks through the door, I browned them first and finished them off in the oven.  (in case of traffic issues making him late)  Thank you so much harperfamiy, for sharing this with us. I will be making this often and will be trying the coating on chicken next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "breezyauzette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4697916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-20T17:08:11.753Z",
                "reviewBody": "I bought 4 packages of pork loin boneless rib chops (15) for a great deal and wanted to try a breaded fried recipe. I only cook fried food maybe once a year. This was it. I started with most of the original ingredients though I didn't have saltine crackers or potato flakes. In the first bowl I increased the flour for the additional 11 chops (2 cups was plenty) added powdered sage cumin brown sugar powdered cinnamon ground red pepper and increased all other original ingredients by sight. No change to the milk and two eggs bowl. In the cracker bowl I started with fancy herb and garlic crackers some ritz knockoffs added crunchy honey oats cereal and some bran flakes cereal all crushed. As I tried one chop with the crackers and one with just the flour seasoning and egg I decided the chops with crackers where definitely better. I added some chil powder to the cracker cereal mix to give it what I thought it was missing. I did turn the heat down to medium and flipped at about 4.5 minutes per side to get the right color crust (used canola oil) So here I am with 13 fantastic chops at 2AM I'm not hungry after the first two. Tomorrow I'll do a chicken gravy and rice dish to go along with it and hook up the neighbors and girls at work. Thanks Becca for a great recipe. I'm giving it 5 stars because it inspired my additions and it came out tender and juicy. - Dale",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shrimpstuffedmanicott",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2913489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-19T10:48:36.037Z",
                "reviewBody": "Had about 8 thin cut boneless chops wanting to braise with peppers and balsamic vinegar DW halted that and requested my fried chops her favorite. Well who am I to say no to my love. In an effort to get away from traditional Italian breaded I found this recipe and decided to give it a try. Let me just say that supper was a big hit. Only thing I did different was to use ritz crackers cause no saltines and added a little herbs di Provence to the flour with s&p. Made some peppered country gravy with the cooking oil and flour to make a rue and used some chicken stock and milk. DW says this is a keeper for sure. Chops were tender and juicy didn't even need a knife with just the right amount of crispness. Note to others be sure you have enough oil this more like deep frying your chops should almost float and be sure of temp. I used 3/4 inches of oil at setting 7 on electric range and they were perfect golden brown. Thank you for sharing recipe I just sorry didn't get pics will post next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Grumpygrandpa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/grumpygrandpa/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-11T17:58:08.077Z",
                "reviewBody": "There wasn't much flavor in the breading even though I added some chili powder and a bit more paprika and garlic powder. Frying them for 5 minutes on each side made them very dark brown while the meat was still pink inside. So I threw them in the oven like another reviewers suggested which made the juices run out and got the bottoms soggy. By the time we sat down to eat the breading was falling off the meat even on the top. My fiance liked them but he's not picky. Don't know that I will be making these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsea Rice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3579897/"
                }
            }
        ]
    }
]