[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/412/seafood/shellfish/",
                    "name": "Shellfish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/438/seafood/shellfish/scallops/",
                    "name": "Scallops",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25869/debs-scallops-florentine/",
        "name": "Deb's Scallops Florentine",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F968420.jpg",
            "width": 2522,
            "height": 2519
        },
        "datePublished": "2018-10-04T13:01:04.000Z",
        "description": "Mouthwatering scallops and spinach, topped off with a rich Parmesan cheese sauce, baked until bubbly and delicious!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 pound sea scallops",
            "3 tablespoons butter",
            "2 tablespoons all-purpose flour",
            "1 cup heavy cream",
            "¼ cup grated Parmesan cheese",
            "salt to taste",
            "ground black pepper to taste",
            "1 (10 ounce) package frozen chopped spinach, thawed ",
            "1 cup shredded mozzarella cheese",
            "¼ cup grated Parmesan cheese",
            "¼ cup plain bread crumbs",
            "1 tablespoon OLD BAY® Seasoning"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch pie plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a pot of water to a rolling boil. Rinse the scallops, and drop them into the boiling water; cook for 2 minutes. Remove the scallops with a slotted spoon, and pat dry. Place on the bottom of the prepared pie plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small saucepan, melt the butter, and stir in the flour. Cook over low heat for 3 minutes. Whisk in heavy cream and 1/4 cup Parmesan cheese.  Season with salt and pepper to taste. Cook for another 2 to 3 minutes, stirring constantly, or until thick.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Squeeze the spinach dry, and spread over the scallops. Pour the cream sauce over the spinach, and top with mozzarella cheese, 1/4 cup Parmesan cheese, and bread crumbs. Sprinkle Old Bay Seasoning over the bread crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 minutes, or until browned and bubbly.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Shellfish",
            "Scallops"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PONYGIRL64"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.519774011299435,
            "ratingCount": 354,
            "itemReviewed": "Deb's Scallops Florentine",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "376 calories",
            "carbohydrateContent": "11.5 g",
            "cholesterolContent": "112.5 mg",
            "fatContent": "26.6 g",
            "fiberContent": "2.1 g",
            "proteinContent": "23.4 g",
            "saturatedFatContent": "16 g",
            "servingSize": null,
            "sodiumContent": "970.8 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-05-17T19:56:32.7Z",
                "reviewBody": "I must say, this is a very good recipe.  I have a few suggestions to offer that really help tweak it (at least in my opinion).  Use fresh baby spinach, fresh is always better.  Skip the mozzarella, it detracts from the dish.  I actually put the fresh spinach in the cream mixture and cook the spinach that way.  I spread the spinach and cream mixture over the scallops, top off with a dusting of italian seasoned bread crumbs, a nice mix of romano and parm cheese and then a very light dusting of Creole seasoning.  This really adds some flavor.  Bake at the temp suggested for 10 minutes then broil for the remaining 5 min.  Really works nicely.  Serve with Basil rice for a real treat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ASCALESE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/390887/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-01T15:46:44.653Z",
                "reviewBody": "This is a fabulous, easy recipe.  I steamed a 10 oz. bag of fresh baby spinach instead of using the frozen variety.  I substituted half-and-half for the heavy cream and used unsalted butter.  I used just a sprinkling of Old Bay, pepper and mozzarella before baking.  I did not precook the scallops, and baked the whole thing for 25 minutes.  The scallops came out perfectly done- the sauce had lots of flavor, without overpowering the scallops.  My husband declared it a home run.\r\nNote:  One night when we had unexpected company, I added a pound of shrimp to the mix and it made this recipe twice as good.  I will use a combination of one pound shrimp, one pound sea scallops from now on.  The loaded-with-seafood approach makes it absolutely stunning.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lefty chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/811011/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-27T02:35:00.78Z",
                "reviewBody": "We just had this tonight - and it was great! My partner insists he is not much on \"seafood\" unless it is fried catfish or shrimp. He also has a strong aversion to \"foo-foo\" food which this clearly is. Even at that - he put this in the recipe book himself!! I made a few changes: Deleted - Old Bay Seasoning (I don't like the taste of it). Also did not precook the scallops based on other reviews - it was a good call. I also have a way of making the sauce without the added butter. The less fat in this dish the more often we can have it! Added - 2 cups cooked rice to bottom of dish (I'd prefer a wild/brown mixture myself but SOMEBODY only likes white rice ). Topped with 5-6 mushrooms sliced & sauted. Substitutions - 5 Italian Cheese mix for mozzerella and non-fat half & half for heavy cream (yes they do make such a thing). I also used fresh spinach (1 bunch) but I think I will use whole leaf frozen next time and see how that works. If not then I will use 2 bunches of fresh - dry fry until soft and lay out in a layer over scallops. Things to change for next time - make a double batch of sauce. This was certainly a great dish not much work and well worth the effort. I would serve it to company any day. I can see that it can be made up ahead of time and refrigerated before baking. Serve with a salad maybe bread and something very light for dessert. Even without the salad this will serve 6 at our house easily.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pitxitxita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/449/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-28T02:20:45.437Z",
                "reviewBody": "This is one of those recipes that tastes like it comes from a great restaurant! Like others I used fresh spinach leaves not frozen. I used 1/2 pound each of shrimp and scallops. To further make it \"my own\" I added a dash each of onion powder and garlic salt in place of the Old Bay seasoning. To cut down on the fat a little I used half-and-half in place of the heavy cream and Smart Balance in place of the butter. A suggestion - Wondra Flour for sauces blends smoother than regular flour. Another great alteration was adding 3/4 cup chopped artichoke hearts. I also put the seafood in without cooking it first. Cook for 25-30 minutes and it comes out just fine! Fantastic recipe thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chouli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2336648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T20:11:45.467Z",
                "reviewBody": "This was wonderfull!!!! I did however make a few changes. I did not boil scallops. Just ran hot water over frozen 1 lb pkg of scallops until thawed. Put in 9x13 pan. Put steamed baby spinach on top. Doubled cream sauce using Kraft s three cheese poured over all toped with Italian bread crumbs used some of Emerald s seasoning did not have any Old Bay. Backed 350 for hour or until bubbly. Hmmmmm the best thing I have ever made and my family loved it!!!! I may try puting shrimp with it next time we love sea food and this is just the best!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JWIUFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-30T18:57:20.89Z",
                "reviewBody": "I don't think you need to boil the scallops first-I instead baked for about 20-25 minutes at 350 and they came out perfect. I used less Old Bay than called for- I think a tablespoon might make it too salty. Also I don't think this takes 30 minutes prep time as the recipe says. I cooked the spinach in the micro while I made the sauce. It takes a minute or so to press the water from the spinach and then the recipe goes together quickly. I put the scallops directly in the pie plate instead of boiling. So prep time is less than 15 minutes. I would rather spend less prep time and a little more time in the oven so I can do some other things while it cooks. My husband who is usually neutral on scallops really liked this and I did too. Whenever I make scallops I'll use this recipe from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CALIFORNIADREAMIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/867207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-23T04:39:34Z",
                "reviewBody": "This is very good. I used fat free half and half I didn't pre-cook the scallops and used salt-free creole seasoning. I wouldn't use as much seasoning as the recipe calls for and no extra salt. It wasn't too salty. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBMCE4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/570400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-29T22:47:55.983Z",
                "reviewBody": "This was absolutely fabulous!!I skipped step #2(pre-boiling is not necessary--they bake perfectly in the oven for 25 minutes). I used fresh spinach which I tore into smaller bite-size pieces. (You could probably use baby spinach.I omitted the OLD BAY seasoning (as did lots of other reviewers who said it made it too salty). Half of the bread crumbs I used were italian style. Its very rich but you could probably substitute milk for the cream for a lighter version. I don't think you need a side dish... we ate caesar salads while it baked and drank white wine with dinner...yummy. Thanks Deb!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tesia7904",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1504517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-09T17:28:17.98Z",
                "reviewBody": "This was very good. I too read the other reviews and did not cook the scallops ahead of time I used fresh baby spinach used milk instead of cream italian bread crumbs -- and I added some fresh crushed garlic not alot but it just gave the sauce a hint of it -- YUM!!!! I also elimated the mozzarella b/c the parmesan is perfect!!! Served it over NO YOLK noodles!!! We loved it!!! Thanks for sharing Deb!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DOREENBUCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/563422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T19:12:12.513Z",
                "reviewBody": "Good concept but way too many salty ingredients. I followed the advice of other reviewers by omitting the M. cheese. I also cut way back on the Old Bay because of reviewers who had found it salty. It was still very salty probably due to the parmesan cheese. I may try it again someday by substituting other white cheeses for most of the parmesan and sticking with just a sprinkling of Old Bay or substituting other herbs for that too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDT2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/297942/"
                }
            }
        ]
    }
]