[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/730/world-cuisine/latin-american/south-american/",
                    "name": "South American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1278/world-cuisine/latin-american/south-american/brazilian/",
                    "name": "Brazilian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24052/brigadeiro/",
        "name": "Brigadeiro",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F04%2Fimage-476.jpg",
            "width": 1280,
            "height": 720
        },
        "datePublished": "2018-10-09T23:47:44.000Z",
        "description": "There is a great Brazilian sweet that is like a bonbon and extremely scrumptious and delicious called brigadeiro! This is a great type of sweet that is loved here in Brazil! Try it!  You can make it in the microwave too, just remember to stir every minute.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "3 tablespoons unsweetened cocoa",
            "1 tablespoon butter",
            "1 (14 ounce) can sweetened condensed milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium heat, combine cocoa, butter and condensed milk.  Cook, stirring, until thickened, about 10 minutes.  Remove from heat and let rest until cool enough to handle.  Form into small balls and eat at once or chill until serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "South American",
            "Brazilian"
        ],
        "recipeCuisine": [
            "Latin American",
            "South American",
            "Brazilian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "ROMINA_BR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.392953929539296,
            "ratingCount": 369,
            "itemReviewed": "Brigadeiro",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "69.9 calories",
            "carbohydrateContent": "11.1 g",
            "cholesterolContent": "8.2 mg",
            "fatContent": "2.4 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "29.2 mg",
            "sugarContent": "10.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-04-12T04:59:41.437Z",
                "reviewBody": "I am from Brazil, but I am currently living in the US. I can give some tips about making a brigadeiro:\r\n1. Condensed milk in the US is a litlle different from the Brazilian version. It is not so sweet as the Brazilian, therefore I would recommend using a chocolate powder like Nesquick.\r\n2. Cook the mixture until it thickens enough to show the pan bottom during stirring.\r\n3. Pour the mixture in a lightly greased dish and let it cool to room temperature.\r\n4. Now you are ready to form the little balls, remember to grease your hands with margarine first!\r\n5. Roll it over sprinkles \r\n6. Place the balls in candy cups (small size)and voilla! Enjoy it!\r\n\r\nIn Brazil every child's birthday includes this wonderful specialty. Children adore brigadeiro.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLANDINA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/507932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-09T22:43:17.34Z",
                "reviewBody": "Ok, this recipe should be better explained. This is an extremelly popular desert and very easy to make, but you do have to follow some tips:\r\n\r\n1. Until when to cook? Until, if you tip the pan a little bit, the \"dough\" appears to be lose from the pan. To make it easier to roll them up, wait another 2 minutes after that. \r\n\r\n2. You have to stir constantly the whole cooking time. Do not stop!\r\n\r\n3. How to roll it: spray cooking oil in your hands (or butter/margerine). Take a teaspoon full of the dough and roll it, like you would do with clay.\r\n\r\n4. After rolling: Roll the balls on chocolate sprinkles or on crystal sugar.\r\n\r\nGood luck!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SPIERSON5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/566346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-31T01:12:42.237Z",
                "reviewBody": "I've been making these at Holiday time every year since a friend came back from a year in Brazil in high school - many years ago. Everyone who tastes them asks for the recipe! \n\nI've found that it's kind of an art to get the timing right. I also found that a doubled recipe cooks better for me. Also, I get anywhere from 40-60 balls per can. My tips for making these are: 1. I use a combo of Nesquik and cocoa powder (proportionally about 2/3 to 1/3 Quik to cocoa for good, dark flavor).  2. The original recipe I was given called for 1/2 to 3/4 cup of Nesquik to 1 can condensed milk, but I've changed that to make it darker and richer: I use about 1/2 cup Quik and 1/4 cup or slightly less of cocoa for each can.  3. I start on medium heat (gas), and lower it to med/low. You can raise it a bit again near the end. I found the longer cooking time makes it more caramelly, and allows the chocolate to hold its shape better. Cook anywhere from 15-25 minutes for a double recipe. 4. In addition to watching for the chocolate to pull away from the pan when the pan is tilted, I also do the following to evaluate done-ness: a. put a little plate or bowl in the freezer and take out when cooking. Drop a blob of chocolate on the plate when near done. The chocolate should quickly solidify and stay solid - not run.  b. To evaluate chocolate readiness, start lifting up a spoonful of it and letting it drop back into the pot. The blob should hold its shape fairly well (stay visible) and not immediately a",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "djhnyc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2880824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-28T01:27:11.983Z",
                "reviewBody": "You cannot beat these for a simple, yet amazing looking, THREE INGREDIENT (which are staples, at that) treat!  First, MANY MANY thanks to the top 2 reviewers who's tips made making these a breeze.  I followed the following tips from them:  A:  KEEP STIRRING!!!  B:  You'll know when it's done.  For real.  2 things will happen:  it will thicken and start to \"pull away\" from the sides of the pan AND when you stir it will open a valley to the bottom of the pan.  Keep stirring for 2 minutes after this happens.  C:  pour into a bowl sprayed w/PAM (cooking spray)  D:  Spray your hands w/PAM before trying to roll (I don't know how you'd begin to it otherwise)  The \"toppings\" I used for rolling:  sprinkles, colored sugar, almonds, coconut, crushed Nilla wafers.  Toppings I plan to use in future batches:  crushed pretzels, cocoa, 10X sugar [confectioners' sugar], crushed Oreos.  This made 18 (-the one i ate) about 2/3 the size of a golf ball for me.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-01T12:16:07.807Z",
                "reviewBody": "These went over really well at my church potluck. Unfortunately, even with the advice of others, I also experienced difficulty in the forming stage, even after having let it sit in the fridge for a time. But I think that had I given it a good 3 hrs in the fridge (until the ENTIRE blob was cooled, even the center), then it would have worked fine. Seeing how I was able to work half into balls pretty easily ntil I encountered some warmer gooier stuff, then returned it to the fridge and formed the other half later with no problems. I greased a melon ball roller (and my hands)which worked really well for scooping it up to roll into balls, then rolled in either cocao powder, icing sugar, crushed almonds or walnuts. They looked great, like truffles!! I put each into it's own very small muffin liner and kept refrigerated until served and they kept their shape perfectly.\n***Made this again with the advice of a reviewer flatten between cling wrap and put in the freezer. Very easy to handle this way, forming went much faster this time. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Faith Woods",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1523823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-23T01:46:07.99Z",
                "reviewBody": "I just made these...the flavor was great but it was so sticky we could barely eat it. Can anybody tell me what I did wrong?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MCKA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2321958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-16T20:54:46.72Z",
                "reviewBody": "It tastes quite good! I didn't even had time to roll and it was all gone:o) I was reading some reviews and one said that it tasted bitter. Well you have to use 100% unsweetened cocoa. And you don't need as much cocoa to give it a good chocolate taste. For who doesn't know cocoa is a fruit (actually it is the powdered and dried cocoa seed). Don't ever use baking chocolate (there is not much pure cocoa on it!) I've tried to make Brigadeiro with no butter and it worked just fine. If it is too gooey simply cook more (30 min in low heat is ideal) and let it cool down. Cook until you see the bottom of the pan when you stir (never stop stiring or it will burn). You should be able to turn the pan upside down without any spills. A great use of Brigadeiro when it is gooey is to use it as a cake filling. Yummy! since it has no transfat it is much healthier than using those shortening based cake fillings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "markps1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1759439/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T18:25:47.187Z",
                "reviewBody": "Oh, my god. This was awsome. I usually don't write reviews a lot, but this one, YES... I had to write it!!! It looked like professionally made chocolate, like Godiva chocolate, and tasted like better than those. I used some crushed nuts to mix in the dough, and used cocoa poweder (both unsweetened for adults and sweetened for kids), crushed nutes and confectionary suger to cover them. (black bitter ones, black sweet ones, nutty ones, and romantic white ones...etc:)) Oh, my God,,,,, this was awsome.  Pls do try!! I honestly do do od think that people can not distinguish these from famous brand chocolate. (both tastes and looks) 10 stars. It deserves it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LITTLEPOOHBEAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/668041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T12:16:26.013Z",
                "reviewBody": "I just prepared this in the mirowave and it worked fine! Just be careful of the bowl size because the heat made the fudge bubble over. Let it cool before rolling because otherwise it is a sticky mess! This is a very delicious recipe and easy to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURIE_551",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/841518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-22T02:17:44.073Z",
                "reviewBody": "To me, these were just \"ok.\"  Sort of like Tootsie Rolls, sort of like cooled but firm hot fudge, but different somehow.  I'm not the best judge because my sweet tooth isn't super-crazy.  We rolled them in coconut, crushed pecans, or crushed white chips, because it's what we had.  Made for a project on Brazil my daughter had to do for her (sophomore) Global Issues class.  She said she and her classmates loved them.  Of course, give a little chocolate to a bunch of teenagers and most of them will say \"mmm.  yum!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "~Severed*Consciousness~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1985703/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Brigadeiro",
            "description": "Watch how to make Brazilian brigadeiros!",
            "uploadDate": "2018-10-09T16:34:27.866Z",
            "duration": "PT1M7.093S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb3a22235-ba97-4ad8-8a11-461eec734c0b%2F18b60130-7896-41f1-aa31-3da232e0b7f3%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5846095619001"
        }
    }
]