[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
                    "name": "Fish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/416/seafood/fish/salmon/",
                    "name": "Salmon",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27253/canadian-cedar-planked-salmon/",
        "name": "Canadian Cedar Planked Salmon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F40728.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "2018-11-13T08:01:19.000Z",
        "description": "Planked salmon is a method of cooking and smoking salmon that has been used for many years. Make sure to use natural (no preservatives) red cedar. The salmon is slow cooked, which produces a rich, smoky flavor. Guests enjoy the wonderful taste of this specially prepared salmon.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT12H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "24x8x1 inch untreated cedar plank",
            "6 (4 ounce) fillets salmon",
            "½ cup extra virgin olive oil",
            "1 large red onion, chopped",
            "1 lemon, sliced",
            "½ tablespoon black peppercorns, crushed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Submerge untreated cedar plank in water. Soak approximately 12 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for high heat. Place prepared plank on the grill, and sprinkle with coarse salt. Cover grill and heat plank 2 to 3 minutes, until dry. Adjust grill temperature for medium heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rub salmon filets with olive oil. Arrange on the plank. Top salmon with red onion, lemon slices and black peppercorns.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook salmon, covered, 10 to 12 minutes, or until opaque and easily flaked with a fork.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Fish",
            "Salmon"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SWIZZLESTICKS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.64,
            "ratingCount": 50,
            "itemReviewed": "Canadian Cedar Planked Salmon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "387.9 calories",
            "carbohydrateContent": "4.6 g",
            "cholesterolContent": "66.1 mg",
            "fatContent": "30.9 g",
            "fiberContent": "1.4 g",
            "proteinContent": "22.8 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "67.9 mg",
            "sugarContent": "1.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-21T19:56:31.48Z",
                "reviewBody": "Fabulous recipe tastes just like in a restaurant. I found putting the lemon slice on top of the salmon shielded that part of the fish from the heat (so it didn't cook properly in that spot) so I just squeezed the juice on the fish and took the slice off. Better to just use the slices for presentation at the end. My plank also caught on fire a few times (heat was too high I guess) so have a glass of water ready and dribble water along the edge of the plank if it catches on fire.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy Sargent-Boileau",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bcrocker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:19:46.123Z",
                "reviewBody": "This planked salmon recipe was GREAT! I tried the lumbar yard route to get the planks and found the taste horrible. I had tried the hickory and another one which I don't remember. I found that the white cedar was the best. I ended up purchasing some online from www.Acadian-woods.com. I would recommend purchasing from a \"food grade\" safe source. I \"planked\" some salmon for our weekend of company and it was a great hit. Thanks for the unique and delicious recipe. Dave P.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATTERSOND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/870391/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-07T18:48:30.837Z",
                "reviewBody": "This a great basic recipe to use as a baseline especially if you've been out fishing the majority of the day. I prefer to substitute the Olive Oil with a high quality garlicky vinaigrette containing all natural ingredients. I've found depending on the size of the fillet (cooking time) that a plank (Red Cedar) soaked anywhere between two to four hours is suitable for the job. I also like to sprinkle some Kosher salt (or Hawaiian red salt) on a lightly oiled (Olive Oil) plank before topping it off with the fillet skin side down. This followed up with some small slices of onion (I prefer Sweet but use what you like) and a few slices of lemon provides not only an exquisite taste but a very impressive presentation. The fresher the fish the better the picture I've provided was of a Western Washington Coho caught filleted put on ice in a container (stored in the refrigerator drain the water as the ice melts occasionally to avoid letting the fillet to soak up water) and planked the same day. No matter how long you've soaked the plank I'd suggest you always keep a squirt bottle containing water to eliminate any flare ups.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "worre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2202701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-27T07:16:41.92Z",
                "reviewBody": "First time using a plank. I soaked it for 24 hours then wasn't able to buy salmon. Took the plank out of water for a few days bought some salmon and soaked it again for 24 hours before grilling. I turned the gas grill to high put the plank on for 5 minutes then turned it over and put some oil on the charred side of the plank then put the salmon on. Then turned grill to medium heat. I never needed to extinguish any fire on the plank. Regarding preparation I added a few cloves of pressed garlic and I did not lay lemon slices on the salmon instead I used lemon juice. It was great truly yummy. I used a cedar plank. The cedar definitely added a distinct flavored to the fish. It was almost a little too strong for my preference. (note: just my preference nobody else brought it up they just kept saying how good it was) After I use up all my cedar planks I will try some alder planks they are suppose to be a little more mild and sweet. The recipe is great thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maui Grill'n",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2236689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-29T23:32:06.357Z",
                "reviewBody": "Amazing easy gourmet meal. The smoked flavor along with the peppercorn was delicious. For the cedar plank: I spoke with a lumber yard owner and was told the following: cedar is untreated as a whole since it is quite a dense wood and doesnt require chemical treatment for carpentry. My plank was not heartwood (center of tree) so it was not quite so dense (great for soaking water). Also it was not planed (pretty rough) and I think that caused it to ignite more often. Totally controllable just keep the lid on and it doesn't feed the wood with enough oxygen to create a blaze. Basically a cheap plank from a lumber yard did the trick! I also found that the lemon slices on top of the salmon while it cooked caused it to absorb some heat making the salmon less cooked under the areas. I would recommend squeezing the juice onto it for cooking then adding slices for serving. Served with steamed spinach rice and wine. I prefer red wine entirely so I paired the salmon with a sweet pinot noir. The smokey peppercorn flavor along with the spinach really brought out the light sweet flavors of the wine. This is one for the index cards!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nuclear Rich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2513126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-24T17:26:27.67Z",
                "reviewBody": "Fantastic recipe! We had it for a BBQ with the inlaws and it was a big hit. They thought I had spent hours in the kitchen cooking but I found it easier to do than home made burgers. The prep time is minimal if you chop the onions the night before the hardest thing to do is to remember to soak the plank the night before. I turn one burner off on my BBQ and place the plank on the other side. I served it with grilled zuccini and mushrooms that I placed on the side the burner was on. Super easy gourmet weekday supper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon LePage",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2375/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-08T00:28:02.28Z",
                "reviewBody": "WOW!! This was so delicious! My husband ate three pieces. I added some chopped garlic to the olive oil and sprinkled some dill on with the pepper. The combination of the flavours was perfect - we could really taste the cedar too. Many grocery stores now sell the planks by their fresh fish section - check there first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIRLONG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1190488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-13T20:37:26.89Z",
                "reviewBody": "Awesome! Fixed this for a group of foodies and they are still raving about it 3 days later. Simple simple simple.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAWAKONI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1460972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-07T03:47:37.873Z",
                "reviewBody": "I ordered something similar to this at a restaurant not long ago. Went to Whole Foods this weekend and bought the cedar planks. We cooked this tonight and it was AWESOME!!!! Didn't change a thing in the recipe. This is going to be a regular in our family. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kado",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1689865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-04T14:31:15.997Z",
                "reviewBody": "My husband made this - it was OK but kinda bland. Maybe we needed more spice. Easy and simple recipe though worth a try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": " KR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2224797/"
                }
            }
        ]
    }
]