[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16230/trusted-brands-recipes-and-tips/progresso/",
                    "name": "Progresso&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215602/roasted-butternut-squash-soup/",
        "name": "Roasted Butternut Squash Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F982280.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-11-13T08:02:53.000Z",
        "description": "Here's a rich soup for an autumn day--winter squash is roasted and pureed and blended into a creamy broth  seasoned with cinnamon and roasted coriander.",
        "prepTime": "P0DT0H30M",
        "cookTime": null,
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 cups",
        "recipeIngredient": [
            "2 tablespoons butter",
            "2 cups raw winter squash (butternut, hubbard, acorn)",
            "Salt and pepper",
            "2 tablespoons extra-virgin olive oil",
            "½ cup diced onion (1/4-inch)",
            "¼ cup diced celery (1/4-inch)",
            "¼ cup diced carrot (1/4-inch)",
            "1 cinnamon stick",
            "Sea salt and freshly ground pepper",
            "1 (32 ounce) carton Progresso® chicken broth",
            "½ teaspoon ground toasted coriander",
            "Roasted Winter Squash (above)",
            "½ cup half-and-half, if desired*",
            "2 tablespoons toasted pumpkin seeds",
            "½ cup Progresso® plain Panko crispy bread crumbs, toasted light brown in saute pan over medium heat"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make roasted winter squash: Heat oven to 375 degrees F. Heat butter over medium-high heat in an ovenproof saute pan; add diced squash, salt and pepper. When squash begins to brown, place pan in oven. Roast for 15 minutes or until medium-brown on all sides. Remove from oven and let cool slightly. Puree in food processor, or mash with potato masher or ricer. Measure 1 1/2 cups squash; reserve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make soup: Heat the olive oil in a large saucepan over medium heat until hot. Add the onion, celery, carrot and cinnamon stick; saute until soft but not brown, about 10 minutes. Season with salt and pepper. Add the broth and the coriander; bring to a boil. Simmer for several minutes. Stir in reserved squash until smooth; simmer gently to let the flavors meld, about 10 minutes. Discard the cinnamon stick.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Puree the soup using an immersion blender or in a blender until smooth. (The soup can be made ahead to this point, cooled, covered, and refrigerated for several days or frozen for about 1 month. It will thicken as it cools and may need thinning with broth or water when reheating.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return the soup to the pan and reheat gently. Add the half-and-half. Adjust the seasoning with salt and pepper. Top each serving with pumpkin seeds and toasted bread crumbs.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Progresso&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Progresso"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.731958762886598,
            "ratingCount": 194,
            "itemReviewed": "Roasted Butternut Squash Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "350.3 calories",
            "carbohydrateContent": "29.9 g",
            "cholesterolContent": "26.5 mg",
            "fatContent": "22.7 g",
            "fiberContent": "2.3 g",
            "proteinContent": "7.8 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "1387.9 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-02-08T18:41:58.49Z",
                "reviewBody": "Tasty! For the sake of laziness, I just did the carrots and onion with the squash in the oven and then mashed it all with a potato masher, then put the whole mixture along with spices in my turkey broth to simmer for a bit, then into the blender. Saves a step. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kyla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6352561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T21:52:21.377Z",
                "reviewBody": "I add a bit more celery carrot and onion and rather than add a stick of cinnamon I add a dash at the end. I don't use the coriander since I don't have any and I use sour cream instead of half and half. But let me tell you everyone loves this soup even made some for my neighbors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paulette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6038888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-23T01:34:02.46Z",
                "reviewBody": "This is a great recipe! I followed the recipe with these modifications: 1/4 tsp of coriander 1/2 plain yogurt and used a sprinkle of cinnamon. Definitely a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "trevbbmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5589253/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-04T00:57:40.47Z",
                "reviewBody": "Thank you for this amazing recipe and very easy to follow instructions. For those who don't have pumpkin seeds on hand it is very easy to toast the butternut squash seeds and use those in place of pumpkin seeds. Separate the seeds from the stringy mass then boil in 2 cups water with 1 tbsp salt for every 1/2 cup of seeds for about 10 minutes. Use more salt if you like saltier seeds. Toss them in a little olive oil and bake in a single layer in 400 degree oven for about 10 minutes. They will keep for days on your counter if closed tightly in a container.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sunny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10874743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-09T03:40:21.217Z",
                "reviewBody": "INCREDIBLE! A few years ago, I tried a roasted squash soup at a local restaurant. They wouldn't give me the recipe, and I've been wanting to try and make it on my own.  This was the first recipe I've tried, and it was phenomenal.  Way better than the restaurant's version!  Overall, I left the ingredients pretty similar but changed the prep a little bit. I used a medium-sized butternut squash, which was about 9 cups, so I quadrupled the rest of the recipe. I sautéed the squash, and when it was brown, I dumped it in a roasting pan along with the onion, celery, and carrots.  I drizzled a little olive oil over all and roasted for about 30 minutes at 400.  I brought my stock to a boil, and I added about a tsp of cinnamon (didn't have cinnamon sticks), nutmeg (for fun), and cumin (didn't have roasted coriander).  I then removed the celery, carrot, and onion from the roasting pan and added to stock. When veggies were soft, I strained them from the broth and blended in the blender.  I blended the squash as well, and I had to add broth as needed to liquefy it better.  When everything was blended well and stirred back together, I brought the soup to a low simmer and let it simmer for over an hour to thicken a little bit.  In the end, I had about 15 cups of soup.  I froze most of it and saved a small portion for my husband and I.  I added the 1/2 and 1/2 to our portion and served for supper.  Amazing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mamamel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8486425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-08T18:42:31.767Z",
                "reviewBody": "I added a small turnip to the celery and carrot. Other than that I followed the recipe and served my family a beautiful winter soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "auntie j",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5711566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-24T19:10:52.137Z",
                "reviewBody": "This soup is fabulous!  I just became a huge fan of squash and now I am trying to learn to cook it in every way possible.  After reading all the reviews I decide not to add any half and half, yogurt, or sour cream.  The ground corriander and the cinnamon really give this soup a warm feeling.  I did not add the pumpkin seeds or bread crumbs either.  I had a salad and some homemade bread with mine and it is definitely a keeper.  This recipe definitely only serves 4.  The next time I will double the batch. I just rewarmed my soup for lunch and it is even better today!!! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "natasha.ramirez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2761061/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-15T23:41:47.84Z",
                "reviewBody": "I loved this soup. I've been looking for a creamy squash based soup for the holidays and this is it. Sauteing then roasting the squash gives it a fabulous flavor - I almost didn't add the 1/2 & 1/2 and I didn't need to add any salt and pepper during step 2. I'm very excited to introduce this to my holiday table. Next time I think I'll opt for the more health conscious plain low-fat yogurt. Finally it was quick and easy and I usually have most of the ingredients in the house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lois",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1840303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-05T22:22:33.27Z",
                "reviewBody": "Maybe it was the homegrown organic squash I used or the homemade goose broth but this was AMAZING. The squash never really browned in the oven even though I left it in there twice as long and it's not as thick as the recipe says but it is phenomenally delicious. The cinnamon really adds that extra zing to the sweet squash.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3240857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-17T16:36:03.623Z",
                "reviewBody": "The texture of this soup was great, but I thought the flavor was lacking something - and I LOVE squash soups! My husband agreed. If I make this again, I will probably use 2 cinnamon sticks, more squash and add some brown sugar. But, it seems I'm in the minority here.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CookieEater",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/brookthecookieeater/"
                }
            }
        ]
    }
]