[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236008/super-baconator-cupcakes/",
        "name": "Super Baconator Cupcakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5856253.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2018-12-06T07:40:12.000Z",
        "description": "Sweet, savory and salty. Your mouth will thank you! Warning: this is not a healthy dessert and any attempts to make it healthy will anger the bacon gods. As with most cooking, using the highest quality ingredients yields the best product. So please use real butter, real (full-fat) cream cheese, and pure all-natural vanilla and maple extracts. Optional: sprinkle tops with coarsely ground salt.)",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "2 dozen cupcakes",
        "recipeIngredient": [
            "24 slices bacon",
            "2 cups whole wheat flour",
            "2 cups demerara sugar",
            "1 cup dark chocolate chips",
            "2 teaspoons baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon sea salt",
            "1 cup cold, strong, brewed coffee",
            "1 cup buttermilk",
            "½ cup bacon grease",
            "2 eggs",
            "1 (8 ounce) package cream cheese, softened",
            "¼ cup butter, softened",
            "3 cups confectioners' sugar",
            "1 ½ teaspoons maple-flavored extract",
            "½ teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease 24 muffin cups or line with paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and crumble. Measure 1 1/2 cups bacon pieces and reserve the rest for garnish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir flour, sugar, chocolate chips, baking soda, baking powder, and salt together in a bowl; make a well in the center. Whisk coffee, buttermilk, bacon grease, and eggs together in a separate bowl; pour into the flour mixture well. Stir until batter is just combined; fold in reserved 1 1/2 cups bacon. Spoon batter into the prepared muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until tops spring back when lightly pressed, 20 to 25 minutes. Cool cupcakes in the muffin tin set on a wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat cream cheese and butter together in a bowl using an electric mixer until smooth and creamy. Stir confectioners' sugar, maple extract, and vanilla extract into creamed butter mixture until frosting is smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange cooled cupcakes on a serving platter and spread frosting over each cupcake; sprinkle with reserved bacon pieces.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sir_Angus"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2,
            "ratingCount": 5,
            "itemReviewed": "Super Baconator Cupcakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "341 calories",
            "carbohydrateContent": "43.7 g",
            "cholesterolContent": "46.1 mg",
            "fatContent": "16.5 g",
            "fiberContent": "1.7 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "8.1 g",
            "servingSize": null,
            "sodiumContent": "447.5 mg",
            "sugarContent": "33.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-06-21T02:58:21.637Z",
                "reviewBody": "I am excited to try this recipe! I love the warning however I am not looking for a healthy recipe I have been searching all evening for a tasty bacon cupcake recipe and came across your comment about a different bacon cupcake recipe and I am making yours instead! It appears to be much more flavorful daring and exciting. Thank you so much for sharing! I am giving 5 Stars because I know myself my friends and family will love them. If you do not see a retraction post then you know I am busy baking and sharing your recipe with my friends and fam.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dddtriplets",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13795948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-20T15:24:32.73Z",
                "reviewBody": "This was a great recipe but I did make a few changes I used regular flour and sugar and I lowered the amount of sea salt and I used white chocolate chips. but I think next time I may leave them out they just sunk to the bottom and didn't melt and we're stuck to the bottom. I found the batter to be too loose so I added 1/4 cup more of flour and I'll use a milder coffee next time the bustelo was a bit over powering. alsoI baked them for 18 min in a 375 oven maybe it's just my oven but they came out great light and fluffy though the bottom was a little crunchy because of the chips but overall they were great I had to keep slapping my husband hand because he was eating them before I could frost them lol. I also tweaked the frosting this is where I folded in the bacon and sprinkled sum on top. and I used 1 teaspoon of maple extract and two teaspoons of maple syrup and two splashes of vanilla extract because extracts tend to make things taste artificial in my opinion it takes away from the homemade taste. I was worried at first cause the batter had a molasses taste but when I tasted the finished cupcake it was almost like a coffee cupcake but the finished product was the perfect balanced bite I could taste every ingredient I will definitely be making these again I think I may have to because my husband might divorce me lol",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mizteeluvin M-eye Mistagee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16357038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-26T16:11:43.803Z",
                "reviewBody": "Was not sure I would like this recipe but made them for my husband's birthday as he is a bacon lover. The bacon is not overpowering and the maple cream cheese frosting is the perfect compliment to the cupcake. Whole family liked them and the bacon birthday boy loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Kreder Crooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7058325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-13T00:06:03.993Z",
                "reviewBody": "These were good but super greasy. I don't think the bacon grease should be used. If I do make them again I'm going to leave out the grease and just use butter and up the bacon. I couldn't taste it unless I got a piece in my cupcake. They're really sweet and moist though:) Oh and the icing left a lot to be desired. Just not my cup of tea really. The cream cheese was all I could taste by the end of the bite. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Amberly Marie Chucher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15152635/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-08-03T08:07:13.95Z",
                "reviewBody": "I loved these cupcakes. I love sugar and coffee and bacon and it was just so deliciously unhealthy for me! It's a wonderful treat for myself! The only thing that stops me from giving it a five star rating is the bacon bits in the cupcake. I don't know if it's normal to have bacon inside the cake part of bacon cupcakes but I just found it a little strange and next time would just leave the bacon as garnish. This is just personal opinion though. If you like having bits of bacon inside your cake than this recipe is perfect for you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13186262/"
                }
            }
        ]
    }
]