[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/271049/kouign-amann/",
        "name": "Kouign-Amann",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6440688.jpg",
            "width": 2500,
            "height": 1667
        },
        "datePublished": "2019-03-08T01:43:28.000Z",
        "description": "Pronounced 'queen-a-mahn,' kouign-amann wouldn't be one of the world's greatest pastries if it also weren't a legendary labor of love. The irresistible combination of sweet, salty, sticky, buttery, crispy, flaky, and tender is something you must experience to believe. Made with bread flour, the dough is a little different from croissants or puff pastry. Salt is also key here; the authentic ones are about as savory as they are sweet.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT4H35M",
        "recipeYield": "12 kouign-amann",
        "recipeIngredient": [
            "1 cup warm water",
            "1 tablespoon white sugar",
            "1 teaspoon active dry yeast",
            "2 ½ cups bread flour",
            "1 tablespoon melted butter, or more as needed",
            "1 teaspoon kosher salt",
            "⅔ cup white sugar",
            "2 teaspoons sea salt",
            "1 tablespoon butter, melted",
            "2 sticks ice-cold unsalted butter, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine water, sugar, and yeast in a bowl. Let rest until foamy, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add melted butter, 2 cups flour, and salt to the yeast mixture. Stir with a wooden spoon to form a very sticky dough. Dust your work surface with remaining 1/2 cup flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough out onto the floured counter. Knead, folding in the excess flour as needed, until dough is soft, slightly sticky, and elastic. Place in a greased bowl. Cover and let rise in a warm place until doubled in volume, about 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine sugar and most of the sea salt together in a bowl. Mix, taste, and add more salt as needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Butter a 12-cup muffin tin. Spoon some of the seasoned sugar into the cups and shake to coat. Turn tin over and return excess sugar to the bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough onto a floured surface and press into a rough rectangle. Roll dough into a rectangle about 1/8- to 1/4-inch thick. Grate cold butter onto the dough, leaving a 1-inch border. Flatten butter using lightly floured hands. Fold rectangle widthwise into thirds. Press gently to square out the edges. Place dough onto a silicone-lined baking sheet. Wrap in plastic and refrigerate for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough into a large rectangle again, pulling and stretching the corners as needed. Grate the second stick of butter over the surface. Pat down with floured fingers and fold into thirds. Roll back out into a rectangle and fold into thirds. Repeat rolling and folding one more time. Wrap in plastic and refrigerate for at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle a generous amount of the seasoned sugar onto your work surface. Place dough onto the sugar and sprinkle more sugar on top. Roll into a large rectangle about 1/8- to 1/4-inch thick, turning and topping with sugar between rolls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use a pizza cutter to trim away uneven edges. Cut dough into 12 even pieces. Sprinkle more sugar on top. Lightly pinch each pastry into a crown shape by bringing all four corners to the center; place into the muffin cups. Sprinkle more sugar on top. Let rest for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until browned and puffed, 25 to 30 minutes. Transfer onto a cooling rack while still hot. Let cool for 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.791666666666667,
            "ratingCount": 72,
            "itemReviewed": "Kouign-Amann",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "290.7 calories",
            "carbohydrateContent": "30.4 g",
            "cholesterolContent": "45.7 mg",
            "fatContent": "17.7 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "11 g",
            "servingSize": null,
            "sodiumContent": "470.3 mg",
            "sugarContent": "12.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2019-05-08T23:46:44.42Z",
                "reviewBody": "These. Are. PHENOMENAL! I’ve made them twice now. This second time, I made a triple batch to bring to an event. I used the croissant method of locking in a slab of butter rather than grating, because it seemed easier to me. I made the dough and shaped the pastries the night before, then let them proof overnight in their muffin cups, topped with greased plastic wrap, in the fridge. I baked them the next morning, just letting them rest at room temp while the oven preheated, and it worked perfectly. For the big batch, I had to use every muffin tin I had in the house, which included a silicone pan and individual silicon muffin cups: they all baked fine. (Don’t forget to put the trays on baking sheets to catch any butter drips.) I could eat these pastries every weekend. They taste best at room temperature, if you can wait that long. Oh, and be sure to bake them until they’re a deep golden brown so that they’re fully baked through in the centers and the sugar has a chance to caramelize.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doughgirl8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doughgirl8/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-05-28T09:01:31.897Z",
                "reviewBody": "I followed the instructions to a \"T\", with one minor exception - I used salted butter vs unsalted butter because that's all I had in the house.  I thought the results were perfection, but my wife thought they were just a tad too salty, although she ate them with relish.  So, next time I will make them with unsalted butter to keep harmony in the marriage.  But really - these are FANTASTIC!  They weren't as hard to make as I had thought.  Using the cheese grater to grate the frozen butter is pure genius - way easier than beating cold butter and rolling it out.   I will henceforth make these whenever I really want to impress someone - they are beautiful and delicious.    PS - I baked at 350 convection - took 29 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andy Meng",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25629761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-06-27T23:41:00.06Z",
                "reviewBody": "These are absolutely amazing. The only change I make is when I make the dough, i put it in the fridge to rise overnight and finish the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christopher Mitchell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13844712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-04-01T05:26:56.97Z",
                "reviewBody": "The recipe is simple to follow but definitely time consuming since there is a lot of downtime while you waitFor the dough to chill. I’m always willing to try a recipe once before I decide if it is worth it and my conclusion is that it is definitely worth it! My family thoroughly enjoyed these treats and wouldn’t let me give them away",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Chau",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1652511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-07-27T21:14:41.97Z",
                "reviewBody": "This recipe was a hit with everyone! I stopped part way through at the step before adding the sugar/salt to the dough and left this in the fridge overnight. It worked out great since I had a fresh batch with breakfast the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Seuss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16436232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-08-22T01:59:23.683Z",
                "reviewBody": "I've made these for about a year and a half now, and I have some tips! \n\nBefore grating the butter into the dough, roll the dough twice the size that you need, and sprinkle HALF of the butter in the middle third, fold one side over, sprinkle the other half of the butter over that, fold the second side over, then you can roll it out again immediately and give it 2 more turns (I don't refrigerate between these steps).\n\nI put it in the fridge for 30 minutes before rolling again, meanwhile I get the oven heated and the pans ready.  I also like to have tongs (to aid removal) and a sink full of hot water (to soak the caramelized pans) ready.  I also recommend having a bowl of cold water or some ice nearby just in case you get that sugar on you, might as well be napalm.  I cut/roll mine a little bigger and put them in jumbo muffin tins instead of regular cupcake pans.  Best sugar ratio I've tried is 2 2/3 C sugar to 1 Tbsp salt.\n\nTake them out of the pans IMMEDIATELY and dump them onto parchment or they will stick badly.  I use a convection oven at 350 F for 18 minutes and they come out perfect every time.\n\nHope this helps someone else!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MaliciousD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17309937/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-11-15T06:40:00.63Z",
                "reviewBody": "By far easiest method, grating the butter in.  I actually found them needing more salt and sugar (next time I will use Kosher & not fine seasalt).  I used Kerry Gold butter (higher fat, lower water).  They also took MUCH longer to bake than stated - used a light aluminum coloured muffin tin, but better long and unburnt.  The layers turned out beautifully well, next time will layer the sugar/salt mix between the last fold and turn steps. Tried other methods and recipes, this is by far the friendliest.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Patricia Penchuk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26463781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-01-11T22:26:23.14Z",
                "reviewBody": "Way too salty. I used unsalted butter and less than the amount of salt called for and they were too salty to eat. The method was great though and the texture of the finished pastry was perfection.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "The French Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4018590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-10-19T00:28:29.49Z",
                "reviewBody": "This was my first time making pastry and it was a smashing success thanks to the video! The video is so helpful and they turned out perfectly and tasted like they came from a pastry shop. AMAZING!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ranchgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4426946/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Kouign-Amann",
            "description": "The (Yas) Queen of pastries!",
            "uploadDate": "2019-03-09T02:10:32.707Z",
            "duration": "PT12M8.747S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F5530f5b2-4886-4097-8ab4-4bb3b91c2754%2Fd45613e1-b6b4-42ba-b780-7c80420a8f82%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6011822808001"
        }
    }
]