[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/235/world-cuisine/middle-eastern/",
                    "name": "Middle Eastern",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15937/world-cuisine/middle-eastern/persian/",
                    "name": "Persian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69299/persian-fesenjun/",
        "name": "Persian Fesenjun",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8106806.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-03-26T05:39:45.000Z",
        "description": "An amazing ethnic exotic Persian dish. Incredibly easy to make. Crowd pleaser. A lot of oil will come to the top of the dish. Don't worry, this is normal. This is the oil from the walnuts. Pomegranate paste or syrup may be found in Middle Eastern food specialty shops.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "1 onion, finely chopped",
            "4 skinless, boneless chicken breast halves",
            "1 cup finely ground walnuts",
            "1 (10 fluid ounce) bottle pomegranate paste or syrup"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a skillet over medium heat. Cook and stir the onion until tender, and quickly brown the chicken on all sides. Remove from skillet, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the ground walnuts in the remaining oil in the skillet. Over medium heat, cook and stir 5 to 10 minutes, until lightly browned.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return the onion and chicken to the skillet with the walnuts, and blend in the pomegranate paste. Reduce heat to low, cover, and simmer 20 minutes, stirring occasionally, until chicken is no longer pink and juices run clear.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Middle Eastern",
            "Persian"
        ],
        "recipeCuisine": [
            "Middle Eastern",
            "Persian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MRFANTASTIC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.918918918918919,
            "ratingCount": 37,
            "itemReviewed": "Persian Fesenjun",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "572.3 calories",
            "carbohydrateContent": "53.2 g",
            "cholesterolContent": "60.8 mg",
            "fatContent": "28.8 g",
            "fiberContent": "2.5 g",
            "proteinContent": "27.8 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "52.5 mg",
            "sugarContent": "49.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-07T02:12:09.757Z",
                "reviewBody": "I am Iranian and I find this recipe missing sugar. There are different versions of this dish in Iran; at North people make it tart in Tehran it's more sweet and in west they make it sour and sweet. I personally like the latter. For having that fabulous sour & sweet taste you need less pomegranade paste and some sugar (usually 2-3 spoon sugar for 5-6 spoon paste for 2 lb chicken) Though it depends on your taste. Anyhow I thought you might find it work better for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Halo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2287037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-23T19:07:39.39Z",
                "reviewBody": "This dish is fit for a Sultan or the King of your house. Very easy to prepare. I served it over basmati rice. My husband is from the middle east & he said it was as good as any he has ever had!We found the Pomegranate syrup at the middle eastern store-it was called pomegranate molassas. Don't be put off by it's sweet appearance-this dish is a sweet & sour masterpiece in looks as well as taste!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen Bayramian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762286/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-09T20:53:34.827Z",
                "reviewBody": "This has been one of my favorites for many years but I make it a little bit differently. First I use about half of the walnuts. After cooking the chicken breasts I cut them into smaller pieces and instead of simmering the entire mixture in a skillet for 20 minutes I bring the onion ground walnuts chicken pomegranate paste and a cup or two of water (until it looks soupy) to a boil in a saucepan and add a bit of sugar and turmeric. I then cover and simmer for almost 2 hours. It's ready when the mixture has thickened. This has to be served on top of plain white rice - basmati is the best.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER72_00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-30T18:17:10.233Z",
                "reviewBody": "Fesenjun over rice is my alltime favorite Persian dish. My Iranian husband learned how to make this from his father who is an excellent cook. The way they make it is the best. They fry the onion in oil along with the chicken until the onion is tender and the chicken is lightly browned. Then they remove the chicken and onions to a pot. Then walnuts finely ground up in a food processor are browned in the skillet with the remaining oil. Then the ground and browned walnuts are added to the pot of chicken and onions along with around 8-10 ounces of pomegranate syrup 1/4 cup of sugar (if using Turkish Pomegranate syrup) and about 2 cups of water. Then it is cooked for about an hour until the water cooks down and it is thick and the chicken breasts are starting to pull apart and then it served over rice with a dollop of plain yogurt on the side. YOU SHOULD NOT USE POMEGRANATE PASTE OR JUICE! It should be Pomegranate SYRUP and you have to pay attention to where the syrup is from. If it is Iranian pomegranate syrup you probably won't have to add sugar unless you want it to be sweeter. Turkish Pomegranate syrup is more sour so you will probably want to add sugar. You can make this dish sweet sour or sweet & sour depending on your taste as it is made in these various ways in different parts of Iran.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Shell Nik",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3850325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-06T20:22:45.67Z",
                "reviewBody": "I am Persian and while I was recently talking to my mother about recipes I let her know this one came through my e-mail. When I let her know she was just dying to know how to make it! She knows all the recipes such as Ghorme Sabzi and Gheime Badenjoon but she didn't know how to make this. Anyhow there is too much pomegrante sauce in the recipe. She tells me it is only supposed to be one or two tablespoons. That might be why some are complaining about their food tasting funny. I just thought I would share!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1888156/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-21T20:20:49.84Z",
                "reviewBody": "I made this for my wife for Valentine's Day this past February. I was a little hesitant at first because although I love pomegranates my wife was only indifferent to pomegranates. We both abosolutely LOVED the flavor of this dish. We had some left and give it to my mother-in-law. She loved it too. I spent three and a half years living in Iran in during the 1970s when my father was stationed there while in the U.S. Air Force. I never ran across the dish but when I saw it I just had to make it. My wife is wondering when I will make it again. If you can get or make some barbary bread to go with it and serve it over white rice you will have a close to authentic Persian dining experience.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GIDEONTOTG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1143592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-18T18:44:47.46Z",
                "reviewBody": "I love Fessen Jan! I gave it four stars because it an be perfect with a couple tweaks: I add about 1 tsp. of turmeric to the onion while it is frying. I also use (1) 16 oz. bag of walnut pieces which renders more than 1 cup. I pound my walnuts with a hammer to make them as fine as possible (and I don't have a food processor so I really do not have a choice!). I use 2 small game hens if they are on sale; if not I use 1 lb. of chicken pieces with the skin on. I boil the meat take it out when finished and use that chicken stock as my liquid base for the Fessen Jan. If it needs more liquid I just add chicken broth never water. Then into the liquid base I add: the onion/turmeric mixture the finely ground walnuts about c. sugar and the bottle of concentrated pomegranate paste/juice. I do not use the full 10 oz bottle maybe about of the 10 oz. bottle. I bring it to a boil reduce heat to about a 3 or 4 on the stove and let it simmer for about 2 hours. When finished add the chicken or game hens. Here are the secrets to the best Fessen Jan: 1. Make sure the walnuts are ground so fine that when you handle it the mass of ground-up walnuts is almost like play-doh; 2. According to some of the best Iranian cooks I know the darker the sauce the better. This is accomplished by using almost all of10 oz bottle of concentrated pomegranate juice/paste. My father who is Iranian (and a darn good cook I might add!) told me that back in the day when he was growin",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "shireen95",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1649409/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-28T06:59:49.903Z",
                "reviewBody": "This is a great recipe...easy...but I always add sugar to the sauce so it cuts the tartness and the flavor becomes sweet and sour. Some may like more sugar others less depends on your taste buds. i chop the walnuts until they are super fine. i love this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SHARZI67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/654882/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-03T09:50:50.293Z",
                "reviewBody": "I was really excited to find this recipe as I love Middle Eastern food but when I made this it was terrible. I had guests over and wanted to make them something special but it was a disaster. However I do have to admit that I didn't have as much walnuts as was called for but the pomegranate paste was just so overpowering I can't imagine that it would have mattered that much. The dish was so tart that you couldn't really taste anything else. Anyhow I won't be trying this again sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CPENABAUER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1082158/"
                }
            }
        ]
    }
]