[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8497/swiss-chicken-casserole-i/",
        "name": "Swiss Chicken Casserole I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7777409.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-04-21T18:42:47.000Z",
        "description": "A tasty spin on the usual chicken and stuffing casserole. Great served with rice or egg noodles.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves",
            "6 slices Swiss cheese",
            "1 (10.75 ounce) can  condensed cream of chicken soup",
            "¼ cup milk",
            "1 (8 ounce) package dry bread stuffing mix",
            "½ cup melted butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange chicken breasts in the baking dish. Place one slice of Swiss cheese on top of each chicken breast. Combine cream of chicken soup and milk in a medium bowl, and pour over chicken breasts. Sprinkle with stuffing mix. Pour melted butter over top, and cover with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 50 minutes, or until chicken is no longer pink and juices run clear.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "M. Burton"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4471403812824954,
            "ratingCount": 577,
            "itemReviewed": "Swiss Chicken Casserole I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "568.1 calories",
            "carbohydrateContent": "34.1 g",
            "cholesterolContent": "140.4 mg",
            "fatContent": "29.1 g",
            "fiberContent": "1.2 g",
            "proteinContent": "40.7 g",
            "saturatedFatContent": "16.4 g",
            "servingSize": null,
            "sodiumContent": "1170.8 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-19T03:16:06.5Z",
                "reviewBody": "No doubt, this is a 5 star recipe!  I absolutely LOVED this dish. Here's what I did to make it extra special... and tasty.  I spread a bit of the soup mixture on the bottom of my casserole dish. So I wouldn't waste unused stuffing, I combined what was left with a little chicken broth (just enough to moisten the stuffing) and added it to the dish (after the soup layer). I then mixed the herb packet and stuffing called for in the recipe in a large zip-lock bag (I don't think the recipe directs to use the herb packet...). I think this really helps distribute the flavors. I topped with chicken breasts, Swiss cheese (I used Alpine Swiss) and more sauce. I melted the butter as directed and poured over the chicken, and also added a few extra pats (you can't have too much butter!) just to be sure that the casserole kept moist in the oven. This dish goes well with green beans, cold applesauce and milk. Thanks for sharing. This one's a definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-12T17:07:17.26Z",
                "reviewBody": "I make this recipe all the time... but one change makes a HUGE difference... my family has always used the \"Traditional Sage\" or \"Savory Herb\" variety of dry stuffing mix (Stouffers).  Melt the butter, mix in the stuffing THEN sprinkle over top before baking.  I guarantee this will take this recipe over the top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelly McVay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2261473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-21T11:56:36.07Z",
                "reviewBody": "I think the concept for this dish was really good. However for those of you who decide to use a ready made stuffing mix like \"Stove Top\" (which I did)I would HIGHLY recommend that you prepare the stuffing first, then added it to the top of the dish. I didn't do this as I followed the directions and it came out WAY TOO SALTY. I actually like salty food but the combination of the full strength stuffing and the cream of chicken was a SALTY combo. I also removed the tin foil half way through the cooking process to crisp up the the stuffing. One other note. If you chicken breast are really large and think I would recommend pounding them down a bit befor preparing. Mine were really think and took an additional 25 minutes in the oven.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jason \"the cook\" Stevens",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2693628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-17T14:58:55.483Z",
                "reviewBody": "Mmmmmmm.  :)  I made this for my husband, hoping that it was similar to one that I'd received from a kitchen business....and he loved it!  I changed it a wee little bit.  I put the cream of chicken in a bowl, and used the can to fill it up with 1/3 milk and 2/3 white wine.  I just used some leftover dry stuffing that I had on hand, so I don't know, it may have been more than 8 ounces, use your judgment on liquid depending on how much you use and how moist you want it.  I also put in some herb and garlic seasonings in the dish with the liquid.  I thought it would be sorta bland without it.  When I poured it over the dish, I pushed the stuffing down underneath the liquid, because I didn't want dry stuffing and I didn't use the butter (I just used a wee little bit on top instead of what the recipe recommended, I'm trying to cut out some fat from our recipes).  It was wonderful!  I only gave it four stars because I altered it.  Next time, I think I'll put fresh mushrooms in it as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Hofer Adam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1680779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T16:49:20.483Z",
                "reviewBody": "A fairly salty casserole but this is just my personal preference showing through. I have made it twice the second time reducing the sodium by using Healthy request soup plain stuffing and asiago cheese rather than swiss. I cut the chicken in bite-sized pieces and added large hunks of broccoli florets and asparagus. My family enjoyed it with the modifications. Thanks for a great starting point Melanie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-04T20:12:21.937Z",
                "reviewBody": "Great recipe, with a few modifications.  I mix a can of cream of mushroom soup with 1/3 c. milk, add 2 1/2 cups stuffing, then spread this on bottom of pan, forming a sort of \"crust\".  Next layer is the chicken, which I cut into bite-size pieces.  Then a layer of swiss, followed by a can of cream of chicken soup mixed with 1/3 c. milk.  I put 3 cups of stuffing mix on top, then drizzle butter on top.  YUM!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUSTSHIRLEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/789972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-18T00:43:53.187Z",
                "reviewBody": "I've made a few changes. Instead of 1/4 cup milk I use a full soup can of liquid. I fill the can about 3/4 of the way with milk and then add dry cooking sherry to fill the can the rest of the way. This gives it a wonderful flavor and extra creamy sauce! I also sautee onions and mushrooms in a little butter and put that over the cheese before I pour the sauce on. It's a very good recipe and my family loves it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janis Kaye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/127509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-03T13:04:37.103Z",
                "reviewBody": "COLLECTION OF REVIEWS:  So many reviews, who to go with?!? I tried this many of the suggested ways, and this is what tastes best for the company I've served it to many times now... 1) definitely melt the UNSALTED butter (way too salty if salted butter is used) in a bowl and then add plain or my preference of any flavored uncooked stuffing.  2) Spray with PAM then add pounded chicken or thin breasts.  Add some seasoning on the chicken such as Mrs. Dash.  3) Add mozzerella chicken on top of each piece  4) Add the soup, 1/8C milk & 1/8C wine mixture (or all milk but the wine really does bring out the flavor) into the 13X9 pan.  5) Press the stuffing down with your fingers so all is covered is soup.  6)COVER with foil as directed and bake for 50 min uncovering the last 15 so stuffing isn't soggy!  This is great to make ahead of time and keep in the fridge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-07T04:53:52.26Z",
                "reviewBody": "Awesome meal! Like others said it's a great base recipe. I cut the chicken into strips layered with bacon (pre-cooked in microwave) and baby spinach. Then I added the cheese soup and stuffing mix. Huge hit no left overs!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2237589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-30T00:00:16.92Z",
                "reviewBody": "Swiss didn't go well. I think mozzarella would be better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "RogueOnion8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185024/"
                }
            }
        ]
    }
]