[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8694/chicken-enchiladas-ii/",
        "name": "Chicken Enchiladas II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F663423.jpg",
            "width": 5184,
            "height": 3456
        },
        "datePublished": "1999-07-13T05:24:08.000Z",
        "description": "A great way to use leftover chicken. Even kids love these!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 tablespoon butter",
            "½ cup chopped green onions",
            "½ teaspoon garlic powder",
            "1 (4 ounce) can diced green chiles",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "½ cup sour cream",
            "1 ½ cups cubed cooked chicken breast meat",
            "1 cup shredded Cheddar cheese, divided",
            "6 (12 inch) flour tortillas",
            "¼ cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium heat, melt the butter and saute the green onion until tender (about 3 to 4 minutes). Add the garlic powder, then stir in the green chiles, cream of mushroom soup and sour cream. Mix well. Reserve 3/4 of this sauce and set aside. To the remaining 1/4 of the sauce in the saucepan, add the chicken and 1/2 cup of shredded Cheddar cheese. Stir together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill each flour tortilla with the chicken mixture and roll up. Place seam side down in the prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl combine the reserved 3/4 of the sauce with the milk. Spoon this mixture over the rolled tortillas and top with the remaining 1/2 cup of shredded Cheddar cheese. Bake in the preheated oven for 30 to 35 minutes, or until cheese is bubbly.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "teppij"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.564870689655172,
            "ratingCount": 4640,
            "itemReviewed": "Chicken Enchiladas II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "619 calories",
            "carbohydrateContent": "66.8 g",
            "cholesterolContent": "60.4 mg",
            "fatContent": "27.1 g",
            "fiberContent": "4.1 g",
            "proteinContent": "26.1 g",
            "saturatedFatContent": "11.5 g",
            "servingSize": null,
            "sodiumContent": "1459 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-08T00:37:03.077Z",
                "reviewBody": "This a good chicken BURRITO recipe. The problem with almost every recipe on this site for chicken enchiladas is that they call for flour tortillas!!  Enchiladas are made with CORN tortillas, not flour.  The corn tortillas also hold up better and have much better flavor.  For chicken enchiladas, in place of flour tortillas, use white corn tortillas, and dip them in to hot oil just for a couple of seconds to make the tortillas flexible and easy to roll.  Try it this way.  It is so much better, though not low in calories, and it is also more authentic.  If you want a lower cal alternative, use olive oil flavored or regular no stick cooking spray.  Spray a skillet with the non stick cooking spray very generously then put in the tortilla for a few seconds on each side. Repeat the process including adding more nonstick cooking spray every time you add another tortilla. Same effect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "WOODANGELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/178252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T14:25:44.217Z",
                "reviewBody": "I made quite a few changes to the recipe with excellent results. First, I used a store- bought rotisserie chicken. I doubled the sauce and used 1 can of cream of chicken and 1 can of cream of poblano chile soup. I also added a squeeze of lime juice, fresh cilantro, fresh garlic, pinch of oregano and chili powder and some salsa at the end. Those additions really gave it a nice flavor. I also used corn tortillas. I served the dish with homemade avocado salsa, beans & rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin J",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/449880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-02T21:12:49.247Z",
                "reviewBody": "I would say that this recipe, as published, is an excellent basic one and quite adaptable. It stands on its own and is really yummy though. My husband, however, didn't really care for the flour tortillas and the ultra creaminess. It just didn't \"feel\" like enchiladas to him. I loved it. I am now cooking for a large group of people (10...sometimes more) including my grandfather who is on a strict renal diet.\r\n\r\nAfter reading some of the reviews here, I decided to give this recipe another try...with modifications. I DOUBLED the recipe as written, EXCEPT for: using 1 can chopped jalapenos (4 oz.), 1/4 cup chopped red bell pepper, and 1/4 cup chopped green bell pepper in place of the green chilies; 4 cups of shredded chicken rather than 3; 2 dozen 6\" corn tortillas rather than a dozen 12\" flour ones; and a full cup of milk rather than 1/2 cup. I also ADDED to the sauce: 1 tsp of garlic powder, 1 tsp of chili powder, 1/2 tsp of cumin, and a can of cream of chicken soup (to help extend the sauce and add a little more chicken flavor). For color, I added a few more chopped red and green bell peppers on top of the cheese before baking.\r\n\r\nThis made 12 servings, and was a major hit. It also fell within the sodium and potassium restrictions of my grandfather's diet. The added spices and the jalapeno added a more adult kick to them, and they \"felt\" more like enchiladas to everyone. This is a wonderful dish, good enchilada alternative for those who can't or won't eat tomatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-27T21:06:38.5Z",
                "reviewBody": "This is the best enchilada recipe I've ever tried. I found that the recipe measurements are perfect for twelve 6\" sized tortillas. Instead of green onions, which no one in my family really cares for, I used 1 large chopped onion, and also 2 fresh finely chopped jalapeno peppers (in addition to the can of chilis that the recipe calls for) that I sauteed. I used Cream of Chicken soup, not mushroom. I added 1 package of dry taco seasoning to the sauce because the condensed soup and sour cream by itself just didn't feel like Mexican food to me. And to further \"up\" the Mexican factor, I used 1 can of refried beans -- I smeared the tortilla with approximately 1 tbs of beans (use more with a larger tortilla) before spooning on the chicken filling and wrapping. Instead of cubing, I also shredded the chicken. In addition, I increased the cheese to 2 cups (1 cup of sharp cheddar, 1 cup of Colby cheese). \n\nYum! This recipe is definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ivyguppy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2027165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T18:49:47.063Z",
                "reviewBody": "This is for all the people who revise, add, and lterally change a whole reipe to their likings. If you want to submit your own recipe, do it! Dont try to change someone else's recipe. To write a book about how hubby, or 2 yr. olds , teens, or whoever, likes, or dislikes, eats, or doesnt eat, is a bit sensless. Most readers do not care what your family food perferences are, they are interested in hearing about the recipe. I get so tired of reading stories liike some people submit, I dont even want to read them anymore. I want to read how they liked the recipe, and short comments, or tips how to make the recipe easier, or better, not  how to change the whole recipe, and talk about family dislikes. Its a waste of readers time. Or.. do like the website suggests, make your changes to the recipe and save it to your own recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Geri G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1731539/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-20T23:48:30.07Z",
                "reviewBody": "Revamping this Review...yet again!\nStill a Wonderful Recipe!!!!!  \nFirst made this back in 2002 without substituting any ingredients (ok i added a few...but didn't use non or low fat items). I use Extra Soft..Soft Taco Size tortillas..(8\" I think).  I get mine at Frys (Fry's/Kroger brand).  They have a little more give to them and don't break as easily.  Made it for a second time a few months after that with non or low fat ingredients. Tasted just as wonderful as with original ingredients.  TRUST ME...NO ONE WILL BE ABLE TO TELL!  AND...I know some of you have suggested or stated that enchiladas are made with corn not flour tortillas...This is true.  But, for myself and my family and friends i have made this for...they prefer the flour over the corn.  A lot of people said they didn't like the toughness of the corn and i personally don't like frying anything i don't have to.  The only way to make the corn tortilla pliable is to fry it for a few seconds.  Try tortillas made with organic ingredients.\nIngredients altered or added:\n1. 1 can of Ro-Tel tomatoes partially drained\n2. 1 can of green enchilada sauce. \n3. A shredded 4 cheese blend we get from Costco consisting of Montery Jack, Medium Cheddar, Queso Quesadilla, Asadero.\n4. Low-fat sour cream\n5. 1% Milk\n6. A baked chicken from my local grocer that i debone and shred\n7. Double the Sauce (VERY IMPORTANT)\n6. 1 can of cream of mushroom soup (along with cream of chicken)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill C ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/79shale97/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-05T14:21:08.467Z",
                "reviewBody": "I have made this recipe several times now and just realized I never rated it.  I'll start by saying every time I feed this to someone new they end up leaving with the recipe.  Really I follow it to a tee with the exception of cooking the chicken in chicken taco seasoning first and then making the recipe.  It gives it a more authentic flavor.  Other than that follow it and you will be very pleased and so will your guests!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Boyar Ha Ha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1216716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-02T21:13:35.513Z",
                "reviewBody": "OHMYGOSH! These were the best enchilada s I ve ever made!!! And was told the best others have ever eaten.This is what I did for those who like suggestions and tips: Taking heed of the advise of other users I planned on making more sauce from the beginning. So I used a package of boneless/skinless Chicken thighs (dark meat for more flavor) and one large bone-in split chicken breast. I coated all with Fajita seasoning garlic powder onion powder paprika salt and pepper. Then I browned them along with chopped white onions in a pan in a little bit of olive oil on each side added some water and chicken bullion to the pan and cooked them until done. I then cut them up (careful to remove all bones from breast) and used that for the meat filling. I also added the onions that cooked with the chicken to the mix. As for the sauce: I dbl'd all ingrediants. I used two cans of soup one was crm chick/crm shroom combined and one was just crm shrooms. I also added 2 cans of mushrooms pieces and an extra can of chili's. That was about all of the changes I made except in addition to cheddar cheese I also added a shredded white cheese on top (Monterey-jack works well but I used an authentic Mexican variety that can be found in Texas). The sauce was enough to make about 9-10 enchiladas each amply stuffed. EXCELLENT! (I also used fresh made tortilla's that you can find in some grocery stores but not sure if that had any impact or not.) I cannot wait to make these AGAIN!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-28T01:42:33.107Z",
                "reviewBody": "THE BEST enchilada recipe I ve ever tried! This was better than the restaurants!! (Okay well close!!) Everyone I made it for RAVED. The changes I made: I used a pre-cooked rotisserie chicken from the grocery store for the chicken filling (a little more expensive but well worth it) CORN tortillas instead of flour (I think enchiladas are technically supposed to be made with the corn tortillas) and for the sauce instead of adding the 1/4 cup milk I substituted a half a can of Ortega s red enchilada sauce. This was key if you ask me! THIS WAS SOOO GOOD!!!! Thank you Steph!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSANLEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/598131/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Enchiladas II",
            "description": "Make these family-pleasing chicken enchiladas.",
            "uploadDate": "2016-05-26T15:53:07.391Z",
            "duration": "PT3M45.225S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F28aebc9c-21ac-46d7-bb0e-dd6e5668524d%2F306d3fc9-824f-48bc-abb7-c64255bf08bd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4913510956001"
        }
    }
]