[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8725/slow-cooker-escalloped-chicken/",
        "name": "Slow Cooker Escalloped Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2276978.jpg",
            "width": 1422,
            "height": 960
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This is a simple and delicious chicken recipe I received from a dear friend years ago.  My family loves it.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves - boiled ",
            "1 cup chopped onion",
            "1 cup butter",
            "13 cups white bread cubes, baked until slightly dry",
            "1 teaspoon poultry seasoning",
            "1 ¼ teaspoons salt",
            "½ teaspoon dried sage",
            "½ teaspoon ground black pepper",
            "2 1/2 cups reserved cooking liquid from chicken",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 cup chopped celery"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "FOR DRESSING: Combine the onion, butter or margarine, bread cubes, poultry seasoning, salt, sage, pepper, reserved cooking liquid, mushroom soup and celery. Mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a slow cooker, layer the cooked chicken and dressing mixture. Cook on low for 4 to 8 hours. Serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Peg"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9423076923076925,
            "ratingCount": 52,
            "itemReviewed": "Slow Cooker Escalloped Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "684.6 calories",
            "carbohydrateContent": "56.2 g",
            "cholesterolContent": "130.1 mg",
            "fatContent": "38.9 g",
            "fiberContent": "3.2 g",
            "proteinContent": "27.4 g",
            "saturatedFatContent": "21.4 g",
            "servingSize": null,
            "sodiumContent": "1751.4 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-08-09T22:39:35.03Z",
                "reviewBody": "This was great and so easy.  I only had the frozen chicken breasts (like you buy at Sam's Club) I threw them in the pot frozen (didn't pre-boil) and took the advice of some of the others and cut down on the liquid and the butter.  Instead of water I used a can of vegtable broth, but I think it needed just a tad more liquid than that.  I also cooked it longer (like 6 hours).  The chicken absolutely fell apart and had a wonderful flavor, probably from the veg.broth).  Overall, it was great!  Will definately make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "call me chickn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1112176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-06T17:20:55.153Z",
                "reviewBody": "I had success with this recipe after reading the other reviews. I cut the butter in half and cut down on the water. I also placed frozen chicken drumsticks in the crockpot 3-4 hours before I added the dressing mixture on top and after a couple more hours of cooking they were both done to perfection. It was even better left over! Don't give up the first time if it doesn't come out right...it's worth experimenting a little until you get it the way you like it! Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IVERYGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/473593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T20:31:42.03Z",
                "reviewBody": "I stumbled upon this recipe; had all the ingredients read the other reviews and VOILA!! This is a real winner! The changes I made were to use 3/4Cup of butter and about 1 Cup of the chicken broth...Just enough to get it \"mushy\"...I cooked for 5 hrs on Low. The onion and celery were al dente which was fine. VERY good recipe! Reheated in the microwave the next day is wonderful!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEWGIRL21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/694865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-15T17:41:16.953Z",
                "reviewBody": "Good recipe - I do agree - use a lot less liquid than specified!! I just mixed diced raw chicken into the mixture before cooking and used one can of chicken broth - which was a little too much!!! I pre-sauteed the onion and celery until al dente. I used half white and half whole grain bread. I also threw in a handful of orange-flavored dried cranberries and some sliced raw mushrooms (which will add their own liquid while cooking!). Next time - I'll use really tough french bread and whole grain bread and will add even more dried cranberries - they made it really \"Thanksgiving-like\"!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Menwith Hill'er Back Home !!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/938152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-10T22:06:56.303Z",
                "reviewBody": "OMG!!!..This is such a great recipe. Fast to make and great tasting. I read the other reviews before making it for the first time. I followed alot of their suggestions of cutting back on the butter and liquid which IO did. 1/2 cup of butter is more than enough. I also toasted the bread light brown before cutting it in cubes. I used 1 chicken boullion disolved in 1 cup of the fluid left over from poaching the chicken. I had chicken backs that I wanted to use instead of breast. I took off the skin but left the bone in to hold the meat together. I put the meat on the bottom of crock pot then covered with the dressing. Dried cranberries were the added touch this needed. It was so nice to come home from work and only have to prepare a vegetable to go with supper. I will certainly make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "heart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1533104/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T05:36:12.89Z",
                "reviewBody": "This recipe has potential but the liquid measurements have got to be wrong. I would cut the butter and reserved cooking liquid in half. Also you don't have to bother toasting the bread cubes if you use day-old french bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "FULLBORE2000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/170309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-23T02:26:16.767Z",
                "reviewBody": "11/10/2003: Wow! This was great! I followed the earlier suggestions to half the liquid and the butter. I also put frozen chicken leg quarters in the slow cooker first and then boned and skinned the chicken before adding the rest of the ingredients. My family raved for days about this recipe. Thanks Peg! This will definitely be on my list of \"best\" recipes! Update 1/2/2017: Fourteen years later this recipe is still used in several of my nieces' and nephews' Thanksgiving and Christmas BEST stuffing recipes! It has been adapted by some to be more vegetarian by leaving out the chicken. Other families have made it more low-carb by using low-carb bread. But Peg's original recipe definitely ranks in the top ten of my family's holiday MUST HAVE recipes! Another UPDATE 11/22/2017: Over the years I've had the best luck with this recipe when I've used the best tasting bread I can find. The absolute ultimate was when I mixed Russian Black Bread (which is slightly sweet) with toasted English Muffin bread. (That year even the teenage nieces and nephews who wont talk to me smiled at me in appreciation!) Unfortunately Franz Bakeries has stopped making the Russian Black bread so this year I am trying Kings Hawaiian Bread (slightly sweet) with toasted English Muffins and homemade white bread. However the only time I really regretted my bread choice was when I used the pre-packaged dried cubes which are sold for stuffing. Don't do that!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mae West",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/663580/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T18:44:18.667Z",
                "reviewBody": "I poached the chicken breasts in a broth / water mixture with a bay leaf then cubed the chicken before I added it to the crock pot. I used a couple of loaves of day old bread one was white and the other was a whole wheat. I used a lot of sage because it's a flavor we enjoy. This was really good really easy (if I had used dressing mix instead of cubing and toasting the bread myself it'd be nearly effortless). It's a good dish for a cold day...made the house smell like the holidays were on the way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ang",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2130161/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T20:34:14.123Z",
                "reviewBody": "So good!!! The flavor of the stuffing was out of this world! DH said he could eat it every day! After reading the other reviews I too cut the butter in half and used less liquid ( 2 cups chicken broth) The other changes I made were I sauteed the onion and celery in olive oil used frozen boneless chicken breasts and used 2 cups of chicken broth instead of water. I will cut the butter down even more next time ( 1/4 cup?) and since it was mushy I will cut the broth back to maybe 1-1 1/2 cups. Really though......very very tasty and easy! I put it in my favorites...thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Libby Wright",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16679228/"
                }
            }
        ]
    }
]