[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8758/white-cheese-chicken-lasagna/",
        "name": "White Cheese Chicken Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2015%2F02%2F735349_White-Cheese-Chicken-Lasagna_8758-_Photo-by-abapplez.jpg",
            "width": 640,
            "height": 423,
            "caption": "Photo by abapplez"
        },
        "datePublished": "1999-06-29T04:07:37.000Z",
        "description": "A chicken and spinach lasagna with a creamy white cheese sauce. Great for any kind of pot luck. My kids love it.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "9 lasagna noodles",
            "½ cup butter",
            "1 onion, chopped",
            "1 clove garlic, minced",
            "½ cup all-purpose flour",
            "1 teaspoon salt",
            "2 cups chicken broth",
            "1 ½ cups milk",
            "4 cups shredded mozzarella cheese, divided",
            "1 cup grated Parmesan cheese, divided",
            "1 teaspoon dried basil",
            "1 teaspoon dried oregano",
            "½ teaspoon ground black pepper",
            "2 cups ricotta cheese",
            "2 cups cubed, cooked chicken meat",
            "2 (10 ounce) packages frozen chopped spinach, thawed and drained",
            "1 tablespoon chopped fresh parsley",
            "¼ cup grated Parmesan cheese for topping"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain, and rinse with cold water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a large saucepan over medium heat. Cook the onion and garlic in the butter until tender, stirring frequently. Stir in the flour and salt, and simmer until bubbly. Mix in the broth and milk, and boil, stirring constantly, for 1 minute. Stir in 2 cups mozzarella cheese and 1/4 cup Parmesan cheese. Season with the basil, oregano, and ground black pepper. Remove from heat, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread 1/3 of the sauce mixture in the bottom of a 9x13 inch baking dish. Layer with 1/3 of the noodles, the ricotta, and the chicken. Arrange 1/3 of the noodles over the chicken,  and layer with 1/3 of the sauce mixture, spinach, and the remaining 2 cups mozzarella cheese and 1/2 cup Parmesan cheese. Arrange remaining noodles over cheese, and spread remaining sauce evenly over noodles. Sprinkle with parsley and 1/4 cup Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 35 to 40 minutes in the preheated oven.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Lisa Humpf"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.405286343612334,
            "ratingCount": 2497,
            "itemReviewed": "White Cheese Chicken Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "368.9 calories",
            "carbohydrateContent": "22.8 g",
            "cholesterolContent": "77.1 mg",
            "fatContent": "20.7 g",
            "fiberContent": "2.4 g",
            "proteinContent": "23.7 g",
            "saturatedFatContent": "12 g",
            "servingSize": null,
            "sodiumContent": "670.9 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-08-24T17:14:17.107Z",
                "reviewBody": "I can't rave about this recipe enough!  It was absolutely fabulous!  I only added about 1 1/2 pks of the spinach, and mixed the spinach, ricotta & chicken together for easy layering.  I used fresh (refrigerated), no-boil noodles and just let them cook in the sauce.  I did add about 1/2 cup white wine to the sauce and added a lot more garlic.  I did add almost twice the amount of ricotta and added a few extra cups of mozzerella.  (There's no such thing as too much cheese in my house:) My husband and friend who came over for dinner couldn't get enough!.  Definitely elegant and interesting enough to serve at a dinner party, but great for any family dinner as well.  I was just really pleased with this meal.\r\n\r\n**Addendum 8/24/04--I just wanted to add that recently I began using fresh spinach in this recipe and it improved greatly.  I de-stemmed the spinach (about 1 lb bag) and then threw it in a pan with 1 tablespoon olive oil.  Cooked it down until it was tender and bright green.  The frozen spinach is mostly stems, so substituting fresh spinach took care of that problem",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARDOZOS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/478095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-15T23:28:09.297Z",
                "reviewBody": "my sister absolutely loves this dish! whenever she comes to visit from college, she begs me to make it. to kick up the flavor in the chicken, i marinate it overnight in a combination of roasted garlic (garlic drizzled w/ olive oil and put in the oven until it's soft and sweet), FRESH basil (nothing compares to the flavor) olive oil, and a splash of lemon juice. then i grill the chicken for additional flavor. it really makes it rustic. I add a layer of sauteed veggies (onion, garlic, fresh garlic, mushrooms, matchstick carrots, and zucchini). Mine ends up going: sauce, noodles, ricotta/spinich mixture, chicken, sauce, noodles, ricotta/spinich, veggies, sauce, noodles, ricotta/spinich, chicken, sauce, cheese. It is so good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LMG1115",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/883413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T22:51:12.59Z",
                "reviewBody": "The only way I could describe this dish is havenly.  It is pretty rich though so I won't be making it often and I felt like I dirtied every pan I own.  I made a few adjustments and have a few more that I will try next time I make it.\r\nFor the sauce I added about two teaspoons of chopped garlic from a jar and thought it was perfect.  I didn't chop my onions fine enough though.  I recommend you chop them very fine.  I only had one 10 oz can of chicken broth so I made up the rest of the two cups of broth with white wine.  I used the amount of oregano and basil called for and thought that was perfect.  But the wine may have hidden some of the taste.  I added salt and pepper at the very end based on taste.  I am not sure how much I added.\r\nThe recipe is not clear if the noodles should be precooked, so I used no bake noodles.  \r\nI baked the chicken in the oven with no spices.  The chicken itself didn't have much flavor, but you don't miss it with everything else going on.\r\nI used a 16 oz package of spinach and was still a little too much in my opinion.  Next time I will use one 10 oz package.\r\nI didn't pay attention to how the recipe said to layer, because it didn't make any sense to me.  I put a third of the sauce in the pan, a layer of noodles, half of the chicken, spinach, and ricotta.  Then another layer of noodles, 1/3 of the sauce, rest of the chicken, spinach and ricotta.  The final layer of noodles and sauce.  Then the mozzerella and parm. cheese.  \r\nBecause I made ahead of",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-01T00:37:11.397Z",
                "reviewBody": "This was wonderful.  I made the following modifications:  made 1/3 more sauce.  Used only 1 package of spinach, which I mixed into the ricotta.  I layered in the following way:  1/4 sauce, 3 noodles, 1/2 ricotta/spinach, 1/2 chicken, 1/4 of sauce, 1/3 of remaining mozz/parm, 3 noodles, rest of ricotta/spinach, rest of chicken, 1/4 of sauce, 1/3 of remaining mozz/parm, 3 noodles, rest of sauce, rest of mozz/parm, sprinkled with fresh parsley.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARISSAW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/242896/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T22:19:40.367Z",
                "reviewBody": "This was fabulous!  My husband enjoyed it so much he took leftovers for lunch the next day.  I did cook 1/2 lb of chopped bacon until crisp, remove and drain on some paper towel.  I then cooked 2 chopped raw chicken breast in the bacon grease until slightly brown and done and then drained on paper towels.  Giving the chicken a slight bacony flavour.  Then in layering I sprinkled the cooked bacon over the layer of spinach. It was great.  It combined one of my favourite combinations, a classic, chicken, bacon and spinach.  You must try adding the bacon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "S. HODGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/298800/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-31T23:36:29.78Z",
                "reviewBody": "DELICIOUS!! I used fat free ricotta cheese and couldn't even tell the difference.  I also cut back on the spinach because I thought one package was more then enough.  I was a little confused as to whether or not I should cook the noodles first.  I chose not to and they cooked perfectly in the cheese sauce!!  Great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KEVINCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/776349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-30T03:41:23.28Z",
                "reviewBody": "I went on the fantastic reviews and made this dish for a group of 12 women without even testing it out first. I was scared but I have nothing to be scared of! It was awesome! I took the advice of others and added extra mozzerella on the top and used no-boil noodles. It all worked out perfectly and every single woman at my party asked for the recipe. I HIGHLY recommend this! PS - My husaband like this recipe so much that he ate some for breakfast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EPRUETZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/647202/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-08T02:33:44.477Z",
                "reviewBody": "I found this recipe 5 years ago right after I got married and was in need of some good recipes. This was a HOME RUN! I have since added lots more garlic more cheese and even created a spinach and mushroom layer that I also flavor with garlic. I get asked for this recipe whenever I make it. Most importantly...it has become a family favorite! I usually do most of the prep work far in advance so I just need to throw it all together and whip up the sauce. Well worth the efforts every time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AnnesGazFam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2134380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-13T18:46:53.497Z",
                "reviewBody": "This was okay and I will make it again but I think it needs some tweaking to make it really good.  Next time, I will use a straight bechamel, using all milk and no chicken broth. I will probably use just parmesan cheese and skip the mozzarella, too. I think part of the reason I found this recipe so bland was that there was no nutmeg in the white sauce - for me nutmeg is a must, both for the bechamel AND for the spinach! Besides all the issues I had with the sauce, I made a couple changes to the \"structure\" of the lasagna - first putting sauce in the pan, then noodles, chicken with sauce, noodles, spinach with ricotta (I substituted cottage cheese), noodles, then the chicken mixture again, noodles, then the spinach mixture again, more noodles, finishing with plain sauce topped with more parmesan cheese. I used no-boil soft lasagna noodles throughout. I like to make lasagna on \"swim lesson night\" because I can make it ahead and have it bake and set before we get home, and my daughter doesn't like tomato-based lasagna so I will definitely make chicken and spinach lasagna again, but next time I'll do it \"my way\"...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNNIEMILANO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1097775/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "White Cheese Chicken Lasagna",
            "description": "See how to make a top-rated 3-cheese white lasagna.",
            "uploadDate": "2012-08-10T22:34:58.591Z",
            "duration": "PT4M39.613S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd9db2c37-7a93-437e-8f39-56ca915e2a93%2F6fada411-0967-45a1-91af-3edf3c69d28e%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1780426225001"
        }
    }
]