[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/650/meat-and-poultry/chicken/fried-chicken/",
                    "name": "Fried Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8805/crispy-fried-chicken/",
        "name": "Crispy Fried Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F22%2F2142598.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-05-21T19:28:05.000Z",
        "description": "I experimented for many years before developing this recipe. It's bits and pieces of hints I had heard over the years. I have had many compliments on this chicken. Most of this recipe is dependant on your own taste. It's more a matter of preparation and cooking method!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (4 pound) chicken, cut into pieces",
            "1 cup buttermilk",
            "2 cups all-purpose flour for coating",
            "1 teaspoon paprika",
            "salt and pepper to taste",
            "2 quarts vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Take your cut up chicken pieces and skin them if you prefer. Put the flour in a large plastic bag (let the amount of chicken you are cooking dictate the amount of flour you use). Season the flour with paprika, salt and pepper to taste (paprika helps to brown the chicken).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip chicken pieces in buttermilk then, a few at a time, put them in the bag with the flour, seal the bag and shake to coat well. Place the coated chicken on a cookie sheet or tray, and cover with a clean dish towel or waxed paper. LET SIT UNTIL THE FLOUR IS OF A PASTE-LIKE CONSISTENCY. THIS IS CRUCIAL!\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a large skillet (cast iron is best) about 1/3 to 1/2 full with vegetable oil. Heat until VERY hot. Put in as many chicken pieces as the skillet can hold. Brown the chicken in HOT oil on both sides. When browned, reduce heat and cover skillet; let cook for 30 minutes (the chicken will be cooked through but not crispy). Remove cover, raise heat again and continue to fry until crispy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain the fried chicken on paper towels. Depending on how much chicken you have, you may have to fry in a few shifts. Keep the finished chicken in a slightly warm oven while preparing the rest.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Fried Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Elaine O"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5340599455040875,
            "ratingCount": 734,
            "itemReviewed": "Crispy Fried Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "488.9 calories",
            "carbohydrateContent": "29.5 g",
            "cholesterolContent": "116.1 mg",
            "fatContent": "21.8 g",
            "fiberContent": "1.1 g",
            "proteinContent": "40.7 g",
            "saturatedFatContent": "5.8 g",
            "servingSize": null,
            "sodiumContent": "140.1 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-01-23T16:35:11.687Z",
                "reviewBody": "I've been cooking for over 50 years and during that time I have fried chicken hundreds of time. But...in all those years never have I fried chicken that comes even close to being as crispy, moist and delicious as Ms. O'Neill's \"Crispy Fried Chicken\". Without a doubt, her recipe is THE BEST fried chicken I've ever prepared or eaten. Not only is\r\nit delicious and crispy hot right out the frying pan, but when warmed up the next day in the oven, the chicken is as crispy as ever. \r\nThank you, Ms. O'Neill for sharing your wonderful recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARBARA11035",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/617499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-29T20:00:50.68Z",
                "reviewBody": "5++ star rating for this one, Elaine! Your techinque works wonderfully. This plus some tried and true ways, give the most perfect fried chicken every time. Correct oil temp is necessary, about 375, and it takes a while to get that hot. I also brine (soak in salted water) any chicken I prepare and this assures moistness no matter what the cooking method. I have tried many seasoning combos, depending on the mood, and they all are super, as long as you follow Elaine's way of preparation. Simply the best fried chicken I've ever made!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATMANDU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/430706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-04T18:02:31.08Z",
                "reviewBody": "I used boneless filets and cut it into strips. I usually coat my chicken in eggs before flouring them but the buttermilk worked 100 times better. The chicken was more tender and moist than it normally is when I fry chicken. Great prep instructions. I also found that I can freeze the chicken after it is coated in the flour. So, I can just pull it out of the freezer the next time I want to make some and it will be a lil' quicker. And for a fun variation, every now and again I add garlic powder and dried parmesan to my flour mixture. Then after I fry up my strips, I throw them on top of some pasta with marinara sauce and top with fresh mozzarella and parmesan cheeses to make a quick and easy chicken parmesana! My family loves it and I can't get rid of my friends when I make it. There is never, never, never any leftovers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gildawen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2241524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-05T17:51:48.24Z",
                "reviewBody": "This is my recipe and I'm flabbergasted with the wonderful reviews!! Thank you all so much!  I haven't been able to edit the recipe, but would like to add that you can add any seasonings you like, it's all personal preference. I didn't include a lot of spices because everyone has their own preference. Please don't complain about it being bland if you don't add your own spices, thanks.  The recipe is more about technique than anything else.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elaine O",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-24T16:53:17.583Z",
                "reviewBody": "OMG!  I never grew up eating fried chicken and after trying this recipe I feel deprived as a child! My husband had been asking for fried chicken for a while and I wanted it to be perfect.  Having never made this before I read through a bunch of recipes but obviously knew that fried chicken has to be moist on the inside and the breading has to be thick enough to stand up to the frying process so it can be crunchy on the outside.  So, I began with a marinade. I put the cut up chicken in a glass bowl and filled it with enough buttermilk to cover plus a couple dashes of tabasco.  I turned the chicken a few times during 6 hours.  I drained the chicken in a colander and patted it dry then breaded it in the flour.  For the flour mixture I used 3 cups flour, 1 Tbsp. garlic powder, 1 Tbsp. onion powder, 2 tsp. paprika, 1 tsp. salt. 1 tsp. pepper.  I then follwed the steps outlined in this recipe.  We used an electric fryer so our cooking time was a bit less than 30 minutes.  You have to watch your chicken closely.  I don't know which I like better - fried chicken that's fresh out of the frier warm or cold out of the fridge the next day.  Either way, I'm hooked! Thanks for a wonderful recipe that definitely makes \"Crispy Fried Chicken\"!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-23T16:35:08.357Z",
                "reviewBody": "I rarely give a recipe an overall rating of five stars. This one deserved every one of the stars. This was a true winner and I couldn't believe how crispy and juicy it was! I used poultry seasoning lots of paprika and some garlic powder to season the flour. I know a recipe is good when my family devours the dish and asks when the next batch will be ready. Even my 3 year old niece ate two pieces! Thank you SO much for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNIGAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/292707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T23:09:28.1Z",
                "reviewBody": "the fried chicken turned out to be deliciously crispy even though i made a few alternation.  i substituted buttermilk with sour milk (made from 1 cup of milk mixed with 1 tablespoon of lemon juice)  as i couldn't find any in the supermart in our country.  Marinated the chicken for few hours with little salt, pepper & paprika. i only cover the chicken for 10 mins (for a batch of 8 thighs).  there's none left to test whether chicken still remain crispy when left overnight",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J. YEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857035/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-06T16:13:01.647Z",
                "reviewBody": "Great simple recipe, but i did add some changes well prep steps and tips not flavour wise. I soaked the chicken in cold ice water for 30 minutes (helps all the blood out of the meat)then soaked in room temp water with dissolved sea salt for another 30 minutes or so. Then soaked over night in the butter milk. Makes my chicken super tender and tastey. I like a really thick coat of bread so i double dip. When frying i add a stalk of celery to the oil, it deepens the color of the fried chicken without needing to overcook it. I also dont use paper towels, i recomend letting the chicken drip on a wire rack, the paper towel although it soaks some of the oil the chicken tends to reabsorb the oil making it soggy! Comes out perfect, with a side of gravy and mashed potatoes what more could you ask for!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LaCuocaEnza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2762237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-10T00:32:10.577Z",
                "reviewBody": "Thank you, thank you, thank you!!!  I've tried (emphasis on \"tried\"!) to make fried chicken in the past and it's always come out all burned and crisped on the outside and still pink in the middle, then I'd try to fix it by nuking it, and ended up having it soggy and uncooked.  But the tips and recipe were both perfect!  All I did was add garlic (garlic fiends here) and paprika then followed recipe to a tee and received perfectly done fried chicken!  Woohoo!  It tasted awesome and looked super!  Hubby and I loved it and chowed down big time!  Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J9GEM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/771808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-22T00:43:27.510Z",
                "reviewBody": "Certainly this chicken lives up to it's name... it definitely IS crispy! I read all the reviews and decided to not only brine it first, but then rinsed and soaked in a buttermilk/tabasco mixture for several hours. Added garlic powder, lemon pepper and Old Bay to the seasonings but I have to say... this chicken, although crispy yet moist, tasted like fried grease. No flavor to speak of. Will continue my search for a good recipe... although this was better cold, I will not adhere to the recipe again. I know it's not the popular opinion, but I think this recipe would definitely benefit from adding MSG (Accent). Three stars for the excellent method, though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "~TAYLOR~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969942/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Crispy Fried Chicken",
            "description": "See great technique for making crispy fried chicken.",
            "uploadDate": "2012-08-23T19:20:58.920Z",
            "duration": "PT3M6.478S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F28ba9fe4-fae0-484a-adac-64e651dc6d7b%2Fe01f2020-67ff-4452-9ad6-7a99d790f919%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1801207363001"
        }
    }
]