[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8818/pico-de-gallo-chicken-quesadillas/",
        "name": "Pico de Gallo Chicken Quesadillas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F997990.jpg",
            "width": 3468,
            "height": 3456
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "Flour tortillas filled with chicken breast, onions, peppers, pico de gallo, and Monterey Jack cheese.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tomatoes, diced",
            "1 onion, finely chopped",
            "2 limes, juiced",
            "2 tablespoons chopped fresh cilantro",
            "1 jalapeno pepper, seeded and minced",
            "salt and pepper to taste",
            "2 tablespoons olive oil, divided",
            "2 skinless, boneless chicken breast halves - cut into strips",
            "½ onion, thinly sliced",
            "1 green bell pepper, thinly sliced",
            "2 cloves garlic, minced",
            "4 (12 inch) flour tortillas",
            "1 cup shredded Monterey Jack cheese",
            "¼ cup sour cream, for topping"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine tomatoes, onion, lime juice, cilantro, jalapeno, salt, and pepper. Set pico de gallo aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat 1 tablespoon olive oil. Add chicken and saute until cooked through and juices run clear. Remove chicken from skillet and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Put the remaining 1 tablespoon of olive oil in the hot skillet and saute the sliced onion and green pepper until tender. Stir in the minced garlic and saute until the aroma is strong. Mix in half of the pico de gallo and chicken breast meat. Set aside; keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a heavy skillet, heat one flour tortilla. Spread 1/4 cup shredded cheese on the tortilla and top with 1/2 the chicken mixture. Sprinkle another 1/4 cup cheese over the chicken and top with another tortilla. When bottom tortilla is lightly brown and cheese has started to melt, flip quesadilla and cook on the opposite side. Remove quesadilla from skillet and cut into quarters. Repeat with remaining ingredients. Serve quesadillas with sour cream and remaining pico de gallo.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Tony Cortez"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7000993048659385,
            "ratingCount": 1007,
            "itemReviewed": "Pico de Gallo Chicken Quesadillas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "673.2 calories",
            "carbohydrateContent": "72.8 g",
            "cholesterolContent": "65 mg",
            "fatContent": "29.1 g",
            "fiberContent": "6.7 g",
            "proteinContent": "31 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "978.5 mg",
            "sugarContent": "7.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-05T18:29:56.5Z",
                "reviewBody": "Tony!  This is an awesome recipe!  Thanks!  For anyone thinking of making this, here's a few suggestions:  1) Don't skip making the pico de gallo. . . that's what makes this recipe so good.  The flavor is wonderful!  2) Reading through the reviews, it appears some of you are having problems flipping the 12\" tortilla.  Here's a quick and easy way to flip it.  When the tortilla is ready to flip, take a dinner plate and lay it upside down in the pan on top of the tortilla.  Put your hand on top of the plate and flip the entire pan over so that the plate and tortilla are now in your hand.  Now, simply slide the tortilla back into the pan and \"voila\" your flipped without the mess!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAUNF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/37613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T18:29:21.09Z",
                "reviewBody": "Senor Cortez--This is the best, by far, recipe I have ever tasted for Pico de Gallo.  Combining it in a chicken quesadilla was a work of genius, or family background.  Using fresh cilantro is imperitive to the overall good taste, as are fresh ripened tomatoes.  I followed your recipe to a T, but did prepare the pico de gallo about 3 hours prior to cooking to let the flavors completely meld.  I also did mine in the oven, lightly coating the lower tortilla with canola oil, then adding the cheese and ingredients, and coating the top tortilla lightly with oil, and baked in a 375 degree oven for about 20 to 25 minutes.  Again, mucho gracios for this delicious recipe.  I will quadruple the recipe the next time in order to feed a few friends.  GordonGoodGuy, and Chef Extrordinaire.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gordon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/328381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T01:38:46.443Z",
                "reviewBody": "You CAN go back home again!  I'm from Texas and sorely missed Tex-Mex food.  This recipe is perfect and outperforms most restaurants easily. The pico de gallo stands alone and can be made as dip for tortilla chips..outstanding!  I would recommend NOT boiling/stewing the chicken as another reviewer suggests, because so much of the flavor comes from the chicken pan drippings created by cooking it in the olive oil.  It provides that essential grilled-type taste like fajitas.  Also, DO use the plate and slide method another reviewer suggests...absolutely no problems with turning them over or messiness.  One final tip: don't load up the centermost part of the quesadilla because when you cut it like a pie to eat, the tip is overweighted and makes for a messy meal with  filling falling out too easily.  Muchas gracias, Senor Cortez. Era lo mejor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAREN WANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/487729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-30T13:57:26.7Z",
                "reviewBody": "This was quick and easy to make. I don't know what the people were talking about when they said it took too long to chop everything. It was no longer than to fix a typical evening meal. I will say that I did use the pre-cooked and sliced southwestern chicken slices (I'm sure that saved quite a bit of time - other than that I followed the recipe exactly. It was soooo good - especially the pico de gallo. The grocery store didn't have any jalapeno peppers - just anaheim - still turned out excellent. My husband and I are on a low carb diet - we just used low-carb tortillas gave the kids flour tortillas and it was great. (I followed the advice of another reviewer - I sprayed olive oil in a pan placed a tortilla on the bottom placed all the ingredients on put another torilla on top sprayed it with olive oil and baked in a 350 oven for about 10 minutes and it turned out perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheila Dull",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/210506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-18T22:55:51.14Z",
                "reviewBody": "Fabulous taste - worth the chopping effort - I eat mine with sour cream on top - also I had trouble flipping and finally decided to only put filling on half the tortilla and then fold the non filled cheese covered half over the top of the filling - then I could heat each side just right - plus when I cut it to serve it didn't goo out the folded side so it was easier to cut and eat!! Awesome recipe you've got to try this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MMP8508",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/659256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-05T21:26:28.64Z",
                "reviewBody": "Pico de Gallo was great! We marinated the chicken in a chicken taco seasoning and then grilled the chicken rather than cooking on the stovetop. In addition we heated the quesadillas on the George Foreman grill instead of the stovetop.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGEL30",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/845958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T20:18:47.06Z",
                "reviewBody": "Wonderful! My husband asks for these all the time now! I added mushrooms and used mozarella cheese. Also as an alternative try baking your quesadillas in the oven on 350 for about 10 minutes instead of heating in a skillet. If you like yours crunchy broil for about 2 minutes after baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELLE ARGYLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/746042/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-23T03:22:37.42Z",
                "reviewBody": "Very easy and delicious!!!! Only thing I changed was to grill the whole chicken breast (with salt and freshly ground black pepper) and then cut it into 2 inch strips. I found that cutting 2 inch pieces from a raw chicken breast causes the pieces to \"puff\" while cooking which was a little cumbersome to place into the quesadilla. Thanks Tony for a refreshing way to eat chicken!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLUESILVERGOLD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/792541/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:33:14.047Z",
                "reviewBody": "The best quesadilla recipe on this site so far! I didn't have any fresh tomatoes so I used a can of diced tomatoes drained and also used half a 4.5 oz can of diced jalapeno peppers and due to lack of lime I used 1/2 TBLS lime juice...VERY GOOD and will remember this pico de gallo part for tacos and other dishes plus I saved on some chopping time. In addition after filling the tortillas with the cheese and chicken mix I just heated them in the oven for a few minutes (rather than heating over the stove steps). We topped them with all our favorites! Served with \"Best Spanish Rice\" on this site...great meal and will make again!! Thanks Tony!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T18:04:39.423Z",
                "reviewBody": "This recipe is just okay. First off when I think of Pico de Gallo I think of spicy and flavorful. This pico is totally missing the heat by only using one jalapeno (and this is coming from someone who doesn't like things too spicy.) If I make this again I would up it to at least 1 1/2 jalapenos. I also noticed no spices were used on the chicken. I wanted these to be tasty so a few minutes before I threw my chicken in the grill pan I sprinkled lime juice chili powder cumin garlic powder onion powder salt and pepper over them. Next time I will let the chicken marinate in it for at least a few hours. The actual quesadillas were okay but they still weren't packing the punch I was looking for. I did not cook these in the oven or on the stove but instead used my Quesadilla Maker. I served them with chips and guacamole or salsa. I'm not quite sure where the almost 5 star rating is coming from these are average quesadillas that could be improved by using a lot more seasonings. The recipe as written is a 3 and even with my adding of extra ingredients into them I still would only give them a 4.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsChmerkovskiy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3506657/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Pico de Gallo Chicken Quesadillas",
            "description": "Super tasty and super easy Tex Mex!",
            "uploadDate": "2017-02-10T17:56:35.618Z",
            "duration": "PT1M2.062S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F804ed201-b596-44dd-a5f9-02cd569204ac%2F2108ee05-d3e9-4ee4-8ef9-fdbb648971f4%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5318785154001"
        }
    }
]