[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8887/chicken-marsala/",
        "name": "Chicken Marsala",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2018%2F08%2F5107151.jpg",
            "width": 650,
            "height": 465
        },
        "datePublished": "1999-07-27T13:22:13.000Z",
        "description": "A delicious, classic chicken dish -- lightly coated chicken breasts braised with Marsala wine and mushrooms. Easy and ideal for both a quick weeknight entree AND serving to company.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "¼ cup all-purpose flour for coating",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "½ teaspoon dried oregano",
            "4  breast half, bone and skin removed (blank)s skinless, boneless chicken breast halves - pounded 1/4 inch thick",
            "4 tablespoons butter",
            "4 tablespoons olive oil",
            "1 cup sliced mushrooms",
            "½ cup Marsala wine",
            "¼ cup cooking sherry"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown.  Turn over chicken pieces, and add mushrooms. Pour in wine and sherry.  Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.546021840873635,
            "ratingCount": 5769,
            "itemReviewed": "Chicken Marsala",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "447.7 calories",
            "carbohydrateContent": "13.3 g",
            "cholesterolContent": "99 mg",
            "fatContent": "26.6 g",
            "fiberContent": "0.5 g",
            "proteinContent": "28.8 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "543 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-30T21:14:32.937Z",
                "reviewBody": "This recipe was really good. I modified it a bit. I did not use cooking cherry, I used 3/4 of a cup of marsala wine instead. I used twice the mushrooms and after I browned the chicken I removed it from the pan and cooked the mushrooms and some shrimp and them added a little heavy whipping cream and reduced it to make a marsala cream sauce and then I added the chicken back and served it over garlic and basil fettuccine. It turned out awesome. I have work in a few 5 star restaurants and had chicken and veal marsala in a lot of restaurants and this is the closest I have gotten the dish to taste myself!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ASHLEYJJONES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/548122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T00:08:28.483Z",
                "reviewBody": "oh my gosh this dinner was amazing!  Not only that, but incredibly easy. I made a few changes, as usual, and everyone -loved- the results.\r\n1- To make it easier to clean up, i put the flour, salt, pepper, and oregano in a resealable plastic bag, then added the pounded chicken and shook it up (one breast at a time) to coat. It's just easier and cleaner that way.\r\n2- When browning the chicken breasts, i added a few sliced cloves of garlic. mmm\r\n3- I doubled the sauce, probably trippled the mushrooms (the more the merrier, right?) and then thickened it with a slurry (water-cornstarch mixture) at the end so we could enjoy it over the angelhair pasta i served it on. So good.\r\n4- i added a splash of heavy cream and a splash of chicken broth to the sauce, to make it richer and creamier, like i'm used to Chicken Marsala being.\r\n\r\nas other users suggested, buy good Marsala wine. It's really not all that expensive, especially if you compare it to how much it costs to eat out at a nice italian restaurant. ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bhappe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/784908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-30T09:41:33.45Z",
                "reviewBody": "I've been using this recipe for about 5 years now and from the first time I made this, it's been nothing short of excellent.  I made it this past weekend at a dinner party for somewhere between 25-30 people and everyone loved it as does everyone I've ever made this for.  \n\nI tend to spend a little more time on prep work because I'm very picky about my chicken, and I take time to trim off as many of those little fatty pieces as possible prior to pounding it out flat.  Sometimes that one chewy bite of fat ruins a good piece of chicken for me!\n\nHere's a few things I do in addition to what the recipe says.  I mentioned I cut out any fatty pieces.  I chop up some onion and add it when I throw the mushrooms in the pan.  It doesn't 'make or break' this, but adds a nice little 'extra' when it's sauteed.  If you buy whole mushrooms and find it too tedious/time consuming to slice them with a knife ...either buy them already sliced (usually a $1.00-$2.00 more), or buy them whole and use one of those hard boiled egg slicers ...And it keeps the slicing thickness consistent.\n\nDefinitely try this recipe, you'll love it.  If it doesn't come out perfect the first time (and it will, but if you feel it didn't), don't be discouraged to try it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ASU1997",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-24T17:02:34.987Z",
                "reviewBody": "All these suggestions are very nice-if you want to splurge (on calories) and have a decadent meal. But don't miss out on the chance to try it without all the added fat. I have made this recipe many times and with a non-stick pan you can omit the butter and halve (or omit) the oil and it's still quite good. I've also made it with and without flour, and it works either way.  Also, with a thinner sauce, you can slice up some warm French bread and use that to soak up the extra sauce on your plate-yummy and you don't even need butter!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denver Dish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1993201/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T02:05:47.67Z",
                "reviewBody": "Chicken Marsala is a family favorite. This Marsala recipe is easy and delicious. The flour gives the chicken a silky coating and thickens the sauce nicely. I made only one change- I reduced the amount of oregano, a half tsp is too much in my opinion. Well done and Thank you for sharing.\r\n PS: Good quality wines (Marsala and Sherry) are vital. The previous reviewer was correct, avoid \"cooking wines\"; if they are not good enough to drink, they are not good enough to cook with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth Lombard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/229051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-26T00:49:04.717Z",
                "reviewBody": "This is a wonderful classic recipe! After reading some of the reviews I followed their advice and put the seasonings and flour in a bag to coat the chicken.  I used all marsala wine for the sauce and doubled the amount of mushrooms.  I removed the chicken from the pan while making the sauce and added a little half and half to it to make it creamy - it turned out great.  I have made this three times now and have finally got around to reviewing it. This is a definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T02:04:38.183Z",
                "reviewBody": "This is by far the best chicken marsala recipe I have ever encountered. My husband found it here two years ago and we have made it and enjoyed it often ever since. We usually double the wines using fine (sweet) Marsala wine and a dry white Sherry which leaves us extra sauce for the angel hair pasta we serve with it. We also use mushrooms of the Portabella variety. Thank you Lisa!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DDJRD1007",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/661014/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-23T00:22:13.32Z",
                "reviewBody": "I thought this was good, but I could tell just by the ingredients that it was going to need some doctoring up.  I added garlic powder, italian seasoning and lots of salt and pepper to the flour mixture. I cut back on the oil and butter- about 2 heaping tablespoons each.  Plus, I sauteed crushed garlic in the oil and butter before adding the chicken. It turned out great.  My stepdaughter loved it.  I served it with angel hair pasta and broccoli.  But I think I may add cream to it at the end, like one reviewer suggested, to make more 'gravy'. It needed more sauce for the pasta. All in all, this is great! (Edited 5/22/2010)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JeanneE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-27T17:04:57.17Z",
                "reviewBody": "My boyfriend and I LOVED this.  I made it with lots of baby portabello mushrooms, and I also threw onions and garlic in with the butter and oil before I placed the chicken in.  I also doubled the sauce like others.  I took the chicken out when it was done cooking, added corn starch and a little heavy cream to the sauce and it was just how we liked it.  I served with mashed garlic red potatoes, I think its our new favorite dinner! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsGibbs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2482337/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-23T04:34:39.653Z",
                "reviewBody": "This was good but not great. I'm terrible at flattening meat and poultry so I didn't bother. I didn't add mushrooms either as my fiance hates them. The chicken was tender and flavor pretty good but I like the marsala dishes more from my favorite Italian restaurant. My fiance was neutral on this. I doubt I'll make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CSANDST1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/115553/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Marsala",
            "description": "This amazing, company-worthy chicken dish is ready in just 30 minutes.",
            "uploadDate": "2012-06-05T23:04:19.401Z",
            "duration": "PT3M29.418S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fed1c76de-4aa6-41e2-aa67-6499a8d174f4%2Fba40b390-38ae-49f2-96ea-31f7e492e3af%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1675299521001"
        }
    }
]