[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14723/soups-stews-and-chili/soup/chicken-soup/chicken-and-dumplings/",
                    "name": "Chicken and Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8941/slow-cooker-chicken-and-dumplings/",
        "name": "Slow Cooker Chicken and Dumplings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F09%2F806223-Slow-Cooker-Chicken-and-Dumplings-photo-by-KGora1.jpg",
            "width": 2000,
            "height": 1577,
            "caption": "Slow Cooker Chicken and Dumplings"
        },
        "datePublished": "1999-06-11T15:59:38.000Z",
        "description": "This is an easy slow cooker recipe that cooks while you are at work! It is wonderful on a cold, snowy day. I have four children who are picky eaters, and they LOVE this! Enjoy!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "2 tablespoons butter",
            "2 (10.75 ounce) cans  condensed cream of chicken soup",
            "1 onion, finely diced",
            "2 (10 ounce) packages refrigerated biscuit dough, torn into pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken, butter, soup, and onion in a slow cooker, and fill with enough water to cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook for 5 to 6 hours on High. About 30 minutes before serving, place the torn biscuit dough in the slow cooker. Cook until the dough is no longer raw in the center.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes",
            "Chicken and Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Janiece Mason"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.368613881538774,
            "ratingCount": 9826,
            "itemReviewed": "Slow Cooker Chicken and Dumplings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "384.6 calories",
            "carbohydrateContent": "37 g",
            "cholesterolContent": "44.8 mg",
            "fatContent": "18 g",
            "fiberContent": "0.7 g",
            "proteinContent": "18.1 g",
            "saturatedFatContent": "5.8 g",
            "servingSize": null,
            "sodiumContent": "1244.6 mg",
            "sugarContent": "6.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-09T01:28:58.013Z",
                "reviewBody": "This recipe is AWESOME with a few modifications. I made it for my mom, husband, 3 year-old and 8 month old and it was a HUGE hit with all of us! My husband liked it better than his grandma's homemade chicken and dumplings and the gourmet chef who lives next door tasted it and thought it was an old family recipe. :) He loved it! First, you definitly need to add spices. I used cumin, parsley, poultry seasoning, seasoned salt and pepper. Next, I only used 1 can of biscuits, not 2. (I even used the reduced fat version and they tasted the same!) Thirdly, I used 1 can of cream of mushroom soup and 1 can of cream of chicken. Instead of water, I used 3/4 can of low sodium/lowfat chicken broth. At first, it seemed like way to much liquid, but eventually the biscuits soaked it all up! Fourthly, I added 2 CANS of mixed veggies (mix of carrots, peas, tiny potatoes, celery). I am not a fan of canned veggies by any means, but they tasted great in this recipe- so tender! I did add red onion, but I used only half and chopped the pieces extra small. Lastly, I cooked the biscuits for almost 3 hours for a total cooking time of 6.5 hours on high. 30 minutes is just not enough time! Another tip- if you accidentally add too much chicken broth, add a bit of sifted flour and the sauce thickens right up! I know that this recipe will be a winter tradition in our household for years to come!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Krista",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2110958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-25T21:18:08.577Z",
                "reviewBody": "Excellent! Only adjustments needed are as follows:  Use 2 cans of cream of chicken soup (as directed- don't deviate with other cream soups) cover with 1 14 oz can of chicken broth (no need to cover with water, dillutes flavor).  Put torn biscuit dough in roughly 90 minutes before ready to serve and make sure that you push them down into the liquid mixture a little, so that they get cooked on the tops, too and saturated with the chicken flavor.  I made this recipe with veggies and without, it was better WITHOUT, because the consistency was better and the veggie flavor soaked into the dumplings. 5 hours on High is MORE than enough total cooking time.  Also, leave chicken partially frozen when starting out and don't tear meat until right before adding dumplings, this keeps chicken moist.  THIS ONE'S A WINNER!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rach747",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2278853/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-11T15:58:17.793Z",
                "reviewBody": "Sorry if this get long winded, but I love dumplings. I cant believe how good this recipe is! Ive been raised on my Great Grandma's recipe from West Virgina, and was sure this would be horrible. It was really good, and I just changed a few things to make it more like Na-Na's. I used one can of cream of chicken soup and one can of cream of celery soup. I added some celery tops with leaves(removed after cooking). And just so theres no confusion, the biscuits will turn into dumpling (like noodles) NOT drop biscuits like you would expect. The only thing I would do differently would be to roll the dough out into small pancake sizes and cut that into strips. (The dumplings were just a little doughy-er than we are used to.)A little salt and pepper, and  with those changes, this would be as close to the all day version as you can get. My husband could'nt tell the difference! Really good! Thank-you Janiece.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BZBMOMOF3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/322837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T00:13:29.133Z",
                "reviewBody": "Wonderful recipe.  And for all the morons who simply make a totally different recipe by their additions, subtractions, cooking a bit longer or shorter...try posting your own recipe and stop giving 4 stars to a perfectly good recipe.  All recipes are guidelines.  We all have different tastes, so either like the recipe or leave it.  tiny.mama",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tiny.mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3989564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-23T07:25:16.577Z",
                "reviewBody": "I'm giving this 5 stars for it's easiness and flavor. It tastes close enough to homemade to be really enjoyable. I used 2 cans cream of chicken, 1 can chicken broth, and 1 & 1/2 soupcans of water to cover 2 FROZEN (helps keep it tender) chicken breasts (just 2 of us). I added the water b/c I was worried about the salt and was glad I did. Cooked on low 8-9 hours, adding 1 can biscuits 2 hrs before eating. It was very good! I'm biased b/c I was raised on the best dumplings of all time (my mom's) so of course they're not quite homemade, but hubby devoured this, and I liked it too! The chicken was SO TENDER I was very surprised! I think cooking on low and *not* cutting up the chicken into chunks before cooking is key, so the juices don't just leak out... they get stored in the breast, which u can pull apart later. This is great if you're learning to cook, in college, or just in a pinch for a great meal! Simple, yummy and comforting! Thanks for a great recipe & quick lifesaver! We barely had leftovers! Leftover chicken could easily be turned into a soup or even enchiladas the next day!\nUPDATE 8-27-07: Veggies add water, so adjust accordingly or skip water altogether. Right before adding biscuits, if liquid's too watery, mix a few TBSPNs of flour with cold water, & stir into crock pot to thicken. Also, cut biscuits into quarters. Cranking up heat to high during biscuit cooking made them cook faster and better - 1 hr instead of 2. So far Pillsbury's Grands Homestyle Buttermilk biscu",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sandalwood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1936007/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-22T16:34:13.873Z",
                "reviewBody": "This was great! I made changes as suggested by others.  I used 8 small breasts, used chicken broth instead of water, added a bit of white wine (less than 1/4 cup).  I seasoned the chicken before cooking with seasoned pepper, garlic powder, chicken seasoning and paprika. I added fresh celery along with the onion.  I added green peas & water & flour for thickening before I added the biscuits.  I flattened the biscuits and cut into strips and seasoned with salt & pepper on both sides.  Cooked an additional 2 hours on high without opening the lid and it was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teresa Corrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/teresacorrie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-03T21:50:36.96Z",
                "reviewBody": "It really irritates me that people give a recipe 5 starts and then proceed to change it so that it's not even the same recipe anymore.  If you don't like the recipe as is then don't give it a high rating - post your own separately somewhere else!  That's not only rude, but it's misleading.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dudley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4585504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-25T14:53:28.56Z",
                "reviewBody": "WONDERFUL!!  I used chicken broth instead of water and did not use the onion.  Did season with salt, pepper and a little onion powder.  I put on low in morning before going to work and let cook all day.  I shredded the chicken(had used frozen chicken breasts) and turned to high and added 2 cans of biscuits, each biscuit into 4 pieces.  Let cook 1-11/2 hrs on high.  Was absolutely the BEST!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TGonzalez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/441966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-11T17:50:08.733Z",
                "reviewBody": "I finally made this recipe today for our Sunday lunch. This was very tasty with my changes. First of all, I have the oblong slow cooker, so I used 6 small to medium sized breasts, first I poured half of a can of chicken broth in the bottom of the slow cooker, then placed the chicken that was seasoned with salt, pepper, poultry seasoning and paprika, then I placed the onions on top, then a can of cream of chicken soup, can of cream of celery soup then the remaining chicken broth. One hour and 45 minutes before serving I shredded the chicken. Then I put the store brand Texas style regular biscuits that I had quartered on top. One can of 10 count biscuits was plenty! This turned out very well and not too liquidy. This will be great to add veggies to and also for cold days. My 16 year old son ate this up like he hadn't been fed in years. Thanks for the post!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-21T02:51:00.393Z",
                "reviewBody": "Super Easy! I liked it but my husband didn't...figures",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsay Hill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2712013/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Slow Cooker Chicken and Dumplings",
            "description": "See how to make a simple, satisfying chicken dinner.",
            "uploadDate": "2012-06-13T21:30:05.912Z",
            "duration": "PT2M24.728S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ffb3a67c5-54ac-4854-a10b-adc1ca6d3b2b%2Fe745a6b3-290d-45ab-b439-652c555525af%2F208x117%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1688044293001"
        }
    }
]