[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8933/feta-chicken/",
        "name": "Feta Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F674016.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-06-08T22:27:01.000Z",
        "description": "Chicken wrapped around tomato-basil feta cheese--simple, succulent, and sensational.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves",
            "6 ounces tomato basil feta cheese, crumbled",
            "¼ cup Italian-style dry bread crumbs, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken breasts between 2 pieces of  waxed paper. Gently pound chicken with flat side of meat mallet or rolling pin until about 1/4 inch thick; remove wax paper. Place 1 ounce of feta cheese in the center of each chicken breast, and fold in half.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread 2 tablespoons bread crumbs in the bottom of the prepared baking dish. Arrange chicken in the dish, and top with remaining bread crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 25 to 30 minutes in the preheated oven, or until chicken is no longer pink and juices run clear.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Debbie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.44672131147541,
            "ratingCount": 732,
            "itemReviewed": "Feta Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "223.8 calories",
            "carbohydrateContent": "4.6 g",
            "cholesterolContent": "93.7 mg",
            "fatContent": "7.8 g",
            "fiberContent": "0.2 g",
            "proteinContent": "32 g",
            "saturatedFatContent": "4.7 g",
            "servingSize": null,
            "sodiumContent": "481 mg",
            "sugarContent": "1.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-04T19:48:15.747Z",
                "reviewBody": "Ok. Great dish. Huge hit. I used past reviews to help me out a little: For the stuffing, I used plain feta and added chopped fresh basil and sundried tomatoes. I used about a teaspoon of oil from the sundried tomato jar and mixed it together (left it crumbly, it wasn't a paste). I breaded the chicken on both sides before stuffing it, folding it over and securing with toothpicks. Drizzled olive oil while baking to brown tops of chicken. It was served with angel hair pasta with a sautee of chopped fresh plum tomatoes, onions, garlic, oregano and fresh chopped basil. Perfect side dish. We're having a dinner party next week and my boyfriend requested this on the menu. Other reviews are correct - it's easy and it definitely looks like you've fussed! FYI: Not the greatest as a microwaved leftover.....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAYLADY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/835542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-01T17:17:03.53Z",
                "reviewBody": "This was really good but I don't understand how anyone could get a good crust with just 1/4 cup of breadcrumbs. For 3 large chicken breasts I had to use 1.5 cups breadcrumbs. As others had suggested I seasoned plain breadcrumbs with a 1/2 packet of italian salad dressing mix and some garlic powder. I sprayed the chicken with cooking spray before popping it into the oven. It helped keep the crust \"crusty\" during baking. It stayed in the oven for about 35 minutes and it was soooo tender!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Betty Crocker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/403814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-12T01:05:21.95Z",
                "reviewBody": "This was very good!  Almost 5 stars.  My husband gobbled his up and was eating pieces off my plate. I had to make changes though - the recipe appeared a bit bland as is.  I took others suggestions and added chopped sundried tomatoes to the feta (I used garlic herb feta, its what I had).  After pounding the chicken, I dipped them in egg and then in a mixture of breadcrumbs/locatelli cheese for flavor.  After securing the stuffed chicken with toothpicks, I sauteed the chicken in a bit of olive oil until lightly browned (but not fully cooked).  I was then able to cover and refrigerate the dish until it was ready to go in the oven. (I love dishes that can do this - very essential with young children!) I drizzled a bit of balsamic vinagrette dressing (compliments the feta perfectly!) over each piece right before it went in the oven, and baked for around 40 min.  Results were tender, juicy, (I was worried this would be dry with no sauce, but it wasnt!) and full of flavor.  If you love feta, then you will love this dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MomSavedbyGrace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1366670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-15T20:48:25.687Z",
                "reviewBody": "I got lazy and just cut a pouch into the side of the chicken breasts and stuffed the feta in.  Turned out very well.  A very easy, quick dinner.  Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DELTAQUEEN50",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/575179/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T13:49:41.107Z",
                "reviewBody": "Yum! I followed another reviewer's advice and drizzled a tiny amount of butter over the chicken to help brown the crumbs and then gave it a quick zap under the broiler. Everyone loved this one including my two-year-old and my meat-and-potatoes husband. I served it with couscous with a little tomato and cucumber cilantro lemon juice and some of the leftover feta. It's a hit at my house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-16T12:39:45.623Z",
                "reviewBody": "As described this recipe is easy to prepare quick reasonably lo-cal and tasty. That said it's easy to improve on. Here's what I like to do -- Filling:It's better with good feta fresh chopped basil and chopped oil packed sun-dried tomatoes. Instead of folding roll the filling up as for Chicken Kiev which it resembles. Dust with flour roll in egg then in Japanese Panko bread crumbs. Lightly brown in butter and oil in an oven proof saute pan then finish in a 350 degree oven. This version is somewhat more caloric but much tastier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ABOEHMER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/631898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-02T23:47:13.123Z",
                "reviewBody": "This was just awesome! I don't cook chicken in the oven very often because I always seem to overcook it. But already having a side dish I needed something to go with it. I used boneless skinless chicken breasts only cooking two for 20 min at 350. I used the tomato basil feta but added some fresh chopped tomatoes as well. I took the advice of others- when it was almost done I drizzled melted margarine over the bread crumbs added a little parmesan cheese and browned it for a few minutes. I also used someone else's advice and marinated the chicken in white wine and garlic for a few hours prior to making. It came out perfect! My fiancee loved it as well. As my side dish I used another recipe found here called Au Gratin Potatoes but really it's a hashed brown casserole. Together the two were magnificent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICKAPOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/791279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-04T19:48:44.373Z",
                "reviewBody": "I didn't have tomato-basil feta on hand, just plain feta, sundried tomatoes, and basil.  I combined 3 oz. feta, 1 oz. tomatoes and tsp. dried basil.  I blended this with a fork.  This was for 4 chicken breast halves.  It was awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KWANTUM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/664776/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-27T18:43:06.077Z",
                "reviewBody": "A nice dish to serve guests. I drizzled melted butter over the chicken before I put it in the oven as someone suggested. This is a versatile recipe. You could stuff the chicken with sauteed mushrooms and shredded swiss cheese etc. You can let your imagination go wild on this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            }
        ]
    }
]