[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16222/meat-and-poultry/chicken/chicken-breasts/broiled/",
                    "name": "Broiled",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9024/broiled-chicken-with-roasted-garlic-sauce/",
        "name": "Broiled Chicken with Roasted Garlic Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F820713.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "1999-05-09T17:02:21.000Z",
        "description": "This is a fairly low-fat cream sauce. Roasting the garlic makes it sweet and slightly nutty - don't be afraid to use the whole head! Serve with hot cooked rice or pasta.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 medium head garlic",
            "1 tablespoon olive oil",
            "4 skinless, boneless chicken breasts",
            "½ cup white wine",
            "2 tablespoons butter",
            "1 cup milk",
            "1 tablespoon all-purpose flour",
            "¼ cup grated Parmesan cheese",
            "1 tablespoon chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice the top of the head of garlic, just enough to remove paper and expose the tops of the cloves. Drizzle with olive oil and roast in preheated oven, either in a clay garlic roaster or wrapped in aluminum foil. Roast for 20 minutes or until cloves are soft and slip from skins when pushed. Change oven setting to broil (375 degrees F, 190 degrees C). Let garlic cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To prepare chicken, place in a 9x13 inch baking dish and splash both sides with white wine. Broil for 25 minutes or until chicken is cooked through and juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, place butter or margarine and milk in a large skillet and heat over medium heat until warm. Stir in the flour and cheese. Stir over medium heat until sauce begins to thicken. Slip cooled garlic cloves from skin and add to the sauce (if desired, mince first). Add chopped parsley. Bring nearly to a boil; reduce heat and stir to control thickening. If desired, pour sauce over cooked rice or pasta and top with broiled chicken. Enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Broiled"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kara Laskowski"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.211111111111111,
            "ratingCount": 90,
            "itemReviewed": "Broiled Chicken with Roasted Garlic Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "316.5 calories",
            "carbohydrateContent": "10.1 g",
            "cholesterolContent": "93 mg",
            "fatContent": "13.3 g",
            "fiberContent": "0.4 g",
            "proteinContent": "32.4 g",
            "saturatedFatContent": "6.2 g",
            "servingSize": null,
            "sodiumContent": "223.6 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-14T15:31:40.263Z",
                "reviewBody": "As written I think it would need a little bit more zing to make it sing. I had to make some changes based on ingredients on hand and w/that it was one of the best dishes I have ever prepared. I only hope I can remember what I did for next time. It takes longer than 20 minutes to roast garlic to make it golden brown. I have a garlic roaster and it took double time. Only had legs so threw those in oven w/the white wine and s/p Old Bay. Covered and baked while the garlic was roasting. Doubled the amt. of cheese and shredded both parm. and romano. Sauteed onions in 1 tbsp. butter 1tbsp. olive oil and added a couple of chopped romas tsp fine herbs and in lieu of 1 cup milk used the wine from the chicken w/milk to make 1 cup. Wine I used was sweet so it made the sauce too sweet so squeezed half a lemon and about 1/2 cup sour cream. Made a flour slurry using some of the hot wine liquid and added to mixture to thicken. The house smells wonderful and I wish it were not so fattening because I could eat the whole thing. Serving over linguine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-18T04:12:57.723Z",
                "reviewBody": "First off I will say that that method of cooking chicken is fabulous. It came out so tender you could barely tell that you were eating a piece of chicken. I changed up the sauce quite a bit. I suspected that it would be bland even with the garlic so I sauteed 2 shallots and some crimini mushrooms in butter and set it aside just in case. When I made the sauce I added the flour before the milk in order to make a roux so the flour wouldn't be chunky. Then I used 1/2 cup half-and-half and 1/2 cup nonfat milk. I also used the whole head of garlic. The sauce was still incredibly bland. I added more parmesan threw in some pecorino romano cheese the shallot/mushroom mixture and some salt and pepper. I also added a little bit of the wine from the cooked chicken. It came out pretty good. I'd make it again but probably only once every few months.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Brynne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2155328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-09T02:08:49.87Z",
                "reviewBody": "After reading all of the reviews I decided that I'd have to do something to add some flavor to this dish. So I cut up the chicken into bite size pieces and marinated in white cooking wine and a little soy sauce along with some salt and pepper. After about 20 minutes I added a few tablespoons of flour to the chicken pieces and mixed it up. I then sauteed the chicken pieces on a high heat until cooked. Next I sauteed some green onions and matsutake mushrooms in a separate pan with a tbsp. of olive oil and a tbsp. of butter then added the tbsp. of flour a dash or two of salt 1/2 cup of skim milk a 1/2 cup of half and half and the roasted garlic cloves. Before the sauce came to a boil it was thickened just right - be sure to make the sauce on a really low heat so that it does not come to a boil otherwise it will turn out too thick. Lastly I spooned the sauce mixture over the chicken and it was ready to eat. In the end I think it turned out pretty good a little time consuming so not something I'll make on a weeknight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1318157/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-15T13:13:08.453Z",
                "reviewBody": "Well nobody else has mentioned this problem so I guess I did something wrong: I could not get the flour to blend into the milk and butter. It started off as big thick lumps and though I stirred and stirred it made the sauce grainy. I should have followed my instincts and made a roux then added the milk bit by bit. The end result was ok but nothing outstanding - I added more cheese because it was rather bland - and certainly not worth the unexpected effort. I won't be making this again. Thanks anyway. (PS I roasted my garlic for just under an hour)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-22T22:15:43.28Z",
                "reviewBody": "This was delicious! I made quite a few changes though... to start I did not broil the chicken in white wine... I was afraid that the alcohol would dry the chicken out by itself so I just whisked some onion powder oregano italian seasoning parsley and some lemon juice into olice oil and generously brushed the chicken breasts before putting them in the oven. I turned them over once during cooktime and broiled for about 22 minutes. I made the sauce by first making a roux... I know that the recipe called for something different but I hate the taste of uncooked flour in a sauce. Once the flour was a little browned I slowly added the milk whisking constantly. I threw in double the cheese and I used shredded rather than grated. Once the cheese was melted I added the garlic. I roasted two small heads of garlic... it was perfect! When well combined I added a touch of salt some fresh parsley and a TON of black pepper (I love lots of cracked black pepper in a white sauce!!). I served it over some whole grain mix (brown rice bulgur and cracked red wheat) and it really was a DELICIOUS meal! My house smelled amazing and I could have just eaten the sauce! Thank you so much for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christie Biggers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/807903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-17T20:19:38.077Z",
                "reviewBody": "This was an excellent meal. Although even though it says dont be afraid to use the whole head of garlic I didnt. I only used about half in the recipe. It had plenty of flavor of garlic and I love garlic. The whole head may have been to overpowering. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NICBUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/771631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T23:16:01.683Z",
                "reviewBody": "Sauce was excellent chicken was too dry... will definitely play around with the chicken as the sauce made the meal",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Dunn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2743290/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-17T20:20:59.98Z",
                "reviewBody": "Didn't make the chicken recipe but used the sauce recipe on salmon over rice. Great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FOCUS55",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/580923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-22T02:19:37.057Z",
                "reviewBody": "Hello...this was delicious! I actually only made the sauce and put it in a baked pasta dish. I was looking for something very garlic based because we LOVE garlic! I had to make changes based on what I had and because we are a gluten free family. I can't wait to make this again and neither can my husband! Thanks for a wonderful recipe!!! Changes: 2 heads of garlic & roasted it for 40 minutes 1/4 cup of Parm cheese and 1/4 cup Asiago cheese (we love our cheese too) rice flour & stirred in some sauteed peppers and onions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Misty Darnell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3452053/"
                }
            }
        ]
    }
]