[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16232/meat-and-poultry/turkey/breasts/",
                    "name": "Breasts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9214/cranberry-stuffed-turkey-breasts/",
        "name": "Cranberry Stuffed Turkey Breasts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F742515.jpg",
            "width": 1830,
            "height": 1441
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "I made these once for a holiday dinner party, and they were such a hit that I started making them for Thanksgiving instead of a whole turkey.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 (12 ounce) package herb-seasoned bread stuffing mix",
            "2 skinless boneless turkey breasts",
            "1 cup chopped pecans",
            "2 (8 ounce) packages dried, sweetened cranberries",
            "2 tablespoons olive oil",
            "6 lettuce leaves",
            "½ cup pecan halves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Prepare stuffing mix according to package directions. Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a sharp knife, butterfly breasts open to lay flat. Place each breast between two sheets of waxed paper, and flatten with a mallet. Spread the prepared stuffing to within 1/4 inch of the edge of each breast. Sprinkle each one with chopped pecans and dried cranberries, reserving some of the cranberries for garnish. Roll up tightly in a jellyroll style, starting with the long end. Tuck in ends, and tie in sections with string, about 4 sections around the middle and one running the length of the roll to secure the ends.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large cast iron skillet over medium-high heat. Carefully brown rolls on all sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place skillet in oven, uncovered. Bake in a preheated 350 degrees F (175 degrees C) oven for 1 hour, or until the internal temperature is at 170 degrees F (78 degrees C) when taken with a meat thermometer. Do not let these get overly dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Allow rolls to set for 15 minutes before removing string, and slicing into 1/2 to 3/4 inch circles. Leave one roll whole, and slice the other for presentation. Stuffing will be spiraled into meat. Present on your prettiest platter on a bed of curly lettuce, and garnish by sprinkling with the remaining 1/2 cup pecan halves and the reserved dried cranberries.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Breasts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Esther Nelson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.48,
            "ratingCount": 150,
            "itemReviewed": "Cranberry Stuffed Turkey Breasts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "369.2 calories",
            "carbohydrateContent": "28 g",
            "cholesterolContent": "34.4 mg",
            "fatContent": "18.4 g",
            "fiberContent": "2.7 g",
            "proteinContent": "23.2 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "857.5 mg",
            "sugarContent": "3.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-30T01:12:09.56Z",
                "reviewBody": "I added a little celery and onion sauteed in butter to the packaged dressing and a 1/2 tsp of poulty seasoning for each package of stuffing.  After rolling the turkey breasts as described, I did NOT brown them in oil. This toughens the skin, particularly if the breasts are still cold.  I put them direcly into a dish with enough melted butter to cover the bottom to about 1/4\".  I then dipped 3 thin layers of cheescloth into butter and draped them over the turkey breasts, completely covering the breats.  I had 6 large breasts in a flat 3 quart casserole dish and they baked to perfection in 50 minutes. These were so tender; not a sign of dryness. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "adelle1016",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2683673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-23T14:58:38.5Z",
                "reviewBody": "This recipe as great!  I was worried about the turkey getting to dry so I put a thin layer of butter on the flatten turkey breast, salt and peppered it and then layered stuffing, pecans and cranberries.  It doesn't mention to salt and pepper that maybe the reason why some reviews said that it didn't have much taste to the turkey.  The next day we made sandwiches with the turkey, added cranberry sauce, mayo, lettuce and it was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUEANNLAWSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/978966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T13:32:38.163Z",
                "reviewBody": "Very good with chicken too!\r\nVery tasty. \r\nKeep turkey/chicken rolls warm in oven while browning all of the breasts.\r\nIf the rolls dry out pour some wine over them and leave in oven for another 5 minutes.\r\nDeglaze the pan from the oven for gravey.\r\nMake extra stuffing because it's really good and place in pan in oven to warm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ALISONWANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/36595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-31T00:20:52.037Z",
                "reviewBody": "Alternate preparation method: cook box of stuffing as directed, then i took 6 boneless, skinless turkey breasts and 1) laid them between two sheets of wax paper and used a canned vegetable to roll/beat them thin  2) brushed both sides with melted butter with thyme & rosemary in it 3) spread 1-2 tbsp of stuffing on each breast (mash it down thin with fingers, dont leave loose & thick) 4) spread cranberry chutney very thin on top of the stuffing (can use cranberry sauce if thats all you have, just mix in a few craisins or other dried cranberries to the sauce to give it texture) 5) rolled up tightly, secured each one with 2 or 3 toothpicks 6) drizzled 2 tbsp melted butter in bottom of small casserole dish 7) baked 15 mins at 375 covered, then 30 mins uncovered. Served with mashed potatoes and brown gravy and the rest of the stuffing! Very Good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cherry Bomb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6019781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-25T12:56:00.913Z",
                "reviewBody": "I try to make a recipe the way it's written the first time, and in doing so, this was a bit of a disappointment.  By first browning the turkey, the skin turned out tough, and it was difficult to slice.  There was no basting liquid to keep it moist.  I took it out of the oven at 45 minutes, and it was totally overcooked.  I like the combination of flavors, so I'll try this again with modifications.  I will not brown it on the stove top, but will rub the turkey breast with some butter.   I will add some broth and a little white wine to the pan, cook it at a higher temperature initially to brown, cover it with foil, then lower the temperature, baste it often, and start checking for doneness at 25-30 minutes.  This is a good recipe, but IMO, the cooking instructions are not correct.  Served this for Thanksgiving, and although it didn't turn out as expected, the presentation is very nice, and it was not a total failure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-28T00:17:22.06Z",
                "reviewBody": "I've made this recipe 2 years in a row and must say that it's not only tasty but has a very nice presentation. I would suggest making more of the stuffing/pecan/cranberry mixture and serving it with it. I can dry out while cooking if you're not careful. Covering the ends with aluminum foil near the end of the cooking time may help this. I highly recommend this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teri Blackburn Pell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/geekette/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-25T04:37:55.687Z",
                "reviewBody": "Not as complicated as it sounds. I did seasoned the breasts with salt, powder garlic and cumin. Not pepper because it burns the meat if it is put way ahead of cooking time. I put the breasts in the refrigerator for a day, prepare the stuffing on the cooking day, before putting the rolled breasts  in skillet I  seasoned them with a bit more salt and pepper. When it was done I used warm turkey broth and sprinkle over them. It turned out perfect with the cranberries and pecans. I would definetly make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATTY_B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/583493/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-28T02:16:54.203Z",
                "reviewBody": "I made this today for thanks giving. The cranberries were soft and tart and delicious. Next time I will put more in there. I didn't have string so I used unflavored unwaxed dental floss. That worked fine. My turkey was definitely cooked all the way through but it never registered a temperature of 170. I think this is because it was hard to measure just the turkey and not the stuffing. I let it cook for ten extra minutes just to be sure but an hour would have been perfectly fine. Finally for decorating I didn't bother with the lettuce leaves. I used cranberries pecan halves and some fresh herbs and it was beautiful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Hundley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rachelhundley/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-15T13:18:56.907Z",
                "reviewBody": "Well no fault of the recipe - more like my nonexistent \"butterflying\" skills - but while my stuffed turkey rolls were pretty ugly they tasted good! I did make a couple changes - made my own stuffing and added some sauteed onions celery and herbs; poured a little turkey stock in the bottom of the baking dish to help keep moist (ended up making nice drippings for a gravy base) and I put a couple little pats of butter on top of each turkey roll for flavor color and additional moisture and sprinkled with some thyme. Not so sure I liked the pecans in this but it was overall a pretty tasty meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            }
        ]
    }
]