[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9247/christmas-breakfast-sausage-casserole/",
        "name": "Christmas Breakfast Sausage Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7274342.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1998-12-05T15:37:33.000Z",
        "description": "My mom has always made this for us on Christmas morning, and since we only have it once a year it makes it even more good. It is so delicious, and everyone enjoys it! When I double the recipe I use 1 pound regular sausage and 1 pound sage sausage.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT9H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound ground pork sausage",
            "1 teaspoon mustard powder",
            "½ teaspoon salt",
            "4 eggs, beaten",
            "2 cups milk",
            "6 slices white bread, toasted and cut into cubes",
            "8 ounces mild Cheddar cheese, shredded"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Crumble sausage into a medium skillet. Cook over medium heat until evenly brown; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together mustard powder, salt, eggs and milk. Add the sausage, bread cubes, and cheese, and stir to coat evenly.  Pour into a greased 9x13 inch baking dish. Cover, and chill in the refrigerator for 8 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and bake 45 to 60 minutes. Uncover, and reduce temperature to 325 degrees F (165 degrees C). Bake for an additional 30 minutes, or until set.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "M.K. Meredith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.58574091332712,
            "ratingCount": 2146,
            "itemReviewed": "Christmas Breakfast Sausage Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "376.8 calories",
            "carbohydrateContent": "13.4 g",
            "cholesterolContent": "160.1 mg",
            "fatContent": "26 g",
            "fiberContent": "0.5 g",
            "proteinContent": "21.5 g",
            "saturatedFatContent": "11.9 g",
            "servingSize": null,
            "sodiumContent": "1015.4 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-21T20:37:59.77Z",
                "reviewBody": "This is a good basic recipe but I think it needs a little revamp. Here is the revamping I did....\n\nI used 1 cup of Half and Half instead of 2 cups of milk (too soggy with that much milk)\n\nI used 6 eggs instead of 4 for a richer egg texture.\n\nI added 3 tbsns green onions to the milk/egg mixture.\n\nI used 6 slices of THICK texas toast and covered the bottom of the pan with it. I then put the cooked sausage over that. (Bob Evans Spicy Hot Sausage from Kroger) I then put 1 cup of shredded sharp cheddar cheese over that. Then I pour the egg/half and half/green onion mixture over that.\n\nI bake after letting it sit in the fridge for 8-12 hours at 350 degree for 25 minutes.\n\nI guess I should post a new recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Leah Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/438859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-02T05:07:46.237Z",
                "reviewBody": "This is the BEST breakfast casserole ever!  I have made it several times for Christmas. This past weekend was my daughters high school prom and our house ended up being the \"after party\".  I put out a spread for them including this casserole.  The kids raved about it! My daughters bf asked me when I was going to make it again! So...I will be making it again this weekend! LOL! I do make a few changes that I have picked up on here. I use the Jimmy Dean Maple Sausage, 6 eggs (I think I am going to try 8 next time), 1 1/2 Cups milk (I think I am going to try the full 2 Cups next time), I don't think I am going to use additional salt next time b/c I feel it is salty enough from the sausage and cheese. I use the mild cheddar, but I use 1 box of Marie Callendar Cheddar/Garlic croutons instead of the bread and that adds to the cheesy flavor. And I add a little bit more of the dried mustard. It is an excellent breakfast casserole!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/744856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-25T07:40:55.867Z",
                "reviewBody": "This dish is absolutely delicious!  I doubled the recipe using 3 bags of Marie Callendar's Cheese & Garlic Croutons instead of plain bread, 20 eggs, 1/2 cup sliced scallions, 1/2 cup chopped onion, 6 cups of milk, 2 teaspoons mustard powder, 1 teaspoon black pepper, 2 teaspoons of salt and 1 pound each of Monterrey Jack and Mild Cheddar Cheese.  I put shredded cheese on the top of it in the last 15 minutes of baking.  I made this recipe for a Holiday Brunch at my place of employment and it won a prize for \"Best Breakfast Casserole\"!  Thank  you M.K. Meredith for this fantastic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STOPPIN001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/813222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-31T14:36:02.497Z",
                "reviewBody": "So tasty, so easy, so great!!  I've made this three times (for a houseful of company each time), and it's always a hit. (It's also really nice to be able to visit in the morning instead of standing at the stove.) These are generous servings, and thank goodness - everyone goes for seconds!  I've tried the half regular/half sage sausage combo as suggested, but my favorite is to just use Jimmy Dean Maple flavor sausage - HEAVENLY. This is my go-to recipe to impress for breakfast or brunch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T03:09:41.983Z",
                "reviewBody": "This was really pretty good.  I am not a big egg person but this I would eat again.  \r\n\r\nI'd bought the wrong type of sausage... so I figured I'd just squeeze it out of the casing to brown, then when I went to do that I found out it was PRECOOKED!  Not a problem at all.  I just popped the precooked (beef) sausage into my Ultimate Chopper and gave it a few zaps, saved a ton of time and mess!  \r\n\r\nI had this thing whipped together in just a few minutes.  I did increase the bread to 8 slices, cheese to 3 cups and reduced the milk to 1 cup...didn't want to take any chances of anything being \"runny or slimey\".  Added a chopped onion according to other suggestions.  The 8 slices of bread may have been a bit much for some... it was pretty thick but I think I'll stick with it as it turned out so well.  Nothing worse than slimey eggs!  \r\n\r\nOh and I had put this in my lazagna pan, so cut the servings the way I would a lazagna.  The left overs I wrapped in the Press-n-Seal wrap in single serving sizes and put them in the freezer.  The next morning we just popped one in the microwave for 1 minute, turned out just as good as the first day.  Would be good to do a pan of this up and cut the whole thing up in single serve slices to freeze for those need a good breakfast quick mornings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny Mazock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1582457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-31T14:36:38.67Z",
                "reviewBody": "This is wonderful on a cold December morning especially at Christmas.  The bread does not have to be toasted or cut up. You can just cut the crusts off and make one layer on the bottom of the baking dish and pour the egg mixture over it. I sometimes saute chopped onion with the sausage, also have added mushrooms.  I always serve with side of picante and sour cream, but not necessary.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3529/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-28T15:25:52.42Z",
                "reviewBody": "I prepared this Christmas eve with a few changes from others. I made this with 6 eggs, maple sausage. I used 1/2 cup croutons & 6 slices of toated bread. Added about 2 teaspoons green chili's for enough zip & not a lot of hot so my children would eat this. I agree 9x13 makes this to thin. I used a 11x7 & will use a 8x8 or 10x10 next year. This was Wonderful, A NO fail recipe. Pop in the oven while family is opening presents or make this for anytime of year. To good to only make once a year!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUSTJEN33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/126242/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-28T15:36:07.33Z",
                "reviewBody": "I have made this for several years now and update my review accordingly.  I used to make various changes, but honestly, the original recipe is the best.  I doubled the recipe, and as the author suggested, I used 1 lb breakfast sausage and 1 lb sage.  Didn't have mustard powder so used yellow mustard.  I also used whole milk and added hredded potatoes.  By accident, I didn't toast the bread.  I am so glad I didn't because this turned out this was the most moist and fluffy this casserole has ever been.  If you fear this will be dry, do NOT toast the bread first.  I love this recipe and it is a Christmas morning tradition for us now.  And, don't you just love that people \"tweak\" recipes until they are unrecognizable and then give the original recipe low stars?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chynook73",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751584/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T18:07:47.78Z",
                "reviewBody": "A huge hit on Christmas morning, and special brunches at our house! Very hearty, and works just as well with 12 ounces of the reduced fat sausage in place of the pound of regular sausage. Be sure to0 LET IT SET OVERNIGHT!!!! Once we were pressed for time and we just mixed it and popped it in the oven, and it was mush! Follow the directions and you will love this!  Try extra sharp cheddar, too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/498754/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-14T17:46:12.600Z",
                "reviewBody": "Good recipe.  One addition I tried last weekend was to use hash browns instead of bread.  Really folks, it was amazing and took it to the next level.  Give it a try!  Otherwise, good recipe as is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "neilgottlieb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8037587/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Christmas Breakfast Sausage Casserole",
            "description": "Make this special casserole for a Christmas morning treat.",
            "uploadDate": "2012-05-08T22:26:40.284Z",
            "duration": "PT3M54.693S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd93effe2-13de-4615-9b80-dd606865bb6f%2Fa040fde2-94d3-4873-9cb5-689be35830d1%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1628728270001"
        }
    }
]