[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
                    "name": "Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9381/prime-rib/",
        "name": "Prime Rib",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4564891.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "1998-12-16T22:12:51.000Z",
        "description": "Prime rib roast the easy way. Tastes delicious!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "1 (10 pound) rib roast",
        "recipeIngredient": [
            "1 (10 pound) prime rib roast",
            "6 cloves garlic, sliced",
            "salt and ground black pepper to taste",
            "½ cup Dijon mustard"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 500 degrees F (260 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make slits all over the roast by pricking with a small knife. Insert slivers of sliced garlic. Season the roast with salt and pepper, then spread generously with mustard. Place on a rack in a roasting pan, and cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast for 60 minutes in the preheated oven. Turn off oven. Leave oven closed, and do not peek for 90 minutes. The internal temperature of the meat should be at least 140 degrees F (60 degrees C) for medium-rare, or 155 degrees F (68 degrees C) for medium.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dale"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.530232558139535,
            "ratingCount": 215,
            "itemReviewed": "Prime Rib",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "443.4 calories",
            "carbohydrateContent": "2.6 g",
            "cholesterolContent": "132.5 mg",
            "fatContent": "25.7 g",
            "fiberContent": null,
            "proteinContent": "46.5 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "364.6 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-03T19:53:17.77Z",
                "reviewBody": "I've cooked my prime rib like this for years ... always delicious!!  One rule of thumb - if you're using a smaller roast - cook at 500F for 5 minutes PER POUND of meat (so a 5lb roast would cook for 25 minutes) and your roast will turn out perfect every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BJKLASELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/196129/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-23T00:11:45.78Z",
                "reviewBody": "Although this would \"seem\" simple enough, I sit here, fuming, because the lack of experience on this board continues to befuddle me.\n\nI purchased a 3.5lb boneless rib roast.  I let this roast sit for 30+ mins, to achieve room temp.  Following this, I rubbed this roast with the mcormicks steak rub, followed by smothering with dijon mustard.  Because I wasn't 100% sure HOW to cook this, I placed it in a 500 degree oven for 17mins, covered, following the 5mins/lb @ 500 rule.  At 17 mins, the roast hadn't even BEGUN to cook.  Uncovered, and returned to the same oven.  Mild smoke ensued.  Retrieved from oven after 11mins, and let rest to continue to cook. (Approx 15mins)  Began to cut roast, and noticed that, although it \"appeared\" cooked, the inside was still very very rare.  It is now BACK IN THE OVEN, over 1.5 hours after the original attempt.\n\nPeople, please, if you have a convec oven, or notice something particular in your cooking, please, please, please post it in your reviews.  I cannot give this recipe a decent review, as the instructions (5mins/lb@500 degrees) are, like I thought, simply untrue.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "simplicity123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2128832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T15:15:56.507Z",
                "reviewBody": "Loved the garlic and mustard taste. However, as one reviewer noted, this is very easy to overcook, which I did the first time. For those of you who prefer prime rib medium rare or less......I suggest: Preheat to 400, Roast for 1 hour in OPEN pan, in center of oven. Shut off for 2 hours (Also, DO NOT open door) Turn oven back on to 375 for 30-35 minutes. Tighly cover with foil and \"rest\" meat for 15 minutes before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GUYCHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T12:37:56.07Z",
                "reviewBody": "I used a 5 lb roast.  I cooked it at 400 for 60 minutes and then let it sit for 45. It was a little bit more than medium.  I would probably cook for 45 and let it sit for 45 next time.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAMESCARTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/420956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-22T06:25:49.5Z",
                "reviewBody": "I loved this recipe.  I do not understand how some people could have gotten anything but exceptional results with this method.  Now I used a Whopper of a Prime Rib…an 18-pounder.  I compensated for the size by using the 5 minute per # rule and it worked out superbly.  I stuffed tons of garlic cloves into the roast and also used Montreal Seasoning as well as a little extra Lawry’s Seasoned salt because I like it so much.  I cooked my roast at 500 for 90 minutes and let stay in there for an additional 90 minutes after turning off the oven.  Definitely will use this recipe again and I am looking forward to tweaking it here and there to get different flavors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tommy Chicago",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1673928/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T23:01:21.2Z",
                "reviewBody": "I made this for the first time on Christmas Eve 2002.  I put it in the preheated oven just as we left home for Xmas Eve services and man did the house smell amazing when we returned home.  Instead of salt and pepper, I use 'Montreal Steak Seasoning' which you can find at Costco.  I believe McCormicks makes it so you might find it in your local grocery store where the spices are.  Be sure to cover with foil before placing in oven.  Otherwise it gets smokey and can set off your smoke alarms...I speak from experience as I have made this at least 6 times in the past 6 months...usually when we entertain.  It gets rave reviews.  I flew some of my husbands friends in from New York for his 40th birthday in March...every single 'man' wanted to go home with this recipe to have their spouse/significant other make it.  It really is SO simple.  Also, if you have a local Meat store/butcher shop, get the rib from them, it's only about $1 more per pound and really does make a difference.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDSBOX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/377155/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-25T03:03:41.41Z",
                "reviewBody": "This recipe is absolutely awesome!  For a previous reviewer, the reason your roast came out raw was because you did not let your roast come to room temperature before cooking.  You need to let it sit out for atleast 1/2 hour before cooking, and you should do this for any roast, but especially for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/459689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-18T06:19:58.107Z",
                "reviewBody": "Like many others I followed the recipe and ended up with barely cooked beef that wasn't particularly flavorful or tender. I know this receipe does work for some folks and their ovens but not for me and I wouldn't recommend anyone to take a chance blowing a 50 piece of meat and a holiday meal on this one! I get far superior results with the method whereby you pack your roast in a bed of Kosher salt cook high heat for 20-30 minutes then drop down to 325 degrees. Always tender and flavorful and no surprises when it's time to eat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "PACRN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/867582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-27T05:15:00.857Z",
                "reviewBody": "\r\nMy family loves this recipe.  I do recomend adjusting the temperature for a smaller/larger roast to 500 degrees for 5 min/lb.  Ex. 5 lb roast is 25 min at 500 degrees.  Also make sure your roast is room temp to start, and, make sure you don't have an old oven that might leak heat to fast or this recipe won't work for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NANFAIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/956350/"
                }
            }
        ]
    }
]