[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15057/desserts/cookies/butter-cookies/",
                    "name": "Butter Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/855/desserts/cookies/butter-cookies/shortbread-cookies/",
                    "name": "Shortbread Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9516/whipped-shortbread-cookies/",
        "name": "Whipped Shortbread Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F129817.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-01-18T15:13:01.000Z",
        "description": "A festive melt in your mouth cookie, and very easy to make.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "1 ½ cups all-purpose flour",
            "½ cup confectioners' sugar",
            "¼ cup red maraschino cherries, quartered",
            "¼ cup green maraschino cherries, quartered"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine butter, flour, and confectioners' sugar. With an electric mixer, beat for 10 minutes, until light and fluffy. Spoon onto cookie sheets, spacing cookies 2 inches apart. Place a piece of maraschino cherry onto the middle of each cookie, alternating between red and green.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 17 minutes in the preheated oven, or until the bottoms of the cookies are lightly browned. Remove from oven, and let cool on cookie sheet for 5 minutes, then transfer cookies on to wire rack to cool. Store in an airtight container, separating each layer with waxed paper.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Butter Cookie Recipes",
            "Shortbread Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "William Anatooskin"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.358974358974359,
            "ratingCount": 624,
            "itemReviewed": "Whipped Shortbread Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "74.8 calories",
            "carbohydrateContent": "6.8 g",
            "cholesterolContent": "13.6 mg",
            "fatContent": "5.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.6 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "36.5 mg",
            "sugarContent": "2.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-06-13T18:44:54.013Z",
                "reviewBody": "I have found that there are 2 secrets to this recipe that have to be followed or disaster strikes as so many have noted.  First, it has to be BUTTER... and nothing but butter.  Margarine cannot be substituted for butter. :)  The second is the beating time.  Personally I abide by the following method: Beat butter by itself for 5 mins.  Add icing sugar and beat another 5 mins.  add flour in 3 equal portions (1/2 C at a time) beating for 2 minutes after additions 1 & 2 and then 10 mins after the last addition.  So thats 14 more minutes than this author says but thats what works for me every time!  As well I bake at 300F for 5-7 mins.  These are absolutely fabulous cookies... they usually never make it to the serving plate! Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kathleen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1239530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-23T01:26:52.547Z",
                "reviewBody": "I make shortbread frequently, and I will say that these cookies are definitely -not- shortbread cookies.  They taste like shortbread, but the butter to flour ratio leans on the butter side, they act much more like a drop cookie than a shortbread. If you're planning to make festive prints or patterns with your press or cutters, try a different recipe.\n\nThey are a good, no fuss alternative to traditional shortbread.\n\nMy experience with the procedure:\nThe dough forms crumbles at the beginning like shortbread.  The color lightens and it becomes more \"fluid\" when enough air has been introduced.  Just keep whipping, you'll be hard pressed to hurt them.  Slow/stop your mixer every minute or so and scrape down the bowl with a spatula to make sure the air-introduction is relatively uniform.  When it's done, it will be about the consistency of a nice buttercream frosting.  You can get fancy with your piping tools instead of cutters or a press.\n\nShortbread cookies, in my experience, are always a little delicate.  I've made big ones before and you always get a few breaks, but there are generally enough people around the house to dispose of them.  \n\nSomeone mentioned the \"puffy\" cookies in the picture.  I think those are either a different recipe, or the person who made them tweaked this recipe by added flour to bring the ratio closer to traditional shortbread (generally 3-4 cups flour per cup of butter).  I don't think this recipe cannot produce cookies like that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michael Lowery",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2176297/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-04T20:18:53.86Z",
                "reviewBody": "Wow. When other reviewers said \"melt in your mouth\", they weren't kidding. These little buttery gems really DO melt in your mouth...almost disintegrate. The flavor is wonderful, but a warning: they are VERY delicate. I followed the recipe to a tee, but baked them for about 14 min (which was perfect for my oven), used parchment paper (helped with easy removal), and added chocolate chips to half the batch. Definitely wouldn't recommend traveling with these cookies, but they'd be great with tea or milk! *EDIT* I made these cookies again and again, and after a lot of experimenting I found that, in order to make it look like the picture, you have to add an extra 1/2 to 3/4 c. of flour to your mix (still beating it in 1/2 c. per 2 min intervals). I tried it first with 3/4 c., but they were a little drier than I would have preferred. I believe a 1/2 c. extra will give just the right consistency with them still keeping their shape. Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2131690/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-15T18:49:49.297Z",
                "reviewBody": "The cookies are amazing! But I do tweak the recipe by adding 1 tsp pure vanilla extract and baking on parchment paper at 325 for 9 minutes (my oven runs a bit hot). Be sure to dry the cherries between paper towels or the color will bleed into the cookies. Yummy topped with a Hershey's Kiss or Hug or a dollop of apricot or raspberry jam as well. These are easy crowd pleasers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1235530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T21:15:51.527Z",
                "reviewBody": "After reading all the other ratings and some trial and error I finally succeeded! The cookies are great! I whipped the butter on high speed in my kithcen aid seperatly first. Then I slowly added the dry ingredients and whipped them again on high speed. I don't think it's possible to over whip them... The first batch I cooked for 10 minutes(after reading the reviews) but the cookies just fell apart. So I cooked the next batch until the edges began to turn a slight golden color. Yummy! I drizzled milk chocolate over them once they cooled. Great Recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melinda Steele StCyr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1636160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-24T01:29:50.827Z",
                "reviewBody": "Oh, yummy!  \n\nI added about 1/4 cup more confectioner's sugar -and- a teaspoon of vanilla.  I also used butter-flavored crisco instead of butter, due to a milk allergy in our home.  \n\nAfter putting them on the cookie sheet, I wet my finger with some water & made an indent in each one, which I filled with some blueberry jam.  \n\nYummy!  Next time, I'll have to make a double batch!  \n\nYou really do need to beat them for 10 minutes, though.  The dough will change consistency over the course of those 10 minutes from crumbles to a whipped up dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gazoogleheimer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1770409/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-13T12:54:20.5Z",
                "reviewBody": "Well these shortbread cookies turned out excellent... you CAN USE MARGRINE I don't use butter in my house for cooking/backing and I had margrine and it worked great... I added 2 teaspoons of vanilla extract I think that is a must have... and I first took 2 squares of margrine and placed it in the micro for about 25 seconds to soften only a little and I wipped it in my electric mixer for about 2 min first ON HIGH and then added the icing sugar still beating on high and 1 cup of the flour on hight and then I sewed in the remaning 1/2 cup flour with my spatula... these really do melt in your mouth... I did'nt think they were difficult... but sometimes when you are new at baking shortbread may not be the best choice... but all in all I love them can't wait to share them with everyone! great recipe william! and thanks for sharing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dolorse MacKay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T16:56:09.967Z",
                "reviewBody": "Great recipe! Very easy to make. I used a cookie scoop to put cookies on parchment paper and flattened them slightly with my fingers. After cooling I dipped 1/2 of each cookie in melted chocolate. They came out great! Thanks for the fast easy and tasty recipe...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STACYBETH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/601658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-09T20:58:44.53Z",
                "reviewBody": "Excellent!! I took the advice of someone and whipped the butter alone first for 5 minutes then slowly added the sugar and flour and continued whipping for 5 minutes. I rolled them a little to make them into balls and they look fantastic! Definitely worthy of giving to guests at Christmas!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Xenodoce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666243/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T20:56:33.89Z",
                "reviewBody": "I wish I could say that this recipe worked for me but it didn't. I added 1/2 tsp of vanilla to this recipe and beat the butter first added the conf sugar and beat that in then the flour and beat for 10 minutes. Cookies looked great and tasted great but I could barely get them off the pan before they would fall apart. I figured they would be easier to handle once they were cooled but they weren't. They fell apart the minute you tried picking them up. They tasted great but I definitely can't make this to serve to people or they would get a plate of crumbs. What a bummer!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "holrk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2038510/"
                }
            }
        ]
    }
]