[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9970/fortune-cookies-iii/",
        "name": "Fortune Cookies III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F350392.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "1997-09-04T01:15:29.000Z",
        "description": "This recipe is for oversized fortune cookies made from a French butter-cooke recipe.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "15 cookies",
        "recipeIngredient": [
            "5 tablespoons unsalted butter",
            "4 egg whites",
            "1 cup super fine sugar",
            "1 cup sifted all-purpose flour",
            "1 pinch salt",
            "3 tablespoons heavy whipping cream",
            "1 teaspoon almond extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).  Coat baking sheet  with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a small saucepan over low heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In bowl of an electric  mixer, combine  egg whites and sugar; beat on medium speed for about 30 seconds.  Add flour and salt; beat until mixed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add butter, heavy cream and almond extract; beat until mixed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1 tablespoon batter onto half the baking sheet.  Spread with  a spoon into a thin 5 inch circle;  repeat on other half of sheet.  Bake until edges turn golden brown, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place baking sheet on a heat-resistant surface.  Working quickly, slide a spatula under one cookie. Lift and place  on a dish towel.  Fold cookie in half, pinching at top to form loose semicircle.  Insert index fingers into ends; press indentation into center of cookie while bending ends together to form shape of a fortune cookie.  This should  take about 10 seconds.  Once the cookie hardens, you  cannot fold it.  Repeat with other cookies.      Write your message on long strips of sturdy art paper, and  thread through cooled cookie.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sherry"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.358974358974359,
            "ratingCount": 39,
            "itemReviewed": "Fortune Cookies III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "281.4 calories",
            "carbohydrateContent": "42.5 g",
            "cholesterolContent": "30.6 mg",
            "fatContent": "10.8 g",
            "fiberContent": "0.5 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "35.9 mg",
            "sugarContent": "28.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-20T06:54:52.623Z",
                "reviewBody": "Aside from the fact that these cookies were difficult to shape (no fault of the recipe) they are fantastic - they taste great and look good. A few tips: 1. Cut a round mold into the top of a plastic container then spread the batter with a long metal spreader; this will give the cookies a smoother surface and make the shaping easier because the cookies will cook more evenly. 2. I cut down on the amount of sugar by almost half a cup - it made them better for my taste buds but didn't adversely affect the baking process. 3. Wear a pair of thin non-wool gloves (you don't want little fibres getting all over your cookies) when shaping the cookies - they are hot!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOKADA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/789793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T19:38:55.483Z",
                "reviewBody": "Wonderful flavor and texture to the cookies. Like any cookie in this genre they are best made on low humidity days. When I was in pastry classes I picked up a few tips for shaped cookies. 1. Cotton gloves protect the fingers from burns 2. Place the cookie sheet on a thick towel once removed from the oven. It helps retain a bit of heat. 3. I was really slow in my forming so my teacher had me work directly from the oven. That way the resting cookies are kept hot while you work the other one. You have to be very careful not to bang appendages and only have the 1 rack in the oven to minimize the chance of burning arms etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUDIEMARIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/888457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-30T02:07:45.2Z",
                "reviewBody": "I tried several fortune cookie recipes and this one was the easiest one the cookies came out perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GR8TPANTHER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T04:02:16.507Z",
                "reviewBody": "I made 200 fortune cookies as wedding favors. Everybody loved them. They were easy to make and went fast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CCLIFFORD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/366197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-18T00:05:30.147Z",
                "reviewBody": "I loved this recipe! It is a MUST to have the rack in the oven level as the dough is extrememly thin and will \"run\". I also put the slips of paper in as I shaped them hot from the oven - no problem. Instead of fortunes I put my favorite memories with my boyfriend and gave them to him for Valentine's Day. He loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/807147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-21T15:41:31.243Z",
                "reviewBody": "Don't underbake the cookies or they will tear during shaping. To shape: Wear cotton gloves. Using a wide spatula remove one cookie at a time from the oven and flip into your gloved hand. Place and hold one fortune paper in the center of the cookie and quickly fold the cookie in half. Grasp the ends of the cookie and draw it gently down over the edge of the straight-sided pan or bowl to get that \"fortune-cookie\" curve. (The slit in the cookie will be facing up as you shape the cookie over the pan.) Place the cookie ends down in one of the muffin pan cups to cool. This will help them hold their shape while cooling. If the cookie hardens too fast return it to the oven for about 1 minute to make it more bendable. Repeat for remaining batter using a cold well-greased baking sheet for each batch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kate Last",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1856475/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T04:01:39.193Z",
                "reviewBody": "It was reallie kewl. It came out perfect. Then I had and idea after making so many after 2 months. I tried them in different colors! It was so kewl! I used foodcoloring! I shared some with mi 5th grade class and it was such a success!!! It was so fun getting all the compliments! And you should try to put colors too! try different colors each time you wanna bake. To make them all mostly folded just put like 1-6 at a time. That's what I did. And when I do the colors fill a little container with little batter then put food coloring. Mix well. All of the above. I hope you love muah idea!!! I'm outie!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGANDAPINAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/812587/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-09T23:20:00.053Z",
                "reviewBody": "Great! After they come out of the oven you can flip a glass over with a 2\" bottom lay the hot cookie over the glass and you will come up with a cute little \"tulip\" bowl that you can serve ice cream or sorbet in! Sweet!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Beckham-Wadley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1852706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-27T07:35:13.497Z",
                "reviewBody": "I gave this 3 stars because it does have a very good flavor but I was unable to fold the cookie into the fortune cookie shape. It was incredibly frustrating because I had tried 3 other recipes for fortune cookies and had the same problem. I was excited to see others here give this a great review so I was very optimistic. I tried so many different things to get these cookies to \"fold\" i.e. adjusting my oven temp from 300 to 400 taking the cookies out sooner letting them bake longer adding more dough to the circles using less dough after trying for two days I gave up. Can anyone here post how they were able to shape these cookies without them breaking or cracking? They ALWAYS cracked and drove me insane.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ITSIZZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1082880/"
                }
            }
        ]
    }
]