[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/849/desserts/cookies/no-bake-cookies/",
                    "name": "No-Bake Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10112/thin-mint-crackers/",
        "name": "Thin Mint Crackers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F46043.jpg",
            "width": 2816,
            "height": 2112
        },
        "datePublished": "1997-11-06T00:17:06.000Z",
        "description": "Just like the Girl Scout cookies!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "80 cookies",
        "recipeIngredient": [
            "1 pound bittersweet chocolate",
            "80 buttery round crackers",
            "½ teaspoon peppermint extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Using a double boiler method, melt the chocolate coatings over hot tap water for 15 - 20 minutes. Stir . Do not cook or get water into the chocolate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After it is melted, stir in a couple drops of peppermint flavor into the chocolate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip crackers into the melted chocolate and then place onto a cold cookie sheet and put into the refrigerator to set.  (A freezing tray to rest the dipped cookies will keep the bottoms neat looking.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a few minutes take them out and package in candy cups. The cookies are best kept at room temperature or a cool  dry place away from any odors.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "No-Bake Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kim"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6688311688311686,
            "ratingCount": 308,
            "itemReviewed": "Thin Mint Crackers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "99.8 calories",
            "carbohydrateContent": "10.6 g",
            "cholesterolContent": "0.5 mg",
            "fatContent": "5.8 g",
            "fiberContent": "1 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "2.7 g",
            "servingSize": null,
            "sodiumContent": "64.7 mg",
            "sugarContent": "5.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-20T13:24:03.25Z",
                "reviewBody": "I reviewed this earlier but wanted to update because I've made them several times since then.\nI figured out something; don't put the peppermint extract in the chocolate until it is fully melted. If you put the peppermint extract in the chocolate and then melt it in the microwave the extract burns the chocolate and makes it crumbly and hard, hence those reviewers having to use oil to make it smooth again.\nOnce the chocolate is fully melted stir well and then put your extract in!\nFor the holidays I used white chocolate chips too. Also crushed some peppermints and added green and/or red sprinkles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "INTELSIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/78507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-07T23:59:27.44Z",
                "reviewBody": "So easy!  What a great idea...that I kind of changed.  Instead of Ritz crackers, I used Nabisco Famous chocolate wafers and melted Andes mints.  I am not even kidding how great these were!  Thin, crispy and chocolaty!  I am thinking about making sandwiches with the wafers with marshmellow cream in the middle and then dunking them in the melted Andes mints.  Oh the possibilities!  Try these, you won't be sorry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "messycook27",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2073625/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-19T13:42:06.003Z",
                "reviewBody": "HELPFUL TIPS NOT MENTIONED: Be sure to use a napkin (or your finger if they're just for you) to wipe up the extra chocolate that spreads around the cookie after you've dipped it, so you don't have a sloppy finish when the chocolate hardens.  Another idea is to spread the ritz w/ a little peanut butter & then dip in chocolate!  However, be ready to do them fast and put them in the freezer for 5 min. so the pb doesn't melt! UPDATE: So I originally made this and loved the recipe because my kids could make them and it took 5 minutes.  Problem is, we would take them to parties, & people easily knew it was a Ritz, and that's kinda embarrassing.  Not to mention the salt! So, after trying several cookies, I tried a nilla wafer AND PERFECTION!! They don't break in half easily like ritz, so you can manage them easier and they taste JUST like girl scout cookies and no one can tell it's a nilla wafer inside! On paula dean, they took 2 sugar cookies and baked it w/a mint in the middle so another idea on how to use those mints.  I use 1 fork, and give it 2 lifts up and down so the excess chocolate can drip off then place on baking sheet line with foil or wax paper, and it's usually enough to catch all the excess chocolate & I find andes mints taste a LOT better than using the peppermint extract.  So, I buy a whole case of andes baking chips when they come out around holidays!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T16:32:57.84Z",
                "reviewBody": "This is the BEST! It tastes just like the Thin Mint Girl Scout Cookies but it is so easy & much more affordable! I make it every year for Christmas but after the chocolate is set I melt red & green candy melt (in separate bowls) & then drizzle each color in different directions across the top of the cookie. I get many requests for this cookie. My kids love it. They have helped dip the crackers but it gets alittle messy. I found that putting them on a cookie sheet lined with wax paper & then putting the cookie sheet in the freezer really makes things go much quicker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEANMONA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/159891/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-18T16:40:59.85Z",
                "reviewBody": "Could NOT be easier! Kids can make this in a snap. Heck monkeys could make this! I bought the Andes baking chips from my grocery store melted a couple handfuls in the microwave in a creme brulee cup for about 30 seconds then mixed it with a fork to be sure it was all melted through. I just dropped my reduced-fat Ritz crackers into the creme brulee cup with melted chocolate (perfect size cup for a Ritz) and used two forks to turn and coat the cracker. Set on paper plates (out of wax paper) and put the plates in the freezer for about two minutes. THAT'S IT FOLKS!! Clean up is a snap! My husband was AMAZED at these. He kept saying \"How did you do that?\" and looking around the kitchen like there must have been more pans or ingredients; like it was magic.:) In all fairness there is a teeny tiny very faint salt taste from the crackers if you really examine them -- but not enough to detract from the taste in any way. I will keep my eyes peeled for plain chocolate wafer cookies. Or if you really wanted to go for broke you could buy a bag of oreos and twist apart each cookie to use the two chocolate wafers; you'd have yourself a true thin mint then. This would work well to make mint chocolate dipped oreos or to dip the ends of a biscotti... the possibilities are endless. People look so stunned and confused when after biting into the cookie I hearing me say \"It's a Ritz cracker!\" Really a fun recipe.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-12T19:41:37.637Z",
                "reviewBody": "These are awesome! I didn't use bittersweet chocolate however. I always buy little chocolate \"buttons\" at our local candy supply store so had some semi-sweet/dark chocolate left over from Christmas. Kept adding the peppermint extract until it tasted right. People at work freaked out - thought I'd somehow gotten my cookie order early!!!! I might add that you should not use plain MINT extract. Every time I've used that in ANY candy it tastes like toothpaste so be sure and use peppermint! Also the cold cookie sheet is a must. I've been making candy for years and always had the little \"pool\" around the chocolate dipped items. This certainly takes care of that problem - looked professional. Also I used a little Wilton candy dipping tool - plastic with the end looking like a tiny \"waffle spatula\". Dropped the Ritz in the chocolate picked it up with the dipping tool and FLIPPED it over onto the cold cookie sheet - perfect! Thanks for the great recipe. I'll be making it again - so much cheaper than the girl scout cookies and frankly I think a little better. Might try it again with the chocolate wafer cookies someone had mentioned but I still don't see how it could be better than the Ritz.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BROSNANFAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-21T02:11:12.82Z",
                "reviewBody": "So good - but I have a couple of suggestions. Taste your chocolate after adding your peppermint. I didn't taste my chocolate until I was working on my second cookie sheet and I didn't have enough peppermint flavor added more and the second sheet tastes just like Thin Mint Girl Scout cookies. First sheet is good but much better with more peppermint flavor. After dipping crackers pick cracker up with a fork tap handle of fork on edge of bowl/double boiler to remove some excess chocolate. Put waxed paper covered cookie sheets in freezer before starting helps cool these quickly. I am sure I'll have to make more of these in the next 2 days can't keep hubby out of them. Thanks for recipe delish!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMINABMW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/650708/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-19T22:54:12.88Z",
                "reviewBody": "Like a previous reviewer I used Andes mints (thank goodness for after Christmas sales). These are like the real deal!!! By the way I didn't bother with the double boiler I just melted the Andes in the microwave:) Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-06T23:35:25.2Z",
                "reviewBody": "EXCELLENT!!! This was soooo easy to make. I melted a little Gulf Wax with a bag of Andes Mint baking pieces Used a fork to flip the Ritz crackers in the melted mixture then from the pan to 2 wax paper lined cookie sheets. Five minutes in the fridge and you HAVE real Thin Mints just like Girl Scouts. I only got 58 cookies out of this recipe(not 80 like stated) but I can't complain...These are Wonderful and HIGHLY recommended. GREAT RECIPE!:D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jody1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-21T18:35:56.063Z",
                "reviewBody": "I froze a sheet tray and then placed the dipped crackers back in the freezer. When they were hardened they would not come off the sheet pan except in tiny little shreds of chocolate covered crackers. The bittersweet chocolate was off-putting to me. Needless to say I won't be making these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy in Pensacola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cindy_in_pensacola/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Thin Mint Crackers",
            "description": "These delicious chocolate-covered crackers have a taste you’ll find familiar.",
            "uploadDate": "2013-04-16T21:41:11.928Z",
            "duration": "PT1M43.77S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F95393ee2-16f4-4890-a76d-1e5b5ee50dac%2F773824e3-d008-44fe-972c-35de6a9a5bc5%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2305811681001"
        }
    }
]