[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16416/desserts/cookies/sandwich-cookies/",
                    "name": "Sandwich Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10413/easy-valentine-sandwich-cookies/",
        "name": "Easy Valentine Sandwich Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1101763.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This recipe makes 17- 3 inch sandwich cookies and 17 - 1 1/2 inch heart shaped cookies.  You'll need a 3-inch heart shaped cutter and a 1 1/2-inch heart shaped cutter.  Frost with Pink Valentine Frosting (see recipe).",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "34 cookies",
        "recipeIngredient": [
            "1 cup butter",
            "1 ½ cups confectioners' sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "½ teaspoon almond extract",
            "2 ½ cups all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon cream of tartar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together butter and confectioners' sugar.  Beat in egg, vanilla and almond extract.  Mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together flour, baking soda and cream of tartar;  blend into the butter mixture.  Divide dough into thirds and shape into balls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working with 1/3 of dough at a time, roll out dough into desired thickness on a lightly floured surface.  For each heart sandwich cookie, cut out 2 3-inch hearts.  Cut out the center of ONE of the 3-inch hearts with the 1 1/2-inch cutter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place each piece separately on an ungreased cookie sheet, 1 - 2 inches apart.  Bake in a preheated, 350 degrees F (175 degrees C) oven until lightly browned (7-8 minutes for 1/4 inch thick cookies).  Cool completely on wire rack.  Frost bottom cookie with Pink Valentine Frosting and place an open centered cookie on top to form the sandwich.  Also frost the small 1 1/2 inch hearts and serve as separate cookies.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sandwich Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Laria Tabul"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.596026490066225,
            "ratingCount": 151,
            "itemReviewed": "Easy Valentine Sandwich Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "209.6 calories",
            "carbohydrateContent": "24.7 g",
            "cholesterolContent": "39.7 mg",
            "fatContent": "11.3 g",
            "fiberContent": "0.5 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "155.7 mg",
            "sugarContent": "10.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-12T23:17:25.967Z",
                "reviewBody": "I made over 400 Valentine Sandwich cookies for my dessert business clients this year using this recipe.  I personally don't like crisp/cut-out sugar cookies, but everyone went NUTS over these cookies.  My niece has me make them for softball games, parties, etc.--she loves them. After making so many of these, I can offer a few suggestions: (1) refrigerate dough for 2-3 hours (I made over 30 batches of dough & often let it refrigerate overnight). I always put the dough back in the refrigerator between batches. (2) I used 2 tsp of vanilla & eliminated the almond extract. (2) When I rolled out the dough, I used confectioners' sugar (10X) NOT flour--I even re-used previously roll-out dough without any problems.  The confectioners' sugar gives the cookie a little extra flakiness. (3) I sprinkled colored sugar on the cookie with the cut-out section before baking-the colored sugar looks nice with the contrast of the frosting coming through the cut-out. (4) I baked the cookies on Silpat, but parchment would work too. (5)I used a different frosting:  2 cups confectioners' sugar (10X), 3/4 tsp vanilla and 4-6 tbsp half & half or whole milk, plus food coloring.  The frosting was always a big hit. (6) I individually bagged the cookies in cellophane cookie bags & everyone commented on how freshed they stayed.  I will be using this recipe for St. Patrick's with shamrock cookie cutters; green sugar & green frosting!  Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TLBRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T23:17:07.53Z",
                "reviewBody": "I consider myself a cookie connoisseur and this recipe is fabulous! There is no need to refrigerate the dough if you roll it between two pieces of parchment paper. I've had great success using different flavourings in the icing such as raspberry amaretto irish cream etc. instead of vanilla. I've also used cream instead of water to make the icing. You can be really creative with using different coloured icings and various cookie cutter shapes. Any time I've brought these cookies to a baby shower or wedding shower they have been raved about. Soon I plan on using a palm tree shaped cutter with pina colada flavoured icing for my next beach theme wedding shower. Can't wait to bake again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKIEXXX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/879491/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-22T13:37:07.467Z",
                "reviewBody": "As far as cookies go I prefer drop cookies (much easier!) but for quick cutouts these worked rather well. The frosting / sandwiching took a while for me but that's my own doing not the recipe's fault. I second the warning to put space between the cookies if you make them 1/4\" thick because they will poof up and out a bit and will stick together. Strong recommendation is to place dough between parchment paper for rolling and then it's easy to simply cut out the shapes pull off the excess and move the parchment paper onto the cookie sheet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Mottram",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/227901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-11T20:56:42.107Z",
                "reviewBody": "This recipe is absolutely DELICIOUS!! I did make a few changes. I used lemon extract in place of the almond extract. I also used seedless raspberry jam to sandwich the cookies together and dusted the tops with powdered sugar. Everyone raves about these cookies. My kids can't wait for me to make them. Since it's Valentines day I'm going to get busy right now. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELUNA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/262279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T22:20:50.52Z",
                "reviewBody": "Delicious cookies - very light and buttery. The dough isn't as easy to work with as I thought is would be. That is until I got the hang of it by rolling between two pieces of lightly floured wax paper and putting it into the freezer - then doing the cut outs. I baked it on parchment paper and did sandwich cookies with seedless strawberry jam then gave the cookies a nice sprinkle of powdered sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-31T02:01:27.907Z",
                "reviewBody": "I have been searching for a while now for a cookie that my mum use to make for me to bring to school for valentines day. To make the cookie more like hers I omitted the icing and used seedless raspberry jam and then afterwards drizzled have of them with white chocolate. I'm not sure if anyone else has suggested this....but instead of trying to fight to get the cookies up and keeping there shape roll the dough out on parchment paper...cut...remove excess dough then put in the oven on a cookie sheet! Definelty will be making again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caitlin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2514774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-11T22:22:06.67Z",
                "reviewBody": "Very easy to make and the taste is great. But be sure to place cookie at least 1 inch away from each other they really \"grow\" during baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vivian Lee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/138/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T23:17:18.95Z",
                "reviewBody": "Excellent Excellent!!! I used previous advice and chilled the dough. I made single cookies for St. Patties Day. The first batch puffed up and did not keep their shape well. I then made cut outs and put them on cookie sheet and refrigerated again for at least 10 minutes before baking and they retained their shapes much better. I thought the dough was very easy to work with and used 10X sugar instead of flour for rolling out. This is my new recipe for cut out cookies. Fantastic recipe Laria! Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwen Langham Howell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/725394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-13T22:16:11.25Z",
                "reviewBody": "I don't know how anyone can say you could work with this dough at room temperature. I had to refrigerate it for over an hour before I could roll it out without sticking. Other than that they were a big hit at work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CATWOMAN06",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/288805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T19:15:52.59Z",
                "reviewBody": "I was very dissapointed with this recipe. I followed it exactly and used confectioner's sugar instead of flour to roll it out. The dough was absolutely delectable but the finished cookie didn't have a great taste was very brittle and spread a lot during baking making the cutout tops unusable because the shapes were all messed up and didn't look like hearts anymore at all. I much prefer the Best Rolled Sugar Cookies recipe from this site which I made at Christmas they cut out beautifully and retained their shape while cooking also have a better taste and not such a crispy/brittle texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "3rdElizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1751712/"
                }
            }
        ]
    }
]