[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/849/desserts/cookies/no-bake-cookies/",
                    "name": "No-Bake Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10753/chocolate-mice/",
        "name": "Chocolate Mice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4579471.jpg",
            "width": 3456,
            "height": 4608
        },
        "datePublished": "1998-04-04T03:56:43.000Z",
        "description": "Kids will love these, they are whimsical and fun. Cute chocolate mice rolled in confectioners' sugar or chocolate cookie crumbs are very realistic.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT2H20M",
        "recipeYield": "1 dozen",
        "recipeIngredient": [
            "4 (1 ounce) squares semisweet chocolate",
            "⅓ cup sour cream",
            "1 cup chocolate cookie crumbs",
            "⅓ cup chocolate cookie crumbs",
            "⅓ cup confectioners' sugar",
            "24 silver dragees decorating candy",
            "¼ cup sliced almonds",
            "12 (2 inch) pieces long red vine licorice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt the chocolate, and combine with sour cream. Stir in 1 cup chocolate cookie crumbs. Cover and refrigerate until firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll by level tablespoonfuls into balls.  Mold to a slight point at one end (the nose).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough in confectioners sugar (for white mice), and in chocolate cookie crumbs (for dark mice).  On each mouse, place dragees in appropriate spot for eyes, almond slices for ears, and a licorice string for the tail.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Refrigerate for at least two hours, until firm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "No-Bake Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rosina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.663663663663663,
            "ratingCount": 333,
            "itemReviewed": "Chocolate Mice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "176.4 calories",
            "carbohydrateContent": "27.4 g",
            "cholesterolContent": "3.1 mg",
            "fatContent": "7.2 g",
            "fiberContent": "1.3 g",
            "proteinContent": "2.3 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "89.8 mg",
            "sugarContent": "17.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-30T17:22:11.443Z",
                "reviewBody": "This was fun to make and my husband said they were tasty.  One suggestion, line an old shoe box with tin foil and poke air holes in the top.  Then, add some chocolate sprinkles to the floor of the box.  Serve the mice in the box and it will look like they've been living there for awhile:).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LKANE99",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/364003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-12T23:30:48.5Z",
                "reviewBody": "Give yourself plenty of time to make these as you will want to make more than one batch.I used a cookie scoop to size the dough and shaped a couple at a time keeping the rest in the refrig. to stay cold and firm. Made tails out of caramels as suggested by others with great results. A small knife to pierce the dough for the placement of ears, tail and eyes made assembly easy. Used pink pearl candies for eyes. Mice can be made a couple days ahead and kept in the fridge but caramel tails will get soft so do not add until day of the party. Tails can be made ahead as well but store alone. These are well worth the effort. For those unfamiliar with chocolate wafers Nabisco (R) makes Famous Chocolate Wafers. They come in a 9 oz yellow box with a cellophane wrapper. UPDATE 3/12/07 Check-out Peanut Butter Christmas Mice by Paula, also very cute!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-30T17:20:46.96Z",
                "reviewBody": "We just won a prize at an adult Halloween party for these. We made a lab rat maze out of a computer paper box lid and strips of cardboard covered with foil--scotch tape held the strips in to make the maze walls (took about 10 minutes to make). We dripped fake blood on a note next the maze saying that these mice are for the taking and the the hammer (propped up against the maze) is the most effective way of killing them so you can eat them, unless you want to bite their heads off. We dressed as mad scientists. Recipe modification: instead of using licorice, make VERY realistic tails by rolling pieces of caramel into skinny tapering strips. Most of the comments we got at the party were about the caramel tails!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline Christy Otto",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/554410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-28T16:53:51.99Z",
                "reviewBody": "I have no clue what chocolate wafer cookies are so I used oreos (cream and all crushed them in food processor until very fine). I used the crushed oreos again to roll them on. For brown mice i rolled them in baking cocoa powder. I did try the confectioner's sugar for white mice but they didn't look right at all because the \"background\" is too dark. I made 4 tails out of one caramel candy by cutting in quarters and heating them in microwave for a few seconds. I attached the tails before rolling the chocolate bodies in the cookies/cocoa. I had to shove some of the tail inside the body so they would stay attached. I made 18 mice out of this recipe Update Made them again and they were much easier the second time around. Try not to handle the \"dough\" too much the heat of your hands will melt them and make them harder to handle. I used crushed teddy grahams for tan/beige colored mice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LatinaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/latinacook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-06T01:41:25.45Z",
                "reviewBody": "omg these were so cute! they turned out well tho i had the same problem with the powdered sugar as another writer. couldn't decide if i put on too much and should have just barely rolled them so it absorbed into their little bodies or if i didn't put on enough; i should have poured it on to make them look furry. any recs on this end would be appreciated. the crushed oreo ones turned out the best. and caramel tails - what a brilliant idea! couldn't find the silver bullet things for eyes so just bought some red white and blue sprinkles and used the red or white ones for eyes. my fiance lost his guy card by adding little pink barbie sprinkles hearts (upside down) for noses. and if you're like me - not the sharpest knife in the drawer - you'll want to put the coconut in the food processor BEFORE rolling the mice in it - elsewise you'll end up with shaggy DA mice. (they didn't look the best but i thought they tasted the best; nice counterbalance to the strong chocolate taste). anyway awesome! thanks for another great halloween idea. (kitty litter cake is another winner.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MEAUXJEAUX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/439246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-18T20:44:32.753Z",
                "reviewBody": "These mice turned out so cute! I took them to a Halloween party at church and got so many compliments. They were yummy too. I modified the recipe a little. I used cream cheese instead of sour cream. I made one batch with semisweet chocolate chips and covered them in crushed oreos. Then I made another batch with white chocolate chips and covered them with powdered sugar. I used rolled caramels for the tails as others had suggested. I used candy sprinkles for the eyes and little dots of pink frosting for noses. They weren't hard to make but then did get my hands very messy. I will definately make them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2618158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-30T17:19:39.647Z",
                "reviewBody": "These are so cute so easy so yummy!! Everyone was shocked to find out it wasn't fudge!! I used chocolate teddy grahams and they worked perfect. Will Make again!! I also put my mice in a box with foil and added chocolate sprinkles. (they looked just like mouse droppings!) Everyone got a good laugh about these little critters.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUADCHICK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/651511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T17:47:45.073Z",
                "reviewBody": "My kids and I had a blast making these adorable and yummy treats. They were the hit of a Halloween party we attended. We put them on a tray covered with coconut that had been dyed with yellow food coloring (like straw) and sprinkled small chocolate sprinkles around them (like droppings!) Very realistic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bamachef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1489400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-30T01:25:45.39Z",
                "reviewBody": "This is just the cutest Halloween treat! Yes it is time consuming but I go for the \"WOW\" effect and this is it! I used Tootsie rolls for the tails just micro them 10 seconds on high slice in half and then roll each half into a pointy tail. I used red jimmies for the eyes. I put the tail eyes and ears on before covering with half Oreo cookie crumbs and half graham cracker crumbs. I put them in a shallow pan lined with graham cracker crumbs and sprinkled with chocolate jimmies. I can't wait to take them to work tomorrow thanks for a keeper. And yes this goes nicely with the kitty litter cake on this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANOPA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/194367/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-17T16:53:01.63Z",
                "reviewBody": "Made these for my sons grade 6 christmas party. Easy yummy adorable and fun. Every kid and a bunch of the staff at the school has asked for the recipie. Served on a platter mixed with the Cake Ball recipie from this site. Fantastic. Mini white chocolate chips are a great \"ear\" option for a nut free environment.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1600577/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chocolate Mice",
            "description": "Turn melted chocolate and cookie crumbs into adorable little black mice.",
            "uploadDate": "2013-10-14T21:34:03.635Z",
            "duration": "PT2M32.819S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F69c88d8a-a12f-4050-a6ee-b71650e50c72%2Fa33b5e84-2630-466d-a6a1-c3cfbb4294a2%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2743832490001"
        }
    }
]