[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/849/desserts/cookies/no-bake-cookies/",
                    "name": "No-Bake Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11162/buckeye-balls/",
        "name": "Buckeye Balls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F156141.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-12-14T01:46:31.000Z",
        "description": "Peanut butter balls dipped in chocolate. They look like buckeye nuts.  Absolutely delicious!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "½ cup butter, melted",
            "1 pound confectioners' sugar",
            "1 ½ cups peanut butter",
            "1 teaspoon vanilla extract",
            "2 cups semisweet chocolate chips",
            "1 tablespoon shortening"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the melted butter or margarine, confectioners' sugar, peanut butter and the vanilla together and mix well. Refrigerate for 1 hour or until firm. Roll into 1 inch balls and place on waxed paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the top half of a double boiler melt the chocolate chips and shortening, stirring constantly. Use a toothpick to dip balls into the melted chocolate, leaving a small uncovered area so balls resemble buckeyes. Place balls on waxed paper. Use fingers to blend in toothpick holes. Refrigerate until chocolate is firm. Enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "No-Bake Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Angela J."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.641255605381166,
            "ratingCount": 223,
            "itemReviewed": "Buckeye Balls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "366.1 calories",
            "carbohydrateContent": "41.1 g",
            "cholesterolContent": "13.6 mg",
            "fatContent": "22.3 g",
            "fiberContent": "2.4 g",
            "proteinContent": "6.2 g",
            "saturatedFatContent": "9 g",
            "servingSize": null,
            "sodiumContent": "137.3 mg",
            "sugarContent": "36.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-21T16:59:27.123Z",
                "reviewBody": "Excellent recipe. Since I buy my confectioners sugar in large quantities I will note for others  1 lb confectioners sugar equals 3 and one half cups. I like to make this recipe using 3 and one quarter cups confectioners sugar. The mixmaster really expedites the binding of the ingredients. Also I used the chocolate candy making disks at craft and grocery stores, formed the one inch balls on wax paper on a cookie sheet and put the cookie sheet into my freezer for 30 minutes . I use a long wooden skewer (shishkabob type) or a toothpick for dipping  the cold dough balls and they turned out very well. Very professional looking. With the disks they can also  easily be made with semi sweet or white chocolate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLIEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1491673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-02T13:54:01.813Z",
                "reviewBody": "I make these often. Have cut the receipe down because they make so many, I make the balls after I blend the mixture, Then I insert a sturdy toothpick into them and then I put them in the freezer for thirty minutes. This makes the toothpick strong so when you cover in chocolate the toothpick is firm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "B C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/304746/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-29T14:30:54.243Z",
                "reviewBody": "Thanks to everyone who reviewed before me, they were a snap to put together, have great consistency and taste absolutely delicious! \nFirst of all, I don't know if anyone else has done this, but I used crunchy peanut butter instead of creamy. It was definitely great! (and I didn't have to add anything extra to get the crunch. :) And, thanks to previous reviewers, I creamed together the sugar & peanut butter before mixing in the room-temperature butter (not melted). After adding the butter and mixing around a couple times with my spoon, I put the spoon on the counter and mixed with my hands!! It creamed super fast and well! Then, I rolled the dough into balls and set on wax paper (I put the wax paper in a 16 X 20 pan) and put a toothpick in them before sticking them in the freezer for 15 minutes (which was plenty of time for them to harden). And I don't have a double boiler, so I melted the chocolate chips in the microwave and just made sure I stirred every 30 seconds for the first minute and 1/2, and then every 15 seconds for the next 45 seconds (because they can burn very easily in the microwave). I did have to put the chocolate back in the microwave about 4 times because it kept getting hard. \nI dipped half the balls in semi-sweet, and half of them in semi-sweet/butterscotch mix. I like the semi-sweet/butterscotch mix, and my husband likes the semi-sweet. So, we're satisfied! I hope these tips help some people, because I think mine turned out just fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jojojomama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2246768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-22T23:29:58.907Z",
                "reviewBody": "I also used the Dark Chocolate Disks and found it much easier to do. I don't have a double boiler. I bought three bags and just microwaved them! When the chocolate started to cool and harden I jsut remicrowaved it. Worked like a charm! Also a tip for the crumbling. REALLY refrigerate them before you dip and right before you dip give them a quick roll and squeeze in your hands. Out of the two batches I made I had one break on me!!! Great recipe-my work finshed all two batches in 15 minutes!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/390747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-18T21:46:39.03Z",
                "reviewBody": "Great recipe! Very sweet and a great consistency. This was the first time I have ever made Buckeyes so I think I made a mistake adding the melted butter directly to the powdered sugar because I had little bits of pure sugar and butter. I will definitely use this recipe in the future! Since my first batch I have found that if you cream together the peanut butter and powdered sugar before adding the butter it makes it easier to get the butter to mix in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RHITPIXIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1189499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-30T06:46:51.213Z",
                "reviewBody": "OUT OF THIS WORLD!! I followed the tip of using 3 cups of powdered sugar. These were disappeared much faster than they should have! This recipe is definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CinciMom11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2464782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-16T19:55:45.7Z",
                "reviewBody": "My family really loves buckeye balls.  I make them every year. I really like it when they are really smooth and just melt in your mouth. I used 3 sticks of butter and 2 cups of peanut butter and 5 cups of powdered sugar.  I chilled the mixture overnight and used a 1 tbsp cookie scoop to make the 7 dz balls.  I stuck the toothpicks in before popping them in the freezer overnight.  I also added 1/4- 1/2 bar of gulf wax to the chocolate and put the chocolate in a crock pot for dipping the frozen balls in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle23464",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2409262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-09T05:26:40.557Z",
                "reviewBody": "Made these for the holidays and they were a real hit! Everyone who had some asked for more. :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEARTH4KITTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1351227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-20T12:00:29.467Z",
                "reviewBody": "Hi this recipe was so easy to make. Everyone loved it too. My only problem was that they turned out a little dry in the middle. Then I heard that if you want them to be dry you need to use Reduced Fat Peanut Butter which is what I did. So keep that in mind when you are buying the PB!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MONDEEP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/107278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T02:56:59.483Z",
                "reviewBody": "I'm not sure if maybe I measured something wrong but the consistency of these didn't really work. Since they were good I will try making them again but with a bit more powdered sugar to make them harder. After putting them in the fridge for a few hours I took them out to roll them into balls and they practically melted in my hands! I put them in the fridge for an hour after that then tried to dip them. By the time I had done five they were too soft so I put the dough in the freezer for an hour. FINALLY I was able to dip them. The flavor is wonderful and they are otherwise great! I took them to a bake sale and they were the first ones sold!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "TwoDCsPlus1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/579128/"
                }
            }
        ]
    }
]