[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11775/homemade-noodles/",
        "name": "Homemade Noodles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8091907.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-02-24T20:54:59.000Z",
        "description": "Easy, homemade noodles for two.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "1 cup all-purpose flour",
            "1 egg",
            "1 pinch salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix all ingredients. Roll thin with flour, then roll like a jelly roll. Cut into 1/2 inch strips. Let dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop into hot chicken broth. Boil for 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Craig Smith, in memory of Elizabeth Larimer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.008,
            "ratingCount": 125,
            "itemReviewed": "Homemade Noodles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "263.3 calories",
            "carbohydrateContent": "47.9 g",
            "cholesterolContent": "93 mg",
            "fatContent": "3.1 g",
            "fiberContent": "1.7 g",
            "proteinContent": "9.6 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "36.3 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-07T20:50:59.233Z",
                "reviewBody": "These are soooo good! No comparison to packaged \"egg noodles\". The chewy texture can't be beat. A few hints: \n-I don't think the recipe will turn out without the addition of a little bit of liquid, I usually add 2 tablespoons of milk along with the lightly beaten egg. \n-The dough is very elastic, let it rest for 10-15 minutes before rolling it out and it will be easier to work with. \n-Roll dough out to a 12\"x16\" rectangle, let rest 20 minutes, dust with flour, roll it up loosely, slice through the roll with a sharp knife (I do thinner slices than 1/2 inch). \n-Spread cut noodles out on a flour dusted tea towel to dry for an hour or two before adding to broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-30T20:10:44.923Z",
                "reviewBody": "This is a  nice beginning to a recipe I grew up with. My family is a homemade noodle family from at least 4 generations I am aware of. To make this recipe for a family of 4, I use 5 eggs, mix in enough flour to form a dough. Then I put the dough on a well floured counter, mix in enough flour to keep the dough from being sticky. I roll it out paper thin, in a circle. I cut the circle in half, put the right half on the left half, then cut it again. I then have a pie shaped piece of dough that is 4 layers thick, I roll it up jelly roll fashion, cut the noodles in thin strips. I shake the flour out of the little pinwheels, and place them on a cookie sheet. I set them aside to dry a little. (I never let them dry all the way, because generally they are made when I need them) Boil your broth, place a few noodles in the broth at a time, stir to keep them from sticking together. Pick the meat off the chickena, add at the very end. We serve this over mashed potatoes. This is a tradition that is almost religious in my family. Thank you for trying to put a recipe out here. It is not easy for people that have not seen the process. I am afraid it might be a dying tradition. We just spent a weekend with my nieces teaching them all to make noodles, the youngest was 6, she rolled and cut and did a fine job. Keep practicing if you have trouble, it is well worth the effort.\n\nThere is really nothing wrong with this recipe. I never add any liquid to my noodles, I am 51 and have been making them s",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy Carnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-04T21:02:13.14Z",
                "reviewBody": "Few things are better than homemade noodles. In central Indiana they are an essential part of a holiday meal. Local cooks are judged by the quality of their noodles. The only problem I see with the recipe here is that there is not enough liquid. Try this:\r\n     3 egg yolks\r\n     1 egg\r\n     beat until light\r\n     1 tsp. salt\r\n     3 tblsp. half and half (or milk)\r\n     beat again\r\n     2 cups flour\r\nThis is a perfect dough for noodles. If you need more liquid, add egg yolks or half and half until it is the desired consistency. Noodles are weather sensitive, so don't be afraid to add more liquid or flour if needed. Hope this helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "POESROSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/499234/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T16:29:14.433Z",
                "reviewBody": "I tried this recipe and it does not work. How long do the noodles sit for? Do you beat the egg before adding to the flour? When I added the egg to the flour all I got was a crumbly mess that wouldn't roll or cut nicely at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Hannah P.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1640127/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-05T14:30:16.677Z",
                "reviewBody": "My kids love these noodles in chicken broth with shredded chicken. If you are in a hurry you can drop little chunks of the mix into boiling broth instead of rolling cutting and letting dry. They are more like dumplings than noodles this way. (They must be VERY small chunks because if they aren't dried first they puff up...)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSYROSS1998",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-19T03:06:03.013Z",
                "reviewBody": "I received this same recipe from an Aunt in Indiana. My family loves it and requests it especially at holidays. One thing I do differently is add a few drops of yellow food coloring to the beaten egg for a little more yellow color and then after they are dried I use a pizza cutter to cut the noodles - much easier than a knife!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LisaMcQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1989550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-22T17:11:39.57Z",
                "reviewBody": "Like many other reviewers this is very similar to my grandmother's recipe. For those who had trouble: Be sure to thoroughly beat the egg before you add any flour. Then with a fork whisk in the flour a little at a time. Also my grandmother never measured anything and for noodles her strategy was to just keep adding flour until it wouldn't take any more. You'll soon realize you have to mix by hand and just keep kneading it in. This way I didn't have to add any other liquid and it didn't retract like pizza dough does so it was easier to roll out. Hope that helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShaeLynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2890926/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-22T04:22:08.357Z",
                "reviewBody": "Every couple of months a group of OLD friends get together for a \"retro dinner\"... This time dinner was at my house and Homemade Chicken and Noodles was on the menu along with Cornbread... Having never made noodles before I was a bit afraid they would turn out like the ones my Grandmother used to make which were like \"anemic rubber bands\"... All I can say is WOW!!! I WILL NEVER purchase egg noodles in the grocery store again. Craig you posted the recipe in memory of Elizabeth I made the noodles this morning with my 96 year old Grandmother's Rolling Pin. Perhaps both of the ladies were with me while I was making these delicious noodles. Thanks again for submitting the recipe. I cooked for 8 and just quadrupled the recipe must say I did have to add a couple of extra eggs to get the correct(or what I thought) consistency to roll out... I wish my Grandmother \"had her mind\" so she could enjoy the outcome. I doubt she'd be impressed as her food is pureed these days.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRAYJETMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/616684/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-07T19:04:42.077Z",
                "reviewBody": "Nice simple recipe for delicous noodles. Egg noodles are supposed to be a littler \"firmer\" since they cook up so much. I did add a dab of milk to my egg yolks before mixing into the flour mixture. I tried noodles 2 ways 1 with whole eggs and this one and I have to say that my family liked these noodles better plus I liked working with the dough better. It's a more old'fashioned type of noodle. They were delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CSIEFER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/542710/"
                }
            }
        ]
    }
]