[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1977/meat-and-poultry/chicken/chicken-breasts/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11967/angel-chicken-pasta/",
        "name": "Angel Chicken Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F525185.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1999-03-30T21:50:07.000Z",
        "description": "A delicious, easy company dish - the flavors are wonderful. A favorite with my family. I usually double the recipe so we can have leftovers.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves",
            "¼ cup butter",
            "1 (.7 ounce) package dry Italian-style salad dressing mix",
            "½ cup white wine",
            "1 (10.75 ounce) can  condensed golden mushroom soup",
            "4 ounces cream cheese with chives",
            "1 pound angel hair pasta"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan, melt butter over low heat. Stir in the package of dressing mix. Blend in wine and golden mushroom soup. Mix in cream cheese, and stir until smooth. Heat through, but do not boil.  Arrange chicken breasts in a single layer in a 9x13 inch baking dish. Pour sauce over.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 60 minutes in the preheated oven. Twenty minutes before the chicken is done, bring a large pot of lightly salted water to a rolling boil. Cook pasta until al dente, about 5 minutes. Drain. Serve chicken and sauce over pasta.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marian Collins"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.496154800297693,
            "ratingCount": 4031,
            "itemReviewed": "Angel Chicken Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "528.4 calories",
            "carbohydrateContent": "48.3 g",
            "cholesterolContent": "107.2 mg",
            "fatContent": "18.5 g",
            "fiberContent": "3.1 g",
            "proteinContent": "37.5 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "1264.9 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-07T16:24:17.013Z",
                "reviewBody": "My family loves this!  The recipe I have is actually a slow cooker recipe and the ingredients are doubled as follows:  1/2 C butter, 2 pkgs dry italin dressing, 1 C white wine, 2 Cans golden mushroom soup, 8 oz tub cream cheese w/chives & onion.\n\nPlace chicken in slow cooker, pour melted ingredients over chicken, cover and cook on low for 4 to 5 hours.\n\nI serve over penne pasta.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1341443/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T20:04:53.64Z",
                "reviewBody": "This is a wonderful recipe.  I used some of the suggestions on the other reviews.  I used a 10oz. can of chicken broth instead of the wine.  Since we don't like mushrooms I substituted cream of chicken with herbs this was a good choice.  I also cut chicken into strips, seasoned well and cooked on stove.  I then put chicken in the pan and poured the sauce over and baked for 30 min just so flavors could blend.  It could be eaten right away.  I used rigatoni pasta instead of angel.  This was absolutely delicious!!!  Will make many times!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/427993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T00:19:20.31Z",
                "reviewBody": "This chicken was SOOOOO GOOOOOOD!!!  I added olives, green onions, and mushrooms and used plain cream cheese, doubled the sauce, and served it over penne pasta and fresh broccoli(yummmm, definitely try it with broccoli).  It was one of the best chicken recipes I've ever tasted or made!!  It would also be pretty simple to lower the fat in this recipe.  I'm new to cooking and didn't let the cream cheese soften before putting it in the sauce- definitely a mistake!!  It took more than half an hour to get the sauce smooth, but that was my fault.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Bunny Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thebunnychef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-04T18:51:21.22Z",
                "reviewBody": "First I read about 300 of this recipes reviews so that I had a clear picture of what was wrong with it. I used an 8 oz pkg of cream cheese 2 cans of soup one packet of Italian dressing mix 1/4 cup chicken broth and 1/2 cup milk I didn't use butter just mixed the seasoning packet into the soup while it was warming. I also added a can of mushrooms. One full pound of pasta serves 8 so it would be okay to not use a full pound with 6 breasts. I cut my breasts into strips and poured the sauce over and baked for about 40 minutes at 350 perfect. Everyone liked this recipe including me but we must be tough coz the family gave this 4 stars so that is how I rated it as well. We will be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "melis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-10T21:56:16.17Z",
                "reviewBody": "Wonderful easy dish that translates well to a slow cooker. Used 1 package of Garlic Herb Italian Dressig mix as that's all I had. Cut back on the butter to 1/8 cup. Added 1 tsp of minced garlic and 1 8oz package of mushrooms. Sauce was a little thinner that I anticipated but nothing a nice golden roux couldn't correct!. This is a great recipe to make ahead or freeze: Prepare recipe as directed. Transfer to a 13- x 9-inch baking dish and let cool completely. Can be frozen up to three months. Thaw before reheating. To reheat cover tightly with aluminum foil and bake at 325 for 45 minutes. Uncover and bake 15 minutes or until thoroughly heated. Easy uncomplicated simple ingredients that will tantilize your tastebuds upon the first bite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T00:19:44.043Z",
                "reviewBody": "I have made this a dozen imes and given this recipe away to many people - all who have loved it.  This recipe also *very easily* adapts to the slow cooker!!  Just mix together your ingresdients, place the chicken in the cooker and pour the seasoning mix over the top.  If you don't have crm. cheese with chives, make your own from block cream cheese and fresh or dried chives.\r\nTry it in the slow cooker (crock pot) - you won't be disappointed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CMiceli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/678943/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T04:09:42.7Z",
                "reviewBody": "This is my favorite recipe from this site so far!!! Wonderful hardly describes the taste!! After trying it once or twice following the recipe, I added fresh sliced mushrooms and stirred/cooked them with the chicken/sauce. Approx 5-8 minutes prior to being done, I cooked frozen finely chopped broccoli and sprinkled it in the top.  Everyone loved it...even my 5 yr old!!  In addition, I passed this recipe on to my mom...who is \"the best cook in the world\" and who thinks that great tasting food cannot be that easy to prepare, and she loved it!!  Her and I both have this recipe is classified \"for guests.\" (Although I make it often as it is sooooo easy to prepare) Thank you!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T00:20:57.14Z",
                "reviewBody": "This was a good recipe, and different than the norm.  I used chicken broth as a subsitute for the wine.  My daughter (5) who HATES cream of mushroom soup, and can usually tell whenever I use it but she LOVED this.  She said \"mom-I like this cheese sauce\" (lol), and she ate seconds!!  My husband LOVED it, and couldn't stop saying how well it tasted.  I thought it was good, but not 5 star quality.  The chicken was really tender, but the long cooking time seems to take away a lot of the sauce--there didn't seem to be enough.  The second time I made this I added a whole can of chicken broth, which made a BIG difference in the amount it made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CRYSTALYNN21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-08T22:06:53.763Z",
                "reviewBody": "Excellent recipe.. It is so simple and tasty.   Only changes:  doubled the sauce; used two packages of chicken tenderloins cut into bite sized pieces.  Seasoned the chicken (on both sides) with a little greek seasoning (don't overdo it), garlic powder, and black pepper before placing into the 9x13 pan (prepared with cooking spray).  I sauteed one half of a large sweet onion (sliced thin) in the melted butter in a saucepan until golden, and then added the remaining sauce ingredients.  I used an 8oz tub of cream cheese spread with onion and garlic, not just a block of plain cream cheese.  I've never seen a block of cream cheese with chives, just in the tub containers.   Highly recommend you use GOLDEN mushroom soup to give it the rich color and flavor, not regular Cream of Mushroom soup.  I used the two full packets of \"Zesty\" Italian dressing packets - no need to cut back, we did not find it too salty.  Recommend a good white wine with no chicken broth substitutions.. this is the only way you will truly appreciate the outstanding flavors of the recipe as posted.  I don't think chicken broth would ever yield the best flavor in this recipe.  A good Sauvignon Blanc enhances the flavor of this dish.   For lots of sauce to cover the pasta, I kept it covered with foil for the first 20-30 mins to retain the liquid, then removed the foil for the last half of cooking time.   My family loved this dish and asked that we put it in our family favorites recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheila",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/810556/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-31T01:13:43.34Z",
                "reviewBody": "Based on all the fairly positive reviews of this recipe I was optomistic that this would be a great tasting dish. Unfortunately it was quite bad. The taste was bland and to be honest it just didn't even look very tasty. I would avoid this recipes and look elsewhere.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "RJBEIER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512665/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Angel Chicken Pasta",
            "description": "See how to make a simple, creamy chicken and pasta dish.",
            "uploadDate": "2012-11-14T22:59:32.133Z",
            "duration": "PT3M8.438S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6ce6ac81-32d8-4916-9a51-9740f603ba79%2Ff9cb74d6-fc6c-4fd4-b841-3d176f9feb23%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1969496959001"
        }
    }
]