[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
                    "name": "Fish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/415/seafood/fish/tuna/",
                    "name": "Tuna",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12851/tuna-noodle-casserole-ii/",
        "name": "Tuna Noodle Casserole II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F23738.jpg",
            "width": 3072,
            "height": 2048
        },
        "datePublished": "1999-09-25T06:45:07.000Z",
        "description": "This is the old tried and true, 1950's style tuna noodle casserole we remember as kids.  Uses ingredients most people have on hand, especially those broken chips at the bottom of the bag that nobody wants to eat.  Got to have those chips on top to be real.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (16 ounce) package uncooked pasta shells",
            "2 (5 ounce) cans tuna, drained",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (10.75 ounce) can  condensed cream of celery soup",
            "1 ¼ cups milk",
            "1 teaspoon salt",
            "¼ teaspoon ground black pepper",
            "1 teaspoon crushed garlic",
            "4 slices processed American cheese",
            "1 ½ cups crushed potato chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Boil pasta in lightly salted water for 10 minutes, or until al dente; drain well. Return the pasta to the pot it was cooked in.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Spray a 2 1/2 quart casserole dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix tuna with cream of mushroom soup, cream of celery soup, milk, salt, black pepper, and garlic in a medium saucepan. Place pan over medium low heat, and heat through. Alternatively, place these ingredients in a microwave safe dish, and warm in the microwave.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix tuna mixture with pasta. Spread 1/2 of the noodles into the prepared dish.  Arrange the cheese slices over the noodles, then spread the remaining noodle mixture over the cheese. Top with crushed potato chips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake, uncovered, for 20 to 30 minutes; cook until the casserole is hot, and the chips begin to brown. Let cool for 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Fish",
            "Tuna"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chris Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2006578947368425,
            "ratingCount": 608,
            "itemReviewed": "Tuna Noodle Casserole II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "467.4 calories",
            "carbohydrateContent": "57.6 g",
            "cholesterolContent": "30 mg",
            "fatContent": "16 g",
            "fiberContent": "3.4 g",
            "proteinContent": "22.6 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "1143.2 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-29T20:52:55.09Z",
                "reviewBody": "This is a great basic tuna noodle recipe.  However, I made a few changes I believe made it even better.  First, I cooked the noodles a couple of minutes less than the package calls for, so after baking they will not be overdone.  I added a can of mushrooms, and an additional can of soup (either mushroom or celery) to make it creamier and it set up fine.  I cut the salt down to 1/2 tsp. because there is salt in the potato chips and sodium in the soup.  I figure eaters can always add, but cant take away.  I also added 1 1/2 c. peas to the soup mixture at the same time as the noodles, being careful not to mash.  I used Mozerella cheese instead of American.  And the leftovers are even better!  This is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SCIOTA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/515622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-02T06:05:36.873Z",
                "reviewBody": "Hi this is Chris and this is my recipe. We're thrilled so many people like it and add whatever items that suit your family's tastes. We use the 98% fat free soups, 2% milk, and shell macaroni  because the sauce fills in the little cup shape. If we have fresh mushrooms we add a few. Couple Tbls fresh celery adds a nice texture. One son likes extra cheese so in one corner we put more there. Use the recipe as the base, add what you like, you can't go wrong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PENDRAGON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-22T02:22:45.467Z",
                "reviewBody": "This recipe is fantastic. I made 3 changes though. Instead of American cheese, I used 8 oz of shredded Sharp cheddar, I used reduced calorie cream of chicken instead of cream of mushroom (my husband hates mushrooms) and I cut the salt in half. To be honest, you could probably get rid of the salt entirely since tuna and cheese are both pretty salty. My boyfriend does not normally eat or enjoy \"comfort food\" LOVED this recipe. A++, 5 stars, a real winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen Graham",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/621543/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-18T00:25:01.653Z",
                "reviewBody": "Awesome recipe!!!  I decided to make it exactly as written the first time and make any changes I thought it needed next, except I did use 6 slices of cheese instead of 4.  It is so perfect the way it is I would not change a thing!  I also used the 98% fat free soup. My hubby can be very picky and he had two huge servings, I couldn't stop eating it and my 2-year-old loved it too.  And it was so easy to make and impossible to mess up.  It will definitely be part of our regular rotation.  Thanks Chris, for posting this delicious, easy and inexpensive recipe!***UPDATE***When I re-heated the leftovers(and there were a lot), the potato chips got soggy.  Now I only top 1/2 with chips and add fresh ones before re-heating leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen Tillem Silverberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2257766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-16T18:13:50.577Z",
                "reviewBody": "I loved this recipe but I changed so much in it I didn't give 5 stars because I almost made up a different recipe! I used 1 can cream of mushroom 2 cans cream of chicken and 2 cups milk since many said it was dry. I used whole wheat egg noodles instead of shells and cooked them for 5 minutes so they were a little under done. I added 1 bag of frozen broccoli florets (peas would be great also!) to the last 2 minutes of the pasta cooking so they would thaw quickly. I added 1 4oz can of mushrooms 2 ribs of celery finely chopped the tops of 3 green onions 1 tsp of white pepper and garlic powder and no salt. I used 8 slices of American cheese. Instead of using chips I used the same amount of crushed croutons which I microwaved with 1 pat of butter to coat before I put them on the casserole. I only cooked it for 20 minutes then shut off the oven and left it for 10 more. It turned out wonderfully! Usually tuna casserole will come out dry (or mushy) if you overcook the noodles or add too many extra things without adding extra liquid.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "K.C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1740930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T16:54:53.513Z",
                "reviewBody": "My two biggest regret making this dish is that I can't give it negative stars and it was a waste of two perfectly good cans of tuna.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LVERNE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716251/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-16T10:12:06.937Z",
                "reviewBody": "We really liked this easy tuna noodle casserole recipe. I used low-fat soups skim milk reduced-fat cheese and crackers instead of potato chips and it was delicious. I also added frozen peas and a can of sliced mushrooms. The recipe makes so much...as much as we enjoyed it last night we have plenty of leftovers today.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SENORARECKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1282018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T02:40:28.687Z",
                "reviewBody": "Easy great tasting casserole! My husband said a total of 5 times how good it was. I made a couple of minor changes...I used a can of healthy select cr. of chicken soup b/c I didn't have cr. of celery and my cr. of mushroom was roasted garlic flavor(I omitted the crushed garlic). I also added a small can of mushrooms and used seasoned stuffing instead of potato chips for extra flavor. I did omit the salt but will use a little next time. Thanks for the great recipe:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole73",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/694840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-31T18:40:24.387Z",
                "reviewBody": "This was simple and great. I added 1/2 cup monterey jack shredded cheese, 1 box thawed frozen peas, a can of mushroom pieces and stems, and sprinkled Panko with butter bread crumbs over the top before baking. The family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Captain2h",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/706385/"
                }
            }
        ]
    }
]