[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17038/soups-stews-and-chili/soup/vegetable-soup/minestrone/",
                    "name": "Minestrone",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13163/classic-minestrone/",
        "name": "Classic Minestrone",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F448549.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-03-02T02:41:59.000Z",
        "description": "This famous Italian soup has been much imitated around the world with very different results.  The homemade version is a delicious revelation and is also extremely healthy, as it has pasta, beans and fresh vegetables. Try to make the minestrone a day early and refrigerate as this improves the flavors. Serve with grated Parmesan cheese and chopped fresh parsley.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "3 tablespoons olive oil",
            "1 leek, sliced",
            "2 carrots, chopped",
            "1 zucchini, thinly sliced",
            "4 ounces green beans, cut into 1 inch pieces",
            "2 stalks celery, thinly sliced",
            "1 ½ quarts vegetable stock",
            "1 pound chopped tomatoes",
            "1 tablespoon chopped fresh thyme",
            "1 (15 ounce) can cannellini beans, with liquid",
            "¼ cup elbow macaroni",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large saucepan, over medium heat. Add leek, carrots, zucchini, green beans and celery. Cover, and reduce heat to low. Cook for 15 minutes, shaking the pan occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the stock, tomatoes and thyme.  Bring to a boil, then replace the lid, and reduce heat to low; simmer gently for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the cannellini beans with liquid and pasta. Simmer for an additional 10 minutes, or until pasta is al dente. Season with salt and pepper to taste before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Minestrone"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.524305555555555,
            "ratingCount": 288,
            "itemReviewed": "Classic Minestrone",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "320 calories",
            "carbohydrateContent": "44.5 g",
            "cholesterolContent": null,
            "fatContent": "12 g",
            "fiberContent": "10.1 g",
            "proteinContent": "12 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "470.9 mg",
            "sugarContent": "7.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-22T13:08:54.687Z",
                "reviewBody": "I was expecting this to be a lot better, judging by all the positive reviews. It was rather bland. I followed the recipe to the letter (as I always try to do before rating a recipe), and came up with a soup that was just fair. I think it needed more tomatoes for body and taste, and I'll agree with one reviewer who thought the thyme was a little much. I had to add lots of salt before I could eat it and enjoy it. I noticed after reading over the reviews that more often than not if a review got 5 stars, the reviewer had added something to the recipe (e.g., potatoes, garlic, in one instance a ham bone!). I think this is one of those recipes that's good to have as a base to work from, then alter to personal tastes.  I'll use this recipe again, but not without some tweaking.\r\n\r\n* After the minestrone sat overnight, the flavor improved dramatically. Still not the five-star recipe I'd like, but the improvement was enough that I will bump it up to four stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "UNCLEBEN1980",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/794663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-02T15:42:31.763Z",
                "reviewBody": "I made this soup for a family gathering. I scaled it to serve 20 people and it turned out very well. I'm a strict vegetarian so I had to make something good to impress the meat-eaters of the group... all of them asked for the recipe. I tried to take a lot of advice from the user reviews before cooking and made some changes: 1. The scaled recipe called for 5 leaks. I subsituted one leak for an onion. So if using the current scale probably half and onion and one and a half leak would suffice. 2. I sauteed one clove of garlic in the olive oil before adding any vegetables. Again with scaling you might not need that much. 3. I couldn't find any cannellini beans so I used kidney beans. My italain stepmom laughed at me but it turned out good so she stopped laughing after she tasted it. 4. I did let it sit in the fridge overnight before serving. It really added a LOT of flavor. 5. I think the stock you choose is probably the most important part of this recipe. I was fortunate enough to have really good vegetable stock. Can't remember the brand or I would share it sorry. 6. I didn't put as much thyme in as called for. I served it with another recipe from allrecipe's: Great Garlic Bread submitted by Noelle. Good stuff.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Katy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1650640/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-30T19:24:34.923Z",
                "reviewBody": "This is a great recipe. Like others I added a bit more... spinach carrots zucchini and italian seasoning instead of the thyme. I also added just a few tablespoons of tomato puree and canned tomatoes instead of fresh. Also threw in a bay leaf of two and a part of a parmesan rind to richen the flavor. Also very important to add the beans. I made it in two batches and only put the beans in one as hubby is not a fan. The bean juice added a great dimension to the broth. Next time will definatly add it to all and just let him pick out the beans!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ktivers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2139468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-29T03:32:34.17Z",
                "reviewBody": "I took the advice of the other reviews and added 8 tablespoons of tomato puree some garlic and a little fresh oregano that I had on hand. I have to tell you this minestrone soup is fabulous and my family loved it! I can't wait to see how it tastes tomorrow after sitting overnight! My husband's only complaint was there wasn't enough beans. If that's the only complaint I'd call this a sure addition to our family recipes. Thank you Michelle!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Bell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2225753/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-29T11:53:23.797Z",
                "reviewBody": "This recipe is awesome. My husband is a vegetarian so I'm always looking for new and good meatless recipies. This soup is very easy to make and it truly is wonderful. I have made it at least 6 or 7 times already for us and family everyone loves it. The only thing I added was potatoes because I love them so much other than that I stick with the recipe and am very happy to have found it. If you like minestrone soup one must at least give this recipie a try. Yummy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCOOBYQUEEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/676520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-06T17:33:19.997Z",
                "reviewBody": "This is a fantastic fail-safe recipe you really can't go wrong no matter how you make it or how you change it! Unfortunately I had to give it only 4 stars because my husband didn't like it as much as me-- his complaint was similar to all the other reviews \"it's kinda bland\". I think it really comes down to your personal tastes and how you like your minestrone soup-- THIS SOUP HAS A LIGHT BROTH AND IS HEAVY ON THE VEGGIES. If you're like me and you like your minestrone like that then this is the soup for you! Changes I made to adapt to our own tastes: sauteed veggies in one crushed clove of garlic; I used closer to 2 quarts of vegatable broth since the noodles do soak up a lot of the liquid (can adjust broth to your own tastes); used one 14.5oz can of diced tomotoes stewed in garlic oregano & basil for more flavor and added one fresh diced tomoato; used about 1/2 tsp. dried thyme since I didn't have fresh thyme laying around (originally used full tsp. but found it overwhelming and had to siphon off some while it was cooking); and since my hubby likes noodles in his soup I used 1 cup whole wheat noodles (they look white like regular pasta when cooked so no one is the wiser) and cooked them before adding them to the soup so they wouldn't suck up so much of the liquid (they came out to about 2 cups once cooked). Overall it turned out quite balanced-- you get a little bit of everything you throw in there with each scoop.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1817352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-13T00:03:46.373Z",
                "reviewBody": "Once you taste this soup all others will pale in comparison. (i.e resturant can etc) The first time I made it we were stationed overseas so I had to subsitute some fresh veggies for canned. AS LONG AS you use a fresh leek you will get good results. If you are able to make it exactly as intended it will be outstanding!! Enjoy:0)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TXANCA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/70140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-01T18:06:03.41Z",
                "reviewBody": "Read the reviews and added more canned tomatoes as well as garlic. Yummy! Will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lanem1972",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2249957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-29T11:53:26.437Z",
                "reviewBody": "Great soup -- everyone who tries it demands the recipe. Improved by adding a clove of garlic IMO. Also like to add some shredded cabbage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KDCKNIT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/616909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-16T14:07:03.497Z",
                "reviewBody": "I opted to try this but will stick with my other minestrone recipe which purports to be authentic Italian. For that you add a potato green cabbage (I often omit doesn't make a difference) 2 zucchini and you saute your veggies in stages (longest cooking first) in a 50/50 mix of butter and olive oil. Use canned tomatoes it's fine. Also add salt rosemany black pepper and basil AND use beef stock/broth (unless you're vegetarian). The simmer for 1.5 hours add the beans (no pasta) and simmer another 30-40 mins. It's a great recipe for a chilly fall day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "cls223",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2908370/"
                }
            }
        ]
    }
]