[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/670/main-dish/pork/ham/",
                    "name": "Ham",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14978/main-dish/pork/ham/whole/",
                    "name": "Whole",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13869/glazed-baked-ham/",
        "name": "Glazed Baked Ham",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3028818.jpg",
            "width": 2448,
            "height": 2449
        },
        "datePublished": "1999-11-23T16:59:36.000Z",
        "description": "This is an easy way to prepare a ham for the holidays.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 ham",
        "recipeIngredient": [
            "10 pounds pre-cooked ham",
            "½ (12 fluid ounce) can cola-flavored carbonated beverage"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 275 degrees F. (135 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove any visible excess fat from ham. Place the ham in a large turkey roasting oven bag and place in a baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour cola over ham, remove as much air as possible and seal bag.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prick a few holes in bag to let steam escape and bake for 4 to 5 hours. Pour off excess juice and slice.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Ham",
            "Whole"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mary48"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.556338028169014,
            "ratingCount": 284,
            "itemReviewed": "Glazed Baked Ham",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "281.1 calories",
            "carbohydrateContent": "0.6 g",
            "cholesterolContent": "63.6 mg",
            "fatContent": "21 g",
            "fiberContent": null,
            "proteinContent": "21 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "1457.5 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-29T05:20:03.793Z",
                "reviewBody": "Oh my gosh, this was soooooo good.  Just so everyone knows, I had an 7 lb. ham, put in in the crockpot with a can of coke on the bottom and finished the top with a can of crushe pineapple.  I set it on low before I went to bed and woke up to a yummy aroma.  When I tried to pick it up to slice it, the fork literally made the ham fall apart like nothing I had ever seen.  I called 3 people because it is amazing and so, so, easy.  Thank you Suzanne!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IBTOUGH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1193346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-31T02:27:52.53Z",
                "reviewBody": "Excellent!  My first ham!  I took the advice of several reviewers and marinated the ham overnight in 1/2 liter of Pepsi in a turkey baking bag that was tightly sealed.  Sealing the bag air tight is tricky which is why I used so much Pepsi!  I did turn the bag several times during the process to get everyting covered.  I then drained the Pepsi and covered the ham in liberal amounts of brown sugar, re-tied up the bag, cut in a few slits and baked according to the directions for the turkey bag (it comes with ham directions and a cooking guide per pound of ham).  The ham was moist and delicous!  You could definitely tell there was a sweetness in the ham and the house smelled terrific during the cooking time.  Be sure to let your ham rest in the bag for at least 15 minutes to re-absorb some of those juices.  After carving, I saved the juices (skimed the fat) and the ham bone to re-use in the Allrecipes.com \"Bean & Ham Soup II\" later on.  It will keep nicely in the freezer until I'm ready to have ham again.  My 12 year old son was thrilled with the result.  Ham is his favorite meat and we've been eating my mother-in-laws ham every holiday for 10 years so I was very flattered - this being my first time and all.  ALSO - Remove the skin from your ham if you plan on using the brown sugar - very important!!!!!  Bon apitite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMASPICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/704352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-13T16:24:15.84Z",
                "reviewBody": "I have been making this for years. I only make a few changes. I put the ham in the oven bag the night before and add the coca cola (put in the fridge). It gives it a chance to soak. then before placing it in the oven, I rub brown sugar on the ham, seal the bag, poke some holes and bake. If your ham is small enough, this is GREAT in a crock pot too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JLEAGUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723076/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-03T15:55:30.34Z",
                "reviewBody": "I'v made this recipie 3 times and each time i'v added alittle something to it but this past easter was the best. I trimed the fat added the cola rubbed with brown sugar added pineapple slices and cherries then tied the bag and held tight using tooth picks. The ham came out of the oven so juicy and tender i almost didn't need to cut it. Everyone loves this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINDY1980",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1391561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-26T22:08:34.503Z",
                "reviewBody": "My father-in-law said it was the best ham he's ever had. Only made one minor change; mixed a cup(ish) of brown sugar with a little ground cloves and packed it on top of the ham. Everyone was surprised by the addition of cola. It's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "April W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1862571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T21:47:53.857Z",
                "reviewBody": "This was super easy. I started out with a 8 pound ham and by the time I got done trimming the fat it was a 6 pounder. So the time had to be adjusted to about 2 hours and 45 minutes. I did not use a pre cooked ham so for the last 30 minutes I just increased the temp to 300. As others suggested the ham was given a good rub down with a couple handfuls of brown sugar. I still used the 1/2 can of soda too. Just be sure to take out as much air from the oven bag as possible before sealing (the top of the bag was punctured a few times with a fork) so the soda is able to surround the ham, not sit at the bottom of the bag. This recipie was very easy and tasty. My family will be eating this again. Thanks Suzanne.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Haines525",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/856377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-25T19:18:55.717Z",
                "reviewBody": "I give this recipe 4 stars because the gist of the recipe is PHENOMENAL! My mom has been cooking holiday ham like this since before I can remember. I would definitely rate her holiday ham 5 stars! There are some major differences in the two recipes, however. My mom always used spiral sliced ham, for one. Also, instead of putting it in a turkey bag, she just put it in a deep metal baking dish (the ones commonly found during the holidays) and covered it with aluminum foil. Here are the two biggest differences, though, that I feel change the outcome drastically: she uses 1 can (HAS to be a can) of coca cola (pours half of the can over the ham before baking, and pours the last half on an hour before taking out of the oven) and she never trims the fat!! She simply cooks the ham fat-side up. Makes the ham unbelievably tender! If you're worried about health, serve it with steamed veggies or only trim half of the fat. Trust me, it's worth it!\nOne more thing...She always cooked it for about 12 hours. Great for cooking overnight and waking up to that wonderful smell on Thanksgiving morning!\nHope someone found this helpful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsJordan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7938302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-18T22:46:54.043Z",
                "reviewBody": "I was really disappointed with the way this ham turned out. Like another reviewer, the coke just sat at the bottom of the bag & since the recipe directed me to poke holes in the bag, there was no way to turn the ham over to ensure full coverage basting. I obviously did something wrong as other reviewers found this recipe superb. I am not sure where my error came in. I used a roasting bag & followed the directions to the T. It also might have been helpful for the poster of the recipe to mention what TYPE of ham to use. I am a novice cook (just trying to get some good meals together for myself & my boyfriend) & picked up a canned ham not a cut of shoulder, etc. YUCK! I was EMBARASSED to serve this. We ended up chucking it & having sandwiches for dinner. Anyway, regardless of the ham, the recipe did not work for me at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MAXINE76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T01:00:48.367Z",
                "reviewBody": "This was by far the WORST ham I have ever tasted. We followed the directions to a T, and it was sticky and mushy in texture. The cooking time is far too long for a pre-cooked ham.  DO NOT USE SPIRAL SLICED HAM WITH THIS RECIPE!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "cravnpup",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2210587/"
                }
            }
        ]
    }
]