[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/662/meat-and-poultry/chicken/whole-chicken/",
                    "name": "Whole Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14531/beer-butt-chicken/",
        "name": "Beer Butt Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3706549.jpg",
            "width": 2000,
            "height": 1995
        },
        "datePublished": "1999-08-28T00:21:18.000Z",
        "description": "A whole chicken is seasoned and slowly cooked on the grill. This is a bit unorthodox, but the end result is moist, flavorful, and amazing. All you'll need is some chicken, butter, beer, and seasonings.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT4H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup butter",
            "2 tablespoons garlic salt",
            "2 tablespoons paprika",
            "salt and pepper to taste",
            "1 (12 fluid ounce) can beer",
            "1 (4 pound) whole chicken"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for low heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small skillet, melt 1/2 cup butter. Mix in 1 tablespoon garlic salt, 1 tablespoon paprika, salt, and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Discard 1/2 the beer, leaving the remainder in the can. Add remaining butter, garlic salt, paprika, and desired amount of salt and pepper to beer can. Place can on a disposable baking sheet. Set chicken on can, inserting can into the cavity of the chicken. Baste chicken with the melted, seasoned butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place baking sheet with beer and chicken on the prepared grill. Cook over low heat for about 3 hours, or until internal temperature of chicken reaches 180 degrees F (80 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Whole Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Barrie Tapp"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.672322375397667,
            "ratingCount": 943,
            "itemReviewed": "Beer Butt Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "514.2 calories",
            "carbohydrateContent": "3 g",
            "cholesterolContent": "158 mg",
            "fatContent": "40.3 g",
            "fiberContent": "0.7 g",
            "proteinContent": "31.4 g",
            "saturatedFatContent": "19.4 g",
            "servingSize": null,
            "sodiumContent": "1618.1 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-08-05T18:30:16.467Z",
                "reviewBody": "I have made a version of this recipe for several years and have some suggestions, mix 6 tablespoons McCormick Ckicken seasoning with 1 tablespoon garlic powder, onion powder, black pepper, Accent (optional) and 1/2 teaspoon Cayenne pepper. Loosen skin and spread 1/2 of mixture under skin, dont miss the legs, rub remaining mixture on outside of chicken. Let sit in fridge overnight. Use a 16 oz. can of beer so that a couple of inches stick out the bottom to grab with the tongs after cooking, very important, spray the can with Pam to make removal much easier. put a tablespoon of garlic and onion powder in beer to season. \r\nFill smoker box with hickory chips and cook chicken at 350 for 1 1/4 to 1 1/2 hours for 5 lb. bird. Skin will be a deep mahogany and it will taste fantastic",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TNT1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/809230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T16:45:56.813Z",
                "reviewBody": "Gotta love this recipe. I have made this quite a few times on the grill AND in the oven (350 degress for about 1 1/2 hours). There are stands \"chickcan rack\" on the market that make this quite easy too. I add a \"montreal chicken blend\" to the recipe and a small potato or onion in the neck cavity to hold in the vapors. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Fisher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/430015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T17:28:37.223Z",
                "reviewBody": "MAAAVELOUS DAHLING!!!  Make SURE you don't overcook this baby (devastating!!!) Guaranteed to be the most delicious chicken you've ever tasted!  Also most of the fun of this is DRINKING HALF THE BEER!!! (Discard???--whatever there, chief!)  No grill?--bakes easily at 350 for about 15 minutes per pound--if ya lather the ole' girl up with dijon and honey as one member recommended it's even better (if that's possible?) OH YEAH--forget that flimsy foil cookie sheet--basic physics here folks...just doesn't have the tensile strength to handle a 7lb. roaster carried from the counter to the oven or grill--especially when precariously perched on top of a partial can o' brew! Regarding that--you can position the legs forward in tripod formation for better balance.  Use a glass baking dish--a bit more cleanup but you won't look like the village idiot when you have to lift it!  Try this recipe with any fowl--you'll be glad you did!!!  (Use fruit preserves of choice on the outside of a duck--yeah baby!!!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KEN-N-STEPH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/703199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-04T10:03:04.22Z",
                "reviewBody": "The first time I tried this - I did it on the grill. I have a very small grill and did not realize it should be covered. I could not do it on my grill because I could not close the lid - The chicken was too tall and well it never cooked. Now I make Beer Butt Chicken in the oven. I put it in my roasing pan, Bake it for  1 1/2 - 2 hours at 350 (don't need to cover it) lol. I also Put in some Potatoes (huge bakers) at the same time (Not in the roasting pan - on the oven rack). I use a funnel to add the butter and spices to the beer in the can. It is better to use warm beer - because when adding melted butter to cold beer it foams up.  I bought the can holder for beer butt chicken - It makes it stand up alot easier and stays in place when you Take it out to transport it to the cutting board.  YUMM !!! The chicken is browned to perfection and So tender the meat just falls off the bone. It is Awesome!!!! Thankyou so much for the recipe. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Coot226",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23546917/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-18T19:29:37.207Z",
                "reviewBody": "Ok! Here's the trick to getting the can off/out of the bird. Spray the beer can top and sides (Not bottom) with non-stick cooking spray before placing the chicken on it. The can simply slides right off!:-) Love the recipe! We always add more spice and you can also maranade the chicken in a bag beforehand insted of th rub.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Beek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/121306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-09T02:20:34.953Z",
                "reviewBody": "This is one fantastic chicken recipe... it comes out extremely moist and flavorful. Have done this recipe many different ways. You can use half a can of ginger ale if you're out of beer. I usually add some BBQ sauce to the half can of liquid and rub spices (garlic powder paprika cayenne pepper salt) into the bird. Have made it on the grill but I really think the oven is easier. Just set the chicken in a 13x9 pan and bake in a 350 oven for about 1hr 30min. Comes out delicious every time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-12T23:58:25.78Z",
                "reviewBody": "I have made this a number of times over the years and this is my favorite way to prepare grilled chicken.  Few words of advice: invest in a beer butt chicken holder (makes it much more stable and less likely to tip off making a huge mess), spray the can and/or holder with non-stick spray for easy removal, put a drip pan under the chicken to avoid nasty flare-ups.  For best flavor, rub the chicken with the seasonings the night before and let rest in the fridge.  I have also done this with a brined chicken which is extremely juicy and tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-05T16:24:36.56Z",
                "reviewBody": "This is incredible!  My 18\" Weber was too small, so I cooked it indoors at 350 for about 1-1 1/2 hours.  Also, I didn't have beer handy, so I used an empty Coke can that I filled half-way up with some wine & threw some garlic and basil leaves into the mix.  This is the best chicken ever - with the upright posture, the fat drains off and if you line the roasting pan with foil, cleanup is so easy. This is how we're making chicken from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GBM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T14:37:20.437Z",
                "reviewBody": "We've been doing this method for a while on a gas grill -and with superb results each time. We have tried garlic and herb spices lemon pepper BBQ blackening seasoning you name it we've tried it. Don't worry - beer isn't needed really. ANY liquid works and same goes for your taste of seasonings. Recently I tried using hickory chips to smoke the chicken. It was simply awesome. If you want a world class meal and one which will impress friends and family this is it. It's EASY and AWESOME. Best of all it's delicious and healthy! PERSONAL NOTE - the chicken thigh should be at 170 degrees when it's done...never hurts to rely on a visual check of the juices but temperature is important.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IROID",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/922549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-06T18:07:39.07Z",
                "reviewBody": "Ok it was different but just not to my taste. I did it twice to be sure I hadn't done it wrong the first time. I can get a crispy-skinned tastier chicken roasting it the traditional way. And have additional bonuses therefrom of tasty stuffings and great gravies. This was too much faffing around for me and I found it unecessarily messy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Swiss Phil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/swissphil-2010/"
                }
            }
        ]
    }
]