[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
                    "name": "Pork Rib Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/997/meat-and-poultry/pork/ribs/baby-back-ribs/",
                    "name": "Baby Back Ribs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14539/prize-winning-baby-back-ribs/",
        "name": "Prize Winning Baby Back Ribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F01%2F27%2FPrize-Winning-Baby-Back-Ribs-by-Alberta-Rose-402890_original-2000.jpg",
            "width": 2000,
            "height": 1328
        },
        "datePublished": "1999-09-09T17:27:45.000Z",
        "description": "A foolproof, simple recipe for the most tender, delectable ribs you've ever had. Follow the directions exactly, and success is guaranteed!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H5M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 tablespoon ground cumin",
            "1 tablespoon chili powder",
            "1 tablespoon paprika",
            "salt and pepper to taste",
            "3 pounds baby back pork ribs",
            "1 cup barbeque sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat a gas grill for high heat, or arrange charcoal briquettes on one side of the barbeque. Lightly oil the grate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small jar, combine cumin, chili powder, paprika, salt, and pepper. Close the lid, and shake to mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Trim the membrane sheath from the back of each rack. Run a small, sharp knife between the membrane and each rib, and snip off the membrane as much as possible. Sprinkle as much of the rub onto both sides of the ribs as desired. To prevent the ribs from becoming too dark and spicy, do not thoroughly rub the spices into the ribs. Store the unused portion of the spice mix for future use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place aluminum foil on lower rack to capture drippings and prevent flare-ups. Lay the ribs on the top rack of the grill (away from the coals, if you're using briquettes). Reduce gas heat to low, close lid, and leave undisturbed for 1 hour. Do not lift the lid at all.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush ribs with barbecue sauce, and grill an additional 5 minutes. Serve ribs as whole rack, or cut between each rib bone and pile individually on a platter.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Rib Recipes",
            "Baby Back Ribs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BONNIE Q."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.596879063719116,
            "ratingCount": 769,
            "itemReviewed": "Prize Winning Baby Back Ribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "440.6 calories",
            "carbohydrateContent": "16.9 g",
            "cholesterolContent": "117 mg",
            "fatContent": "30 g",
            "fiberContent": "1.2 g",
            "proteinContent": "24.6 g",
            "saturatedFatContent": "11 g",
            "servingSize": null,
            "sodiumContent": "581.8 mg",
            "sugarContent": "11.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-08-09T23:21:41Z",
                "reviewBody": "This is one of my favorite rib recipes. Last saturday I prepared these for a guest list of 40. I had three bbq's on the go. I did something different though. I added mesquite wood chips and let them smoke the whole time. Oh and a trick to removing the membrane: use a dry butter knife and scrap into the membrane at the small end of the back ribs..then take a piece of paper towel and grip that sucker and tug...should come off every time in one piece.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEREMYM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1156720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T19:34:47.7Z",
                "reviewBody": "This is the PERFECT spice mix, and the best way to season the meat. Trimming the membrane off is crucial, and actually not that hard to do with a flat boning knife if you insert it parallel to the rib and directly over it. Once you get the first few done, you can grab the membrane and just tear it off the rest. \r\n\r\nBut for the preparation, I prefer to SMOKE the ribs Southern-style on a Weber instead of doing them in the oven. The key to this is that you put all the coals in a pile on one side of the grill, then all the meat at the far opposite side. Add the soaked hickory chips and the seasoned meat (no sauce yet) and close the lid quickly, close down the top and bottom vents to about 1/4 open, and leave it that way for an hour. Then, add more soaked chips (adjust the vents if needed) and start basting the meat with the barbeque sauce once every 15 minutes for another hour. Close the lid as quickly as possible every time, as the chips will want to flare up and you want to try to avoid that. \r\n\r\nI've done this at least a dozen times now, and it comes out perfect every time, with the crunchy carmelized sauce on the edges and the meat very tender and juicy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISNELDER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/728844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-14T19:35:29.72Z",
                "reviewBody": "(1-29-06)This was my first time cooking baby back ribs and what a success! This recipe is very easy and very delicious! Don't be afraid it will fail you--it more than lives up to its five-star rating!  Here are my tips: We had close to 6 pounds of Costco baby backs--very meaty. The butter knife method of removing the membrane (described by another reviewer)worked perfectly. Thanks! I made double the dry-rub and took suggestions by other reviews to decrease the cumin (I used a little over 1T for the double batch and increased the chili powder accordingly) and rub the mixture into the meat a bit (2-14-07 update: take the recipe's caution about not rubbing it in too much seriously. I put too much on my last batch & it was overpowering). We followed the grilling instructions to a 'T'!  Our ribs were perfectly cooked in just under two hours.  Because we had double the amount of meat, I did peek after an hour and 20 minutes to see the progress.  Based on the recipe description, I could tell we needed more time.  We cooked them for about another 20 minutes (next time I won't have to peek!) then added the sauce. I made the sauce in Scott Hibb's Amazing Whisky Grilled Baby Back Ribs recipe \n(5 stars!).  After adding the sauce we grilled as instructed. DELICIOUS!  My husband, who claimed to not like baby back ribs, LOVED these. I loved these! My 6 and 3 year olds loved these. The cooking method, the rub and the sauce are winners! TRY THIS ONE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/219722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-04T23:42:53.633Z",
                "reviewBody": "This was my second time for this recipe and it rocks!  I used baby back ribs, about 6 lbs so I doubled the rub. I cut down the amount of cumin and added onion and garlic powder. They sat in the refrigerator with the rub on them for a day and a half. I slow cooked them in the oven at 300 degrees for 2-1/2 hours then grilled last 15 minutes with BBQ sauce.  They were the best, fell right off the bone. Look out Tony Romas! Mmmmmmmmmmmmm - the best !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Williams Diaz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/639928/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T22:42:31.163Z",
                "reviewBody": "This recipe is *soooo* good!  I have been on the lookout for a good rib rub recipe and this is it!  We can't always bbq were we live, so I cook my ribs at 175 degrees farenheit for appx. 6 or 7 hours.  Yes, slow cooking in the oven.  Don't boil them first!  Never do that!  Just rub them, let them slow cook while you're going about your business.   Then in the last 15 minutes, remove your ribs from the oven, up the heat to 450, slather on a good bbq sauce and let them cook another 10 minutes then serve.   These are downright succulent.  Oh and thank you JEREMYM for your fantastic tip on how to remove the membrane!  Such a helpful tip!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole F.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4687480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-01T22:57:46.91Z",
                "reviewBody": "The rub was ok, although I did add oregano and thyme.  But an hour is not nearly what grill masters have in mind when they say ribs should be grilled \"low and slow.\"  Hubs was right - one hour was not long enough for these to be \"fall off the bone tender,\" so at that point I turned it over to his expertise.  There should be nothing quick about barbecued ribs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T19:34:47.31Z",
                "reviewBody": "Oh my goodness these are WONDERFUL. We have made them 5 times now and I must say they are foolproof. They key is you must follow the instructions EXACTLY. Each step is important and the key to these is to shimmy the membrane in between each rib. I had never thought to do that before and I believe that is what makes these ribs so tender and flavorful. My husband is very picky about his ribs he even dislikes Tony Roma's ribs but these he gobbles up and wants to make them all the time. We also add garlic powder and kosher salt to the rub for a little extra flavor. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHIMMERCHK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T19:34:43.81Z",
                "reviewBody": "I must say I was a little skeptical, as I've married into a family of Texans and have heard stories of all the steps a proper rib cookout should entail - well, these were really great!  I actually just used an inexpensive, store-bought (gasp!) BBQ sauce, but next time I'll plan ahead and make some of Bubba's Best BBQ Sauce (here on allrecipes.com) and really knock 'em dead.  Great ribs!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T10:42:26.403Z",
                "reviewBody": "This made a memorable picnic for our family today.  Because of a time constraint,yesterday morning, I baked them covered in the oven at 375 for 2 hours with the dry rub. Then before lunch today my husband finished them with the sauce on the grill.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSYKEW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/840162/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Prize Winning Baby Back Ribs",
            "description": "Spice-rubbed ribs slow-cooked over indirect heat.",
            "uploadDate": "2013-12-20T19:38:01.541Z",
            "duration": "PT2M40.452S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F226bbdbc-e317-429c-a42b-08d7b9a5ab92%2F8492811e-3ece-4d50-a249-9864e2079261%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2955908964001"
        }
    }
]