[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/200/meat-and-poultry/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
                    "name": "Steaks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1023/meat-and-poultry/beef/steaks/flank-steak/",
                    "name": "Flank Steak Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14684/slow-cooker-london-broil/",
        "name": "Slow Cooker London Broil",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9150011.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-10-06T14:14:47.000Z",
        "description": "The steak is cooked with condensed tomato soup mixed with cream of mushroom soup. Dry onion soup mix is sprinkled over the top. Easy by any standard.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT10H0M",
        "totalTime": "P0DT10H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds flank steak",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (10.75 ounce) can  condensed tomato soup",
            "1 (1 ounce) package dry onion soup mix"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place meat in the bottom of the slow cooker; if necessary, slice meat to make it fit!\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together mushroom and tomato soup. Pour mixture over beef. Sprinkle dry onion soup mix over top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on Low for 8 to 10 hours.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Beef",
            "Steaks",
            "Flank Steak Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MERRI C"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.23992133726647,
            "ratingCount": 1017,
            "itemReviewed": "Slow Cooker London Broil",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "198.2 calories",
            "carbohydrateContent": "9.8 g",
            "cholesterolContent": "35.7 mg",
            "fatContent": "11.1 g",
            "fiberContent": "0.4 g",
            "proteinContent": "14.9 g",
            "saturatedFatContent": "4.1 g",
            "servingSize": null,
            "sodiumContent": "801.1 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-23T14:33:01.877Z",
                "reviewBody": "My family loved this.  I love the rich flavor the tomato soup adds.  Here's what I did the second time to make it perfect:\n-Used London Broil, not flank steak.\n-Add 1 tbl worcestershire\n-Add 1 tbl red wine vinegar\n-Mix all 3 soups together first.\n-Added some carrots and potatoes - To keep them from changing the flavor of the sauce and soaking most of it up, I place the veggies in some aluminum foil, fold the sides up to make a little boat and sit on top of the meat - I read this trick in a cooking magazine.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kendal N.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657548/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-18T01:06:57.78Z",
                "reviewBody": "I had a cut of london broil in my freezer, and I have been eyeing this recipe for some time. Grilling the meat was out of the question since it is February and the dead of winter here. And that is the only way I have ever made london broil. I was attracted to this recipe because of the different ingredients used.  So I figured I'd give this a try. \nI used low sodium tomato soup and low fat cream of mushroom soup, 2 splashes of Worcester sauce, 1 splash of wine as reviewers suggested. Also added only 1/3 of the onion soup mix and sliced baby portabellas, a chopped onion and carrots. \nThe appearance, texture and aroma was not appetizing. My husband came in after it had been on for 7 hours and said \"gee usually when I come home and your cooking it smells so GOOD what happened\"? Yikes!\nI made mashed potatos as so many others suggested to serve this with and reluctantly we dug in. It was EXCELLENT. Wow. We were both so impressed and decided to add this to our regular rotation. The meat comes out very much like pot roast with a steak flavor, and the gravy, no matter what you think about it as it's cooking, it comes out so flavorful and tasty you will be tempted to just dunk some bread in it. \nGreat recipe, and I recommend listen to others here and reducing the sodium content, adding veggies, it still is excellent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sueasinsue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2289641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-13T17:56:00.827Z",
                "reviewBody": "First of all I need to thank you for the easiest, tastiest crockpot dish ever.  I actually planned to make it exactly as written but realized I opened a can of cream of chicken soup instead of cream of mushroom soup by accident.  I then just mixed the soups and dry onion soup mix together and poured it over the london broil, turned the meat a few times to coat it, turned the crockpot on low and ran out the door for work.  I planned to be home in 8 hours or so, but got stuck at the office and didn't get home for 11 hours.  I thought I was going to have a mess and no dinner.  Instead I was greated to the most melt in your mouth london broil ever.  The gravy was fabulous!  Next time I will double the gravy so I can have leftover!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DRUMNWRITE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T21:09:29.763Z",
                "reviewBody": "I used a frozen top round roast and followed all the directions exactly.  It just fell apart when I took it out...it was delicious.  I will definitely try using other cream soups, as many have recommended, since I know now that the meat comes out just like we like it.  I am so glad that I finally tried this recipe and did not listen to the few bad reviews that it received. Let's get it straight, London Broil is a Cooking Method - NOT a cut of beef!! It is usually either Top Round Steak (or Top Round Roast) or Flank Steak. \r\n\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHINCHEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/147211/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-18T17:48:25.267Z",
                "reviewBody": "FANTASTICALLY EASY!  Seriously this is the ONLY recipe that truly takes 5 minutes of prep time.  I mean, how long does it take to open up a couple cans of soup and a soup packet?  Anyway, I've made this several times using a top sirloin roast and it always comes out tender and falling apart.  I cook it on low for 10 hours and I flip the roast over once during cooking.  This helps get that dry soup mix into the gravy, others suggest mixing it into the soup first.  After making it the first time exactly as the recipe states, I double the canned soup-but not the dry-so there will be extra gravy.  I made this for my sister and brother in law and they couldn't believe it was a top sirloin roast (which tends to be a little tough).  They loved it.  It not only tastes delicious but it is the quickest dinner you will ever make!  Love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LC23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-01T03:08:56.373Z",
                "reviewBody": "This was by far one of the best recipes I have ever gotten off this site.  I put some ground black pepper on the meat, laid some quartered potatoes on top of it, and then poured the soups over it.. About an hour before it was finished, I added about a half a bag of broccoli/cauliflower/carrot combo veggies.  I can't even express how delicious this was.  I definitely don't get the few poor reviews this one has gotten, unless it has something to do with the cut of meat.  Thanks for a recipe I'll surely use many many times over!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nichole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/yankeerose/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-29T22:13:12.577Z",
                "reviewBody": "I am fairly new at cooking considering I have only been consistently cooking meals for the past two years. I am still considered a \"newlywed\" and have a 1-year-old. It's often times hard to find a quick easy recipe that doesn't break the bank with a million ingredients. My husband is getting very tired of having chicken so much so I have recently started buying more \"inexpensive\" cuts of red meat. The first time I tried this I did not have tomato soup (about the only time that's never been in the cupboard!) so I used tomato paste instead and used NY strip steak that I wanted to get rid of. It came out okay but it wasn't what I hoped. I made it again with the tomato soup and regular flank steak as the recipe calls for and WOW! I think the best part is the gravy the two soups make to go over mashed potatoes! Wonderful! The meat is good too of course. We had relatives come over that night who commented on how great the room smelled too. Luckily they had eaten or I would have felt bad for eating such a yummy dinner in front of them! My only complaint is how the recipe says to sprinkle the soup mix on top. I think it should be mixed in as others have said. I might try adding some Worsch. sauce and some chopped onions to give it a little kick. It's a tad on the salty side but the potatoes really even it out. What makes it so salty is the onion soup mix so I only use 1/3 the package. A fantastic recipe that is always on my grocery list now! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren Bedell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1719387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-30T20:20:25.46Z",
                "reviewBody": "All I can say is YUM YUM! I added fresh mushrooms worcestershire sauce black pepper fresh garlic and chives. And I seasoned the meat with steak seasoning before putting it in the slow cooker. I cooked it for ten hours and it was melt-in-the-mouth tender. No need for knives. I served it with potatoes and green beans and hubby loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOPPEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/712960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-10T21:18:08.23Z",
                "reviewBody": "Very good. I put in my flank steak partially frozen and cooked it on low 8 hours; also used low sodium mushroom and tomato soup. Will make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CSANDST1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/115553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-08T22:05:30.497Z",
                "reviewBody": "Omigosh! With all those good reviews, I thought how could this go wrong, but there must be a BIG difference between \"London Broil\" and \"flank steak\" cuts of meat. This recipe using London Broil was dry, tough and stringy - even though I followed the directions to a \"T\". My friend's mom, a veteran cook, said this type of receipe would be best using a flank steak, which has some fat in it. She said a London Broil should only be ... marinated and broiled. Beware!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "IRIS T.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/424656/"
                }
            }
        ]
    }
]