[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/677/main-dish/pork/pork-roast/",
                    "name": "Pork Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14708/pork-roast-with-thyme/",
        "name": "Pork Roast with Thyme",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F775316.jpg",
            "width": 2848,
            "height": 2136
        },
        "datePublished": "1999-09-30T18:29:41.000Z",
        "description": "This savory recipe is easy and delicious. It is my favorite recipe for cooking a pork roast. Serve with autumn apples and sweet potatoes.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "5 pounds pork roast, trimmed",
            "3 cloves garlic, sliced",
            "1 teaspoon salt",
            "½ tablespoon ground black pepper",
            "3 bay leaves",
            "½ cup cider vinegar",
            "1 teaspoon dried thyme"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a small knife, pierce top of roast. Force garlic slices into the cuts. Sprinkle the roast with salt and pepper. Place bay leaves in the bottom of the roasting pan, and set roast on top of bay leaves, fat side up. Mix vinegar and thyme in a small bowl, and pour over the top of the roast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven 3 hours, or until an internal temperature of 145 degrees F (63 degrees C) is reached. Using a baster or spoon, baste the drippings over the roast frequently while it is cooking. Let the roast rest for 10 minutes when done before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Teresa C. Rouzer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.45,
            "ratingCount": 360,
            "itemReviewed": "Pork Roast with Thyme",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "197.8 calories",
            "carbohydrateContent": "0.6 g",
            "cholesterolContent": "66.1 mg",
            "fatContent": "11.2 g",
            "fiberContent": "0.1 g",
            "proteinContent": "21.8 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "246.7 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-13T00:01:00.2Z",
                "reviewBody": "OK, EVERYBODY, LISTEN UP!  If your complaint is that the meat was TOO DRY, then you need to get out your meat thermometer and USE IT!  The #1 reason that pork is \"dry\" is that you have overcooked it!  Pork should be done to an internal temperative of 160 degrees.  There should be a touch of pink to it.  Sorry, some of you are from the old school of NO PINK IN PORK, but that is just simply not true.  This was an absolutely DELICIOUS recipe.  My teenage son came up from the rec room to inquire what that AMAZING SMELL was!  We ALL loved it!  I'll be making this again and again!  Only substitution I made was using white wine vinegar as I did not have apple cider vinegar on hand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ginny Maziarka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1391210/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-03T02:06:54.64Z",
                "reviewBody": "This is an AWESOME recipe and the way I made it will probably be the only way I make a pork roast from now on.  I used about a 3 pound pork loin roast and the first thing I did was make a mixture of\r\n1 1/2 Tblsp. fresh rosemary, 1 tsp. garlic salt, 1/2 tsp. dried thyme, and 1/4 tsp. freshly ground black pepper and put that along with the roast in a plastic bag, shaking it up to coat the roast with the mixture and let in sit in the refrigerator for about an hour or so.  After taking it out again I continued on with this recipe just as written and did also add about a tsp. of caraway, as one other reviewer suggested.  I put it in a smaller pan so that the juices wouldn't evaporate as quickly and when it was done we used the juices as au jus.  IT WAS WONDERFUL!  Great flavor, very moist and tender.  I think the vinegar helps with that.  I served oven roasted vegetables from this website with this, butternut squash, and apple crisp for dessert.  It was a very memorable meal that everyone enjoyed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHARMICHEAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1378939/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-19T21:44:40.14Z",
                "reviewBody": "Great recipe. I do mine in a crock pot on low for about 6-7 hours. It turns out great...and the drippings make a great base for a nice gravy. A great way to do a pork roast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1195763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T09:36:07.217Z",
                "reviewBody": "Great recipe. This was the first time I've made a pork roast. I used fresh thyme and added more cider vinegar as it evaporated during cooking. During the last hour of cooking I added chopped potato onion and carrots tossed with a small amount of olive oil garlic salt ground black pepper and balsalmic vinegar to the roasting pan. I also added some chopped green and red bell peppers zucchini and yellow squash to the veggie mixture the last 20 minutes. Served with cranberries green tossed salad and crusty bread. The roast was quite juicy and had great flavor. Wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TJESBC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/389446/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-11T14:46:51.89Z",
                "reviewBody": "I loved this recipe. My husband is very picky eater and generally does not like pork. A friend gave me a loin roast so I was searching for a creative way to fix it. I used balsamic because that was what I had on hand at the time. It was heavenly!!! My 9 year old also loved it. He poured some of the juices over his mashed potatoes and raved about those also. Will definitely fix again...as a matter of fact, I have one in the oven right now. I would recommend monitoring the doneness because it got done faster than the recipe said.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TVLY4ME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-09T22:11:04.903Z",
                "reviewBody": "Very good and the deal about smell in kitchen I don't get. I had no problem but I'm a man and we're not supposed to smell as well as women! Anyway the main thing about this recipe is the cooking time. I used a 5 lb boneless pork loin and it was at 170 degrees after 2 hrs! So start watching it at around 2 hours. I hadn't yet put the sourkraut around it yet so had to take the roast out and just bake it by it's self. I also used a great cranberry sauce to spoon over the servings. Take 1 can cranberry sauce plus 1/2 cup brown sugar and 1 cup orange juice and heat on stove until desolved and spoon over meat. Very good. Time to go I am now hungry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WELSH5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/768028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-12T10:03:27.703Z",
                "reviewBody": "Very moist and tasty. A few changes:  I used    1/4 cup balsamic vinegar in place of cider vinegar and added 1 can of beef broth to the mix.  I sprinkled the roast with meat tenderizer and granulated garlic in additon to the salt and pepper and garlic cloves. I added 4 peeled and cut potatoes and 3 carrots during the last hour of cooking. Total cooking time was 3 1/2 hours for a 5 lb. roast.  The sauce made an excellent gravy. My husband is a great cook, and rated this recipe 5 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Adams Perez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1588342/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-21T05:22:33.13Z",
                "reviewBody": "Best ever! I felt like I was eating at a 5-star resturant! This is one to keep and cherish - I will serve this the next time I have company. I added a little sage and some caraway seeds to the rub omitted the salt (hubby can't have any) and doubled the amount of bay leaves. It was to die for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CELERY13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032529/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T18:58:45.293Z",
                "reviewBody": "This is unbelievable.  I am always looking for an easy pork recipe, and this fills the bill.  I upt the thyme a little and used a small 8X8 brownie pan.  The juices didn't burn up in the pan.  The vinegar smell lasts for a short time, and gives way to delicious smells.  I can't say enough about this recipe.  I use so many complex recipes with lots of ingredients.  This was a great change of pace.  I served the loin with spaetzle.  They soaked up the au jus.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFERC1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/221657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T16:15:27.383Z",
                "reviewBody": "I did not like this at all. It was very bland and it took much less time to cook than the recipe called for. I usually love pork recipes that call for stuffing the meat with garlic but this one was not a hit at my dinner table.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ewheat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1843309/"
                }
            }
        ]
    }
]