[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15852/appetizers-and-snacks/meat-and-poultry/meatball-appetizers/",
                    "name": "Meatball Appetizer Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14810/cocktail-meatballs-i/",
        "name": "Cocktail Meatballs I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1114968.jpg",
            "width": 1550,
            "height": 1033
        },
        "datePublished": "1999-11-03T21:34:28.000Z",
        "description": "Simple meatballs with an unusual chili sauce/grape jelly coating. Quite a combination of tastes and textures. Note: After cooking, I like to keep the meatballs warm in a slow cooker until ready to serve.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "16 meatballs",
        "recipeIngredient": [
            "1 pound ground beef",
            "½ cup dried bread crumbs",
            "⅓ cup chopped onion",
            "¼ cup milk",
            "1 egg",
            "1 teaspoon salt",
            "½ teaspoon Worcestershire sauce",
            "⅛ teaspoon ground black pepper",
            "¼ cup shortening",
            "12 fluid ounces tomato-based chili sauce",
            "1 ¼ cups grape jelly"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine ground beef, bread crumbs, onion, milk, egg, salt, Worcestershire sauce, and ground black pepper. Mix together, and shape into meatballs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat shortening over medium heat. Add meatballs, and cook until browned, about 5 to 7 minutes. Remove from skillet, and drain on paper towels.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add chili sauce and jelly to skillet; heat, stirring, until jelly is melted. Return meatballs to skillet, and stir until coated. Reduce heat to low.  Simmer, uncovered, for 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Meat and Poultry",
            "Meatball Appetizer Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jennie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.56145251396648,
            "ratingCount": 358,
            "itemReviewed": "Cocktail Meatballs I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "457.9 calories",
            "carbohydrateContent": "52.5 g",
            "cholesterolContent": "72.1 mg",
            "fatContent": "22.8 g",
            "fiberContent": "1.1 g",
            "proteinContent": "12.7 g",
            "saturatedFatContent": "8.1 g",
            "servingSize": null,
            "sodiumContent": "1038.4 mg",
            "sugarContent": "38.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-12T15:03:11.043Z",
                "reviewBody": "The only way I can give this four stars is after MAJOR changes to this recipe. First, a teaspoon of salt is unnecessary, I left it out entirely (Worcestershire is salty enough). I also left out the onion and just sprinkled in some onion powder. Also, fry ground beef in shortening? I don't think so. I used ground sirloin and cooked them in the oven. I greased a cookie sheet and baked the meatballs at 375 for 10-15 minutes, turning once. I then added the chili sauce, grape jelly and meatballs to my slow cooker and let them heat up.The combo of chili sauce and grape jelly is excellent, once the flavors combined and the sauce thickened this was an excellent snack. Great crowd pleaser.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "amydoll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T03:15:18.88Z",
                "reviewBody": "This is soo easy!!  I cheat though and use frozen meatballs, put them in a crockpot w/the chili sauce and grape jelly and just let them heat in the crock pot on low.  Really nice snack. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy Curtis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/362853/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-31T17:38:22.043Z",
                "reviewBody": "Wonderfully tangy meatballs.  I bake (rather than fry) the meatballs on a cookie sheet up to 2 weeks ahead of time and freeze them.  On the day I am serving them, I dump the chili sauce and grape jelly in a crock pot.  Then, add the meatballs straight from the freezer.  If you do this, you will need to start the crock pot on HIGH setting at least 1 1/2 hours before eating.  Ready to eat when liquid is simmering.  These go quickly!!!!  (You may substitute pre-packaged frozen meatballs to save on time).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGNOLIAWENCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/661345/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T18:33:07.257Z",
                "reviewBody": "I would never have tried such a strange combo if not for all the positive ratings but I'm sure glad I did! We made these for our Christmas party and everyone loved them - even me and I'm not a beef person at all! I used 2 lbs of frozen plain meatballs and found that the recipe uses exactly 1 small jar (I think 10 oz) of jelly and 1 jar (12 oz) of chili sauce. How could it get any easier? And definitely let them sit in the crock pot for a while - the longer they sit the more the sauce soaks in and adds to the flavor and texture. And don't forget that veggie meatballs work great with this too for a much healthier treat. Thanks for this fantastic recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Magill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/477960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-13T19:38:02.87Z",
                "reviewBody": "I gave this recipe 4 stars since the meatballs, (minus the sauce) were excellent. However, the sauce was way too sweet, not at all spicy, and left something to be desired. After some tweaking, I was able to make this an excellent appetizer that got great reviews! First, I baked the meatballs rather than frying them.  I mixed the original ingredients for the sauce, added a few dashes of Frank's Hot Sauce, one clove of minced garlic, powdered mustard, and 1 1/2Tbs Worcestier sauce. I poured the sauce mixture into the crock pot with the cooked meatballs and cooked on high for 1 to 1 1/2 hours. They were tasty and party perfect! I am excited to make them this way again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GourmetShea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1735212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-18T18:57:37.047Z",
                "reviewBody": "This is the same recipe I've been using for the past couple years! However, I don't use shortening and like another reviewer, I bake mine on a greased cookie sheet at 350 for about 30 minutes turning halfway. Also, instead of cooking the sauce on the stovetop, I use my slowcooker. Blend both sauces and then add the meatballs and cook on high for 2-3 hrs or low for 5 hrs. I've made this recipe many many times and there's NEVER any leftovers. Great for potlucks because you can bring your crock and keep them on the warm setting - just make sure not to overcook them - they burn easily if you overcook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OHIOMOM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/922638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-08T02:44:40.67Z",
                "reviewBody": "I just use the Costco frozen Italian style beef meatballs. I add a bit of mustard and worcestershire sauce to the sauce about 1-1/2 tbsp each and some ground pepper. Always the first thing to get finished at the office potlucks. People are amazed at the easiness of the recipe once they wrap their heads around the idea of heated grape jelly glaze. It is so awesome that I always have to set aside a small batch for the hubby to eat for dinner with brown rice....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNTHIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T03:14:17.367Z",
                "reviewBody": "I have used this \"secret\" recipe for years and it always gets rave reviews.  It is the most requested dish at family gatherings.  I always start with a big bag of frozen meatballs from whatever warehouse type store we belong to at the moment.  Throw them in the crockpot frozen, dump the jars in and about 1-1 1/2 hrs later it is ready to eat.  Never a disappointment.  I also like them reheated...Yum...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANEDF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/748603/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T06:01:02.357Z",
                "reviewBody": "Excellent Excellent Excellent!! I cannot tell you how good these were! I took them to a christmas party last night and I got tuns of compliments on them. I loved them myself. My mouth is watering just thinking about them. I only had about 9 meatballs left in my pot when it was all said and done and the only reason for that is because there was so much other foods there. I put them in the crock pot but did so too late so to speed things up I put the sauce and the meatballs(frozen homestyle) into a pot on the stove and slow boiled them for about 30 minutes and then put them in the crock pot to take to the party. They were perfect great taste and great texture! Don't try the sauce when you first put them it because its gross but when everything cooks together its wonderful. Take my word for it TRY THIS RECIPE!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SINGINGPRAISES25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/672590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-25T23:54:39.26Z",
                "reviewBody": "I used frozen meatballs from Sam's Club and made the sauce as written exactly. The meatballs were too sweet and the flavors didn't blend well. I used brand name Grape Jelly & brand named chili sauce. The Grape overpowered the chili sauce. Will not make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DMPLAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1080728/"
                }
            }
        ]
    }
]