[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17158/desserts/chocolate/milk-chocolate/",
                    "name": "Milk Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14995/chocolate-covered-orange-balls/",
        "name": "Chocolate Covered Orange Balls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1072136.jpg",
            "width": 1632,
            "height": 1224
        },
        "datePublished": "2000-01-24T23:16:07.000Z",
        "description": "A friend gave me this recipe at a cookie exchange party in 1981. I won a 2nd place in a cookie contest with this recipe. It's a GREAT holiday cookie!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 pound confectioners' sugar",
            "1 (12 ounce) package vanilla wafers, crushed",
            "1 cup chopped walnuts",
            "¼ pound butter",
            "1 (6 ounce) can frozen orange juice concentrate, thawed",
            "1 ½ pounds milk chocolate, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the confectioners sugar, vanilla wafers, walnuts, butter and orange juice. Mix well and shape into 1 inch round balls; allow to dry for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chocolate chips in top of double boiler. Stir frequently over medium heat until melted.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip balls into melted chocolate and place in decorative paper cups.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "Milk Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Vickie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.112676056338028,
            "ratingCount": 71,
            "itemReviewed": "Chocolate Covered Orange Balls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "495.4 calories",
            "carbohydrateContent": "66.3 g",
            "cholesterolContent": "22.3 mg",
            "fatContent": "24.2 g",
            "fiberContent": "2.2 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "10.7 g",
            "servingSize": null,
            "sodiumContent": "124.1 mg",
            "sugarContent": "48.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-12-10T20:12:47.2Z",
                "reviewBody": "These were very good.  At first I had a difficult time coating the balls with chocolate.  I offer the following suggestions:  1.  I used a 12 oz. bag of semi-sweet chocolate chips and melted them in a double-boiler.  2.  When the chocolate was almost melted, I added 3 Tbsp. of shortening and stirred until it was fully melted. (Doing this helps the chocolate set-up firm and dry, and you don't taste it a bit.  3.  I dropped the cookies into the melted chocolate mixture.  4.  I used a fork to roll them over gently.  5.  I slid a fork under the cookies to lift them out, tapping off excess chocolate gently into the pot of chocolate.  6.  Finally, I used a toothpick to slide the cookie off the fork onto a sheet of waxed paper.  It was really easy to do, and the cookies looked gorgeous and tasted great!  I also followed another reviewer's suggestion, and melted white chocolate chips, which I died orange with food coloring, and piped the colored cholate on to the top of the cookie.  It really did look like something you would buy at a candy store.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROBYNLEIGH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1021856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-16T20:06:42.883Z",
                "reviewBody": "Ok, I just made these, and this is the suggestion I have to appease those cooks who say the mix is too sweet. It started out as my mess up, to which I added too much orange juice, as my can was a 12 oz. can, and it calls for a 6 oz. can. Instead of doubling the rest of the recipe, and more sugar, I added a box of precrushed graham cracker crumbs until my mixture dried out and was easier to handle. I also bought mini paper cups and before rolling out 3 dozen cookie balls that didn't fit the \"1/2\" ball, I measured against my paper cups, so they were just a little smaller than ping pong balls. Now, that adjusts the sweetness and size issue some folks had. As for the dipping just follow the other cooks and use a fork or a skewer to get them dipped and add a little shortening or oil to the chocolate. I adorned mine with little sprinkles I bought that were snowflakes. How cute they are. And the mix isn't too sweet at all, in fact it has inspired me to do more with canned orange juice! Thanks Vicki!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CoastieCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2207882/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-06T01:05:05.903Z",
                "reviewBody": "WOW! These were so delicious. Unlike another reviewer, I thought the orange flavor was very subtle and not overpowering. Here are some things to consider for ensuring the least mess and the most efficient way to cover with chocolate: line a large jelly roll pan with parchment or waxed paper;transfer melted chocolate to a plate or shallow dish; push a 5in bamboo skewer (get them several to a pkg at the market) down thru the top of the ball;place a good size amount of melted chocolate on a rubber or metal spatula; use a combination of rolling and patting action to coate the ball;place coated ball onto prepared jelly roll pan to chill; If you're a perfectionist, you may want to dab the hole made by the skewer with a dab of chocolate. Next time I make these I will cut the sugar to 3/4lb and add about 1/2t salt to cut the sweetness a bit. I made the balls approx 1/2-3/4\" round rather than an inch for ease of handling and eating.Judging by the moistness, I will probably let them \"set up\" in a 175 degree oven for a half hour or so. Most people would probably find this recipe perfect as is, but I am striving to make a similar product that is less messy to eat, especially when serving them for the holidays or to guests.These are very rich and delicious so keep serving size in mind.Thanks Vicki.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-20T23:09:36.717Z",
                "reviewBody": "To make the chocolate coat easier add a tablespoon or two of vegetable oil to the chocolate mixture. The first year I made these I nearly pulled all of my hair out while trying to coat these. The oil makes it much easier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MYMONKEYTOES03",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1294531/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-25T13:41:41.13Z",
                "reviewBody": "These were so good! My family loved them. The orange flavoring is just right in them. I made them a couple of weeks before Thanksgiving and they freeze wonderfully. They make alot more than 16 though!!! Please try these; you will not be disapointed!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHAWNSMOM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-24T04:27:32.217Z",
                "reviewBody": "These are very rich and delicious. I solved the chocolate dipping problem by using the kind of chocolate designed for dipping and coating rather than baking chips. Since they're so rich I suggest you roll the cookies small. Definitely more of a candy than a cookie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Socalreporter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/553685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-16T19:46:04.84Z",
                "reviewBody": "I was disappointed with these too. The orange taste is too strong like cheap candy and they were VERY hard to coat with the chocolate. They're too big for mini-cupcake liners and too small for regular ones so I ended up with a bunch of unattractive chocolate lumps crammed into the smaller liners. I'm a big fan of orange and chocolate candy but I couldn't even eat these.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Magill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/477960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-20T16:02:16.263Z",
                "reviewBody": "Absolutely wonderful! The orange taste is intense and yet natural- not like orange flavoring at all. These got rave reviews and were really simple to make. For all of those who had chocolate-dipping issues: drop the ball into the chocolate lift it out with a fork (but don't stab it!) and gently shake off excess. Then use a teaspoon to roll the ball off of the fork and on to your tray to harden. I only needed about 2/3 of the chocolate- but I drizzled the rest on a batch of biscotti...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENKENT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1025533/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-13T05:32:31.2Z",
                "reviewBody": "These were absolutely delicious! I bake anywhere from 15-20 different kinds of cookies every year for Christmas. Not only are they no bake but as mentioned in another review very addictive! I save some of these for myself! If you like the chocolate/orange combination - this is your cookie! They will become part of the \"regulars\" I make every year!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roz Blair",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/417785/"
                }
            }
        ]
    }
]