[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/109/appetizers-and-snacks/vegetable/",
                    "name": "Vegetable",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1118/appetizers-and-snacks/vegetable/mushrooms/",
                    "name": "Mushrooms",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14906/appetizers-and-snacks/vegetable/mushrooms/stuffed-mushrooms/",
                    "name": "Stuffed Mushroom Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15184/mouth-watering-stuffed-mushrooms/",
        "name": "Mouth-Watering Stuffed Mushrooms",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F22%2F15184-mouth-watering-stuffed-mushrooms-414837-alberta-rose.jpg",
            "width": 2000,
            "height": 1000
        },
        "datePublished": "1999-12-29T06:11:18.000Z",
        "description": "These delicious mushrooms taste just like restaurant-style stuffed mushrooms and are my guy's absolute favorite.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "12 large mushrooms",
        "recipeIngredient": [
            "12 whole fresh mushrooms",
            "1 tablespoon vegetable oil",
            "1 tablespoon minced garlic",
            "1 (8 ounce) package cream cheese, softened",
            "¼ cup grated Parmesan cheese",
            "¼ teaspoon ground black pepper",
            "¼ teaspoon onion powder",
            "¼ teaspoon ground cayenne pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray. Clean mushrooms with a damp paper towel.  Carefully break off stems.  Chop stems extremely fine, discarding tough end of stems.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium heat. Add garlic and chopped mushroom stems to the skillet. Fry until any moisture has disappeared, taking care not to burn garlic.  Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When garlic and mushroom mixture is no longer hot, stir in cream cheese, Parmesan cheese, black pepper, onion powder and cayenne pepper.  Mixture should be very thick. Using a little spoon, fill each mushroom cap with a generous amount of stuffing. Arrange the mushroom caps on prepared cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven, or until the mushrooms are piping hot and liquid starts to form under caps.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Vegetable",
            "Mushrooms",
            "Stuffed Mushroom Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Angie Gorkoff"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.625377643504532,
            "ratingCount": 4303,
            "itemReviewed": "Mouth-Watering Stuffed Mushrooms",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "87.8 calories",
            "carbohydrateContent": "1.5 g",
            "cholesterolContent": "22 mg",
            "fatContent": "8.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "81.8 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-07T23:28:07.687Z",
                "reviewBody": "I've made these many times and everyone loves them. They are not time consuming at all and can be made up two days before needed. Wash mushrooms and twist out stems. Drain in colander. Put mushroom caps on paper towels to drain well. Slice off woody part of stem and put in food processor. Pulse stems until minced. Add 1 Tlbs olive oil to pan and stir-fry minced stems and garlic (minced type from jar)until dry. Add spices. Slightly cool, but while still warm add  cheeses (and a can of drained crab if want). Put a plastic zip lock bag into a bowl and roll back sides- add cream cheese mixture. Snip off one corner and use as a pastry bag to fill mushrooms. If making ahead 1)use only freshest mushrooms you can find, 2)blot off excess water from mushrooms, 3)put them into a non-metalic dish. I sprinkle the tops with shreded (not grated )parmesan cheese. Cover well with plastic wrap and refrig. until ready to bake. (I've made up to two days in advance- without crabmeat though).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BUTTERB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/927796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T16:33:20.24Z",
                "reviewBody": "This is a favorite recipe that I have made several times and I never have any leftovers.  Even my young son loves the flavorfull filling. These are great to bring to get togethers.  I usually prepare the stuffing and put into a ziplock and assemble them when I arrive.  Just snip off the corner of the ziplock, fill the mushrooms like a pastry and pop in the oven. Adjustments I make are I add crabmeat to the mixture which I find adds a little more substance to an otherwise very creamy filling.  I like to sprinkle with parmesan cheese before putting them in the oven which adds a nice touch.  A trick I use is to use smaller mushrooms so there is a good balance between mushroom and the amount of filling.  I tried larger ones one time and it almost seemed like each bite was just a bit too full of creamy mixture.  I also lightly butter the mushrooms before baking which keeps them from drying out.  Last trick is I bake them in mini muffin tin pans.  They hold the smaller mushrooms perfectly and the pans keep the mushrooms from tipping over and rolling around.  The cayenne pepper gives just the perfect amount of kick to this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1239094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-31T21:35:29.217Z",
                "reviewBody": "Great! A little time consuming, but worth it. I, too, added some chopped green onion while sauteeing and lightly brushed outside of mushrooms with melted butter laced with Ital. crumbs. Made almost 3 doz. reg. mushrooms! TIP: slice off bottem a little so they don't roll over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOXYLOXY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/781799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-16T18:18:17.557Z",
                "reviewBody": "Wow, these are ever so good exactly as written!!!  For my family's personal preference, I added the following....  16 oz of ground sausage, increased the Parmesan to 1/2 cup and the garlic to 1.5 tbsp, and then rolled the top of the stuffed mushrooms in the Parmesan cheese and Italian seasoned Panko bread crumbs prior to baking.  Created a great little crunch with wonderful oozy goodness underneath.  Absolutely divine!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-27T10:22:51.503Z",
                "reviewBody": "I made for Christmas dinner appetizer and they were YUMMY! But i also read a lot of the reviews and took some of the advice (and left some). I rated accordingly since i changed it a bit. I used 12 large mushrooms (caps about 2\" wide) as the recipe called for as well as the the whole pkg of cream cheese and it was just right. Next time, though, I will use bite size smaller mushrooms but double the amount of mushrooms to make it easier to eat as a appetizer. Used olive oil instead of vegetable oil and  added to the original ingredients for the filling: 2 stalks green onions (minced and cooked with the garlic and mushroom stems), a bit more parmesan (used fresh grated parmesano reggiano), a bit of garlic powder, 1 crisp, crumbled bacon and about a cup of cooked dungeoness crab. I dunked the mushroom caps in melted butter & lemon before filling, sprinkled with more parmesan and baked in a mini muffin pan. (Beware: if the mushrooms don't fit all the way into the muffin pan, they will come out shaped like muffins! It is kind of cute though.) Cooked for 20 mins and they came out beautifully! Everyone loved them! The parmesan topping gave it that extra crunch too! And love the heat the Cayenne leaves after you eat it. Will make (my new revised recipe again!) Thanks!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T23:34:18.59Z",
                "reviewBody": "This was my first time making stuffed mushrooms and after reading several of the reviews I decided on how I would make mine. The full amount of cream cheese was enough for 24 mushrooms and I placed a bit of chopped proscuitto in the bottom of each mushroom before placing the cheese mixture on top (which was wonderful). I then sprinkled garlic and herb bread crumbs over them and drizzled melted butter over all. Baked for only 15 minutes and broiled for the last 5. They were wonderful. I plan on making these when my Mom and Grandmom come to visit in the fall. Thanks a bunch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/542399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-28T22:47:36.403Z",
                "reviewBody": "Excellent recipe.  I doubled the filling and used 24 oz fresh mushrooms and it filled them almost perfectly.  I also added  a dash of Worcestershire sauce while cooking the stems and 1/3 cup of crumbled bacon to the cream cheese mixture.  Just before baking, I sprinkled with breadcrumbs and dipped the mushroom caps in melted butter so that they wouldn't dry out.  I brought to Thanksgiving as an appetizer and they went in minutes.  Everyone loved the bite that the cayenne pepper added.  Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Delahunt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1414295/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-08T19:36:57.75Z",
                "reviewBody": "I have made these many times, and they always disappear so fast!  What a great recipe.  I put the stuffing into a ziploc bag with a corner cut off and squeeze it into the caps, it's less messy.  Thanks for sharing such a great treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARDUCCI78",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/882139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T19:29:41.483Z",
                "reviewBody": "Very good recipe! My husband gave it 2 thumbs up, which is HUGE. I followed some other reviewers' suggestions and added 1/4 cup or seasoned breadcrumbs, and cut the cream cheese to about 2/3 what the recipe called for. I also used 2 10oz pkgs of white mushrooms, or about double what the recipe specified. I'm sure adding crabmeat would've made it even better, but i don't think it needs it... i kept the recipe cheap, quick, and easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erika Parker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512761/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Mouth-Watering Stuffed Mushrooms",
            "description": "See how easy it is to make sensational stuffed mushrooms.",
            "uploadDate": "2012-04-04T03:59:48.949Z",
            "duration": "PT3M21.024S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7571f19a-80cf-40ec-89b3-ed0ba90ebe86%2F22636686-4b4b-4ac1-9349-4b6bd76be5be%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1545906477001"
        }
    }
]