[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14723/soups-stews-and-chili/soup/chicken-soup/chicken-and-dumplings/",
                    "name": "Chicken and Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15867/chicken-and-dumplings-iii/",
        "name": "Chicken and Dumplings III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5842463.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2000-02-06T19:03:39.000Z",
        "description": "My mom used to make this recipe for us growing up. Now I make it for my family and they all love it! It's simple yet delicious! Enjoy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 boneless chicken thighs",
            "2 (10.75 ounce) cans  condensed cream of celery soup",
            "salt and pepper to taste",
            "1 (12 ounce) package refrigerated biscuit dough"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large pot over high heat, combine the chicken with enough water to cover, and boil for 15 to 20 minutes. Drain some of the water from the pot, reserving 3 cups in the pot. Remove chicken and allow it to cool, then pull it apart into bite size pieces; return to pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce heat to medium, and add the cans of condensed soup. Season with salt and pepper. Pull the biscuit dough into pieces, and add to the soup. Simmer over medium heat for 7 to 8 minutes, or until the dough is cooked through.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes",
            "Chicken and Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Melissa"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.541966426858513,
            "ratingCount": 1251,
            "itemReviewed": "Chicken and Dumplings III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "376.4 calories",
            "carbohydrateContent": "31.4 g",
            "cholesterolContent": "68.4 mg",
            "fatContent": "18.3 g",
            "fiberContent": "1 g",
            "proteinContent": "20.8 g",
            "saturatedFatContent": "4.8 g",
            "servingSize": null,
            "sodiumContent": "1377 mg",
            "sugarContent": "5.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-21T00:04:46.01Z",
                "reviewBody": "im only 13 and i could make this all by my self so it was really easy. i made some revisions to the recipe though such as, i changed the soup to creme of chicken and i also added another can of it to make 3. i also added a can of chicken broth instead of the 3 cups of water but then it was very chickeney so i added 1/2 a can of water. but for the briskets i added a lot more than lot called for and rolled them into balls before dropping them in. i dont know if you will like my changes but my parents said it was really good:)\n\n-molly...if you like the revisions maybe you could add a review because i want to be a cook one day....thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "molly :)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2865544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T01:52:26.21Z",
                "reviewBody": "GREAT basic recipe! I modified it a bit (like everyone else) as follows: Sauteed 1/8 c chopped onion and 1 lg. garlic clove (chopped) in 1 TBL butter before adding chicken.  I used chicken tenderloin and covered it with 2 cans chicken broth.  Did not drain any broth when chicken was done.  Added 1 c cream of chicken, 1 c cream of mushroom and 1 can cream of celery soup and 1/2 box frozen peas and carrots.  I used two cans of Pillsbury buttermilk biscuits and after sprinkling about 1 TBL of Wondra (very fine) flour on a paper plate, cut them into a tic-tac-toe pattern.  I dusted the dumplings with the flour on the plate and put 1/2 of them in the pot to cook (when it was boiling).  They took about 15 minutes.  After we had eaten all of the dumplings in the pot, I turned the heat back on, let it come to a boil again and cooked the remaining dumplings for the leftovers.  Without the dumplings crowding into each other, they plumped nicely, didn't stick together and there were plenty for the leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STELLAR7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/867625/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T07:30:21.77Z",
                "reviewBody": "This is the first time that I have made chicken and dumplings because I never wanted to go to the trouble. This is a great recipe and the previous listed suggestions that I used were: using 1 cup of broth and 2 cups water to cover chicken, adding sliced carrots, chopped celery and onion, 2 smashed garlic cloves (which I later removed). I used Chardonnay wine (had some in the frig). I used one can of non-grand, non-flaky refrigerator biscuits - tearing off thumb sized pieces and flattening them slightly between my thumb and forefinger as I threw them into the pot.\r\nMy husband loved it and for me it was a one dish meal with compliments - and no left overs. Can't get better than that!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "R. J. Nequette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rjnequette/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-13T00:01:45.98Z",
                "reviewBody": "My husband asked me to make his favorite dish, chicken & dumplings...which in 17 years I had never made, I'm a yankee, and the whole idea of raw dough boiled in soup didn't appeal to me, but being a cool rainy day today, I decided to treat him...Thanks to this EXCELLENT recipe, I am now a total convert! :)\nI read more than half the reviews, and made these changes, used one can cream of chicken soup and one of cream of celery, used 1 1/2 lbs boneless skinless chicken breasts, used 5 cups of water with 5 cubes low-sodium chicken bouillion, added a teaspoon of tarragon and used the bisquick dumplings too...it was SO GOOD!!! My husband and 2 1/2 year old daughter both had 2 big bowls apiece!\nThank you Melissa for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mare",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1474923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-31T23:15:59.14Z",
                "reviewBody": "Yum!  By the time I served this, the recipe listed here was a mere spec of what I ended up with, but it is a perfect foundation to do with whatever you want!  Here's what I did, some of it per other reviews, and some of it on my own.  I simmered the chicken in chicken broth mixed with water and chicken bullion cubes.  To the broth I added parsley, cracked peppercorn, minced onion, four or five bay leaves and a pinch of garlic powder.  I used a can of cream of celery soup and a can of cream of chicken soup.  I added diced canned potatoes, fresh carrots and celery, fresh minced garlic, frozen peas a little more onion and more pepper.  I made my own biscuits using biscuit mix and milk.  To the dough I added basil, parsley and a pinch of pepper.  IT WAS SO YUMMY that my 11-year old announced that she could eat it every day for the rest of her life!!!  Hubby and other daughter loved it too!  Definitely cook the biscuits longer...I cooked mine for 10 minutes with the lid and 10 minutes without the lid!  You can't screw this up!  Give it a try...I bet your gang will love it too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen R Boots",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677494/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-18T02:00:43.777Z",
                "reviewBody": "I made this and FOLLOWED THE RECIPE EXACTLY so I could taste it then decide what I would want to do with it if anything. AS IS THIS WAS EASY AND VERY YUMMY! My husband AND teenagers LOVED it! Since making it I too have added carrots more chicken etc.. BUT THIS IS A GREAT AS IS RECIPE!!! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "4everLuuvd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2390924/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-12T22:07:14.703Z",
                "reviewBody": "I made this recipe for my daughter and she loved it so much that it has become a staple in her house. She makes it at least once a week. I use 4 to 6 very large chicken thighs (skinless & boneless simmered them in 1 waxed carton of chicken broth. I cut up carrots celery & onion and a touch of garlic then sprinked in pepper. When the carrots were almost done I added a can of cream of celery and cream of chicken soup and stirred it well to blend. Then I added the refrigerator biscuits. I tore them in half but my daughter simply put them on whole without tearing them into pieces. Then I put a lid on it and simmered it for at least a half hour. It was sooooooooooo good. Simple & easy. A winning recipe thank you for sharing. We have this dish often because it's tasty and quick and easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Norma June Penny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-04T20:00:58.827Z",
                "reviewBody": "Followed a lot of the suggested modifications and a few of my own. I'm sure it's good as the recipe is written and definitely easy....but a few quick changes made it incredible to me! Instead of cooking the chicken in plain water I added chicken broth carrots onions celery 2 cloves crushed garlic and white wine. It smelled heavenly while it was cooking! I pulled out the crushed garlic but used most of this cooking liquid veggies and all--delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LLIGETT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/632128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-03T04:29:31.123Z",
                "reviewBody": "A great recipe!! i've been trying to duplicate the chicken and dumplings that my mother used to make when i was little. i know this is not the recipe but it's MUCH MUCH easier than doing it all from scratch and it's just as good!! i followed some of the reviews and cooked the chicken in chicken broth not water with onions and some garilc. i also didn't have cream of celery soup so i used cream of chicken and mushroom and made dumplings according to the Bisquick box beacuse i didn't have and biscuit dough...it all worked GREAT. my husband even had leftovers the same night i made this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALIXOXO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460008/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-27T07:43:01.23Z",
                "reviewBody": "Quick easy and yummy. It was also very simple. I tweaked the recipe a little and added a couple dashes of minced onions and used 3 good-sized chicken breasts instead of the called for thighs. Turned out great! Good job Melissa.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RogueOnion8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185024/"
                }
            }
        ]
    }
]