[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/200/meat-and-poultry/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
                    "name": "Steaks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1024/meat-and-poultry/beef/steaks/filet-mignon/",
                    "name": "Filet Mignon Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15901/lovers-beef-burgundy-filet/",
        "name": "Lover's Beef Burgundy Filet",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6886966.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2000-02-12T22:07:05.000Z",
        "description": "One must be very careful who this is prepared for. Like a magic love potion, it brings out the lover in ANYone. Through trial and error, I learned very quickly not to prepare this for a mere 'casual date' UNLESS you want that 'casual date' to become 'more'....",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT6H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 cups Burgundy wine",
            "1 ½ cups canola oil",
            "1 ½ cups soy sauce",
            "2 cups oyster sauce",
            "1 tablespoon garlic, minced",
            "1 ½ teaspoons dried oregano",
            "8 (6 ounce) fillets filet mignon",
            "½ cup butter, softened",
            "1 teaspoon Burgundy wine",
            "1 tablespoon minced shallots",
            "1 tablespoon minced green onions",
            "1 teaspoon ground white pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, mix together Burgundy wine, canola oil, soy sauce, oyster sauce, garlic and oregano. Bring to a boil, and then remove from heat. Place in the refrigerator 1 hour, or until chilled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place filet mignon filets in a 9x13 inch baking dish, and pour the chilled marinade over them. Cover tightly with foil, and refrigerate for a minimum of 5 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream butter and 1 teaspoon of Burgundy wine with a hand mixer. Mix in shallots, green onions and white pepper by hand; cover tightly, and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for high heat, and lightly oil grate. Preheat oven to 200 degrees F (95 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grill marinated filets to desired doneness, turning once. Place filets in a clean 9x13 inch baking dish. Dollop with the Burgundy butter mixture, and place in the preheated oven for a minute, or until butter is melted.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Beef",
            "Steaks",
            "Filet Mignon Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ttinkerbel"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.573863636363637,
            "ratingCount": 176,
            "itemReviewed": "Lover's Beef Burgundy Filet",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "882.9 calories",
            "carbohydrateContent": "8 g",
            "cholesterolContent": "116.1 mg",
            "fatContent": "73.8 g",
            "fiberContent": "0.7 g",
            "proteinContent": "28.9 g",
            "saturatedFatContent": "18.3 g",
            "servingSize": null,
            "sodiumContent": "3289.7 mg",
            "sugarContent": "2.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-03T15:12:42.843Z",
                "reviewBody": "Absolutely incredible!  This is the BEST steak I have ever had.  I made this for a romantic meal for my husband and myself with garlic mashed potatoes and steamed broccoli.  He (ever the meat-and-potatoes man) was in heaven.\n\nBabs--oyster sauce is a thick, brown sauce that would either be in the condiment or Asian food section of your grocery (I had to ask for help finding it in my mid-sized grocery, but they had it.)  'Dynasty' was the name of the brand I found.  You can also get it online.\n\n(3/3/2006) I'm still making, and LOVING, this recipe, and I just wanted to add--the marinade freezes beautifully, so I make the full batch of marinade and freeze half of it (as I've never made it for 8 people).  Also, my latest addition to the meal is putting sliced baby Portobellos in the marinade (just dip them and then take them out, the marinade soaks in QUICKLY) after I remove the steaks.  Saute them with a little marinade until tender and serve on top or on the side of the filets.  Heavenly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda Moyle Reynolds",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-07T14:10:14.233Z",
                "reviewBody": "This recipe was awesome!! The meat was so tender it was like cutting through butter. I was only planning on eating half of my steak but their was no way I could stop eating until their was nothing left:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Esmee Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/esmee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-26T06:21:06.763Z",
                "reviewBody": "Completely over the top for steak house flavor! I followed the recipe to the \"T\" and BBQ'd the steaks to med-rare. The ONLY thing I changed was that I didn't want to purchase a shallot for the final butter mixture so I just used all green onion. I will also add that I made extra on the butter/wine/green onion and served it to be spread on French bread. This was positively sensational and I disagree with it being a lot of extra work. It was a snap to prepare. I served it with garlic mashed potatoes a green salad the French bread and of course... the left over Burgundy wine! Everyone raved and I was pleased beyond words! It did make quite a bit of marinade sauce but that will be fun trying it out on different cuts of meat and the George Foreman grill. Yummmmmmmmmmmmm!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dung Beetle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/287898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-30T00:00:59.357Z",
                "reviewBody": "Incredible! This was an excellent recipe. My only comment is that I wish the person who listed the recipe would have indicated whether it's red or white burgundy wine. Also in the supermarket I could only find oyster \"flavored\" sauce which was in the oriental aisle. I'm not sure whether this was the correct product it was very thick. I used the red burgundy and this oyster \"flavored\" sauce and it turned out fabulous. So I assume that I guessed right with the wine and sauce. I would recommend using a little less canola oil for the sauce because it really doesn't seem that necessary. And I didn't use the grill but rather broiled the fillets. I highly recommend everyone try this recipe the flavors are incredible. We had the fillets with frozen shoestring fries. The sauce over the fries was excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VISTICAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/582604/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-14T20:51:13.72Z",
                "reviewBody": "I made this last night and it was delicious. I could kick myself for not taking a picture though. I followed the recipe almost exactly except we didn't have any charcoal so we put the tenderloins in the oven on broil (approx 500 degrees) for about 7 minutes on each side. I let them rest for another 10 minutes before dolloping the butter on and placing them in the 200 degree oven. They came out perfect -pink inside but not too pink. (The tenderloins I used were approximately an inch thick) My husband and daughter both loved this recipe. I served the steak with garlic mashed potatos and steamed asparagus. I will make this recipe again but next time I promise to take a picture. Thanks Penelope Holmes for a fabulous recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SavvyTech",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/savvytech/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-21T17:29:30.213Z",
                "reviewBody": "I'm obsessed with the steak. To die for... My only change is the way you cook the filets- which I learned from a chef here in town. Just sear on a stove top grill pan and then place in a baking dish and cover with foil and cook for about 8-10 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bluefox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1766607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-16T19:21:47.17Z",
                "reviewBody": "The marinade has an unusual flavor due to the oyster sauce which is very good; the steak comes out very flavorful.  I like oyster sauce very much (used extensively in Chinese cooking) however it does contain MSG so be forewarned as many people must avoid MSG added to food.  My husband really enjoys this.  I would recommend scaling the recipe way down if only making 2 or 4 steaks as it yields a whole lot of liquid.  I also think the added butter/wine topping for serving, while adding a very rich buttery sauce, can be easily ommitted.  To cool the liquid down faster, I put it in the freezer for a short time, and I also don't marinade longer than an hour or two max as I find the flavor becomes too strong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "WANDA L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/259995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-21T23:16:10.013Z",
                "reviewBody": "Very good I overmarinated it the first time and left the filets in overnight and they absorbed too much of the wine and didn't taste like steak at all anymore. I've since used it on several different cuts of steak and marinated it only 5 hours and they turned out terrific. Family requests it now and even my picky 8 year old loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARARNMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1193574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-07T05:36:55.343Z",
                "reviewBody": "I would have rated this a one- or two-star recipe, but my husband liked it enough to rate it as a four, so I'm averaging our ratings.  I marinated the beef for the five hours the recipe called for, and the taste was entirely too strong for me -- it masked the beef taste entirely.  My husband, who likes steak sauce, likened it to beef with the steak sauce built in.  If I ever decided to make this again, I'd marinate it for only an hour or two.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Antalya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/350136/"
                }
            }
        ]
    }
]