[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16096/pioneer-potato-candy/",
        "name": "Pioneer Potato Candy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5914.jpg",
            "width": 1787,
            "height": 1326
        },
        "datePublished": "1999-12-29T02:33:06.000Z",
        "description": "The main ingredients for this old fashioned candy are mashed potato and confectioners' sugar. Salted peanuts can be substituted for shredded coconut for a different taste.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "1 pound semisweet chocolate, chopped",
            "1 cup mashed cooked potatoes",
            "½ teaspoon salt",
            "2 teaspoons vanilla extract",
            "2 pounds confectioners' sugar",
            "⅔ cup shredded coconut"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a mixing bowl, combine the potato, salt and vanilla. Sift the confectioners sugar over potato, stirring and adding about 1 cup at a time. Mixture will liquefy when first sugar is added then gradually begin to thicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When it becomes the consistency of stiff dough, knead it even though not all the sugar has been added.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After kneading, cover with a damp cloth and chill until a small spoonful can be rolled into a ball.  Shape in small 1/2 inch balls. Dip balls in melted chocolate then roll in peanuts or coconut.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DEBEHOO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9473684210526314,
            "ratingCount": 19,
            "itemReviewed": "Pioneer Potato Candy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "516.4 calories",
            "carbohydrateContent": "102 g",
            "cholesterolContent": "0.3 mg",
            "fatContent": "13.3 g",
            "fiberContent": "3.3 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "7.8 g",
            "servingSize": null,
            "sodiumContent": "162.3 mg",
            "sugarContent": "94.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-27T00:06:50.53Z",
                "reviewBody": "I had never heard of potato candy. This recipe came up when I was looking for a potato salad recipe and since it was close to christmas I decided to try it. I am glad I did.  It was so good. I have no idea why another reviewer said it wasn't good. Mine came out perfect. I followed the recipe for the dough exactly the way it is printed. It does liquify at first but by the end of adding all the sugar it is a nice dough. One suggestions would be to microwave or bake the potato instead of boiling them.  It keeps the potato drier so you don't have to add extra sugar. Also I started with 8 oz of chocolate and figured if I need more I could add it as I went, but that was enough for me.  I rolled them into balls and dunked the bottom half in chocolate. It was easier and less messy that way. Then I rolled them in crushed peanuts, mini chips, coconut, and crushed pepperment.  Then I set them white side down on wax paper. The toppings you can use is endless. We liked the peanuts the best. Also instead of using vanilla you could add any flavor of extract you like or some rum or brandy.  I will be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A cook in Houston",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1463678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T21:16:36.39Z",
                "reviewBody": "For years we have been enjoying this candy but we call this candy \"Fried Oysters\". My mother-in-law is getting up in years and decided that this Christmas she wouldn't be making her candy. I questioned her about how to make it and then checked with \"all recipes.com\" to compare. Its the same ingredients and is just as good if not better than what we've had for years. I've made this twice this Christmas. The second time I used my mixer to blend in the powdered sugar. It saved time & energy. After it was mixed I put in the frig for 2 hours. Next I used my small cookie scoop for even amounts and rolled into balls. I put these back into the frig so they would firm up. This made dipping much easier. I used 1 1/2 lb. of dipping chocolate 22 oz. Spanish peanuts (chopped fine in my food processor). Makes approximately 5 1/2 dozen. Note: Don't salt the water when boiling the potatoes or your candy will be too salty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Morupe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/919683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T07:23:57.53Z",
                "reviewBody": "I am a professional chef and I must say that I have not tasted anything as terrible as this candy. I have used other potato candy recipes in the past with great success.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DIMETHIOS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/709036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-30T17:47:56.187Z",
                "reviewBody": "another way to do it is to make the potato part of the candy into a big ball and roll it out flat. Then spread peanut butter over it and roll up. Cut into slices that look like spirals.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JJ3803",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1270106/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-11T16:30:18.717Z",
                "reviewBody": "My mom made this candy for us kids every holiday, and special occasions. It may sound terrible-potatoes and chocolate, but it is so good. Mom used to also put peanut butter in at times which is very very good, and often would leave off the coconut if she didn't have any. It was still yummy. As another member suggested, making in a log and then slicing is how mom made it, much less time consuming and that is how i do it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Connie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/909032/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-19T04:46:42.39Z",
                "reviewBody": "An old boyfriend's mother use to make potato candy. I loved it she gave me the recipe years ago but had lost it. This is almost identical. Thanks. Everyone at work loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VANILLA_SPARKY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/90230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-30T18:12:12.783Z",
                "reviewBody": "Well I should have expected these would be sweet and they were:(... but not willing to waste any ingredients on this experiment the girls and I added several different things to salvage into a very addictive confection. Here's the list... 1/2 cup more potato. At least 2/3 cup cocoa (the \"dark\" Hershey cocoa was phenomenal in this). 1 tsp. instant coffee granules undissolved; and per another recipe an extra 1/2 tsp. salt. Then we added flaked and chopped sweetened coconut to taste right into the bowl. We did not dip but immediately rolled in coconut or cocoa. The pioneers would not recognize this but we liked it!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "joy-of-jesus-smileymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2217912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-29T17:09:32.66Z",
                "reviewBody": "A lady at our church made this candy years ago and I thought it was so good..Glad I could find the recipe! I did find you had to add more sugar than the recipe called for..You just keep slowly adding sugar in small increments until the dough gets so stiff you're not able to easily stir it then cover and chill..Then I dusted my surface and dough with powdered sugar rolled it out & divided the dough into four sections to make it easier to work with..Then section by section I spread peanut butter on the dough rolled it up and made the roll very thin(much like you did with playdough when you were little making skinny 'wiggly' worms..lol)..Cut into small pieces and..yum!..enjoy...Overall a great recipe but makes ALOT of candy..I'm going to half it next time..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LuvDeeMocha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3478631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-02T16:19:24.64Z",
                "reviewBody": "Thank you SO much for this recipe. I have been making ths candy from the time I've been on my own. Originally I used my mother's recipe but over the years (she passed away when I was 7 years old in 1956) the handwritten recipe has gotten sort of \"messed up\". This one is just the same...DELICIOUS!!! Every time I make this I am suddenly thinking I've done something wrong when first adding the powdered sugar it truly liquifies but turns into a very special treat. Thanks again for this one. I can't imagine why one of the reviewers didn't like it???",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SULEO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1288959/"
                }
            }
        ]
    }
]