[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1014/meat-and-poultry/pork/tenderloin/",
                    "name": "Pork Tenderloin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16362/burgundy-pork-tenderloin/",
        "name": "Burgundy Pork Tenderloin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F220538.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2000-01-04T16:01:06.000Z",
        "description": "My husband doesn't care for pork much, but he loves this. It is very easy to fix, and it is very rich tasting. Serve with baked potato.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 pounds pork tenderloin",
            "½ teaspoon salt",
            "½ teaspoon ground black pepper",
            "½ teaspoon garlic powder",
            "½ onion, thinly sliced",
            "1 stalk celery, chopped",
            "2 cups red wine",
            "1 (.75 ounce) packet dry brown gravy mix"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pork in a 9x13 inch baking dish, and sprinkle meat with salt, pepper and garlic powder. Top with onion and celery, and pour wine over all.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When done baking, remove meat from baking dish, and place on a serving platter. Pour gravy mix into baking dish with wine and cooking juices, and stir until thickened. Slice meat, and cover with the gravy.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Tenderloin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BROWNDOG"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.336506159014558,
            "ratingCount": 1786,
            "itemReviewed": "Burgundy Pork Tenderloin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "399.8 calories",
            "carbohydrateContent": "8.2 g",
            "cholesterolContent": "147.6 mg",
            "fatContent": "8.6 g",
            "fiberContent": "0.6 g",
            "proteinContent": "47.8 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "676.3 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-04-25T21:20:33.747Z",
                "reviewBody": "This recipe is great, and making it is about as easy as falling off a log. You need to know some things though, so yours will turn out wonderfully, like mine does every time i make this recipe. \r\nFirst of all, the pork should be relatively pink when it is done. This is due to the fact that it was swimming in Burgundy Red Wine. Be sure to use a meat thermometer and bring the temp to 160, and if any of your guests complains that they think they are going to get trichanosis, politely ask them to leave and go to applebees where they process and overcook everything. \r\nNext, I am not sure how this recipe was called Burgundy Pork Tenderloin and it calls for red wine. Be sure to use BURGUNDY red wine, as the title suggests. The fun thing about burgundy is that there is no such thing as an expensive burgundy wine. It is usuall near the mogen david and other cheap wines. Don't bother changing the Bbrown gravy amount. Also, the first time I made this I thought I would be smart and braise the roast first to make it more tender. The next time I made it I just threw all the ingredient into the pan as the recipe suggests and it came out way better. It takes about five minutes to construct this recipe and it is the best I have ever found. \r\nHave fun!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chefjudge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/685932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T16:23:13.967Z",
                "reviewBody": "This is my all time favorite recipe.  I've been making it for the past two years now and figured it's about time that I finally rate it.  I've learned to omit the onions and the celery as they really don't improve the taste beyond the seasonings.  Also, this means that I don't have to strain out the onion and celery from the wine before making the gravy, I can just take the loin out to rest on a cutting board and put the pan right on top of the stove with the wine still in it to make the gravy. I use two packages of gravy mix as I serve this with quartered red potatoes tossed with butter and parsley and baked alongside the pork (which the gravy goes well with) and with the PAN-FRIED ASPARAGUS (Recipe on the site).  It's wonderful.  You must try if you haven't already.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A277387",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/399489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-28T05:18:15.817Z",
                "reviewBody": "This was EXCEPTIONAL, make no mistake - it's great. But make sure to use fresh (not previously frozen) tenderloin. I had 4 tenderloins (3lbs) which I marinated for 1 hour in a ¼ cup of olive oil and ½ cup of white wine, combined with one small bunch of chopped green onions, and 2 small peeled anneheim peppers (chopped), 5 cloves of crushed garlic, and a fair bit of fresh ground pepper (approx. 3tbs). \n\nAfter tranfering the meat and marinade to the roasting dish, I covered everything with 2 cups of freshly sliced small brown mushrooms, 2 cups of red wine (Valpolicella), and one cup of beef broth.\n\nI turned the meat after 25 minutes and stuck a thermometer into one of the larger pieces and waited until the temp got to 155°F. I removed them immediately (the real issue with this is, don't over cook). I covered the meat with foil and let sit while I transfered everything that was remaining into a sauce pan and made the gravy. I used a little flour and some beef soup mix. When the gravy was done, I sliced the tenderloins into ½ inch thick slices and served with fresh garden beans and mashed red potatoes (skin left on and seasoned to taste). \n\nThe gravy and the tenderloin were to die for. Enjoy!\n\nJust one more thing. Make sure to serve on warm plates so that you can take your time to enjoy this fabulous dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dubdub",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1039894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T19:55:58.72Z",
                "reviewBody": "OUCH, way to much wine....  Reduced the wine by 1 cup and subbed low sodium beef broth the second time around.  Used fresh minced garlic vs powder and seared the pork prior to baking as it makes a much better presentation when finished.  Added baby brown bella mushrooms to the pork while baking and used 2 packages of pork gravy mix.  One tip I'd like to share:  Smaller tenderloins are easier to cook and monitor to prevent dryness ~ some pink in the middle of pork is fine unlike the old wives tales we have all heard for years....   Very tasty dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-31T00:06:03.42Z",
                "reviewBody": "I am only 13 and am an aspiring chef, so I try to cook for my parents and sister (they are kind of like my recipe guinea pigs) my sister is also an EXTREMELY picky eater, and even she loved it, so far I haven’t found one person who didn’t like it. I would definitely recommend this recipe to anyone.\r\n\r\nP.S. make more red wine mix than advised and make with mashed potatoes, the gravy wine mixture is great with mashed potatoes.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHIGANFAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/763402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-15T14:11:48.17Z",
                "reviewBody": "WOW!!!!!!!! I hesitated on this recipe because it sounded WAY TOO EASY to be that wonderful, but I was wrong. This is a definite keeper, I added portebella mushrooms and I seared the meat in a TB of olive oil and butter to give it a nice color, I found it was perfectly cooked in 45 min be sure to use a meat thermoter and do not over cook!! when it reaches 165 degrees take out and wrap in foil while making the gravy I used 2 cups of Merlot wine and got nervous it might be to much wine taste and added 1/2 CUP WATER so I did use 2 pkgs of Mccormick brown gravy and it was PERFECT a great recipe to impress guests or make for a large crowd, even my husband who really doesn't like pork thought it was FABULOUS my brother in law kept telling me what an awsome dinner rates 10 stars thank you for sharing!!!! I also used 2 1 lb tenderloins that is probably where some of you have had issues with evaporation because larger ones would take longer to cook, try using several small ones",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Perri Pender",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/perripender/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-11T22:14:27.31Z",
                "reviewBody": "I read all of the reviews before making this and never having made a pork tenderloin before was ready and willing to make any and all changes that other reviewers had suggested.  We like meat braised in wine and I did not change that at all.  You don't need an \"expensive\" red wine - I used a \"2 Buck Chuck\" Merlot from Trader Joes that is fine enough to drink as well.   I did sear the pork first because I was fearful of a pale white piece of meat and I was glad I did ( the meat is not red if you sear it first by the way) - the meat was so tender - don't be afraid of a quick hot sear on both sides after seasoning - maybe 2 minutes top each side.  I sauteed some onions ( thinly sliced ) just because this recipe was so fast and I had time so I threw them in the pan with the pork for a little extra zip --  if I had mushrooms in the house I would have done that too -- next time I will.  I doubled the gravy mix because we are gravy people too.  This was OUT OF THIS WORLD !!!!!!!!!!!!!!  Stock up the freezer when these babies are on sale - it's a no brainer - the quickest after work dinner I have made in a year  !!!!!!!!!!  Thank you Kathleen - this is a keeper in this house !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HIGGMED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/844218/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-24T22:49:30.373Z",
                "reviewBody": "This is very good one thing I ALWAYS do with any cut of meat I intend to roast in the oven is to brown it first on the stove otherwise the meat has a very light and unappealing color. Add salt pepper garlic salt to the pork brown all sides in oil or butter or both. Transfer to the baking pan with the wine/broth mixture. I do agree that you must cut the wine down and add beef broth. I can see why some people said it tasted to strongly of wine this will help that problem. For an added touch saute mushrooms in the pan you browned the pork in then pour over the finished dish. Very tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LisaMB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/691632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T16:18:12.687Z",
                "reviewBody": "My guests loved this recipe. It really helps to read the reviews before cooking. I seared the meat first used 1c burgundy wine and 1c beef broth deleted the celery added mushrooms chopped the onions added 2pks of pork gravy mix to the wine sauce and put the sauce in a pan and brought it to a boil. It thickened beautifully.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHELLY M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/920340/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Burgundy Pork Tenderloin",
            "description": "An easy but elegant pork roast cooked in a rich red wine sauce.",
            "uploadDate": "2013-01-04T19:30:58.244Z",
            "duration": "PT2M53.548S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fcc73a778-87ef-45b4-90bd-66a5dbd2f11d%2Fca59f9d1-e4ea-41a6-8ed7-403e3ce57308%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2073253412001"
        }
    }
]