[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
                    "name": "Pork Rib Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/996/meat-and-poultry/pork/ribs/country-style-ribs/",
                    "name": "Country-Style Ribs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16448/simple-bbq-ribs/",
        "name": "Simple BBQ Ribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9037614.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-10-23T03:55:32.000Z",
        "description": "Country-style ribs are cut from the loin, one of the leanest areas of pork. These ribs are seasoned, boiled until tender, then baked with your favorite barbeque sauce. That's it! Back to simplicity, back to the country life. Sigh.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 ½ pounds country style pork ribs",
            "1 tablespoon garlic powder",
            "1 teaspoon ground black pepper",
            "2 tablespoons salt",
            "1 cup barbeque sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place ribs in a large pot with enough water to cover. Season with garlic powder, black pepper and salt. Bring water to a boil, and cook ribs until tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove ribs from pot, and place them in a 9x13 inch baking dish. Pour barbeque sauce over ribs. Cover dish with aluminum foil, and bake in the preheated oven for 1 to 1 1/2 hours, or until internal temperature of pork has reached 160 degrees F (70 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Rib Recipes",
            "Country-Style Ribs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LLOYD RUSHING"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.778378378378378,
            "ratingCount": 1850,
            "itemReviewed": "Simple BBQ Ribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "440.5 calories",
            "carbohydrateContent": "24.5 g",
            "cholesterolContent": "127.7 mg",
            "fatContent": "22.2 g",
            "fiberContent": "0.7 g",
            "proteinContent": "33.3 g",
            "saturatedFatContent": "7.8 g",
            "servingSize": null,
            "sodiumContent": "4260.3 mg",
            "sugarContent": "16.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-01T16:17:05.437Z",
                "reviewBody": "UPDATE:  I've started straining the cooking liquid and boiling potoates in it for either boiled or chunky mashed potatoes.  I haven't done it yet but I think I'll try using the liqued to boil rice.  \n\nI have been boiling ribs and chicken like this for years and years.  I always add a generous amount of garlic powder, ground pepper and 1 onion cut into wedges.  My secret ingredient is to add a good amount of soy sauce 1/2-1 C approx.  Boil for 45 mins-1 hour.  Turn off heat, cover pan and let ribs marinate in the broth for several hours (I have let them sit for 4-5 hours).  Great to put in the oven especially during the winter months, but best on the grill.  If you want to make ahead put cooled ribs into plastic bag and add enough BBQ sauce to coat well.  Refrigerate until ready to use and then cook with additional sauce.  Try this with chicken--you will love it.  Just reduce the boiling time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cyn Coriell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-18T21:02:28.513Z",
                "reviewBody": "I was always too intimidated to attempt making ribs. All I can say is WOW! They were so easy to make... I DID modify the cooking time: I boiled for only 1 hour and then cooked in the oven for only an hour as well. I wanted the meat tender but not falling completely off the bone as you picked it up, so I cut down on the cooking time (the meat still falling off the bone, but only while you were eating them, not while you were handling them). I also used pork baby back ribs, if that helps any of you... When boiling, I added salt and pepper, garlic and onion powder, and adobo seasoning. I did use a lot of seasoning, too (probably a teaspoon of each if not more - I used a big lobster pot to boil them in). I took some reviewers recommendations and I used the Sweet Baby Ray's BBQ sauce. They have 3 or 4 different flavors, and instead of picking just one, I chose 3 different kinds and mixed them together: spicy, honey BBQ, and regular. Buy one bottle of sauce per rack of ribs you make, and buy one extra bottle as well! Some here basted theirs many times - I found that I only needed to do that twice. I cooked them in the oven for 30 mins, flipped them, recoated with sauce, and cooked another 30 minutes. And, I did all of this the night before a party. The day of the party, I separated all the ribs and cooked them for an additional 15 minutes on the BBQ... They were UNBELIEVABLE. I hope this info helps!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEADMEISTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/429477/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T15:13:31.45Z",
                "reviewBody": "These ribs were just wonderful.  I boiled them for about 45 minutes.  I also followed the advice of others and put more BBQ sauce on the tops about 20 minutes before I took them out of the oven.  A note to others...this only makes 4 SMALL portions/about 4 ribs each.  I think everyone was left wanting more and not quite full. The ribs did come out incredibly tender and falling off the bone!  I will definitely make again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NICOLE HELLER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/710651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T23:01:45.043Z",
                "reviewBody": "These deserve 100 stars! Recommended ALL the way.\r\nSo, I used boneless pork country style ribs, and they turned out very much like pulled pork. I boiled these with the seasoning for one hour. During that time I prepared my own BBQ Sauce (5 tbs ketchup, 5 tbs brown sugar, 2 tbs vinegar, 1 tbs lemon juice, 2 Worcestershire sauce, 1 teaspoon: salt, dry mustard powder and chili powder) After mixing it together and heating it up for a bit, I poured it over the ribs, and baked it for 1 & 1/2 hours. It makes them very sweet and juicy. I will make again and again! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MBCHEERS99",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/862474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-03T12:34:04.907Z",
                "reviewBody": "I found this recipe here 2-3 years ago...make it all of the time!  This is our favorite meal to take camping...complete 1st step at home a day or 2 before you go, boil in seasoned water, let cool a little, throw the pork in a ziplock or disposable Gladware, cover with bar-b-que sauce & freeze or refrigerate...throw them in your cooler, when you are ready to eat them, heat for about an hour in a disposable foil pan, covered tight with aluminum foil over a low fire...serve w/apple sauce, salad & dinner rolls-- eat great, even camping...no mess to clean up, just throw away the ziplock bag & foil pan!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "janemjett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1965055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-14T19:33:02.75Z",
                "reviewBody": "Very similar to my own rib recipe which is also 5 star!  To enhance the flavor, cover the meat in equal parts beef broth and water, add one bottle of a \"better\" bbq sauce, (using a cheap variety will only give a vinegar like flavor to the ribs) add 5 cloves of finely sliced garlic, two onions cut into 8 parts, top 1/3 of a head of celery to include the celery leaves, and 1/4 cup worcheshire sauce.  Turn off the stove after 1 hour on a low, slow boil and let sit for 1+ hours.  Take out and place on a cookie sheet and lightly coat them with additional sauce until you are ready to finish them on the grill.  Absolutely superb!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-26T16:53:28.297Z",
                "reviewBody": "WOWEE!!  I made these ribs last night for my boyfriend and I. He was in heaven!  He said, and I quote \" Honey, we are going to make ribs this way for the rest of our lives!\"  Yummy, tender juicy.  I took the foil off during the last 5 or 10 minutes put a bit more sauce on them, cause it does all slide off during cooking and then broiled them to get the edges just a little dark and crispy, and they did not dry out at all! Thanks Lloyd!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOOLBAIT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/608547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-14T23:45:00.827Z",
                "reviewBody": "We are rib-lovers and we go out for bbq ribs often, but this recipe is great for when we feel like staying in. It's so easy. I usually boil mine for 45 minutes before cooking them and they come out perfect every time. They really do fall off the bone. You do have to make sure to use a really thick bbq sauce - and use enough to completely cover the ribs. I love these ribs!! We've made them 5 times so far since finding the recipe a few months ago.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BACLARK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/708673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-09T10:42:42.38Z",
                "reviewBody": "Being from CA and marrying a TX man I' ve struggled in tuning into TX cusine. So when my husband asked me to cook something for his work potluck I wanted to hit it out of the ball park. After studying the reviews for a week I produced the \"Best F'in Ribs\" (Guys at DH's work)\nI purchased 2 slabs of pork spare ribs (6.5 lbs) from Sams club and asked the butcher to cut them into sections of 3 for me (free) \nI BOILED WATER FIRST in a large stock pot and layered the ribs inside then I added: 3 TBSP g. powder, 3 Tsp of Pepper, about a TBSP Worchester sauce, 1 cup soy sauce, and 5-6 dashs of liquid smoke. \nI boiled for 1 hr. Then shut off the heat and covered and let it sit in the liquid for 1 hr 45 min.\nI purchased a square roasting tray from the dollar store (easy clean up and didn't have to nag DH about bringing back any dishs). I layerd the ribs in the tray (meaty side up) and brushed generously with a cup of Cattlemans BBQ Sauce. Covered with foil and cooked for 45 mins. Took it out flipped the ribs (at this point its difficult since they're falling off the bone) and lathered with another cup of BBQ sauce. Covered and cooked for another 1/2 hr. Then I flipped them again added BBQ drippings from the tray and broiled for 6-8 mins on high to give it a charred look. Covered with foil and sent DH to work along with a roll of napkins. He works the midnight shift and by the next day the word had gotten around to to 2 other shifts of my \"F'in Good ribs\". I'm so proud of myself!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pchotrani",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4832879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-02T19:12:56.440Z",
                "reviewBody": "My ribs came out extremely dry and not tender at all... It didn't even fall apart...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "krufangl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684983/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Simple Barbeque Ribs",
            "description": "These tender, authentic ribs are boiled and baked, and so simple to make.",
            "uploadDate": "2012-06-21T01:11:04.638Z",
            "duration": "PT1M51.945S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fbf219d40-27d3-4630-9886-293785356c36%2F080e7027-e348-41ce-b610-34d99ae3fdb8%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1699409866001"
        }
    }
]