[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16773/gooey-butter-cookies/",
        "name": "Gooey Butter Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5585804.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2000-02-02T16:24:25.000Z",
        "description": "If you like Gooey Butter Cake you will love these cookies. You can't stop eating them.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H13M",
        "totalTime": "P0DT0H18M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "1 (8 ounce) package cream cheese",
            "½ cup butter, softened",
            "1 egg",
            "¼ teaspoon vanilla extract",
            "1 (18.25 ounce) package yellow cake mix",
            "¼ cup confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the cream cheese and butter. Stir in the egg and vanilla. Add cake mix, and stir until well blended. Roll into 1inch balls and roll the balls in the confectioners' sugar. Place 1 inch apart onto an ungreased  cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 to 13 minutes in the preheated oven. Remove from baking sheets to cool on wire racks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SOAP"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.605351170568562,
            "ratingCount": 598,
            "itemReviewed": "Gooey Butter Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "167.5 calories",
            "carbohydrateContent": "18.3 g",
            "cholesterolContent": "28.6 mg",
            "fatContent": "9.8 g",
            "fiberContent": "0.2 g",
            "proteinContent": "2 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "199.3 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-20T04:32:01.463Z",
                "reviewBody": "I have made these cookies several times and have tried several different cake mixes.  Each cake mix results in a different texture and flavor.  So it's important to know that the dough may not be easily workable, but if that is the case just make a bar cookie instead of the individual cookies.  The following cake mixes worked well: (just remember to refrigrate over night) -Lemon Cake Mix (nice dough)(use lemon extract instead of vanilla) and if you would like make a lemon glaze and drizzle over cookie when cooled.  (These got a lot of rave reviews when I made them). - Cherry Chip cake mix (nice dough) got rave reviews, devils food cake mix (sticky dough)good taste, german chocolate (nice dough), Carmel cake mix (forget it, very sticky dough- is workable to some degree you just wont get as many cookies. Next I want try carrot cake mix, strawberry cake mix, and spice cake mix.  \nI did discover that it's better to refrigrate over night and use a small cookie scoop,  My scoop is big so once I scoop a cookie out of the dough I cut it in half, roll it and then shake it in a baggy with powdered sugar.   In my oven 12 min. exact is the cooking time any longer these cookies get a crispy burnt bottom.\nI hope everyone enjoys trying these other cake mixes as well as my family, neighbors and friends have.\n:)\n(update)  Strawberry cake was pretty good.  But our newest favorite rave review cake choice is Orange. I just made lemon cookies and orange cookies for a church social and then again ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "deloreschl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1992052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-06T16:44:24.477Z",
                "reviewBody": "I suggest instead of using Yellow cake mix use Yellow Butter Cake Mix.  The yellow butter cake mix give the cookie a texture that closer resemble the gooey butter cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dawn1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2659732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-20T14:50:42.967Z",
                "reviewBody": "These cookies are incredibly delicious! I made them for a bake sale, and although they appeared kind of plain at first, once people tasted them, they came back for more! I cannot wait to try this recipe with different flavors of cake mix next time. If you are lucky enough to have any left, they taste even better a few hours after they come out of the oven. One warning, though: It may seem as though the baking time may be off, but DO NOT OVERBAKE. It is just about right. The cookies will continue to cook a bit once they are out of the oven. They are soft and just melt in your mouth. The last thing you want is a burned cookie. Definitely try this one. Mmm mmm good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MEMIAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/608272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-20T14:47:33.937Z",
                "reviewBody": "Folks just love these cookies. \"Like a little bit of heaven in your mouth\".  A few notes that would make this cookie dough easier to handle.\r\nOne dough is made, put in fridge for 2 hours or overnight.  This will make it easier to work with. \r\nAlso, when rolling the dough I will put a light spray of Pam or Mazola cooking spray on my hands which keeps it from sticking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SUZYJAX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/750109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-19T20:58:10.86Z",
                "reviewBody": "Some of my “finds” on this site are only as a result of my using the ingredient search for ideas when I have something in particular I need to use – in this case it was cream cheese.  If it wasn’t for that necessity I don’t know that I would have actively chosen this recipe, which in the end happily proved to be one of those “finds.”  The dough is difficult to work with because it’s sticky and mushy and gooey.  The cookie isn’t gooey, as its title describes, but the dough sure is.  If I wasn’t so impatient I would have chilled it until good and firm, but who knows – maybe it would have made this a different cookie.  I used a French Vanilla cake mix, the flavor of which I believe is far superior to either a white or yellow cake mix (but especially the yellow).  I had recently purchased raspberry baking tidbits from Amazon.com and knew this would be a good time to use them – I added just shy of a cup.  Because the dough was so soft it was kind of a pain to roll the little mush balls in the powdered sugar, and in hindsight I wouldn’t bother with that step because you couldn’t really see it on the finished cookie anyway. Needless to say, with a stick of butter and an 8-ounce package of cream cheese, these are very rich, soft cookies, but oh are they good, particularly, I think, because of the addition of the raspberry baking tidbits - not sure I’d like these just plain.  I think mini chocolate chips as well as any number of other additions would also work well in this cookie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-05T15:32:19.483Z",
                "reviewBody": "\"Best Chocolate Chip Cookie Ever\" - a direct quote from my boyfriend. These were super simple and super delicious. I sprinkled powdered sugar over half of the baked cookies and added chocolate chips to the other half. I highly recomend adding the chocolate chips. : ) \nDon't bother with refrigerating the dough and rolling it into balls. Just treat it as normal cookie dough and use a cookie scoop. This worked perfect for me. Super simple!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarajo614",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2149327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-05T22:47:42.857Z",
                "reviewBody": "These cookies are the best! You can subsitute a chocolate cake mix for a delicious chocolate version. My dad doesn't like sweets but he couldn't stop eating these. He wants these for his birthday instead of a cake. Also make sure you chill the dough for about 30 min before rolling in the powdered sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MULLIN22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1312717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-22T01:10:03.95Z",
                "reviewBody": "I had no trouble whatsoever molding these cookies. I just used my cookie scoop and dropped them into the powdered sugar then rolled them around a bit. I started with the l T. scoop which makes l inch cookies then changed to the 2 T. scoop. Also had to adjust the timing. Micky",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICKY28",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/69381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-06T14:20:02.23Z",
                "reviewBody": "These are so so yummy. Only change was to add a full tsp  vanilla, and 1/2 tsp. rum extract.  The dough is wonderful to work with, didn't refrigerate at all. First batch was rolled in 10x sugar before baking and it didn't leave much on the cookie out of the oven so the rest I just rolled in sugar after out of the oven, and did some with holiday sprinkles before baking. So buttery, rich, and love the texture. almost tastes like a rich cheesecake. They stay nice and soft too. thanks for this very versatile recipe with lots of combinations of cake mixes and additions of nuts, chips, etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-16T23:43:29Z",
                "reviewBody": "Sad to say but these were not anything speical. They were okay. I would not bother to make them again. I would use the cake mix for a cake and could make much better use of cream cheese. They were easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/888907/"
                }
            }
        ]
    }
]