[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16995/charleys-slow-cooker-mexican-style-meat/",
        "name": "Charley's Slow Cooker Mexican Style Meat",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1013628.jpg",
            "width": 2733,
            "height": 2733
        },
        "datePublished": "2000-03-22T18:49:58.000Z",
        "description": "This recipe can be used with chicken, beef, pork and even venison. It freezes well, and can be made into burritos, tacos, or any number of other Mexican-style dishes. This dish uses a lot of spice, so please be sure to adjust to your taste.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT8H0M",
        "totalTime": "P0DT8H50M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (4 pound) chuck roast",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "2 tablespoons olive oil",
            "1 large onion, chopped",
            "1 ¼ cups diced green chile pepper",
            "1 teaspoon chili powder",
            "1 teaspoon ground cayenne pepper",
            "1 (5 ounce) bottle hot pepper sauce",
            "1 teaspoon garlic powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Trim the roast of any excess fat, and season with salt and pepper. Heat olive oil in a large skillet over medium-high heat. Place the beef in the hot skillet, and brown it quickly on all sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the roast to a slow cooker and top it with the chopped onion. Season with chile peppers, chili powder, cayenne pepper, hot pepper sauce, and garlic powder. Add enough water to cover 1/3 of the roast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on High for 6 hours, checking to make sure there is always at least a small amount of liquid in the bottom of the cooker. Reduce heat to Low, and continue cooking for 2 to 4 hours, or until meat is totally tender and falls apart.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the roast to a bowl and shred it using two forks (reserve 2 cups of cooking liquid, if desired). Serve in tacos or burritos (see Cook's Note).\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "CHARLEY357"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.593528018942384,
            "ratingCount": 1267,
            "itemReviewed": "Charley's Slow Cooker Mexican Style Meat",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "260.5 calories",
            "carbohydrateContent": "3.3 g",
            "cholesterolContent": "68.7 mg",
            "fatContent": "19.1 g",
            "fiberContent": "0.7 g",
            "proteinContent": "18.4 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "314.7 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-01T18:15:06.013Z",
                "reviewBody": "Incredible. I'm from San Diego, so must, must, MUST have lots of flavor and spice in my meat, 'cause I'm used to it! Can't throw a rock without running into authentic Mexican food here. The flavor of this is just like that juicy, spiced shredded beef you dream of. Not-blow-your-head-off hot to my palette. Just right.\n\nCooking time: using a 3 pounder, we cooked 8 hours on low overnight. At 8 hours, the meat was falling apart; removed it, shredded with two forks, spooned off the fat in the Crock pot, removed a majority of the onions/peppers via a slotted spoon, returned mixture to Crock Pot juice and cooked on low for 1 1/2 hours. This is important; it allows the spiced juice that has formed overnight to really get in that meat.\n\nSpices: used a 5 oz. bottle of Tapatio hot sauce. Increased chili powder to 1 TBS and added 1 1/2 tsp. of cumin, because what's Mex without cumin? Green peppers: used de-seeded chopped fresh jalapenos. Added a beef boullion cube like other posters recommended.\n\nWhen you replace the beef, now shredded, into the pot to simmer, add 1/2 tsp. of additional cumin and 1 tsp. of paprika. Trust me, this is key.\n\nBest part: your first meal of the morning can be Machaca; combine a handful of shredded beef, 4 eggs (beaten), 1/2 cup of veggies of your choice (we used onion/yellow pepper), stir in pan till done, spoon into ripped up flour tortillas and eat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Impish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/102238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-11T00:37:06.5Z",
                "reviewBody": "This was so simple, and with a few changes became the ultimate shredded meat recipe!\n\nFollowing other reviewers suggestions, I didn't brown the meat, just put it in the crock pot and cooked it on high for 5 hours, then shredded the meat and put it back in the crock pot for another 2.  \n\nI then put all of it (including liquid) in a large saute pan over medium heat (I added no oil) and fried it until all the liquid had evaporated and the meat was slightly browned.\n\nThis turned into the most intense, flavorful shredded beef I have ever tasted -- everyone LOVED it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/815730/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-16T17:47:06.093Z",
                "reviewBody": "I have been using this recipe for 2 years now.  It is excellent when chicken is substituted & paired with the Red Enchilada Sauce (also on this site) for a outstanding chicken enchilada dish.  \n\nAlso, whenever chuck roast goes on sale, I buy one & cook it with this recipe & then use it for the beef filling in the Beef Tamales on this site as well.  It makes a lot, so I freeze half of them in gallon size freezer bags - then when I want to eat one, I just steam it for about 15 minutes - so good! They hold in the freezer for 6 months. \n\nThis really is a wonderful base recipe that you can use with all meats to make fillings for all sorts of dishes. And, its easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsHappyHomemaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1227866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-29T01:35:38.247Z",
                "reviewBody": "I have to VERY much agree with the reviewer who called this 'atomic beef'.  My husband and I both enjoy spicy foods, and were especially looking forward to a spicy meal since we were both having bad allergy days and could use a little spice to clear out our sinuses.  Well, once I shredded up this roast, we tasted it and threw it out.  If you got a piece from the middle, it had NO taste whatsoever, and if you happened to get a piece from the outside, it was SO hot it burned your head off...and is still burning the inside of my stomach.  This recipe is the same idea as all those stupid BBQ sauces that try to be hot just for the sake of being hot.  There needs to be layers of FLAVOR in spicy food, not just 'burn your tongue' hot sensations.\r\nDefinitely will NEVER make again, and would not recommend...and for those who are wondering, I had about a 3 pound roast, and I used about 3 oz. of tabasco sauce, 1/2 of the chili powder, 1/2 of the cayenne, added some cumin (just cause I love cumin), and threw a couple of veggie boullion cubes in with the water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie Wiens Craddock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/707132/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-28T15:34:54.513Z",
                "reviewBody": "Added cumin and beef broth based on other reviews, but felt it still lacked \"something\".  Upon taking the first bite all you can taste is \"hot\" as in spicy with not much complexity in flavors.  The flavor never seemed to truly develop which left for a disappointing finish.  Based on all the great reviews, I expected more....  It's good, but doesn't knock my socks off.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T16:32:15.413Z",
                "reviewBody": "What wonderful aromas as this cooks!  I was burning some lavender candles the day this was cooking and I couldn't smell the lavender... but I didn't care!\r\n\r\nI like spicy, but had to adapt it for the children (they like spicy too - but their mouths are still more delicate than ours).  I reduced the amount of hot peppers because I used jalapenos and they were severe, and omitted the cayenne.  For chili powder, I made my own using paprika, oregano and cumin.  It was just right for everyone!  We had half the meat in tacos the first day, and tonight I'm making the remaining meat and sauce into a savoury stew with potatoes, zucchini, green beans, pinto beans, and corn rounds.  A bit of arroz blanco, and we're set!\r\n\r\nHere's one tip which adds immeasurably to the sauce (and I'm surprised the recipe author didn't say this):  after browning the meat, dump a cup of water or stock into the pan to deglaze it, scraping up any browned bits.  Add this liquid to the crockpot along with everything else.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Morena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/528228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T22:18:52.13Z",
                "reviewBody": "I made this for a different Easter dinner. It is quite delicious. I did make some modifications based on what I had on hand. I used a red onion, 1 small can of diced green chiles, 1/2 tsp cumin and because of previous comments about the spiciness, I used a 3oz. bottle of Louisiana Hot Sauce and substituted beef broth for the water. Finally, I cooked the meat about 5 1/2 hours on high and 3 1/2 hours on low. It has a nice little bite but was not spicy enough for me.  Next time I'll use 5 oz of hot sauce. I may also add a can of Mexican spiced tomatoes.  \r\n\r\nA SLOW COOKER TIP: Spray the inside of your crock pot insert with non-stick spray before adding ingredients. It makes clean up a breeze, especially with dish which really got to bubbling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GINWOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/331399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T16:30:54.053Z",
                "reviewBody": "My husband is addicted to this meat.  I make it almost weekly and we use it in everything ... nachos, burritoes, salad, soup, etc.  It freezes very well for a quick meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diva Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/441348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-01T15:36:52.2Z",
                "reviewBody": "Great! Serving it on a Mexican buffet for a Super Bowl party. I used a small can of green chilis with the juice and a 2 oz. bottle of hot sauce. I also used 6 pounds of meat and added 1 teas of cumin and it was plenty spicy. Enough that it lingers in your mouth but not too hot!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Connie Schuessler Alkire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/711333/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Charley's Slow Cooker Mexican Style Meat",
            "description": "See how to turn chuck roast into a spicy, tender meat filling for tacos and burritos.",
            "uploadDate": "2013-05-16T21:14:53.844Z",
            "duration": "PT3M1.248S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F1a516b59-a644-4e9e-86a7-a4357f0ab972%2F92639952-0b49-41f1-b687-4fff3db05a52%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2387566885001"
        }
    }
]