[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/219/salad/vegetable-salads/",
                    "name": "Vegetable Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14228/caribbean-sweet-potato-salad/",
        "name": "Caribbean Sweet Potato Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F35395.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1999-08-13T11:55:03.000Z",
        "description": "This is a 90's potato salad - a new and improved, redone, much better potato salad. Not only does it have a sweet potato, in addition to a Russet potato, but it also contains corn, cucumber, and peanuts!  Corn oil will do if you don't have canola.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "1 large russet potato, peeled and quartered",
            "1 large sweet potato, peeled and quartered",
            "1 cup corn",
            "1 teaspoon prepared Dijon-style mustard",
            "2 tablespoons fresh lime juice",
            "3 tablespoons chopped fresh cilantro",
            "1 clove garlic, minced",
            "3 tablespoons canola oil",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "1 cucumber, halved lengthwise and chopped",
            "½ red onion, thinly sliced",
            "¼ cup finely chopped peanuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the Russet potato pieces into a large saucepan, and cover with salted water. Bring to a boil, turn the heat down, and simmer for 10 minutes. Add the sweet potato, and cook about 15 minutes more. Remove a piece of each potato, and cut it in half to see if it is cooked enough. Once the potatoes are tender, add corn kernels; cook another 30 seconds. Drain through a colander. Fill the saucepan with cold water, and drop vegetables into water.  Cool for 5 minutes, and drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whisk together mustard, lime juice, cilantro, and garlic.  Slowly whisk in oil.  Mix in salt and black pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut cooled potatoes into 1 inch cubes, and add to dressing along with cucumber, and red onion. Toss well.  Serve at room temperature or chilled.  Toss the peanuts in just before serving.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Vegetable Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "jessica"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.301115241635688,
            "ratingCount": 269,
            "itemReviewed": "Caribbean Sweet Potato Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "231.4 calories",
            "carbohydrateContent": "27.8 g",
            "cholesterolContent": null,
            "fatContent": "12.6 g",
            "fiberContent": "4.5 g",
            "proteinContent": "4.6 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "290.4 mg",
            "sugarContent": "7.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-08-03T21:57:16.67Z",
                "reviewBody": "Come on people!Doesn't anybody taste the dishes they make before they serve them?!I'm so tired of people giving a recipe a bad review because it didn't have enough flavor,salt,spice etc.Adding more flavor is about the easiest change you can make to a recipe.Make it,taste it,if it needs something more for your taste,add it!Everyone's taste is different~think for yourselves!Don't blindly follow a recipe that was made to a different persons idea of flavorful!\r\n That said~this was a great start and a great recipe once I personalized the flavor level.I added more lime,mustard,garlic,salt and pepper,and used 1Tbs veg. oil and 1Tbs peanut oil.I also used Yukon Gold potatoes because I like their texture more than Russet's.Great looking,great tasting,great texture! Enough said!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EMAPERU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/597756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-17T16:18:08.09Z",
                "reviewBody": "5 stars only for Great recipes -- this one deserves it!  Don't be put off by negative reviews... some people just don't get it.  This is NOT a potluck item or the deli slop you get at the supermarket; it's designed to be featured in a menu of complementary dishes.  I continued the Caribbean theme and grilled jerk chicken (Jay's), accompanied with a spicy mango salsa (both recipes on this website) and rice.\r\n\r\nAs with all dishes calling for produce or herbs, freshness is key! -- most ingredients were purchased the same day at a farmer's market.  Used Yukon potatoes and fresh sweet corn sliced from the cob.  Cucumbers add an unexpected freshness and texture.  After a decade of cilantro overkill, this dished utilized it for maximum definition.  The dressing was wonderful; just added a little extra lime for zip.\r\n\r\nWill be using this dish repeatedly -- especially at potlucks where previous reviewers will leave it for me to take home and devour!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARLYOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/684837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-04T16:46:20.127Z",
                "reviewBody": "Loved this. I made it for a gathering and everyone loved it! \nI used parsley instead of cilantro...only because I goofed when I bought it, but I'm not a big fan of cilantro so it worked out for me! \nI also doubled the entire dressing part of the recipe and used about 2/3 of the amount of the dressing I made. \nI bought two medium russet potatoes because they didn't have the giant ones, also bought a yam (or so it was labled - I don't really know the difference). \nAlso, I cooked the potatoes the day before, dunked them in ice water after cooking (as stated) and then sealed them a plastic container in the fridge. I think this really helps set the potatoes so that they don't fall apart. I also made the dressing the day before and I think that helped meld the flavors. \nI mixed the solid ingredients at home before taking to the outing and I put the dressing on at the VERY LAST minute right before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "slmcm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1521278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-21T16:24:11.157Z",
                "reviewBody": "This is a unique recipe for a different potato salad. For Weight Watchers -- it has 4 points per serving. I cooked white and sweet potatoes together and tested their doneness at intervals. Added frozen corn at last minute. The only change I made to the recipe was to add some curry powder --- made all the difference in the world....picked up the flavors of sweet potatoes as well as other vegetables. I will be making this recipe for a long time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Charlotte Conaway",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/803821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-19T16:26:04.733Z",
                "reviewBody": "I made this on Sunday and it was really good. The only change I made was to cut back on the oil a bit. I made it a day in advance as I wasn't going to have time on Monday to make this. Big mistake. I don't know quite what happened, but on Monday this tasted really different. The cucumber had shed a lot of water so it was watery and bland and not very appetizing. I am going to try and salvage this tonight, somehow but if you do decide to make this.. make it on the same day you are planning on serving it. letting this sit overnight like some salads does not improve the flavor. I didn't add the nuts until I was ready to serve so those were kept crunchy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-07T02:07:24.81Z",
                "reviewBody": "This salad was cool and delicious. The only problem was that I made it in the morning for dinner that evening and couldn't get out of taste testing mode. Almost didn't have enough for dinner! I did use extra lime juice cut fresh corn off the cob (super easy and it doesn't get mushy like canned) and used a seedless cucumber. Don't let the unusual ingredients scare you away. They really make the salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Kirchner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/396226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-14T11:57:22.683Z",
                "reviewBody": "OOOOH YUMMY! This was delicious! We used twice the amount of potatoes and used half of the oil called for. The amount of dressing was perfectly preportioned to the salad. The combination of sweet tangy and nutty was fabulous. We'll make this again (and it's pretty too!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hugatunity",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1953341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T20:50:05.653Z",
                "reviewBody": "This recipe is fantastic a refreshing change to your typical sweet potato dish. I used extra lime juice and used regular mustard with honey rather than dijon and it was gobbled up in no time! I felt this is served best at room temperature and don't add the nuts and cucumber until serving time to preven them from going soggy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "suzanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1591024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-14T14:31:05.25Z",
                "reviewBody": "A must try! I have been making potato salads for years and this one is tops. For probably the first time in my cooking career I did NOT change or add anything to a recipe. It's perfect just the way it is! I love the contrasting textures and flavors and friends commented on the beautiful presentation. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANOLAGIRLTOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644056/"
                }
            }
        ]
    }
]