[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/215/salad/pasta-salad/",
                    "name": "Pasta Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16201/salad/pasta-salad/tomato-pasta-salad/",
                    "name": "Tomato Pasta Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14278/antipasto-pasta-salad/",
        "name": "Antipasto Pasta Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2341472.jpg",
            "width": 2052,
            "height": 1532
        },
        "datePublished": "1999-07-27T16:27:22.000Z",
        "description": "A delicious pasta, meat and cheese combination with a homemade dressing. It serves a crowd and is great for a picnic.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound seashell pasta",
            "¼ pound Genoa salami, chopped",
            "¼ pound pepperoni sausage, chopped",
            "½ pound Asiago cheese, diced",
            "1 (6 ounce) can black olives, drained and chopped",
            "1 red bell pepper, diced",
            "1 green bell pepper, chopped",
            "3 tomatoes, chopped",
            "1 (.7 ounce) package dry Italian-style salad dressing mix",
            "¾ cup extra virgin olive oil",
            "¼ cup balsamic vinegar",
            "2 tablespoons dried oregano",
            "1 tablespoon dried parsley",
            "1 tablespoon grated Parmesan cheese",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook the pasta in a large pot of salted boiling water until al dente. Drain, and cool under cold water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the pasta, salami, pepperoni, Asiago cheese, black olives, red bell pepper, green bell pepper and tomatoes. Stir in the envelope of dressing mix. Cover, and refrigerate for at least one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To prepare the dressing, whisk together the olive oil, balsamic vinegar, oregano, parsley, Parmesan cheese, salt and pepper. Just before serving, pour dressing over the salad, and mix well.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Pasta Salad",
            "Tomato Pasta Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dayna"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.625564880568109,
            "ratingCount": 1549,
            "itemReviewed": "Antipasto Pasta Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "451 calories",
            "carbohydrateContent": "33.2 g",
            "cholesterolContent": "36.6 mg",
            "fatContent": "29.1 g",
            "fiberContent": "2.8 g",
            "proteinContent": "15 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "977.5 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-05-09T20:36:01.633Z",
                "reviewBody": "I made this for my step-daughters grad party and total strangers asked me for the recipe. I have to admit I didnt taste any at the party, but the next day I ate some leftovers and it was fantastic.  I made a few alterations; rotini instead of sea shell, yellow or red pepper in place of green, 3oz. can of olives, 3 green onions, and instead of the dressing provided in the recipe- I used Newman's Own Light Balsamic Vinegrette.  It was a huge hit.  The key was to mix everything together but the balsamic dressing and let it sit for a while.  In my case, 24 hours before I poured the Newman's Own on it.  Really yummy!  One reviewer suggested Pepperchini's, which I think would be a great addition.  I didnt think this cost much to make, and I dont understand why people think there is so much chopping.  That is a part of cooking!  This is an excellent recipe and one woman at our party said it was going to be her pasta salad recipe from now on. Excellent! (Edited 5/9/2010)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JeanneE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-22T20:20:53.95Z",
                "reviewBody": "EXCELLENT!!  I would suggest not substituting the asiago cheese, it has such a distinct flavor and it adds so much to the flavor of the salad. I did use a three cheese vinigrette that contained the olive oil, balsamic vinegar, seasonings, and parmesan cheese. It made it so much easier,  and saves the cost of having to buy individual ingredients that you may not already have on hand. I did add additional salt and pepper, and a shake of red pepper for zest.  TIP: If you gently squeeze the tomatoe after slicing off top before chopping, it will remove the excess juice and seeds so that the salad doesn't get watered down as it sits.  This is one of the best pasta salads that I have ever made. I am so happy to be adding it to my collection.  Thanks so much for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELFROMHEAVEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1038997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-21T19:13:28.233Z",
                "reviewBody": "Really good.  There was not a bite left after the cookout.  I used fussili pasta, I used halved grape tomatoes. I added chopped artichokes, I omitted the pepperoni and doubled the salami, I used a combination of brine cured olives, I added finely sliced red onion, I roasted the red peppers, omitted the oregano and used fresh parsley.  Per the suggestion of a couple other reviewers, I used a little less oil, but I think I will use all of it next time.  I liked the asiago cheese, but I think next time I will try real mozzarella instead.    I will certainly make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TARAPORTEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/841423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-05T16:39:10.45Z",
                "reviewBody": "I've probably made this now at least 10x!!  it's a HUGE hit (in fact, friends request me to bring it to parties).  so figured it should comment!\n\ni've leared a few hints from making it so many times..i've now \"perfected it\". 1)***THIS IS BEST MADE THE NIGHT BEFORE!!***this truly is the secret!  the flavors need time to develop and incorporate!  2) i use 1lb. multi-colored rotini.  3) i use 1 box cherry tomatoes halfed.  4) 1/2c. oil was too much for me!! - i cut down to 1/4 C - and like 3Tbl of zesty italian dressing.  5) i add a handfull of chopped banana peppers. 6) i add 3 green onions finely sliced. 7)  POUR 1/2 the dressing on the night before - and allow to \"marinate\" overnight in fridge.  then add the remaining dressing right before serving! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "melpalm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1714647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T22:21:08.453Z",
                "reviewBody": "Great recipe, however the flavor can get lost easily.  If you add all of the ingredients except the balsamic before refridgerating, the flavor of the Italian dressing comes out a lot better.  Then just add the balsamic just before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "EKENNEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/908610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-25T12:49:50.863Z",
                "reviewBody": "This was a wonderful dish and easy to prepare. I followed the recommendations of other reviewers and made both the salad & dressing the night before. I mixed them together two hours prior to serving. I also scaled the recipe down to six servings. For four people (two of them big men) it was still way too much. The antipasto does hold up well for left overs. This dish is perfect to bring to parties & picnics but be prepared to drop some cash. The ingredients are not cheap but the compliments from your guests/friends make it well worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IRENE75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/817092/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-25T21:07:54.6Z",
                "reviewBody": "Yo if you don't like pasta salads then you'll love this one!! If you love pasta salads then you'll lose your mind behind this one!!!! This one was so flavorful. If you like bland foods then don't try this one at all. The Asiago cheese added a different but very pleasing taste to it. It definitely tastes better the second day. Allow dressing to be absorbed overnight. I also added two italian dressing packets. Next time I make it I'll add some more meat to it......but that's strictly my preference cause I love meat. Definitely will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bayou Gator",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/753209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-30T16:07:15.59Z",
                "reviewBody": "This is a great recipe. I sometimes add artichokes and/or garbanzo beans. Substituting shredded mozzarella for the asiago is also quick and delicious. I also like to use grape tomatoes or cherry tomatoes instead of regular tomatoes.It is a meal all by itself, especially on warm summer nights.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/116113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-24T19:40:03.973Z",
                "reviewBody": "Absolutely easy and delicious. It makes a ton so is handy for an anytime snack over a long weekend.:) Taking suggestions from other reviewers.. i changed the following: 1. Used less olive oil. 2. Used Kraft Italian dressing. 3. Roasted some red peppers de-skinned julienned and added those. 4. Added cherry tomatoes. 5. Added feta cheese instead of asiago. 6. Added red onions and some garlic cloves (whole). Definitely will make again! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAPAL123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-07T00:16:22.35Z",
                "reviewBody": "UPDATE: I DECIDED TO GIVE THIS A SECOND GO ALMOST 5 YEARS AFTER I INTIALLY IT.:) IT WAS MUCH BETTER THIS TIME AROUND. HERE'S WHAT I DID: A) USED CHEESE-FILLED TORTELLINI (I THINK I'LL GO BACK TO USING ROTINI THO...) B) OMMITTED THE FRESH PEPPERS FOR CHOPPED ROASTED RED PEPPERS C) ADDED HALF OF A THINLY SLICED RED ONION D) USED ASIAGO THIS TIME AND E) SUBBED A MARINATED GREEN OLIVE & ARTICHOKE DELI SALAD FOR THE BLACK OLIVES CALLED FOR. ALTHOUGH MORE EXPENSIVE IT WAS DIVINE!!! This was \"OK.\" Although my friend liked this more than I did she wasn't all that impressed either. NOTE: This makes a LOT (I halved everything and still ended up with a TON!) and unfortunately doesn't lend itself well to leftovers (my salad dried up quickly - despite covering my bowl I needed to add additional vinaigrette the next day). This is also very expensive to prepare (the meat and cheese are pricey) but for a special splurge I think the 's spent are well worth it. To speed pre I subbed small grape tomatoes for whole ones. I also omitted the red bell pepper and subbed tri-colored rotini pasta for shells (both personal preferences). Because Asiago cheese was so pricey I opted for a less expensive (fresh) mozzarella instead. I found that using a GOOD quality olive oil and balsamic for the vinaigrette REALLY makes all the difference so PLEASE don't skimp on those. All in all this was decent but I will need to make several changes if I were to make it again. Thanks anyways Dayna!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Antipasto Pasta Salad",
            "description": "This salad combines meat, cheese, veggies, and pasta into a picnic delight.",
            "uploadDate": "2012-10-30T17:50:03.595Z",
            "duration": "PT4M47.746S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa50b080f-e831-4a0c-b670-935a77ffe2dd%2Ffb422d8b-8768-4d0a-a842-4fd7c750a39d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1934613620001"
        }
    }
]