[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/113/appetizers-and-snacks/pastries/",
                    "name": "Pastries",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16023/shrimp-scampi-cheesecake-appetizer/",
        "name": "Shrimp Scampi Cheesecake Appetizer",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6940514.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-02-11T00:20:23.000Z",
        "description": "Rich cheesecake with a seafood surprise.  Decadent and smooth for adult tastes.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "1 onion",
            "6 teaspoons minced garlic",
            "1 pound fresh shrimp, peeled and deveined",
            "12 shells puff pastry, baked",
            "4 tablespoons butter or margarine",
            "3 (8 ounce) packages cream cheese, softened",
            "4 eggs",
            "½ cup heavy cream",
            "16 ounces smoked Gouda, grated",
            "2 teaspoons salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium-low heat, warm oil and saute onions and garlic until onions are translucent; set aside to cool. When cool, pour off liquid reserving garlic.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut shrimp into 1/2 inch pieces, reserving 12 uncut for garnish. In a large skillet over medium-low heat, melt butter and add reserved garlic and all shrimp; cook shrimp for 2 to 4 minutes or until done.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove center circle and a small portion of inside of cooled puff pastry shells.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, beat cream cheese until creamy; add one egg at a time and beat until well mixed. Add cream, Gouda, onions, shrimp and salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon filling into puff pastry shells.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 20 to 25 minutes or until filling is browned on top. Garnish with whole shrimp and chopped chives; serve.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Pastries"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Betty L. Ince"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.597402597402597,
            "ratingCount": 77,
            "itemReviewed": "Shrimp Scampi Cheesecake Appetizer",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "701 calories",
            "carbohydrateContent": "22.7 g",
            "cholesterolContent": "248 mg",
            "fatContent": "56.3 g",
            "fiberContent": "0.8 g",
            "proteinContent": "26.8 g",
            "saturatedFatContent": "26.7 g",
            "servingSize": null,
            "sodiumContent": "1075.1 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-19T19:29:38.77Z",
                "reviewBody": "I made these in the prebaked fillo cups for two Christmas parties. At the one they ate every single morsel, but no comments. (Lots of people not a lot of food.) At the other party, ladies only, lots of food, lots of these leftover and still no comments about this recipe. I wasn't crazy about them either. Later I tried some of the unbaked leftovers (without the fillo cups) I had frozen as a dip. Weird eggy quiche like consistancy, although good flavor. I was not going to give up on this recipe, and I personally am not crazy about fillo and didn't want to use the puff pastry cups, so I took egg roll skins and cut them in quarters. Layered two squares opposite each in a flower pattern and put them in mini muffin tins. What a difference this \"cheesecake\" is in these. Very good and pretty this way. I felt the fillo took away from the taste - not enough filling to dough ratio and the egg roll wrappers just gave it a nice cup to be in with a little crunch with the \"petals\" sticking out the top. Baked at 350 for 10 minutes an they browned up perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "joypip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1786597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T13:49:00.217Z",
                "reviewBody": "Don't let the \"cheesecake\" title keep you away!! This is great. I used the little phylo pastry cups for a party and was able to make about 100. Everyone loved them very elegant.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNNEV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/306816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-02T21:36:42.937Z",
                "reviewBody": "Absolutely decadent and honestly far easier than anyone would ever believe.  I used the phyllo cups several other people recommended instead of puff pastry.  Garnished with fresh snipped chives and thyme.  I have also used the filling as a baked dip if you don't want to deal with the hassel of filling nearly a 100 of these.  Just buy some very nice crackers or toasts instead to enjoy these delightful bites instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-30T20:14:35.827Z",
                "reviewBody": "Oh. My. Goodness. Since I was taking these to a party I did as other reviewers suggested and used mini phyllo cups to make 60 appetizers. (This is rather expensive to make because of the cheese and shrimp so I skimped on the number of cups.) The phyllo dough I bought was already cooked so I simply heated them with the filling in the oven for about 10 minutes. I still had plenty of filling left over for a cracker spread but I should have bought more cups- it was hard enough keeping ourselves from eating them before we got there! If you've been looking for a rave-worthy recipe that's always the first to go at a gathering this is it. Mine were gone in 20 minutes! Thanks for such a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OMAHAKATE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/815455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-13T17:18:07.623Z",
                "reviewBody": "I thought this was a very rich recipe but I loved it. This recipe makes A LOT but I did freeze the batter and it tasted fine. I'm thinking you could probably cut the recipe in half. I used 4 pkgs mini phyllo cups for half the recipe and froze the rest and used as a hot dip with crackers when I needed it. I also don't think you need 16 oz. of Gouda. I believe I only used half of that and I couldn't find smoked. I did not used the onions or salt. The second time I made it I used a pound of shimp to half the batter recipe. Much better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MKing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1335249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-01T18:46:06.21Z",
                "reviewBody": "This was a great find however I am altering it the next time I make it. There is WAY to much cheese for the amount of shrimp. I am going to do the following: add another pound of shrimp add a couple cans of real lump crab add another onion and carmalize them add a little more garlic use one smoked gouda and one regular and call this Shrimp Scampi Rangoon. I made this for Thanksgiving and put them in the phyllo shells I made in the mini muffin pans. I made 4 dozen and still have half of the mixture left. I used the other half of the mixture the next day. I poured it in a glass dish and baked it. I got a lot of compliments on both and several people asked for the recipe. I dont think there is enough meat in it. When I was filling my phyllo cups I was trying to put a shrimp peice in each cup and I found myself digging around in the mixture looking for them. All in all this was good. It does make a ton but it saves well in the fridge. Looking forward to the next time I make it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sally Renz Cummings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valleygirl/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-15T17:17:05.31Z",
                "reviewBody": "My family LOVED these.  Not only was it easy to make, it freezes really well.  It does cost a bit more than other appetizers - I only make it once a year - plus, family & friends rave about it.  It is always a hit at family holiday functions.  I too used the pre-cooked phyllo dough and just filled them up and heated them up in the over.  It has become a family favorite for the holidays.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSHELLZ2U",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mshellz2u/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-18T21:25:04.753Z",
                "reviewBody": "Wonderful!! I halved the recipe but used the full 1 lb. of shrimp. Used the mini cups but as a personal preference no onion or salt but generously sprinkled shrimp with Old Bay after cooking. Used Fat Free 1/2 & 1/2 instead of cream just to make me feel like I was saving calories. (Yeah right!!) My husband isn't usually a fan of smoked gouda but he loved these!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NancyLou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3284850/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T21:59:54.967Z",
                "reviewBody": "These are excellent! Great party appetizer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chandra Meyer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1058058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-01T20:24:36.557Z",
                "reviewBody": "1st this recipe has the worst name, after I got over that and check out the ingredients I was intriqued.  After reading all the glowing reviews I found it a must!  I made it just as written. But...\nI found it very disapointing.  My guests were not very interested either and they were all eaters.  It just isn't that special. And it makes SO much, I had tons lefover.  Not impressed, sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "NICKI61",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/731604/"
                }
            }
        ]
    }
]