[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16167/beef-bourguignon-i/",
        "name": "Beef Bourguignon I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1188118.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2000-01-12T19:03:41.000Z",
        "description": "My sister sent me this recipe and the delectable smell of this hearty yet fancy dish brings my teenaged boys running! Serve with potatoes, noodles or rice.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P2DT3H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 cups Burgundy wine",
            "2 tablespoons brandy",
            "2 onions, thinly sliced",
            "2 carrots, chopped",
            "1 sprig fresh parsley",
            "1 bay leaf",
            "1 clove garlic, crushed",
            "10 whole black peppercorns",
            "1 teaspoon salt",
            "2 pounds cubed beef chuck roast",
            "4 tablespoons olive oil, divided",
            "¼ pound bacon, cubed",
            "2 onions, chopped",
            "3 tablespoons all-purpose flour",
            "1 tablespoon tomato paste",
            "2 cloves garlic, crushed",
            "1 (10.5 ounce) can beef broth",
            "salt and pepper to taste",
            "4 tablespoons butter",
            "1 pound fresh mushrooms, sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "For marinade: In a large bowl, combine the wine, cognac, onions, carrots, parsley, bay leaf, garlic, peppercorns and salt. Mix well and add the cubed beef. Cover and marinate in the refrigerator for 2 days.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "For Bourguignon: Strain the meat from the vegetables and marinade; reserve marinade. Dry meat with paper towels. Heat 2 tablespoons of the oil in a large skillet over medium high heat. Add the meat and saute for 10 minutes, or until browned on all sides. Transfer meat to a separate medium bowl with a slotted spoon and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the same skillet, add the bacon and saute until lightly browned. Transfer the bacon to the bowl with the meat. Drain the skillet and return it to the heat. Pour a cup of marinade into the skillet to deglaze the skillet, scraping the bottom to loosen up all the little bits. Return this liquid to the reserved marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the remaining oil in the skillet. Add the onion and carrot from the marinade, along with the additional onion that you've chopped, and saute for 5 minutes, or until tender. Transfer this mixture to the bowl with the meat and bacon, again using a slotted spoon, and return skillet to the heat. Add the flour to the skillet, combining with the oil and stir until well mixed and brown, about 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Now add the tomato paste, garlic, beef broth, reserved marinade and salt and pepper to taste. Bring to a boil and whisk to remove any flour lumps. Add this to the meat and vegetable mixture. Place entire mixture into a 9x13 baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 300 degrees F (150 degrees C) for 3 hours, stirring occasionally and adding water as needed. Season with salt and pepper to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "About 15 minutes before meat is done baking, melt butter in the skillet over medium high heat. Add the mushrooms and saute for 5 to 10 minutes, or until lightly browned. When meat is done, add the mushrooms to the meat mixture, stir well and let sit for about 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "COOKPOT"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.632034632034632,
            "ratingCount": 231,
            "itemReviewed": "Beef Bourguignon I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "458.3 calories",
            "carbohydrateContent": "14.1 g",
            "cholesterolContent": "72 mg",
            "fatContent": "28.9 g",
            "fiberContent": "2.6 g",
            "proteinContent": "19.9 g",
            "saturatedFatContent": "10.6 g",
            "servingSize": null,
            "sodiumContent": "638 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-29T19:38:08.153Z",
                "reviewBody": "It just kills me when people come to these review sites and complain how there just \"has to be a quicker way\" to prepare a dish such as THIS one.  And then they almost make it sound like a personal mission that people took to rob them of their time if a recipe isn't to their liking.  Perhaps a review should consider that GOOD food takes the love of cooking, and anything less WILL be evident \"somewhere\".  And often times in classic french recipes such as this one, it DOES take time and if you \"read and think\" before you begin you can figure that out. My personal opinion on this recipe is that it is VERY classic and delicious.  It was meant to be meaty and rich and not too spiced up...warm and comforting and classic...and it is!  I serve mine over \"smashed\"  garlic potatoes with the skins left on and a fruit parfait for dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "suzichef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1577342/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-10T02:03:52.123Z",
                "reviewBody": "An outstanding meal.  I followed the recipe exactly, and scaled it to 12 because I caught a great sale on top grade meat, which I recommend you use.  I also used a Pinot Noir (don't use supermarket wines.  They're not glass worthy for a reason!).  I froze all this food in meal-sized portions.  When it was thawed and reheated, it was even more delicious! I'm ready for any holiday company that might call for an elegant meal. Served with creamy mashed potatoes, asparagus tips and french bread. Wow!  Worth the effort.  Thanks Judy. -- Update 11/2004 -- this is still the best recipe I've ever found here at allrecipes.com.  Follow the tips - no shortcuts, and make a lot at once to freeze.  Company coming?  Thaw, reheat, make sides, and take the bows.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "claudygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-15T20:41:36.763Z",
                "reviewBody": "I made this yesterday morning and at the point in the recipe where you put it in the oven, I put it in a crockpot and forgot about it all day (I did stir it from time to time). It came out so yummy! I didn't use as many onions--one in the marinade and then I used shallots for the main dish. I served it with a hearty homemade French peasant bread and garlic mashed red potatos. I will definately make this again. Ps..don't skimp on the quality of the red wine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NXS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/478446/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-30T18:40:41.477Z",
                "reviewBody": "This is a great recipe.  After I add the mushrooms and its just about finished I spoon single servings into a medium size ramekin (one per person ) and place flakey puff pastry over top and bake it for an additional 10-15 or until the pastry is golden.  This is by far the best way to eat it, with a side of green salad. YUMMY!  I have made this dish 5 times now.  My boyfriend loves it and guests are always impressed.  I always make about 10 servings and freeze the rest, then its a quick elegant dinner all you have to do is defrost it scoop it into a ramekin thaw more puff pastry shove it in the oven and serve it up.  WONDERFUL! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "D-LITE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/664077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-22T03:14:59.377Z",
                "reviewBody": "Despite some of the negative reviews of this recipe, I have nothing but good things to say. I made a few changes to the recipe, but thought it was specatcular. I had to make a bit of extra \"gravy\" (marinade) when I re-heated it after sitting for a couple of days in the fridge, but that was easy and it turned out marvelous. Some mentioned that you should use a \"good\" burgundy or Pino Grigio; I myself used the burgundy cooking wine I found at the grocery store. I substituted some sherry wine designed for cooking for the cognac, (both MUCH cheaper than the liquor store!) and I found the recipe one of the best I've had. Summary: marinade for 3 days, and rely on your local grocery store to provide the cooking wine(s) for you!! It is absolutely superb over homemade garlic mashed potatoes! I would serve it to God. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LizardLover2009",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2208205/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-21T01:52:14.577Z",
                "reviewBody": "I love complicated and involved recipes.  It seems that the more time I spend making a dish, the more complex and interesting the taste, and the more my guests rave.  Sadly, this rule of thumb did not apply here.\n\nI made this Christmas Day for 25 people (4x original recipe) and it about did us in.  The marinating was quite easy, but the prep on the day it was being served was deceptively involved -- adding to the stress of the day.  The fragrance while cooking was lovely.....but at the moment we had all been waiting for, when the meal was presented, the taste turned out to be only \"average.\"  Nothing special, not even memorable, just okay.  I could have spent far less time cooking and far more time enjoying my guests with a less involved recipe, and had the taste of the meal come out the same.\n\nLike me, a lot of reviewers who made this recipe spent many hours and dirtied a houseful of dishes making it.  I can only think that the reviews are so positive because once the investment of time and effort was made, they just couldn't bring themselves to giving it a review of \"not memorable.\"  The high ratings are probably more of an A for Effort than an A for Taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "OSuzyQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1266627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-15T21:26:52.887Z",
                "reviewBody": "After reading some of the negative reviews I was a little torn about trying this dish given the time involved. I must say I am so glad I decided to try. It has great flavor and is absolutely delicious. The only thing I can say to the negative reviewer is that a recipe is only as good as the quality of the ingredients. I can only guess that perhaps they did not use a good quality wine or a good cut of meat. With quality ingredients you cannot go wrong with this recipe! I would also recommend that you not take shortcuts. I ended up having to marinade the meat for 3 days and I think the flavor was amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ksphillip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2080452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-13T04:03:03.117Z",
                "reviewBody": "Wow...this was fantastic! Impressive. Will make again definitely. Who ever says it tasted like beef stew and/or it took too long to prepare must not like to cook much or did something wrong! Thanks for sharing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HvyMtlGma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/160425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-17T13:27:00.42Z",
                "reviewBody": "I can always tell from reading other reviews if I am going to have success with a recipe or not. This time I was completely wrong. I followed the recipe exactly and it was mediocre at best.I've been cooking for many years and I've prepared dozens of recipes from this site. I don't think the poor results this time were due to something I did wrong. This is the first review I've given. I wanted to warn others that if you want to try this recipe try it yourself before you serve it to guests. The results are a common beef stew and not an elegant dinner party dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie Ellen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1218674/"
                }
            }
        ]
    }
]