[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1982/meat-and-poultry/chicken/chicken-breasts/skillet/",
                    "name": "Skillet",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16220/lemon-mushroom-herb-chicken/",
        "name": "Lemon Mushroom Herb Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F401728.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-07-02T17:30:33.000Z",
        "description": "Easy chicken and herbs in a creamy lemon and mushroom sauce. The sauce is excellent over rice -- my kids can't get enough!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 cup all-purpose flour",
            "½ tablespoon dried thyme",
            "2 tablespoons dried basil",
            "1 tablespoon dried parsley",
            "1 teaspoon paprika",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "1 teaspoon garlic powder",
            "4 boneless, skinless chicken breast halves",
            "½ cup butter",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (10.5 ounce) can condensed chicken broth",
            "¼ cup dry white wine",
            "1 lemon, juiced",
            "1 tablespoon chopped fresh parsley",
            "2 tablespoons capers",
            "1 tablespoon grated lemon zest"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a shallow dish or bowl, combine the flour, thyme, basil, parsley, paprika, salt, ground black pepper, and garlic powder. Dredge chicken in the mixture to coat, patting off any excess flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a large skillet over medium heat, and cook chicken until no longer translucent. In a medium bowl, mix together the cream of mushroom soup, chicken broth, wine, and lemon juice; pour over chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover skillet, and simmer 20 minutes, or until chicken is no longer pink and juices run clear. Garnish with parsley, capers, and lemon zest.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Skillet"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Valerie Serao"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.41439205955335,
            "ratingCount": 403,
            "itemReviewed": "Lemon Mushroom Herb Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "567.9 calories",
            "carbohydrateContent": "36.2 g",
            "cholesterolContent": "130.2 mg",
            "fatContent": "30.4 g",
            "fiberContent": "4 g",
            "proteinContent": "36.4 g",
            "saturatedFatContent": "16.4 g",
            "servingSize": null,
            "sodiumContent": "1914.7 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-06-23T08:19:03.92Z",
                "reviewBody": "This was great extremely delicious. As per earlier reviews I dipped the chicken into egg before coating with the flour mixture. Reminds me somewhat of Chicken Francaise but with much more flavor. Definitely a keeper recipie. A",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PRINCESS20NY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-05T22:28:09.067Z",
                "reviewBody": "This recipe ROCKS! The first time that I made it I followed the directions completely and it was SUPREME! Then the second time I made it I made some changes... I added: 1. A large basket of sliced fresh mushrooms and added it to the broth mixture BEFORE pouring it over the chicken (tastes good if you let the mushrooms soak in the broth mixture for about 30 minutes) 2. I scraped out the remaining pulp from the lemon that I juiced and added it to the broth mixture. 3. I added 2 tablespoons of Lemon Pepper to the broth mixture 4. I dipped the chicken in 2 raw eggs (beaten) before dipping the chicken in the flour mixture",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Monty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/503339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:35:26.513Z",
                "reviewBody": "OMG!!! This was wonderful! I was so impressed that I could make something so easy taste and look so elegant! I can't wait to make for guests! Per other reviewers added 1 1/2 TBLS of lemon pepper seasoning to the broth/soup mix only used 3/4 cup flour and 6 chicken breasts (first dipped in an egg and butter mixture before dipping into flour so it would stick to chicken better). I served over rice (Uncle Ben's chicken and wild rice) and spooned the excees \"sauce\" over all. Absolutley devine! The praise I received for making this dish made me blush. Thanks Valerie for sharing this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-15T23:28:44.42Z",
                "reviewBody": "10 star recipe. The best of the best. I make this for company all the time and people go crazy over it. Some changes when I make it- all optional obviously: 1. after I dip the chicken in flour and begin to saute it I then dip it back in the flour mixure-otherwise the \"breading\" is minimal and there is a lot of flour and herbs left over. 2. Never/rarely have fresh lemon (please!) so I just throw in lemon juice- prob 1/4 to 1/3 cup. 3. Never used the capers or lemon zest. 4. ALWAYS pound the chicken to within a centimeter of its life. Its so tender- amazing. 5. I use whatever in terms of the soup mushroom chicken chicken and garlic full fat reduced fat etc. Doesnt seem to make any difference to me. 6. I havent felt like leaving out spices if youre out is a big deal. Ive been out of parsley and basil and it made no difference- I just ignored them. 7. I always make extra sauce and a vat or rice b/c the family wants to eat it for leftovers for days. Im really surpised at those who dont like this. Ive made it probably 25 times and every time (except for one when I made a HUGE mistake on salt- tired due to having a newborn!) Ive been hailed a hero. Whoever came up with this recipe knows what they are doing. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adh0621",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/577467/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T21:07:35.327Z",
                "reviewBody": "I don't go by reviews much anymore but I took a chance on this one and thought how bad could this be - I thought this was going to be okay - but nope - it was amazing - this is a new standard. I added some fresh mushrooms as well. Very good. The other thing about this recipe is that it is REALLY EASY to do.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TROY2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/899328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-24T16:00:08.643Z",
                "reviewBody": "5 stars? Heck make that 5000 stars for this most fascinating and mouth-watering recipe!! I have had my share of wonderful chicken recipes but this recipe definitely takes the cake; it is definitely on the top of my list! Fine dining / restaurant quality for sure! There is nothing to change about this most exceptional recipe other than the fact that I added lemon pepper to the chicken broth mixture as suggested in some of the reviews. I also added extra flour coating on the chicken breasts as it was cooking in the skillet to increase the 'thickness' of the coating and it turned out great. May I suggest the addition of chopped fresh mushrooms to the chicken broth mixture. But again it's only a suggestion since the recipe is perfectly fine as it is. Cudos to the creator of this stunning recipe! Safe to say I will definitely make this dish again but this time it will be for friends and family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Daniel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2576696/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T08:18:58.733Z",
                "reviewBody": "Wow! Ever after all the substitution I made this still turned out awesome and I recieved raved reviews. I didn't have lemon so I had to use lime and substituted more chicken broth for the wine. I suggest to make only 1/2 of the flour mixture because there was more than 1/2 left after dredging them. I also added a tblsp of the flour mixture to the soup for added flavor. It had a nice subtle taste. I can't wait to try it with lemon. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Flaquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T08:19:06.06Z",
                "reviewBody": "This was amazing. I couldn't believe that a recipe that I already had all the ingredients for could be so wonderful! I added 1/4 c. of the flour mixture to the broth before pouring it over the chicken so that it would thicken a bit while the chicken simmered... to create more of a gravy consistency. I swear my husband actually LICKED his plate clean! haha",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEAH977",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/555020/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T23:12:08.327Z",
                "reviewBody": "Wow this was awesome. Tastes gourmet but quick and easy. I didn't do the exact recipe because I was missing some things but it turned out great. I didn't have basil or capers and I forgot the paprika. Didn't add the lemon zest either. Frankly it had the perfect amount of lemon flavor. I also only used 1/4 cup of butter 1/2c. seemed too much and I used the healty request cream of mushroom to cut back on calories. I had a lot of flour mixture left over as well. The sauce thickened perfectly. Next time I will make according to recipe to see if there is any difference in flavor. But even without a few ingredients it was still delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/371205/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-11T02:48:43.123Z",
                "reviewBody": "This was just okay for me. I think the spices were a little strong and the breading was gummy. Its worth another try so next time i will make some changes. I will add a little less thyme in the flour mixture and brown the chicken more using olive oil instead of butter. I'll then remove the chicken and keep it warm while i add the soup mixture to the pan without the chicken and then when its ready add the chicken again just to coat it. My chicken needed to be crispier before the sauce was added. All in all it was a decent recipe i just expected more after reading all the reviews. I'll try again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rianppg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1584017/"
                }
            }
        ]
    }
]