[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18345/artichokes/",
        "name": "Artichokes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1019864.jpg",
            "width": 1834,
            "height": 1375
        },
        "datePublished": "2000-04-25T06:26:42.000Z",
        "description": "Simple and delicious steamed artichokes. Serve these with melted butter for dipping. You will need a pan with a steamer insert.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "2 whole artichokes",
            "2 tablespoons butter",
            "2 cloves garlic, sliced",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill the pan with just enough water to cover bottom. Bring to a full boil over high heat. While water is heating, trim and discard the stems and tough outer leaves of artichokes. Tuck slivers of butter and slices of garlic into artichoke leaves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When water is boiling, place steamer insert in pot and set artichokes in steamer, stem-side down. Cover pot with lid and allow artichokes to steam for approximately 20 minutes, until tender.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Shai"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.207100591715976,
            "ratingCount": 169,
            "itemReviewed": "Artichokes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "133.4 calories",
            "carbohydrateContent": "7.1 g",
            "cholesterolContent": "30.5 mg",
            "fatContent": "11.7 g",
            "fiberContent": "4.5 g",
            "proteinContent": "1.8 g",
            "saturatedFatContent": "7.3 g",
            "servingSize": null,
            "sodiumContent": "113 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-25T17:31:54.36Z",
                "reviewBody": "This is just a little heads up for some folks who never made and or eaten artichokes whole like this before. I read through some of the reviews and noticed that some were trying to eat the whole leaf. what you do is remove a leaf, dip in butter or sauce and scrape the fleshy part off with your teeth. Discard the rest of the leaf.I hope this helped.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Party Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/570494/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-17T06:33:35.763Z",
                "reviewBody": "The best way to clean chokes is set them in the sink & cover with cold water for a  30 mins or so. Then take a shape knife & cut the stem back with an even cut so that they can stand upright in your pot or steamer without falling. After you cut the stem off, take kitchen shears & go around each choke & snip the tips of each leaf to remove the tiny stickers at the tops of each leaf. Run back under cold water again & now you can safely spread the leafs back some without getting pricked! Pull the center back & reach in with the tips of your fingers & pull out all of the little tiny purple leafs that are near the heart in the very center, they are too small to eat so remove them now to avoid a mess while eating them later. With the centers cleaned before cooking  gives you an area to insert a  fork into the heart to check for doneness, (beware of steam) when it goes in without any effort then they are done. I set them on a paper plate or some paper towels to cool some & this also helps remove any excess moisture so you don't end up with a puddle on your dinner plate. Artichokes are a little involved to clean & cook, so I now clean & cook four at a time & stick them in a big zip lock until we are ready to eat them. They last for quite a few days with no problem in the frig. I then set each artichoke in microwave proof (cereal size) bowl and nuke them for a minute or two to knock the chill off right before we are ready to eat them. Although these things taste excellent cold too!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen Johnson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1381857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-06T01:44:02.78Z",
                "reviewBody": "Steaming makes these the perfect texture.  Like others, I added plenty of water (the water level was flush with the bottom of the steamer).  In addition to slathering the artichokes with butter and garlic before steaming (great idea!), I also added slices of lemon and minced garlic to the water.  I steamed them for 45 minutes and made two sauces to dip the leaves in--one with butter, garlic and lemon, the other with mayo, a little bit of balsamic vinaigrette and pepper.  My husband loved these and so did I!  Will definitely make again...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie A.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/726530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T16:47:53.983Z",
                "reviewBody": "I made this turn out good eventually.  If you follow the instructions to the letter, by only putting enough water in the pot to cover the bottom of the pan and then try to steam for 20 minutes, you will end up with a house full of smoke.  All of the water evaporated within 10 minutes and the butter that was stuffed in the artichokes melted to the bottom and burned on the bottom of the pan.  Lucky for me I gave this recipe a try on Christmas eve and didn't embarass myself in front of my guests on Christmas Day!  The recipe should suggest putting much more water in the pot that that.  I think I ended up putting close to 6 cups just to be sure.  Also my artichokes took much longer than 20 minutes to steam.  They took about 45 minutes.  All in all they ended up turning out well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "NAT_YSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/540941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-04T15:12:17.95Z",
                "reviewBody": "Pretty good. Like most other reviewers I needed considerably more water and fresh lemon juice (throw in the peel too) is quite good. BUT DON'T CUT OFF THE STEM, IT'S JUST THE END OF THE HEART!!! Just trim of the end (like you would cut flowers before placing in a vase). It also gives you a way to test for doneness. Pierce the stem with a knife,if it goes through easily, it's done. ALSO: try fresh lemon juice with salt, fresh ground pepper, fresh garlic and slowly beat in Extra Virgin Olive Oil for dipping. Ligh and velvety.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KELARJIAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/814189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-27T17:25:48.547Z",
                "reviewBody": "This was a great starting point-I literally slathered the artichokes with butter and (minced)garlic instead of putting between the leaves, and I took the suggestion about using lemon-I laid a lemon slice over each one.  I filled the pot with water to the bottom of my steamer insert and did not have to add any water while they were cooking.  I also added a chicken bouillon cube to the water along with 1 teaspoon of my favorite \"Trader Joe's Pasta seasoning blend\".  Because my 'chokes were big-I extended the cooking time to 1 hour. I let them sit in the covered pan for about 15 minutes prior to serving, and they were PERFECT. I served these with a lowfat mayo and fresh basil pesto I mixed together-my family asked for them the very next night!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1536237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T16:47:53.17Z",
                "reviewBody": "I am an artichoke addict. Unfortunately I live in SD and can only get these during the summer if I'm lucky. I thought tucking butter and garlic into the leaves was a nice touch. Usually I just steam the artichoke in a few inches of water as opposed to actually using a steamer and serve it with a lemon-butter mixture (proportions are to taste). I find it cuts cooking time nearly in half. Of course you can't do the butter idea with this method and if you have too much water you may risk washing out the flavor. Of course this needed more water. But I usually leave only enough water in the pan to cover the bottom like the recipe calls for and add more water as it evaporates so not to burn the pan. Like I said too much water may wash out flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "R_CAESAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/806674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T16:47:53.53Z",
                "reviewBody": "Oh the weather outside is certainly frightful! It looks like a blizzard out there. While I'm anxiously awaiting for my little chickens to arrive home early from school today I decided to catch up on my reviews. These artichokes rock! My kids BEG me to buy them and believe it or not they'll make a meal out of them. The only additional thing I do is melt butter and add garlic powder so the kids can dip.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-21T12:00:57.857Z",
                "reviewBody": "This was amazing. I have been making stuffed artichokes for a while now and this tastes SO MUCH BETTER. Very simple and easy to do. I do cut the choke in half to make it easier to serve later. I also served it with a garlic butter. Delicious. Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            }
        ]
    }
]