[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/152/breakfast-and-brunch/potatoes/",
                    "name": "Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20198/spanish-potato-omelet/",
        "name": "Spanish Potato Omelet",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2200867.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2000-06-19T18:09:25.000Z",
        "description": "There's nothing too fancy about this rustic Spanish style omelet, just lots of hearty goodness from crispy fried potatoes and onions. Chopped tomatoes and green onions lend even more flavor and color.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ cup olive oil",
            "½ pound potatoes, thinly sliced ",
            "salt and pepper to taste",
            "1 large onion, thinly sliced",
            "4 eggs",
            "salt and pepper to taste",
            "2 tomatoes - peeled, seeded, and coarsely chopped",
            "2 green onions, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large frying pan or skillet, heat olive oil over medium-high heat. Sprinkle potatoes lightly with salt and pepper. Cook until golden brown and crisp.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the potatoes are golden, stir in the onions. Cook, stirring occasionally, until onions soften and begin to brown.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, beat eggs together with salt and pepper. Pour eggs into pan and stir gently to combine. Reduce heat to low and cook until eggs begin to brown on the bottom.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Loosen bottom of omelet with a spatula, invert a large plate over the pan, and carefully turn the omelet out onto it. Slide the omelet back into the pan with the uncooked side down. Cook until eggs are set. Garnish omelet with tomato and green onion and serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PATTY5"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.461538461538462,
            "ratingCount": 208,
            "itemReviewed": "Spanish Potato Omelet",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "252 calories",
            "carbohydrateContent": "10.7 g",
            "cholesterolContent": "124 mg",
            "fatContent": "21.5 g",
            "fiberContent": "1.6 g",
            "proteinContent": "5.4 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "53.6 mg",
            "sugarContent": "2.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-06T16:21:33.56Z",
                "reviewBody": "Tortilla Espanola, as this is called in Spain, is definitely part of the Spanish way of life.  They eat very light dinners over there and when I lived there we would have this at least twice a week (served with crusty bread and a simple lettuce salad dressed with vinegar and olive oil).  While I was in Seville, I was taught by a Spaniard I met there how to make this and this is pretty much what he taught me.  The only thing I really do differently is to stir the potatoes often while cooking so that they don't get browned.  You really want them to be very soft and tender, not crispy.  It's also worth noting that in some regions of Spain they do not use onions (I lived for a while in Salamanca, which is about 3 hours west of Madrid, and they never used onions there).  It's good either way but I find that when made with onions it is a little more moist.  I currently make it without because my boyfriend is allergic to onions.  Every time I saw this served in a home, it was simply made with just potatoes, eggs, and maybe onions.  I never saw anybody garnish it with tomatoes and green onion (or anything, really), although in restaurants they would often mix in other vegetables or ham so you can really add whatever you like.  Another tip I use is to determine when the eggs are fully cooked, insert a butter knife into the center of the tortilla.  If it comes out clean, it is done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2201579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-14T12:07:20.943Z",
                "reviewBody": "I have got to give this five stars, because it is just amazing. A Spanish friend made this for me once and this tastes just like hers, with the adjustments I made: I leave out the tomatoes and green onions (because she said in Spain they don't put them in), and it tastes so good without them that I can't bear to try it WITH them! :) \n\nOne other tip: After I cook the potatoes and onions in oil, I put the eggs and potatoes together (combine very gently) in a bowl, and let it sit for 20-30 minutes. The cooked potatoes absorbs the egg, and it's just SO moist. \n\nLast thing... I find that the dish tastes best if I turn the heat off shortly before it feels right to do so. It still looks a teeny bit moist and eggy inside - but when I cook it any longer it gets much drier. Mmmmm moist! \n\nThanks Patty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brenda Grace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1546803/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T21:47:17.993Z",
                "reviewBody": "Being a Spaniard, this recipe caught my attention. Tortilla de patata is truly a simple, rustic dish and it sounds like everyone's got the right idea. Having made this tortilla many times at home and with family in Spain-I have a couple tips to share. After cooking the sliced potatoes in olive oil, I drain them in a colander then put potatoes back into frying pan (a good non-stick works best!) After adding egg and pushing potatoes down so they're submerged as much as possible, I cover the pan and cook on very low heat-you can actually cook the tortilla all the way through this way and only need to invert onto a serving plate and cut into wedges to serve-although if you're using a non-stick, the inversion process is a snap. I'd never had Tortilla made with anything other than potato, egg, and onion UNTIL I experimented on my own. I sauteed chorizo, put half the potatoes in the pan sauteed chorizo on top of potato, rest of potatoes on top of chorizo, then egg over all. Really good! and a very nice presentation when sliced.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1550283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-16T17:02:19.493Z",
                "reviewBody": "I would suggest that you sautee the onions first until brown and then add the potatoes. This way the oil gets all the flavor from the onions which then transfers to the potatoes.   As far as garnish, we really (I am from Spain) don't garnish it with anything but hey it doesn't hurt either. We eat it with bread which is very similar to french baguette. This is the typical \"Pincho de tortilla\" that you can get at every bar.  The only thing I was surprised with was the picture, because it looks scrambled and it is suppose to look like a pie (more or less). It is not that hard to turn it. Make sure you put enough oil in the non-stick pan, put a plate bigger that the pan on top of the pan and if you are afraid it may slip put a piece of paper towel on two sides of the pan (in between the pan and the dish) and then flip it with a quick move. That's a trick my mom showed me when I first started cooking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/matxalenalfaro/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T17:51:57.687Z",
                "reviewBody": "I lived in Spain for 4 months and \"Spanish tortilla\" is a favorite of mine...I omitted the tomatoes and green onions and it tasted like I was back in Madrid!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SCOUTURE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/603595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-16T18:11:27.623Z",
                "reviewBody": "I added some green pepper in with the onion. I wasn't even going to attempt turning it over as I'm very accident prone. So I did what I always do with omelettes once the egg mixture had set I put it under the broiler on medium heat until golden brown. I ended up with fluffy omelettes we all enjoyed. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-18T16:24:50.19Z",
                "reviewBody": "I was raised in Spain and this is definitely a simple and delicious recipe that is just like \"home\" for me. As other reviewers have mentioned they do not use tomatoes or green onions with a potato omelet in Spain! Also we lived in Southern Andalucia which might be different but we always cubed our potatoes and fried them until tender (not crispy). As other reviewers have noted the traditional step is to then mix the eggs onions & potatoes in a bowl together letting them sit for a few minutes before cooking the omelet. This is an extremely simple and completely delicious recipe! All my American friends like to dip their bites of potato omelet in KETCHUP when they eat it...whatever works!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "allergyfree",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4544675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-17T14:39:44.013Z",
                "reviewBody": "I thought this recipe was great. I even made it the night before for breakfast because my husband gets up early. It was definitely better when it was hot. I made some adjustments based on what other reviews stated. I personally didn't use as much olive oil because it started to splatter all over. I cubed the potatoes and cooked them in the microwave with a little bit of water. I diced the onion and added red pepper when I added the onion. I used 6 eggs instead of 4. And I skipped the tomatoes and the green onions. This recipe is actually really easy and really good. Be sure to use enough salt and pepper to flavor it. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MJLAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1036038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:54:01.46Z",
                "reviewBody": "This was a great way to wake up on a BEAUTIFUL Sat morning (esspecially after a rough night before)! I diced the potatoes and cooked them in the microwave for about 5 min B4 cooking them in the pan to speed up the cooking proces and diced the onions instead of slicing. I also added half a green bell pepper (chopped). Besides adding S&P to the eggs I also added 1/4c milk so that they would still be fluffy. Not going to lie to you: it was tricky getting the eggs to transfer to the plate and then inverting them uncooked side down again back into the pan BUT the end result was very tasty. Finally I didn't use the tomatoes but just the green onions and cheese. With a side of sausage these made for a great breakfast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Spanish Potato Omelet ",
            "description": "Rustic, satisfying classic Spanish dish.",
            "uploadDate": "2018-03-22T18:29:07.601Z",
            "duration": "PT43.544S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F4593a1cb-fc65-4ebf-9a57-ddaba8d54b3c%2F2267f309-2c59-4361-9323-36ab03e76e47%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5756405587001"
        }
    }
]