[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1564/breakfast-and-brunch/eggs/frittata/",
                    "name": "Frittata Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21248/hot-or-cold-vegetable-frittata/",
        "name": "Hot or Cold Vegetable Frittata",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2418440.jpg",
            "width": 2322,
            "height": 4128
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "Not your typical zucchini quiche. This fantastic medley of fresh veggies may be served either hot or cold. You can even cut it into small pieces and serve as finger food!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 tablespoons vegetable oil",
            "1 ½ cups chopped zucchini",
            "1 ½ cups chopped fresh mushrooms",
            "¾ cup chopped onion",
            "¾ cup chopped green bell pepper",
            "1 clove garlic, minced",
            "6 eggs, beaten",
            "¼ cup half-and-half cream",
            "2 (8 ounce) packages cream cheese, diced",
            "2 cups shredded Cheddar cheese",
            "4 slices whole wheat bread, cubed",
            "1 teaspoon salt",
            "¼ teaspoon ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet or frying pan, heat oil over medium high heat. Add zucchini, mushrooms, onion, green pepper and garlic; saute until tender. Remove from heat and let cool slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat together the eggs and cream. Stir in cream cheese, cheddar cheese, bread cubes and sauteed vegetables. Season with salt and pepper. Mix well and pour into prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for one hour, or until center is set. Serve hot or cold.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs",
            "Frittata Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PEGAREE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6066666666666665,
            "ratingCount": 150,
            "itemReviewed": "Hot or Cold Vegetable Frittata",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "469.7 calories",
            "carbohydrateContent": "12.1 g",
            "cholesterolContent": "233.6 mg",
            "fatContent": "39.2 g",
            "fiberContent": "1.9 g",
            "proteinContent": "18.8 g",
            "saturatedFatContent": "20.9 g",
            "servingSize": null,
            "sodiumContent": "789.5 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-13T04:44:58.687Z",
                "reviewBody": "My entire family loved this dish. It was really tasty and the texture was great. I increased the eggs to a total of 9 and used 1/3 cup of half and half. I used 2 medium zucchini a whole red bell pepper 8 oz of mushrooms 2 cloves of garlic and a whole yellow onion. I didn't do the measurments stated in the recipe. I chopped all of the veggies quite fine in the food processor and I was very happy with the result. Make sure you cook the veggies very well until all of the water is cooked off. I will definitely keep this recipe and make it again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DMHOLTON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1461812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-23T16:55:38.39Z",
                "reviewBody": "Great recipe cold or hot although a bit more flavorful hot.  Cutting the cream cheese in half also cuts the baking time a bit.  Watch carefully.  For more flavor I added 1/4 cup chopped fresh basil, eliminated the salt and pepper and substituted 1 tsp. Mrs. Dash and 1-2 tsp. Spike.  This recipe got raves from a very picky brunch guest!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dibykat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1628820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-14T18:19:58.593Z",
                "reviewBody": "another rave review! I made this for mothers day a big crowd. As hostess I LOVE these mix and dump recipes. This one has the added benefit of looking really pretty if you thinly slice a large tomato and embed it into the wet mixture and bake. Looks party and shower pretty but so easy. I used asparagus and canned artichoke hearts. 9 eggs as earlier posters suggested. Asparagus were steamed until crisp before baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "momzilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-09T23:00:56.817Z",
                "reviewBody": "This is always a hit at office parties, as well as my house.  I use red bell pepper instead of green; red onion; a package of frozen chopped spinach, thawed and well drained; and WAY more garlic.  I love cremini (also called baby portabella) mushrooms in this.  I believe I've used fresh tomatoes in this, and it was awesome.  Make sure to drain the sautéed veggies before and after cooling before mixing with egg and cheese mixture so your end product isn’t watery.  You can up the number of eggs if there appears to be too little to hold it all together, just eyeball it after mixing.  I can't eat wheat, so I skip the bread altogether.  I’ve made it with the 2 blocks of cream cheese, and just one, it was good both ways but VERY cheesy with both.  Adding herbs is always tasty, but for those merely looking for more kick, it’s all-about the hot sauce at the table so everyone can alter exactly to their taste.  Personally, I love chipotle Tabasco on any and all eggs.     ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mad Scientist",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2665918/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-16T00:41:28.233Z",
                "reviewBody": "This was excellent hot (and later cold!). I served this to guests and it flew off the platter! Next time I won't add oil and just saute in my nonstick pan (or spritz with Pam). I used chopped mushrooms and with those and the oil I ended up with a soggy mess in the saute pan. I had to drain/press out the liquid. If I hadn't this would have been too soggy to eat. Next time I will add meat and/or veggies to this: sausage chopped ham crab asparagus broccoli Swiss cheese etc. would be some wonderful additions. I used one brick of reg cream cheese and one of fat free. Next time I'll try this with Egg Beaters. Also be sure to butter the 9x13 pan well to help get these out. I took them out when they were just out of the oven; if I had waited much longer maybe they would have stuck a little more to the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "American Beauty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-21T01:27:06.07Z",
                "reviewBody": "This is excellent when served cold. It's so much better the next day! It was just ok hot out of the oven and that's why I gave it 4 stars. I topped it with sliced tomatoes and parmesan cheese after 50 mins in the oven. Also I increased the amount of eggs like suggested by other reviewers (to 10). I used fat free cream cheese and grated my own white cheddar Wisconsin Private Reserve. Additionally I used freshly ground pepper sea salt and red yellow and green peppers for color.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Elle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1535022/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-12T17:50:34.543Z",
                "reviewBody": "Great flavor! Very popular= served it to the PTA and they loved it. Added broccoli and substituted two small cooked potatoes for the bread. Have made it a couple of times. Once you get on to it it is easy to change vegetables/quantities. Cream cheese is a nice touch. Will print it out and cover it in plastic this time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNIE6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-09T01:58:49.84Z",
                "reviewBody": "I made this for my sisters bridal shower and it was a huge hit. It was really easy to prepare and I didn't have to worry about the timing. I did make some changes. I used 1 pkg of cream cheese as suggested and added 3 extra eggs. I also roasted the vegetables the day before at 400 for about 1 1/2 hours. I added about 4 cloves of garlic to the veggies and used red onion. This gave the frittata a great flavor and left little to do the next day. I can't wait to make this as a mexican frittata a roasted red pepper and artichoke heart frittata etc... YUM.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1576114/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-24T18:23:06.577Z",
                "reviewBody": "I made this dish to serve cold at a picnic dinner date with my husband at a local winery. My son got to it first right out of the oven and pronounced it \"bangin.\" While he preferred it hot rather than cold that didn't stop him from eating more cold for breakfast the next morning. I was glad it is a generous recipe because he put a serious dent in this and there was still plenty for us. As far as prep mods I was not stingy with the veggies and cubed a low carb onion bagel instead of the wheat bread making this recipe lower carb and more Atkins friendly. It s truly bangin' er... delicious and with the help of a food processor easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/851660/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T19:04:21.323Z",
                "reviewBody": "This was good but not great. I used the food processor to process all the veggies (zucchini yellow squash red and yellow peppers mushrooms and onion) If I do this again will add more herbs to liven up the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Wood Walker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/606798/"
                }
            }
        ]
    }
]