[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/152/breakfast-and-brunch/potatoes/",
                    "name": "Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24345/shredded-potato-quiche/",
        "name": "Shredded Potato Quiche",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6052440.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2018-06-08T13:15:30.000Z",
        "description": "Quiche with crunchy potato crust. A good one dish meal and a great way to use leftovers. You may also use 1 cup chopped vegetables of your choosing, such as onions, peppers, broccoli or tomatoes, etc.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (16 ounce) package frozen shredded hash brown potatoes, thawed",
            "¼ cup butter, melted",
            "5 eggs, lightly beaten",
            "1 ½ cups shredded Swiss cheese",
            "1 cup cooked ham",
            "¼ cup milk",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9 inch pie pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Press potatoes into greased pie plate. Brush with melted butter. Bake in preheated oven until lightly browned, about 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together beaten eggs, milk, cheese, ham, salt and pepper. Pour egg mixture into baked crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until center is set, about 20 minutes. The quiche will be browned on top and a knife inserted into the center will come out clean.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan Spickelmier"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.419354838709677,
            "ratingCount": 155,
            "itemReviewed": "Shredded Potato Quiche",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "525.4 calories",
            "carbohydrateContent": "23.3 g",
            "cholesterolContent": "320.4 mg",
            "fatContent": "42.5 g",
            "fiberContent": "1.6 g",
            "proteinContent": "27.9 g",
            "saturatedFatContent": "21.6 g",
            "servingSize": null,
            "sodiumContent": "722.1 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-20T23:18:51.5Z",
                "reviewBody": "I've been making this recipe for several years now. My husband likes it better than a traditional pie crust quiche. The only difference in the way I prepare it is to press the thawed hash browns between sheets of paper towel pressing as much moisture out as possible. Then after putting in the pan and brushing with butter, it gets baked at 425 for 25 minutes. That makes a well browned crust instead of damp and mushy. Make the egg and milk mixture adding any combination of meats, chopped vegetables and cheese. Be sure to test the center of the quiche for doneness before removing from oven (a knife inserted in middle comes out clean). A great meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-02T12:16:38.64Z",
                "reviewBody": "I have made this recipe several times with some changes.  I shred potatoes instead of using frozen.  After browning the potatoes in the oven, I layer some shredded cheese and sliced ham to keep the egg from baking through the potatoes.  I also put the cheese on top instead of mixing with the egg.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1054387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T14:07:41.85Z",
                "reviewBody": "This is a great dish! I made it to take to work when we were sampling different quiche recipes and everyone loved it.  I reduced the amount of butter to 1 Tbsp. instead of 1/4 cup.  I made another one for my friends to taste and they loved it to.  Great recipe Susan!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUICKHOUND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/648070/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-01T01:26:54.7Z",
                "reviewBody": "Okay, so now I will never again use a pastry crust for quiche!!  Which is good, because I'm sensitive to wheat and this is SO much easier.  Don't worry about crisping the bottom, it probably won't happen even if you bake it longer (which I did) and it doesn't matter.  An EXCELLENT way to make the filling is with diced pepperoni and cheddar (instead of the ham and swiss) with the additions of green pepper, onion, and some tomato if you wish. If you're worried about leakage through the crust, put a few slices on Buddig meat (ham, turkey, whatever) to coat the bottom before adding filling.  This went over BIG at Christmas brunch.  I'm telling you, you've got to try the pepperoni and cheddar combo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WONDERMAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/890559/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-02T19:20:32.41Z",
                "reviewBody": "A very good recipe yet a little bland. I will be making this again but adding a few extra ingredients to give it some extra kick. I followed one of the reviewers advice and patted my thawed hash browns in paper towels and brushed with melted butter the crust crisped up nicely. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DELTAQUEEN50",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/575179/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-07T12:57:24.543Z",
                "reviewBody": "I served this quiche last night when a few friends showed up for dinner unannounced. I had baked the quiche the night before since I was planning on getting home late from work and not having time to cook dinner. After about 2 minutes in the microwave it was ready to serve and got rave reviews from both my husband and our friends who wanted the recipe. Instead of using ham I substituted bacon and added chopped red pepper green pepper onion and mushrooms. I did not have any packaged frozen hash browns so I shredded two potatoes in my food processor. Like most of the reviewers I had trouble getting the potatoes to brown. I think next time I will cook the hash browns in a skillet with a little bit of oil as I would any hash browns and then transfer to the pan to top with ingredients and bake so that they have the crunch that I love in hash browns. This is a very versatile recipe I look forward to experimenting with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MBC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1211289/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-20T01:28:37.187Z",
                "reviewBody": "This was excellent. I made several changes. I did not thaw the potato before pressing into the pie pan and I baked it at 400 degrees for roughly 20 minutes before adding the filling. I used spinach sauted mushrooms and onions and grandulated garlic in place of ham and I used sharp cheddar and two slices of white american for the cheese. I also used just 4 eggs and half and half instead of milk (that's what I had). After baking for 20 minutes at 400 degrees the crust was brown and crispy and everyone loved it. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Erika P.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1866988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-13T01:43:38.14Z",
                "reviewBody": "The first quiche I've ever made and it turned out \"good\" in my husband's words - who is THE chef in the family.  I melted the butter first in the oven, added a chopped onion to that, pressed the thawed potatoes and baked for 25 minutes, then added the egg mixture.  Baked for 30 more minutes.  Let it cool for about 10 minutes befor cutting.  Wonderful brunch idea.  Thank you....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATTI777",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1344632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-01T22:49:57.727Z",
                "reviewBody": "I loved this recipe. I did not use all the butter that it called for, actually I used the spray marg. to cut down on calories. I bought sliced swiss and layed it on the bottom of the potatoes then chopped frozen and squeezed dried spinach then poured the eggs on top and then added more cheese. I used 3 whole eggs and 2 whites and the milk was a can of evaporated skim milk. It was lower in calories but fabulous. I will make this again and in muffin tins for brunch with friends.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUV2COOK10",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1152081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-22T22:00:36.900Z",
                "reviewBody": "This was alright. A little too much potato for me. That's pretty much all I could taste. I was hoping the crust would've been crispier, but it was pretty mushy. I patted dry the thawed potatoes as others suggested, and baked for at least 15 minutes before adding the egg mixture. I also had to bake the egg mixture longer than the instructions stated. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Staloch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1229781/"
                }
            }
        ]
    }
]