[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2421/desserts/frostings-and-icings/buttercream/",
                    "name": "Buttercream",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7277/french-buttercream-frosting/",
        "name": "French Buttercream Frosting",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6574603.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1998-03-10T01:01:16.000Z",
        "description": "This buttercream is great for icing cakes, and writing on them.  It gets hard when refrigerated, so you have to let it come to room temperature before serving.  You cannot make flowers with this recipe.  I use this recipe every time I make birthday cakes for my family.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 cups",
        "recipeIngredient": [
            "1 cup unsalted butter",
            "½ cup shortening",
            "2 cups confectioners' sugar",
            "1 teaspoon vanilla extract",
            "¼ teaspoon butter flavored extract",
            "½ cup heavy whipping cream",
            "4 tablespoons all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix heavy cream and flour in a small bowl.  Heat the mixure in the microwave for 45 seconds on high.  Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a mixing bowl, combine butter, shortening, confectioner's sugar, vanilla extract and butter extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using and electric mixer, beat on low until combined. Then beat on medium speed for 6-8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Next add the heavy cream mixture, and beat on medium speed for another 10 minutes. ( Mixture will appear soupy at first, but will become fluffy.)\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings",
            "Buttercream"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kristen Pontier"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.367741935483871,
            "ratingCount": 155,
            "itemReviewed": "French Buttercream Frosting",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "333.7 calories",
            "carbohydrateContent": "22.2 g",
            "cholesterolContent": "54.3 mg",
            "fatContent": "27.6 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.6 g",
            "saturatedFatContent": "14.1 g",
            "servingSize": null,
            "sodiumContent": "6.1 mg",
            "sugarContent": "19.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-11T00:38:57.6Z",
                "reviewBody": "You CAN make flowers!  I use this frosting recipe (slightly altered) on all my personal and retail cakes now.  Not too sweet, light and fluffy and holds color and flavor well.  To make flowers, etc, put the frosting in the fridge (best in a stainless steel bowl) for about 20 minutes, then beat on medium for about 15 seconds - viola!  However, if you have warm hands like me, you need to be able to work a little fast.  Once finished, refridgerate cake until an hour before serving.  Unless drastic temperature change, colors won't bleed and decorations retain shape.  HINT: add just a tad bit more flour to the cream mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CakeMadness!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cakemadness/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-12T01:50:42.617Z",
                "reviewBody": "This recipe has unreached potential. Spreading consistency was nice. However, the flour was noticeable in my first sample taste of the frosting. Also, I didn't use the butter extract because I don't like artificial ingredients. However, the large amount of real \r\nbutter was overwhelmed by the shortening. I'm going to try the recipe again but with only 3 tablespoons flour and with butter in place of some of the shortening. Also, I doubled the amount of vanilla. I would also add at least 1/2 cup more powdered sugar. The recipe is a great starting place, just needs a little refinement.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BEACHBUM2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/532186/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-21T06:27:32.373Z",
                "reviewBody": "This was very close to what I was looking for. My friend is a professional baker and award winning designer. She has a \"top secret\" French Butter Cream frosting she uses and I have been trying to find something close. I think this is as close as I am going to get!\r\n\r\nI used regular butter (I did not have unsalted on hand) and butter flavored Crisco. There was enough to frost a 2 layer 8\" round. It was smooth and creamy. \r\n\r\nIt was not stiff enough to decorate with, unless whatever was not in the bag was put in the fridge. It was way too soft for flowers. I combined it with a regular shortening based buttercream for decorating. (I chose a basketweave on the sides and roses on top.)\r\n\r\nThanks so much for a great recipe! \r\n\r\nP.S. It is wonderful on carrot cake. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIKENDREA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/789217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-09T20:42:04.197Z",
                "reviewBody": "This frosting is so light and fluffy, you might think it was made by angels! Based on suggestions from other reviewers, I used butten instead of shortening and reduced the flour to 2 Tablespoons. The result was heavenly! I wouldn't hesitate to make this again and again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chocolat3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2736901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-10T20:33:58.81Z",
                "reviewBody": "Sorry Kristen we didn't like this at all. We actually ended up throwing it away and making a batch from a different recipe. Not sweet enough not enough flavor flour mixture was funky too heavy on the butter & shortening. Don't waste your time and ingredients on this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "TIPPERBABE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-02T14:32:33.813Z",
                "reviewBody": "My husband's family doesn't like traditional sweet buttercream frosting, but I didn't want to deal with whipped cream for a variety of reasons, so I was looking for a buttercream recipe that tastes more like whipped cream.  I made this recipe with the whisk attachment on my Kitchenaid, and it came out much creamier and smoother than regular buttercream.. great consistency.  However, I would NOT say it isn't as sweet.  I did use a little extra powdered sugar since some reviewers said to add more, and I think it was overkill.  Icing the cake was very easy, especially for perfectionists like me who are never satisfied with the way it looks.  It didn't crust over and I could re-smooth it over and over.  I frosted the cake 2 days before my son's birthday party and put it in the fridge, took it out for a couple of hours the day before to decorate it (with regular buttercream), and then took it out of the fridge about 30 minutes before serving.  The frosting tasted the same as it did the day I made it.  I will definitely use this recipe again, with a little less sugar and maybe a touch more vanilla. I changed the servings to 18 to make sure I had enough to frost a 2-layer 9x13 cake, and I had about 1 cup left over. Great recipe - thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LisaD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/687281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-17T20:00:23.19Z",
                "reviewBody": "I really wasn't happy with this frosting. I assume the flour is added to give structure in light of there not being enough sugar for the large amount of butter/shortening. The lack of sugar butter/shortening overload and funky flour texture/taste combined with the half cup of cream makes this super soft very greasy and not nearly sweet enough (I have zero sweet tooth so if I'm saying it's not sweet enough there's a problem). And not to be nitpicky but French buttercream is made by beating a sugar syrup into egg yolks then adding softened butter. This isn't it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "campagnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-31T01:58:26.797Z",
                "reviewBody": "Wonderful Recipe. Used the suggestion for butter shortening and the buttercream was a hit. Used this recipe to fill ice and decorate sister's wedding cake. I had several professional bakers at the wedding compliment me on the buttercream. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bakerychick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684541/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-04T16:42:15.38Z",
                "reviewBody": "I have used this recipe dozens of times and LOVE it! Everyone I serve this to is impressed by the texture and taste. I like a more whipped cream flavor so I always make the following changes: #1 - Omit the butter flavor extract and increase the vanilla to 2 tsp. #2 - I also add 1/8 more whipped cream to recipe to boost cream whipped cream flavor. Some popular variations I've done: Add seedless strawberry jam for an awesome cake filling or reduce shortening to 1/4 cup and add 1/4 cup cream cheese (MUST be room temp) to give more stability for many layers. To better transport the finished product I'll refrigerate or freeze prior to moving it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2266059/"
                }
            }
        ]
    }
]