[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/712/world-cuisine/european/eastern-european/",
                    "name": "Eastern European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/713/world-cuisine/european/eastern-european/czech/",
                    "name": "Czech",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25195/saucy-stuffed-peppers/",
        "name": "Saucy Stuffed Peppers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3113284.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2018-06-08T13:16:15.000Z",
        "description": "My Slovakian grandmother always made huge pots of this during the winter time.  I'm a vegetarian now, and can safely say that this is the one dish that I really miss eating.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "8 large green bell peppers",
            "6 tablespoons butter",
            "1 large yellow onion, diced",
            "1 ½ pounds ground round",
            "salt to taste",
            "ground black pepper to taste",
            "1 cup uncooked white rice",
            "1 gallon tomato juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Wash the peppers thoroughly. Make a circular incision around the stem to remove it. Once stem has been removed, remove seeds, and rinse the inside of the pepper. Discard seeds and stems and set peppers aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a skillet over medium heat, melt the butter and saute onion until translucent.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, combine the onion and butter mixture with the ground beef and mix well by hand. Sprinkle in salt and pepper to taste. Slowly pour in the rice, while mixing by hand. Mix thoroughly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stuff the meat and rice mixture into the peppers. Coat the bottom of 1 or 2 large pots with oil. Place the stuffed peppers into the pot(s) leaving a 2 inch space at the top of the pot. Pour in tomato juice until peppers are covered. If there is leftover meat mixture, form into balls and add to the tomato juice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat on low for 2 to 3 hours. Stir every 20 to 45 minutes. Juice will reduce to a thick sauce. You can tell that the peppers are done when they are splitting at the sides.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Eastern European",
            "Czech"
        ],
        "recipeCuisine": [
            "European",
            "Eastern European",
            "Czech"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MOELIZ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.322222222222222,
            "ratingCount": 90,
            "itemReviewed": "Saucy Stuffed Peppers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "467.3 calories",
            "carbohydrateContent": "52.9 g",
            "cholesterolContent": "82.2 mg",
            "fatContent": "19.8 g",
            "fiberContent": "4.4 g",
            "proteinContent": "24 g",
            "saturatedFatContent": "9.7 g",
            "servingSize": null,
            "sodiumContent": "1417.6 mg",
            "sugarContent": "23.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-05T23:39:58.84Z",
                "reviewBody": "I did this recipe but I'll go 1 less step. I did not sautee the onions or add the butter. No need. Ever since I was a kid my mom never used a recipe but made peppers without precooking everything. This was the only recipe I could find that did not ask you to do that. She thought I was nuts to precook all my ingredients. I used this recipe for the amounts. I used uncle Bens converted rice and added one egg to the meat mixture. I also added italian seasoning along with the salt (must be kosher or sea salt huge difference!)and pepper. I used 85% lean ground beef. I had enourmous peppers (i used 4) so I halved them and layed them in a deep baking dish. Instead of tomato sauce I used 2 jars of marinara and 1 jar of water. I poured them over the stuffed peppers and loosly covered the baking pan. I baked it at 300 for 3 to 3 1/2 hours. They came out perfect! My baking dish was stoneware so I do not know if that makes a difference but it was great! The peppers were not way overcooked at all. Try it this way. It is soooo easy! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMMYDACHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/920726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-23T19:52:02.433Z",
                "reviewBody": "FINALLY, Someone who knows how to make Stuffed Peppers! That is right. You do NOT cook the meat mixture before adding it to the peppers to bake. It WILL bake fully in the oven.  If you cook the meat before you will lose all the needed flavor! You do cook the rice, then chopped onion, Italian Seasoning, a little garlic and pepper. Mix this all together with the meat add to peppers. I would have given this 5* but you do not have Tomato Soup. If you use this instead of the Juice,it has much more flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURENELYSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1246500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-14T14:21:42.303Z",
                "reviewBody": "As originally submitted the result is very soft and a bit bland with a steamed instead of browned texture. But my husband mopped up every bit off his plate with bread and we thought it was an ideal winter comfort food. We even got our 9 year old to eat it when we omitted the onions. It was very fast and easy to put together. I loved that we could skip precooking of the rice and browning of the beef but did not like having to cook the onions. To save time I melted the butter in the microwave stirred in the chopped onion and nuked it until translucent. If you use converted rice you can put it all together and pack it into a crockpot on low for 7-10 hours. Use only half the liquid and pour it over the tops of the peppers. Top with your favorite cheese just before serving. I tried it with pasta sauce and tomato soup instead of juice with good results. I have also substitued any combination of bits of garlic corn kernels celery carrots or cooked beans for all or part the onion when onion haters came to dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNTHIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-10T02:05:04.967Z",
                "reviewBody": "This was pretty good! I used V8 instead of plain tomato juice and red bell peppers instead of green. I also added some \"Mrs Dash\" Itailian seasoning and crushed red pepper to give it some zing. Give this one a try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MARY MOON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/252238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-13T00:17:23.967Z",
                "reviewBody": "I thought this was outstanding - best stuffed pepper recipe I've come across yet. I made mine with red green and yellow bell peppers and added a little brown sugar to the tomato juice while it was simmering. Wonderful! Thanks for sharing it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KELLYCLARK99",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/340452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-04T17:14:04.327Z",
                "reviewBody": "We really liked this recipe. I added some chopped celery and a grated carrot to the onion along with some minced garlic. I also used V8 juice and added some seasonings to that. It was GREAT! Will make again soon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROBINS31",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/694627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-22T22:55:58.203Z",
                "reviewBody": "This was GREAT! I am eating it as I type. I cut the recipe in half and did it with 2 red 2 green. I altered the recipe due to all the reviews about it being bland. It does say salt and pepper to taste. I added a heaping teaspoon of minced garlic to the onion and butter mixture. I even added 1 tablespoon of fresh parsley to the meat mix and salt and pepper. I also used a large can of tomato sauce and added about 1 1/2 large cans of water. (I used the can of sauce to measure) I cooked on medium for about 2 hours. (a more current review)-when I posted the previous info I did not write if I used instant rice or not. Recently I used this recipe again but with reg. rice and like previous posters the rice on top was crunchy while the bottom was mush and the pepper was so soft it fell apart by the time it was done cooking. USE INSTANT that's what I must have used the first time and had wonderful success. I usually use instant for everything but I was out this time. INSTANT RICE IS KEY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "calead910",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/500195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-04T17:13:25.483Z",
                "reviewBody": "This recipe turned out perfectly! I added some garlic tabasco and extra spices (oregano and basil). It was excellent. A meal in a pot! I will definitely make it again.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OLIVIABREEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/348659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-08T00:33:40.2Z",
                "reviewBody": "Very disappointing. I read the reviews and tried to alter it but it still didn't help. The taste was bland even after adding garlic and italian seasonings. And the instructions could be better. It took me awhile to figure that this is done on the stovetop and it doesn't specify whether to use \"minute rice\" or regular rice. I used jasmine rice figuring that cooking for 3 hours would cook it - wrong. After 2 hours the rice on the top was still crunchy so I had to tip them over to try to get them in the sauce enough to cook the rice even though I was basting them every 15-20 minutes. And I didn't know if I should cook them covered or not. I left the lid on thinking that would help the rice nope. Oddly the rice that was deep in the pepper got horribly mushy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "LKANE99",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/364003/"
                }
            }
        ]
    }
]