[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25354/egg-and-cheese-puffs/",
        "name": "Egg and Cheese Puffs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4218725.jpg",
            "width": 2272,
            "height": 2272
        },
        "datePublished": "2018-06-08T13:16:24.000Z",
        "description": "I sometimes take this to work in the mornings and everyone who has ever tried it has asked for the recipe.  Try it with your favorite salsa on top. You may add cooked sausage and/or sauteed green onions if you prefer.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT14H20M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "1 pound bacon",
            "10 eggs, beaten",
            "1 (16 ounce) container cottage cheese",
            "1 pound Monterey Jack cheese, shredded",
            "1 (7 ounce) can diced green chile peppers, drained",
            "½ cup all-purpose flour",
            "½ cup butter, melted",
            "1 teaspoon baking powder",
            "½ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine eggs, cottage cheese, Monterey Jack cheese, chile peppers and bacon. Cover and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "The next morning, preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove cheese mixture from refrigerator; stir in flour, butter, baking powder and salt. Spoon batter into 24 lightly greased muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 25 to 30 minutes, until puffs are slightly golden on top.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.511363636363637,
            "ratingCount": 264,
            "itemReviewed": "Egg and Cheese Puffs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "251.4 calories",
            "carbohydrateContent": "3.4 g",
            "cholesterolContent": "120.2 mg",
            "fatContent": "21 g",
            "fiberContent": "0.2 g",
            "proteinContent": "12.2 g",
            "saturatedFatContent": "10.1 g",
            "servingSize": null,
            "sodiumContent": "550.3 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-07-24T13:56:06.64Z",
                "reviewBody": "I was skeptical... I really was.  I mean, the recipe only had 2 reviews and I usually like to try more \"proven\" ones.  Plus I usually dislike cottage cheese in recipes.\r\n\r\nBut this was AWESOME.  I follow a basic low-carb way of eating, and this is great.  I can't wait to see how they do with freezing and reheating- it'll give me a way to have a breakfast on the go.\r\n\r\nI can easily see replacing the bacon with diced ham or sausage crumbles.  Everything else, I'd keep the same.  My husband wants me to try making it without the green chiles, but they are so good if you are using salsa on top!\r\n\r\nOne hint- USE paper muffin cups... even with a well greased muffin pan, the egginess doesn't allow them to come out easily.  The paper cups would be the answer....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA in STL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/600974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-10T16:56:42.127Z",
                "reviewBody": "These were fabulous (with a few modifications)! I did not mix these up the night before - I don't know what the advantage would be. This is a quick breakfast dish already. First, 1/4 cup of butter is all that is needed. Secondly, 2 cups of shredded cheddar/monterey jack cheese is a better amount. I can't imagine this with more cheese than that. I used diced ham and sprinkled some freeze dried chives on the tops before baking for extra flavor & color. A note on pans - for one tray, I used my Pampered Chef stoneware muffin pan (still sprayed with Pam) and they puffed up beautifully & came out perfect. My other pan, an old non-stick sprayed with Pam - didn't come out as puffy, or as easily. I will buy a 2nd stoneware pan now! Thanks for the yummy breakfast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Plourde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2078358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-26T21:36:26.093Z",
                "reviewBody": "These are great for an easy breakfast for company or yourself! They feeze great and can be thawed in the fridge overnight and just popped in the microwave for easy warming. They are so versitile and easy to make to your liking. I usually use ham to make it even easier and add whatever veggies and cheese I have on hand. Yummy....also the butter is NOT needed!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bamhall",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1785266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-10T18:36:35.78Z",
                "reviewBody": "No doubt this is worth 5 stars!!! The green chilis were what made it - don't leave them out. I will though make it a little less fattening next time by substituting ham for bacon use fat free cottage cheese and much less butter! Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1292930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-18T13:59:51.483Z",
                "reviewBody": "OH MY GOODNESS! This rec. is easy to make and impressed those who sampled it! YUM! I preapred it for the first time this morning and though I typically burn anything I bake/cook in muffin pans these puffs cooked to perfection! I forgot to include the butter but they still came out really nice -- an I suppose we saved ourselves needless calories and fat!:) The extra puffs are in my freezer... I 'll have to let you know if they thawed/microwaved well as leftovers. Try this; you'll love it! And think of all the modifications you can make to it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bea Trent",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1458359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-01T23:08:13Z",
                "reviewBody": "Delicious! I brought these to work and everyone asked for the recipe. They are like miniature crustless quiches. I will definitely make these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bbqgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/298581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-16T13:42:58.903Z",
                "reviewBody": "Awesome! Highly recommended recipe! I loved that it could be mixed up the night before. I didn't use as much cheese as called for but used sharp cheddar for flavor. This would be great with sausage also. These reheat nicely in the microwave the next day. Thanks Karen!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristin Pozniak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/242909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T18:23:04.937Z",
                "reviewBody": "This is my husband's favorite breakfast treat. I've shared it with others for fabulous potlucks and even a Christmas brunch. Always popular and super-easy to make! I've never had a problem with them sticking which is odd given that so many people have complained of sticking. I do use butter-flavored cooking spray to lightly grease my non-stick muffin pans though. And I use a spoon to sort of edge around each puff to loosen it from the pan edges. If you want a little green but don't care for the canned chiles you can use chopped fresh baby spinach or parsley. I also substitute diced ham for the bacon most times. I use 8 oz of shredded Mexican blend cheese in the mix and then about another 4 oz on top. After accidentally forgetting to add the melted butter once I've now omitted butter from the recipe altogether. It doesn't need it. You could probably add anything you would throw into an omelette to tailor these to your liking. Just make sure you dice or shred pretty small. Anything too big or heavy will sink to the bottom and not mix properly while baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1588026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-18T20:49:37.437Z",
                "reviewBody": "I love this recipe! I added extra cheese and just a pinch of chopped onion to the milk and egg mix and it came out fabulous! I ate it with cold sour cream just a suggestion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "drb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1197184/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-17T11:42:40.603Z",
                "reviewBody": "These got such rave reviews... I'm really surprised, but I just didn't like them. I used muffin liners as some people suggested, but they were really hard to peel off the puffs.  The chile peppers give this a weird taste. If I were ever to make these again, I would substitute onions and peppers or even spinach.  Also the amount of cheese is ridiculous, and I don't know what the point of the melted butter is.  I halved the amount of monterey jack and halved the amount of butter and these were still horribly greasy.  When I took them out of the muffin pan there were little pools of oil left behind.  Ugh. I can't imagine what it would have been like had I used the amounts stated in the recipe.  I was hoping these would make a great breakfast-on-the-go option, but they just weren't for me.  I'll keep looking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Steph",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1540228/"
                }
            }
        ]
    }
]