[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26008/cinnamon-coffee-frosting/",
        "name": "Cinnamon Coffee Frosting",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F376298.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2018-06-08T13:16:54.000Z",
        "description": "My Mom has made this cake frosting for as long as I can remember; she has no idea where she got it but it is very unique and absolutely delicious on a chocolate cake.  I now make it for my family and they love it, too.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT0H10M",
        "recipeYield": "1 frosting for 1 cake",
        "recipeIngredient": [
            "1 teaspoon instant coffee granules",
            "½ teaspoon ground cinnamon",
            "1 pinch salt",
            "1 teaspoon vanilla extract",
            "½ cup butter, softened",
            "3 cups confectioners' sugar",
            "⅓ cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mash instant coffee with the back of a spoon until powdery. Stir in cinnamon and salt. In a large bowl, beat the butter until smooth, then stir in spice mixture and vanilla. Alternately beat in confectioners' sugar and milk until desired consistency is achieved.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Caffeinated2733"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.553672316384181,
            "ratingCount": 177,
            "itemReviewed": "Cinnamon Coffee Frosting",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "145.9 calories",
            "carbohydrateContent": "23.8 g",
            "cholesterolContent": "15.7 mg",
            "fatContent": "5.9 g",
            "fiberContent": null,
            "proteinContent": "0.2 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "43.2 mg",
            "sugarContent": "23.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-03-05T20:35:43.78Z",
                "reviewBody": "This is wonderful! As a previous reviewer wrote it is excellent on the Black Magic cake (I made 2 today one for us one to give away). I make 1-1/2 times the frosting recipe to fill and frost the Black Magic Cake. Also I add a teaspoon or 2 of boiling water to the dry coffee and cinnamon mixture to make them dissolve before adding them to the butter. This makes the appearance less gritty and more smooth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AUNT MAMIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/252203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-14T14:45:52.53Z",
                "reviewBody": "This recipe is fabulous. Gave it only 4 because I tweaked it way too much. Like other reviewers suggested I mixed the sugar and milk in slowly checking for consistency. When I checked the taste and consistancy after 2 cups of sugar and about 1 tbsp of milk it was perfect. The frosting wasn't too sweet which is the way we like it. I suspect 3 cups of sugar would make the frosting very sweet which you may need when baking for kids. But here we are not too fond of extra sweetness so I stopped with 2 cups. I also added about a cup of chopped nuts which made the frosting extra special. I didn't add any vanila but added another tsp of instant coffee. The coffee taste was perfect and not at all overpowering which I was apprehensive about. I used this frosting with a coffee cake and the end result was fabulous. Will def be making this again probably with a chocolate cake the next time. Btw this recipe is not enough if you want to fill as well as frost a cake. I just frosted and it was just sufficient.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHANDYCOOKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1441552/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-12T01:45:29.077Z",
                "reviewBody": "WOW! This is fantastic! I admit I didn't follow the recipe to a T. I didn't have instant coffee so I brewed strong coffee & used that instead of milk. I also added an extra .5 tsp of cinnamon. It was amazing! Goes so well with chocolate cake.\r\n\r\nUpdate: I gave this a great review before anyone else had tasted it. Although I loved it, I should note that everyone else I served it to disliked it! They thought it was too sweet and/or didn't like the flavor. Some thought it was just ok. Just thought I should add that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SILLYSARAHC123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/843317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-20T04:20:48.453Z",
                "reviewBody": "Omigosh this is my new favorite frosting. I first tried it on the black magic cake and let me tell you--perfect combination. Thanks to all the other reviewers for the suggestion! I don't keep instant coffee on hand so when I brewed the very strong coffee for the cake I brewed a little extra and used about 2/3 milk and 1/3 coffee where the recipe called for milk. I definitely think that if you are having trouble reaching the desired consistency do NOT keep dumping in powdered sugar as it really takes away from the buttery cinnamon flavor that's to die for. Instead I suggest using a minimal amount of liquid to get started and add more if needed. My next use of this recipe will be to top my homemade cinnamon rolls! (At hubby's request) Thanks so much for an awesome recipe! --since then have made it a couple time the right way...wow!! I actually now use more coffee granules for an extra flavor boost and a splash of butter flavoring if the consistency comes out funky and I have to add extra sugar (weird how that happens sometimes!!) and it's a definite family favorite!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "snugglepunkin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1101702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-26T17:44:55.167Z",
                "reviewBody": "Yum! I made this with Black Magic Cake from this site a great match. I warmed up the milk prior and disolved the instant decaf coffee in that. It turned out beautifully!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GOBUCKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/842110/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-23T21:51:48.613Z",
                "reviewBody": "First off I want to say that this was an excellent base to an OUTSTANDING frosting only because I was missing a few ingredients and wanted to try a few substitutions for personal taste which is why I rate three stars (the original recipe lack actual cinnamon flavor appears gritty and is WAY overly sweet). First I wasn't spending 4 on instant coffee for one teaspoon I am on a budget here. So I took a measuring cup and put one part milk one part REALLY strong brewed coffee and a big spoonful of sour cream. I wanted the consistency to hold up as my first batch wasn't stiff enough so I did add some shortening. 1tbs Cinnamon 1tsp 100% maple syrup 2tbs Ghiradelli unsweetened cocoa powder teeny tiny splash of vanilla extract and rum. Fabulous texture consistency and the flavor was amazing! If your frosting is too thin try using some Crisco.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cassie Carola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2325240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-23T04:37:58.573Z",
                "reviewBody": "The cinnamon got lost in this recipe so I ended up increasing it quite a bit. Very nice flavor combination between the cinnamon and coffee. You can play around with it to have either flavor play dominantly. I love this recipe and will use it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-14T16:36:35.933Z",
                "reviewBody": "What a unique frosting flavor! Very good on chocolate cake. Save the step of mashing the instant coffee by dissolving it in a little water or the vanilla. Excellent!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Springchick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-21T17:58:07.067Z",
                "reviewBody": "Absolutely amazing... made to top Cappuccino Bon Bons from this site. I did make a few minor modifications: I added a tbsp of unsweetened cocoa powder and a splash of vanilla flavored coffee creamer and reduced the milk and confectioners' sugar by probably half (eyeballed it). The result was an incredibly smooth fluffy and absolutely delectable topping. I can't wait to try this on other desserts!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHYCOOKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1194117/"
                }
            }
        ]
    }
]