[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26249/alfredo-mostaccioli/",
        "name": "Alfredo Mostaccioli",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6566548.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2018-06-08T13:17:02.000Z",
        "description": "My friends love this Alfredo sauce and it can be used with any type pasta that will hold sauce well.  I've also used this as a base for making a white pizza and it is excellent!  Enjoy!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (16 ounce) package mostaccioli",
            "1 cup heavy cream",
            "½ cup butter",
            "½ cup grated Parmesan cheese",
            "1 cup chopped fresh parsley",
            "1 teaspoon salt",
            "¼ teaspoon freshly ground black pepper",
            "⅛ teaspoon garlic powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil.  Add pasta and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine heavy cream and butter in a Dutch oven or large, heavy saucepan over medium heat.  Heat until butter melts, stirring occasionally; be careful not to bring mixture to a boil.  Stir in Parmesan cheese, parsley, salt, pepper and garlic powder.  Toss with cooked pasta and serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kimber"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.481751824817518,
            "ratingCount": 411,
            "itemReviewed": "Alfredo Mostaccioli",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "429.6 calories",
            "carbohydrateContent": "42.4 g",
            "cholesterolContent": "75.7 mg",
            "fatContent": "25.3 g",
            "fiberContent": "2.2 g",
            "proteinContent": "10.3 g",
            "saturatedFatContent": "15.3 g",
            "servingSize": null,
            "sodiumContent": "467.3 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-18T17:02:50.297Z",
                "reviewBody": "My reason for not giving it a five is due to the fact that the recipe should tell the novice cook to let the sauce sit for a moment so that it will get a bit thicker.  I put it in directly with the pasta(as listed in the directions), and for the first 5 mins had pasta soup.  It eventually thickened up, and had great consistency.\n   On the \"taste\" end of things, I thought the sauce was awesome.  I'm being serious.  Now, I'm a big fan of the Alfredo from Olive Garden, and anyone who eats there regularly will know what I'm talking about.  I'll have to say, this version is second to Olive Garden's.  I was more than pleasantly surprised.  \n   Anyone who loves some good ol' Alfredo, definately try this one out.  Also, I added extra parmesan to the sauce.  It was magnifico!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chase Greene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2029954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T21:12:16.513Z",
                "reviewBody": "I have one major complaint: The recipe doesn't make enough sauce! Eight servings? No way. At least not with the size servings we have at my house. There were 2 1/2 servings at best. Next time I will triple or quadruple this. I reduced the salt by half and it was ever so slightly salt top-heavy probably because the butter I used was salted. But that is a minor easily corrected issue. And it's a common reason why recipes come out too salty. As another reviewer recommended another reason that it might be too salty for some is if one uses the off the shelf parmesan cheese. Since it's such a major ingredient spring for the fresh stuff. I used freshly grated asiago cheese and it was spectacular. I thawed and microwaved a couple of chicken breast cutlets. Slicing the chicken in long pieces makes for a nice appearance if one places the cutlet on the pasta in it's original shape--not to mention a great recipe enhancer making the pasta a full-on meal. Pasta chicken sauce in that order. What a meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-06T00:45:53.827Z",
                "reviewBody": "With this recipe the alfredo sauce is to die for however the type of pasta that is mentioned in this recipe is not good. Mostaccioli is a heavy pasta that does not work well with the alfredo sauce. When I make this sauce I use Fettuccini. The Fettuccini makes this dish one of the bests.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BENAMB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1275836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-11T04:52:36.907Z",
                "reviewBody": "This recipe is a KEEPER. A genuine GREAT \"base\" for dressing pasta dishes. I've been using it for years (just never knew -- or even thought about -- the proportions). Thank you. Given this SAUCE tossed over pasta you can decide about your accompaniments (chicken beef seafood vegetables etc.). Add whatever you like (cooked onions peppers peas corn carrots zucchini; cooked beef poultry seafood or whatever) to your PASTA. If you feel like it add (fresh is preferred but dried is OK too) Tarragon Dill Marjoram Basil Oregano or Cilantro. Got a man (or older boy teen) in your home? Think about incorporating bacon and/or one or more \"shakes\" (approximately 1 T.) of Worcester Sauce and/or Hot Sauce and/or prepared Horseradish) into the SAUCE. Use ANY pasta of your choice. IMO the \"thicker ones\" (e.g. rigatoni rotini gremeli penne etc.) are preferred (they're more prone to absorbing the SAUCE as well as the flavor(s)). Use THIS SAUCE and your own preferred \"accompaniments\". It's unlikely you'll go wrong! We use SALTED butter in my home. Therefore I do not add salt during preparation of ANY dish I prepare (the shaker is on the table at all times but no one seems to notice). At the same time this recipe seems to \"work better\" when UNSALTED/SWEET butter is used. My advice: start with this SAUCE (it's really good) and \"run with\" the rest of your mral.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JoAnn Cambareri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2414866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-26T08:13:31.323Z",
                "reviewBody": "Though this was pretty good the first time I made it we added chicken and I thought it was still a little salty. Also though I like parsley we thought there was a little to much. Now when I make it we cut back on the salt and parsley and use penne pasta. I also use chicken breast cut into chunks and sauteed in olive oil. If your looking for a little extra kick cut up your chicken breast add to a ziplock back with cajun seasoning shake till all chicken pieces are coated sautee till no longer pink and add to sauce so flavors blend. Yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cooking 101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1793893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-10T00:42:30.723Z",
                "reviewBody": "Great with shrimp added too We loved this! But I just had to say 'NO' to the heavy cream. I used my standard replacement carnation fat free evap milk--12 oz can 1/2 cup salted butter and 2 TBS low fat cream cheese. Real garlic not powdered and NO SALT. sooooo good with chicken and grilled eggplant",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HBfuninsun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1565839/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-01T20:57:50.17Z",
                "reviewBody": "I was looking for a simple recipe and I finally found it. I modified it somewhat. Instead of boiling the pasta and making the sauce seperate I used 2 cups of water and 1 cup of 2% milk added the butter and parsley left out the salt. I brought the mixture to a boil then added 1/2 box of no.9 spegetti. I boiled that till the liquid was reduced by 1/2 took if off the heat then added the parmesian cheese. I let it stand till all the liquid was absorbed by the pasta we each added the salt to taste and it was great!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "REEREE818",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T21:05:55.84Z",
                "reviewBody": "Ugh! Not sure what I did wrong but this was sooooooo salty. I used dried parsley but I halfed it. I tried to add more cream and milk but it didn't help. I finally put potatoes in it to absorb some of the salt. I will NOT make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JYPOLLOCK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-21T10:32:04.717Z",
                "reviewBody": "I think this is an excellent sauce just as it is and the type of pasta you picked to go with it was a good choice as well. I usually add some vegetables to it-sometimes asparagus sometimes fried zuchinni but always top it off with spinach and chopped roma tomatoes (cooking everything but the tomatoes before adding them in of course). The vegetables complement this dish and make for a nice presentation. Thanks for the yumminess Kimber. =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MichaelinLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1868556/"
                }
            }
        ]
    }
]