[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1285/meat-and-poultry/chicken/chicken-breasts/breaded/",
                    "name": "Breaded",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27838/chicken-monterey/",
        "name": "Chicken Monterey",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F18391.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2018-06-08T13:17:26.000Z",
        "description": "This is a delicious entree - easy to make and elegant enough for a dinner party!!!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "½ cup butter, divided",
            "½ cup chopped onion",
            "8 large mushrooms, chopped",
            "1 clove garlic, minced",
            "2 tablespoons all-purpose flour",
            "½ cup chicken stock",
            "1 teaspoon celery salt",
            "½ teaspoon white pepper",
            "½ cup white wine",
            "1 ½ cups shredded Monterey Jack cheese",
            "1 cup all-purpose flour",
            "salt and pepper to taste",
            "8 skinless, boneless chicken breast halves - pounded thin"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). Lightly grease a medium baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1/4 cup butter in a medium skillet over medium heat. Stir in onion, mushrooms and garlic. Cook until tender, about 10 minutes. Stir in 2 tablespoons flour, chicken stock, celery salt, white pepper and white wine. Reduce heat to low, and cook, stirring frequently, until thickened and well blended, about 10 minutes. Mix 1/2 cup Monterey Jack cheese into the thickened sauce mixture, and stir until melted.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a shallow medium bowl, mix 1 cup flour with salt and pepper. Dredge chicken breast halves in the flour mixture to coat. Melt remaining 1/4 cup butter in a large skillet over medium high heat. Cook chicken until lightly browned on all sides. Arrange breast halves in the prepared baking dish, and cover with the sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Top chicken breast halves with remaining Monterey Jack cheese. Bake in the preheated oven 25 minutes, or until chicken is no longer pink and juices run clear.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Breaded"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DOREENB"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.53125,
            "ratingCount": 256,
            "itemReviewed": "Chicken Monterey",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "399 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "116.6 mg",
            "fatContent": "21.1 g",
            "fiberContent": "0.9 g",
            "proteinContent": "32.6 g",
            "saturatedFatContent": "12.2 g",
            "servingSize": null,
            "sodiumContent": "484.8 mg",
            "sugarContent": "1.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-04-25T20:22:08.747Z",
                "reviewBody": "This is an elegant and incredible recipe the name \"Chicken Monterey\" does not do it justice. You have to make it right if you don't follow the recipe don't complain. This is a classic french mushroom sauce and the flavors combine to make you nearly weep. I made this for a party I threw and didn't even try it till after the party because I had been cooking all day. When I popped a bite into my mouth I made noises that were well inappropriate. When you brown the chicken do it in hot almost browned butter to acheive the browning without overcooking the chicken. I think that may be where some people are complaining they destroy the chicken before they ever put it in the oven. The sauce needs to be made exactly according to the directions. I will cherish this recipe in my files forever. -Oh yeah I am going to try adding some diced green chiles next time but only because I have followed the directions once already.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chefjudge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/685932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:49:35.953Z",
                "reviewBody": "Fortunately my husband and I raised our children to at least \"try\" everything that's on their plates. To our delight they've developed very mature palates and I knew that this recipe with all of the wonderful mushrooms would be an instant hit. Although I only made four chicken cutlets I kept the sauce amount the same and used about 4 ozs. of cheese. I didn't have any white wine on hand however I used a good hardy beer instead. If you're not a salt person leave out the celery salt; it won't make a difference. This dish was delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-27T16:19:05.247Z",
                "reviewBody": "Thank you all for your great reviews....I agree w/ all of you that there needs to be more sauce and I also double it when using breast halves and adapt as needed...more wine...less celery salt etc - forgot to mention that in orig recipe but as any good cook knows....you have to be able to adapt as needed to any recipe!!!! I love all the helpful hints that I get from the reviews of various recipes - I can tell who loves to cook and I am NEVER insulted when my recipes are critiqued! ALSO try using chicken cutlets as they are thinner and take less time to pan fry than regular breast halves - and I add Garlic Pepper to the flour to bread the chicken in b/c we love garlic and I add about 3 cloves of garlic and pre cut mushrooms will cut down on your prep time. Sauce is probably enough if you use the cutlets as opposed to the breast halves and you can cut down on the baking time if using the cutlets. So glad that everyone has enjoyed this recipe my best friend shared this recipe w/ me several years ago and it has been a favorite around our dinner table!!!! Doreen",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOREENBUCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/563422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-09T04:50:43.31Z",
                "reviewBody": "This one is fantastic. My changes: no onions (yuck) used half pkg sliced mushrooms only used 6 Tbsp butter only used a sprinkle of salt and pepper (no fancy stuff) used more chicken broth instead of wine (didn't have it) used only 1 cup MJ cheese (misread recipe) and halved the chicken pieces (2 breasts making 4 pieces). My husband and I melted into this.. next time will serve left over sauce with rice or egg noodles. I also soaked the breasts in garlic infused olive oil for a few hours before I started because I was worried they'd be dry like others have said. This was perfect. When you fry the chicken do it over medium heat and just until the sides get pretty white -- I think actually browning them is what is causing the dryness. Don't worry they'll cook all the way in the oven. This was perfect. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AXSTAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/540250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:50:01.28Z",
                "reviewBody": "I'm going to have to give this another shot because I wasn't too impressed with it. The celery salt was very distinctive (and since I love it in bloody mary's I thought it would be good here as well- teehee) and it was very greasy. Next time I will take Linda Mclean's review advise. Thanks Doreen (& Linda too)!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-23T14:43:24.123Z",
                "reviewBody": "Wow what a great recipe...the only thing I'd change would maybe be to make more of the sauce and add more white wine to thin it out a little. But wow one of the best chicken recipes I have found. Tried this recipe out on my in-laws a couple weeks ago and they are still complementing me on it. A definite keeper in my recipe box!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TDRINK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/686326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-08T21:14:22.34Z",
                "reviewBody": "This recipe is the best chicken dish I've found on this site! Wonderful tasting sauce moist and tender chicken. Yummmmmy!! I printed the recipe as is but only used 4 ch. breasts (in essence doubling the sauce) and used the sauce over rotini noodles. I also did not have wine so I used more broth instead. Wonderful!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBMILLIKAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/582046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:51:00.84Z",
                "reviewBody": "This would have been awesome EXCEPT it was much too salty. I will make this again but use less chicken stock no salt (celery or otherwise) and maybe add some water so the sauce is not so thick. Thanks Doreen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-22T16:45:35.67Z",
                "reviewBody": "Good recipe. Made only 4 breasts instead of 8. Cut waaaay back on the butter (sauteed mushrooms & onions in chicken broth) & cheese; also added frozen spinach. Instead of frying floured breasts in butter then cooking in the oven I dipped the breasts in seasoned bread crumbs & cooked at 350 for about 30 minutes. Good Monterey sauce though! Served over rice with green beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill Welch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1530738/"
                }
            }
        ]
    }
]