[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1977/meat-and-poultry/chicken/chicken-breasts/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/35468/silvers-savory-chicken-and-broccoli-casserole/",
        "name": "Silver's Savory Chicken and Broccoli Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F32118.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2018-06-08T13:18:00.000Z",
        "description": "This is an easy to make recipe that is great for potlucks, church gatherings, holidays, or outside gatherings. It is also a non-hassle recipe for you working folks, single folks, or even for kids to make! You can even make it ahead of time by preparing the casserole and then freezing it - for up to 3months! My family loves this casserole and we change things around in it, by adding or taking out different things. Have fun with it, and I would love to hear comments on what worked for you and what changes you made! Serve with dinner rolls or French bread and a salad!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 ounces egg noodles",
            "3 tablespoons butter",
            "1 yellow onion, chopped",
            "¼ cup all-purpose flour",
            "1 ½ cups chicken broth",
            "¾ cup milk",
            "salt and pepper to taste",
            "5 cups cooked, shredded chicken breast meat",
            "1 (10 ounce) package chopped frozen broccoli, thawed",
            "1 cup shredded Cheddar cheese",
            "1 cup shredded provolone cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 6 to 8 minutes or until al dente; drain. Preheat oven to 400 degrees F (200 degrees C.) Grease a 9x13 inch casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a large saucepan over medium heat. Saute onion until tender, about 3 minutes. Mix in flour. Gradually stir in chicken broth. Slowly stir in milk, and cook, stirring, until sauce begins to thicken. Season with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place cooked noodles in the bottom of casserole dish. Arrange cooked chicken in an even layer over noodles. Place broccoli over the chicken. Pour sauce evenly over the broccoli. Combine cheeses, and sprinkle half over the casserole.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 20 minutes, or until the cheese melts. Remove from oven, and sprinkle with remaining cheese. Allow to set for 5 minutes, until cheese melts.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SILVER SHADOWWOLF"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.179372197309417,
            "ratingCount": 223,
            "itemReviewed": "Silver's Savory Chicken and Broccoli Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "580.1 calories",
            "carbohydrateContent": "30.1 g",
            "cholesterolContent": "163.7 mg",
            "fatContent": "28.6 g",
            "fiberContent": "2.8 g",
            "proteinContent": "49.4 g",
            "saturatedFatContent": "14.6 g",
            "servingSize": null,
            "sodiumContent": "453.5 mg",
            "sugarContent": "3.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-06T14:51:56.157Z",
                "reviewBody": "Alot of you are complaining about the fact that the noodles seem dry after it's been baked. Just make extra sauce and toss it with the noodles before you put them in the baking dish,then do your layering. When you layer it and add the rest of the sauce,all of it will be moist and delish. Problem solved. This recipe is just a blue print. You can do anything with it. Add fresh garlic,thyme,rosemary, or use a shallot instead of just onion. The skies the limits ladies just take it and run with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "harpo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1496647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-08T16:27:23.14Z",
                "reviewBody": "I've been looking for a chicken casserole recipe that doesn't use canned soup, and this sure did the trick. My husband and I thought this was great! Like others, I tweaked a few things. I baked 4 chicken breasts that were sprinkled with garlic powder, lemon pepper and dill, cooked the pasta in the broth that went into the sauce, chopped and steamed a head of fresh broccoli and mixed everything together (including all of the cheese) rather than layering. The sauce melted the cheese and created this wonderfully cheesy gooeyness all through the dish :)! I didn't bother doubling the sauce, and didn't think it was dry at all. Last, I cooked it for 35 minutes to get everything bubbling nicely. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Food4me",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/food4me/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-31T02:00:52.967Z",
                "reviewBody": "The best casserole that I have made from this site. I was afaid we wouldn't like it, since we like very spicy foods with lots of flavor, but this was great & very simple. After reading the reviews I made a few changes. I used fesh broccoli, we don't like frozen (to many stems) & used swiss & cheddar. Instead of layering the ingred., I mixed them all together w/ 8oz grated swiss cheese. Then I doubled the sauce & poured it over the top, finishing w/ the grated cheddar. Wow.  I love to cook & try different things so we rarely eat the same thing twice even when its really good, but this is definetly something I will make regularly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A cook in Houston",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1463678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-29T00:57:30.81Z",
                "reviewBody": "I made this for a family before a funeral and they said they loved it! But I changed a few things based on what others have said: Instead of chicken broth I added cream of chicken soup to the onion mixture and made double of what it called for. Also I put about 1/4 of the mixture right on top of the noodles before the chicken so that the noodles wouldn't be dry. I also added some garlic powder and onion powder in with the soup/onion mixture. Last I layered about 1/3 of the cheese right on top of the chicken to get that flavor throughout and used swiss in addition to the provolone and chedder. Although I didn't have any they said they really enjoyed it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristin O",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1992743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-10T01:28:03.577Z",
                "reviewBody": "I really enjoyed this recipe and it was easy to make. After reading some of the other reviews I decided to try & spice it up a bit and avoid using as many pans. After cooking & removing the chicken from the pan I sauteed the onions in the same skillet and also added a couple of cloves of chopped garlic. When I added the chicken broth I scraped up the brown bits left from the chicken in the bottom of the pan. I also added a few hearty dashes of cayenne & cumin to the sauce. I didn't have any provolone cheese on hand so I substituted some mozzarella & swiss to go along with the cheddar. I also used fresh broccoli instead of frozen. I ended up with a great dish that I'll most likely try again. I think that there is an endless possibility of variations that can be made to this dish depending on what you have on hand. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole Besancon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/495248/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-03T05:33:27.937Z",
                "reviewBody": "Made this tonight but with penne instead of egg noodles and fresh broccoli that I blanched for 3 minutes in the microwave first. For the sauce I doubled it and added a generous dash of cayenne and curry. Then I added shredded cheddar directly to the sauce until melted. Next I layered the ingredients as recommended but sprinkled parmesan (instead of provolone) on top of everything before pouring on the sauce. I then put a bit more shredded cheddar & parmesan over the top prior to baking. It was very tasty and had just the right \"zip\" without being too spicy. I would definitely make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PIERIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/943290/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:51:11.77Z",
                "reviewBody": "This was a great meal for a cold winter night-reheated nicely the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-06T16:43:41.25Z",
                "reviewBody": "This is a good basic recipe but needs some oomph. I used roasted chicken from a deli that has more flavour than home cooked. I also made extra sauce and added some to the noodles before layering them into the casserole. I cooked the noodles in chicken broth and used the broth in the sauce. In addition I added dried garlic to the sauce as it was being prepared white pepper (it has a different taste). I added canned sliced mushrooms and sliced almonds browned in marg. I omitted the half the broccoli.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSSNOOP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032048/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-27T22:03:37.947Z",
                "reviewBody": "Be aware it will take longer than 20 min. to assemble the ingredients for this recipe. It took me 45 min. to make this from scratch. If you are making from scratch and don't have ingredients precooked and precut it may take that long. This could use a larger amount of the white sauce portion and less cheese. It is not a favorite with our family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "musicmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6018268/"
                }
            }
        ]
    }
]