[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14724/soups-stews-and-chili/soup/chicken-soup/chicken-and-rice-soup/",
                    "name": "Chicken and Rice Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/37707/vietnamese-chicken-and-long-grain-rice-congee/",
        "name": "Vietnamese Chicken and Long-Grain Rice Congee",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6750773.jpg",
            "width": 2854,
            "height": 2751
        },
        "datePublished": "2018-06-08T13:18:32.000Z",
        "description": "Congee is a much overlooked soup and a comfort food of a lot of Asian peoples. This recipe is flavorful, light, and goes down real easy when you are feeling a little out of the weather. It looks harder than it actually is. I usually just throw things together, go away, and wander into the kitchen later to see if it's done.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "⅛ cup uncooked jasmine rice",
            "1 (2.5 pound) whole chicken",
            "3 (2 inch) pieces fresh ginger root",
            "1 stalk lemon grass, chopped",
            "1 tablespoon salt, or to taste",
            "¼ cup chopped cilantro",
            "⅛ cup chopped fresh chives",
            "ground black pepper to taste",
            "1 lime, cut into 8 wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken in a stock pot. Pour in enough water to cover chicken. Add ginger, lemon grass, and salt; bring to a boil. Reduce heat, cover, and gently simmer for 1 hour to 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain broth, and return broth to stock pot. Let chicken cool, then remove bones and skin, and tear into bite-size pieces; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir rice into broth, and bring to a boil. Reduce heat to medium, and cook for 30 minutes, stirring occasionally. If necessary, adjust with water or additional salt. The congee is done, but can be left to cook an additional 45 minutes for better consistency.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Ladle congee into bowls, and top with chicken, cilantro, chives, and pepper. Squeeze lime juice to taste.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes",
            "Chicken and Rice Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DawnH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.48,
            "ratingCount": 25,
            "itemReviewed": "Vietnamese Chicken and Long-Grain Rice Congee",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "642.5 calories",
            "carbohydrateContent": "9.8 g",
            "cholesterolContent": "210 mg",
            "fatContent": "42.3 g",
            "fiberContent": "1 g",
            "proteinContent": "53 g",
            "saturatedFatContent": "12.1 g",
            "servingSize": null,
            "sodiumContent": "1943.4 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-24T17:49:51.723Z",
                "reviewBody": "Chao ga or Vietnamese congee does not usually contain lemongrass, but I guess the addition may help to make the broth more fragrant.  Additionally, you may not want to stir the rice very often or at all while cooking as this will often cause scorching at the bottom of the pot.  Wait until the rice has cooked for 20 -30 minutes or just right before the you are about to eat to stir up the pot to break the rice grains.  The cooking time for the chicken is also quite lengthy.  If chicken were left to cook that long the meat would no longer be good.  Too mushy and stringy.  What my mom and I usually do is to cook the chicken for 30 to 45 mins depending on size, set the chicken aside to cool for a bit then remove the meat.  We then return the bones to the pot to continue making the stock.  Last but not least, the original preparation of chao contains garishes of cilantro, scallions aka green onions(not chives), and thinly sliced slivers of ginger.  If scallions are not available then the next best substitute would be thinly sliced onions. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ljoli3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1651184/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T19:16:24.583Z",
                "reviewBody": "Hey all just a tip on the rice. The way I learned to cook it was to soak the rice first in warm water that'll help make the soup a little less thick. I like to break the rice in warm water by hand before putting it into the pot so that the rice is smaller and a bit of smoother consistency. Another way to prepare the rice is to slightly brown it in a dry skillet that gives it a little bit more flavor which is really good. I also cook the broth with a whole onion and carrots which is great when you're sick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "chumtram",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2624960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-16T01:08:37.81Z",
                "reviewBody": "Excellent recipe. Tastes just like my mom's \"chau\" (Vietnamese word for congee). I doubled everything in the recipe except for the rice which I added 2 cups of instead. I didn't add any lime juice. Great comfort food!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VUCN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/487573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-02T12:51:08.82Z",
                "reviewBody": "I recently encountered congee as a breakfast option on a cruise ship & fell in love with it. Until I tasted this recipe I thought it was just plain rice but one small taste told me I'd found an exact match for the ship's version. I added my favorite toppings: fried bean curd sauteed mushrooms sauteed onions raw snow peas & enoki mushrooms. Also upped the quantity of rice for a thicker consistency. I just threw everything in the pot at the same time & it came out perfect after about 1.5 hours. Thanks for a wonderful recipe! This one's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Stone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/744467/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-18T19:38:37.937Z",
                "reviewBody": "I'm a fool for congee. The first time I heard of rice porridge- or \"rice gruel\" more specifically I thought it sounded pretty bland and kind of gross but then I went and made it and it's WONDERFUL. Maybe I shouldn't be reviewing this recipe because I didn't follow it exactly. How I make it is I put a small handful of rice in my tiny crockpot put in some water (proportions approximately equal to that of the recipe) and a beef or vegetable bouillion cube (I haven't eaten poultry for the last few months but when I did I'd just put in a raw chicken breast or some ground turkey with or without added bouillion) a chunk of ginger and lemongrass and let it go overnight. In the morning it tastes wonderful as is or with lime juice and green onions. Oh and it's also good if you just cook it with bouillion and nothing else to flavor it...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Bunny Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thebunnychef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-07T23:11:01.28Z",
                "reviewBody": "Yummmm. This is what my mom would make for me as a child whenever I wasn't feeling well. This is the Vietnamese equivalent of Chicken Noodle Soup. In fact just recently I came down with Bronchitis. This is what my mom brought over for me and I m 33 years old! I'm so glad I came across this recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNDA L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/799445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-13T20:58:53.437Z",
                "reviewBody": "I usually just take all of the ingredients listed above (lime juice if I don't have a lime onions when I don't have chives) and throw it all together with a bunch of water - sometimes I add carrots and potatos too... very very good. Woot!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUATHAAN75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/954129/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-05T13:45:40.01Z",
                "reviewBody": "I never use a whole chicken - I have no idea what to do with one - I usually get chicken tenderloins or cut up a chicken breast and it works fine - it's actually very tasty. I also add vegetable stock which adds flavor and if I'm in a really creative mood I add miso. This is a great feel better winter recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Hart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3182530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-25T19:31:18.037Z",
                "reviewBody": "Perhaps I prepared it wrong but it wasn't as good as I hoped it would be. I wanted to make some for my sick boyfriend (he had a fever). I was on a time crunch so I used chicken broth and put in chicken breasts to boil (hoping to cut down in time). I added chunks of ginger and lemongrass as stated. I did however put a bit more rice than it said was needed. This took about 1 hour still. Soup came out salty. I knew that with regular chicken broth it would be salty - but I had added extra water.. but it was still too salty. Congee came out ok but not wonderful. You need to cook the rice MORE than 30 min if you want a nice consistency. I took it out at 30 minutes and rice was still not soft enough. It smelled good though. Also (in addition to chicken) boiled chicken liver in a separate small pot (to avoid the frothyness) and set aside in a bowl. Remember to add some squid sauce afterwards too for that extra flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ink",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769545/"
                }
            }
        ]
    }
]