[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/730/world-cuisine/latin-american/south-american/",
                    "name": "South American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2433/world-cuisine/latin-american/south-american/peruvian/",
                    "name": "Peruvian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/40083/peruvian-lomo-saltado/",
        "name": "Peruvian Lomo Saltado",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4459131.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2018-06-08T13:18:54.000Z",
        "description": "This is a traditional, very easy dish to make.  I might add that it's very popular with finicky kids and adults as well.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (16 ounce) package frozen French fries",
            "vegetable oil as needed",
            "1 pound beef tri tip, sliced 1/8 to 1/4 inch thick",
            "salt and pepper to taste",
            "1 large onion, sliced into strips",
            "3 large tomatoes, peeled, seeded, and sliced into strips",
            "1 yellow chili pepper (preferably Peruvian aji amarillo)",
            "¼ cup distilled white vinegar",
            "1 dash soy sauce to taste",
            "2 tablespoons chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare the bag of French fries according to package directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the French fries are cooking, heat the oil in a frying pan over medium-high heat.  Season the sliced meat with salt and pepper to taste.  Fry the meat until just cooked, and the juices begin to release.  Remove the meat from the frying pan, then cook the onions, with additional oil if needed, until they are transparent.  Stir in the tomato and aji amarillo; cook until the tomato softens.  Pour in the vinegar and soy sauce, add the French fries, cover, and cook until the beef is done, about 3 minutes.  Season to taste with salt and pepper, and sprinkle with chopped parsley to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "South American",
            "Peruvian"
        ],
        "recipeCuisine": [
            "Latin American",
            "South American",
            "Peruvian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Perricholi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.475609756097561,
            "ratingCount": 164,
            "itemReviewed": "Peruvian Lomo Saltado",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "498 calories",
            "carbohydrateContent": "37.8 g",
            "cholesterolContent": "73.7 mg",
            "fatContent": "27.3 g",
            "fiberContent": "4.6 g",
            "proteinContent": "26.3 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "606.1 mg",
            "sugarContent": "6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-03T00:39:09.353Z",
                "reviewBody": "I am peruvian and had loved this recipe since I was a child. Instead of using frozen fries, try making the fries yourself by chopping potatoes into fries and making frying them in a pan, just add a little olive oil. They come out cruncy and great! Also, added cumin and minced garlic to the marinade to give it an authentic taste and served with rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "valencia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3507452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-06T16:35:11.66Z",
                "reviewBody": "My husband is Peruvian, his family introduced me to this, they have it almost every sunday.. Also living in Miami, there are tons of latin/south american restaurants that serve this dish. Tastes authentic, the only things I did was: marinate the meat in the vinegar and soy sauce,thinly slice hot yellow peppers add a bit of garlic and cumin. Also I've never liked how the potatoes are always soggy, so toss them in last when ready to serve the dish. I used large slices of RED onion and ROMA tomato along with cilantro, NOT parsley. One thing is this doesn't produce much juice or gravy, which is my family's favorite part to top white rice. I also serve spicy aji sauce on the side. The better cut of steak you use, the better this will be. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/gia/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-06T18:51:21.763Z",
                "reviewBody": "This recipe had a good flavor but it was too \"stew-y\". Lomo saltado is supposed to be \"stir-fried\". There is no covering to let the meat cook in stir frying! The method of cooking has a big impact on the flavor.\nHere are grandma's bulletpoints: 1) Lomo saltado is made with *lomo*, meaning tenderloin. If you can get some (I get it when it's on sale and freeze some), please use that. There's no need to marinate a good tenderloin. And don't let the juices release. Stir fry, in a wok, with HIGH heat. You want the juices to release in your plate. 2) Make sure your onions are RED. (I have small kids, so I won't say anything about the frozen fries; it's a good shortcut) 3) no need to peel or seed tomato. 4) Grandma says parsley AND cilantro. She was the best cook in the world, so she should know. 5) You add the meat back just to bring all flavors together, 30 seconds or so (you're still stir frying at high heat). Do not overcook. I repeat: DO.NOT.OVERCOOK! Your vegetables need to be still crisp. 6) Have your crispy fries waiting and add them only at the end, a split second before serving, and if possible only to the portion that you're going to eat right away or they'll get soggy.\nThere, now it's just like grandma's, that is: perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Littlelentil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3299759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-26T19:40:58.76Z",
                "reviewBody": "I have made this meal several times.  I never peel or de-seed the tomatoes.  That's a waste of time.  Make sure to use RED onions for better flavor.  Don't use parsley, use cilantro!!1  Never use Ore-Ida frozen potatoes, they fall apart.  Cut your own fresh potato fries or some other brand.  I like to use peruvian aji salsas called aji panca and aji amarillo to spice up the beef.  I just fry the salsas in oil for a bit and then add the beef to it.  You can add garlic puree too.  Finally, don't forget the touch of vinegar, it really makes a difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "tooth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2961518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-29T14:29:00.553Z",
                "reviewBody": "I'm Peruvian and also think this is a great recipe. Marinating the meat and adding cumin are great tips. Sometimes when I make this I bring home large fries from a fast food joint then just throw them on top of the stir fry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikolina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1996439/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-18T18:26:48.617Z",
                "reviewBody": "Wow this was absolutely delicious! Imperative that the meat is marinated in the vinegar/soy sauce for at least a half an hour. Like others I added cumin garlic and subbed cilantro for the parsley. I used Ore Ida steak fries to much success! I did turn up the heat to almost a broil for an extra 4 minutes at the end to make them extra crispy. Make yourself a pisco sour and try this recipe it's a must!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJANE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1135304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-07T23:25:46.703Z",
                "reviewBody": "My family is from Peru and this is a favorite when we visit Lima, and at home.  I marinated the meat in the vinegar and soy sauce.  Gave the meat a nice flavor.  Used red onion and made my own french fries.  Also used cilantro instead of parsley and added quite a bit of minced garlic.  I used some aji amarillo in a bottle I purchased last time I was in Peru.  Pretty much impossible to find fresh aji in the states from what I have seen.  Served over rice!  Yum :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VariableVeracity",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3580098/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-23T20:25:37.92Z",
                "reviewBody": "I first encountered Lomo Saltado in a small Latin restaurant in my area where it quickly became a favorite. Unfortunately the restaurant took this dish off the menu so I was very pleased to discover it on this site and re-create it at home. As is I think this recipe is OK. If you re willing to invest a bit more time however it is a wonderful dish. 1) I ve eaten meat and chicken versions of this recipe. I find the chicken to be better. 2) Do marinade the meat in the vinegar and soy sauce for at least an hour if not several hours. The added tanginess is nice. 3) Ditch the frozen fries (does anyone really like Ore Ida?) and make your own. I agree crispy crunchy shoestring fries are best with this meal. I also season the fries with added pepper and paprika. 4) To serve either place meat with some of the marinade on top of a bed of fries or separate fries from the meat - but keep on the same plate! - so guests/family members can pick from both piles. This is good. I hope others try it despite the unusual name.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "m0wlp42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2794751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-22T15:04:46.33Z",
                "reviewBody": "Lomo Saltado! I marinated my stir fry beef in red wine vinegar soy sauce garlic powder and a little freshly ground black pepper while I prepared my vegatables fries and rice. I as able to find aji amarillo at my local Latino grocery. I used fresh chopped cilantro instead of parsley and I went with a red onion. Try adding strips of red bell pepper to sweeten the dish slightly and to add color and texture. For a video on how to prepare Lomo Saltado I'd recommend Allreceipes' user Pedro's http://www.youtube.com/watch?v=NUywRYwY9gQ&feature=BFa&list=PLYH-mN8crBv2oA2hw-rF9R_lmilrt_ZAp",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bianchiveloce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bianchiveloce/"
                }
            }
        ]
    }
]