[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
                    "name": "Wraps and Rolls",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/40351/lumpia-shanghai-version/",
        "name": "Lumpia (Shanghai version)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1087149.jpg",
            "width": 3552,
            "height": 2368
        },
        "datePublished": "2018-06-08T13:18:58.000Z",
        "description": "A recipe I know all Filipinos are proud of! Lumpia (shanghai type) is a type of egg roll, except it's mainly filled with meat. You could use pork or beef or both! It's a yummy recipe and great to serve as finger food. I like to use both beef and pork but you can substitute one for the other. VERY EASY!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "1 pound ground pork",
            "1 pound ground beef",
            "1 medium onion, finely chopped",
            "1 carrot, grated",
            "¼ cup soy sauce",
            "2 ½ teaspoons black pepper",
            "1 ½ tablespoons garlic powder",
            "2 tablespoons salt",
            "1 (16 ounce) package spring roll wrappers",
            "1 ½ quarts oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a Large bowl, combine ground pork, ground beef, onion, and carrot.  Make sure to completely mix everything.  I suggest getting down and dirty and use your hands. Knead the meat in the bowl if you must. Gradually blend in the soy sauce , black pepper, garlic powder, and salt until all ingredients are evenly distributed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lay out a few wrappers at a time on a flat surface, and place about 2 tablespoons of the filling in a line down the center of the wrapper. Make sure the filling is no thicker than your thumb, or the wrapper will cook faster than the meat. Take the bottom and top edges of the wrapper and fold them towards the center. Take the left and right sides, and fold them towards the center. Moisten the last edge of the wrapper to seal. Now repeat using the rest of the wrappers, and have hubby or the kids help you out.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a deep-fryer or heavy skillet to 375 degrees F (190 degrees C). Fry 3 or 4 lumpia at a time. Fry for about 3 or 4 minutes, turning once. Lumpia are cooked through when they float, and the wrapper is golden brown. Cut in half, or serve as is with dipping sauce. We like sweet and sour sauce, soy sauce with lemon, or banana ketchup.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Wraps and Rolls"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MINKCHAN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3893129770992365,
            "ratingCount": 131,
            "itemReviewed": "Lumpia (Shanghai version)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "261.5 calories",
            "carbohydrateContent": "14.6 g",
            "cholesterolContent": "37.7 mg",
            "fatContent": "17.8 g",
            "fiberContent": "0.7 g",
            "proteinContent": "10.2 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "1036.9 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-12-31T19:08:01.647Z",
                "reviewBody": "This recipe is great, but there is no need for the additional salt because the soy sauce has a lot of sodium.  Also, if you like garlic, use fresh crushed garlic instead. I tend to use ground beef instead of ground pork because the ground pork takes longer to cook, and when I make a huge batch of these, I don't have time to make sure the pork is cooked well and at the same time the lumpia wrapper is not burnt!  My extra ingredient that gives the taste a special twist is to use sesame oil too.  I use sesame oil that's more an asian style, and it has a strong scent, but a lot of people will say it tastes good and ask what that extra ingredient is.  I also add an egg as well.   This recipe is good w/sweet and sour sauce or w/soy sauce and a little vinegar for dipping.Another good sauce to eat with this is Thai sweet chili sauce for a little hint of spice.  OH YEAH ..they're great for freezing in case you have unexpected guests... like the other reviewer said, you don't need to thaw before frying, just be careful of oil spatter.. don't turn the heat too high or it will burn quickly while the middle is still frozen.  If you want to  make  sure the amount of soy sauce isn't too salty for you, don't add it all at once, and you could do what my mom does, throw a little tiny bit of the meat on a pan and fry it and then taste it to get your flavors right.  a tip i got from my cousin is that if you are freezing them, spray the bag or container you keep them in with baking spray  and lay",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNETTE914",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/662979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:02:52.717Z",
                "reviewBody": "I love lumpia but can't find it where I live now. So finding this recipe was great. I used all beef because I forgot to buy the pork but it was still good. The extra salt is not needed at all. I cooked some when fresh and froze the rest. They work great when fried after being frozen. Just put in hot oil without thawing. Next time I may try adding some veggies to the mix for some variety. These are a lot of work but so worth the time and effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:02:53.513Z",
                "reviewBody": "Great recipe!!  My room mate bought me a pastry bag to squeeze out the mix, it saves alot of time.  I also quater the warpers to make them bite size.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Todd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-29T18:27:28.42Z",
                "reviewBody": "I have been making lumpia for years now  using all pork, all ground beef and even all ground turkey for the filling.  The pork filled lumpia came in first for taste with the ground turkey coming in second. Check the lumpia wrappers for mold before you check out in the grocery store. Experience has taught me that the lumpia wrappers either need to be used almost immediately or frozen for future use as soon as you get them home.  They mold easily and I have bought my fair share of unchecked moldy wrappers home. It is really important to only put about a pinkie's worth of filling in each wrapper as these cook up pretty quickly and you want to make sure these are done completely. Sometimes I cheat using store bought shredded carrot and cabbage cole slaw mixture and a half a medium onion for the vegetables. Oh and dont forget to pull all of the wrappers apart before you start rolling (a huge time saver).  Just remember to cover them back up with a dry dishcloth as to prevent drying out while rolling. I always create an assembly line using about 7 wrappers at a time  quickly stuffing, rolling then sealing them. Sweet Chilli Sauce is a must have for dipping.  It can usually be found next to the sweet and sour sauce of any grocery store while the wrappers can be found in the frozen section.  Both can be found at just about any international grocery store. Cook some lumpia now and freeze the rest for a later date.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BABYLADY907",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1251447/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-29T17:11:52.31Z",
                "reviewBody": "Aside from substituting onion salt (and reducing the salt content) for the regular salt and adding 1/4 cup sliced green onions I made NO changes to this recipe. These are excellent!!! I will DEFINITELY make these again (probably weekly)!!! I also used egg roll wrappers instead of spring roll wrappers (didn't have them on hand at the time). I have also found that I can brush them with peanut oil and bake them in a 425 degree oven for 25 min to reduce the fat content turning the lumpia after 10 minutes. The peanut oil also adds a nice flavor when deep fried. Thanks for the great recipe!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula Stotts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/680301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:02:49.747Z",
                "reviewBody": "My Filipina finance loves this recipe!  Be very careful with the salt though, if you use what the recipe says it will turn out extremely salty...  The salt that is in the soy sauce is already enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AJAARSMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/632963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T18:58:14.577Z",
                "reviewBody": "This recipie is great.  It is just like the ones the ladies in the kitchen (all Filipinos) make for our work pot-lucks.  I had a request from a fellow co-worker to create a chicken version.  Through not authentic, diced chicken with just an added drop of seseme seed oil, cooked just like the rest of the recipe, was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMABEAR68123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:02:49.687Z",
                "reviewBody": "My husband has craved lumpia's ever since he left the Marine Corp.....almost twenty years ago.  I decided to make this recipe for him and our card-party guests and it was a HUGE hit!  They always ask if we'll be having these at each card party.  They were served with banana ketchup, which I've never had and had my doubts about.  That, too, was excellent!  My only suggestion for this recipe would be to use low-sodium soy sauce and to cut back a little on the salt.  This recipe is one that I will use again and again, thanks for sharing it Cristine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RaiderMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/148935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-14T21:08:12.78Z",
                "reviewBody": "It was a hit at my husband's pot luck party! They all loved it! I used ground pork and it tasted terrific!! I made another batch for the house I used ground beef it wasn't as great. I suggest using ground pork. Also I'd add about 1 tbs of onion powder and maybe 1 tsp of msg. Lessen on the black pepper..maybe just a 1 tsp. 2 1/2 is just way way too much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MINKCHAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/442140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-25T18:34:03.83Z",
                "reviewBody": "I was really disappointed with this recipe. I followed everything that was in the ingredients and now my whole batch is ruined because it's too salty. I'm so upset. It took me a long time to finish wrapping all those lumpia only to find out that the food is TOO SALTY!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "kiko150",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4487557/"
                }
            }
        ]
    }
]