[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
                    "name": "Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16212/appetizers-and-snacks/snacks/crackers/",
                    "name": "Cracker Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/42774/cheddar-pennies/",
        "name": "Cheddar Pennies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F668061.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:19:40.000Z",
        "description": "Delicious cheddar penny cookies!!! My mother and I have made these for years and they are just as good as when I was young.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "70 pennies",
        "recipeIngredient": [
            "2 cups sifted all-purpose flour",
            "1 pinch salt",
            "1 pinch cayenne pepper",
            "6 ounces shredded Cheddar cheese",
            "½ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a large cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the flour, salt and cayenne pepper. Stir in the Cheddar cheese and melted butter to form a firm dough. Roll pieces of dough into ropes as big around as a penny. Slice into 1/4 inch slices. If dough is too soft, it can be chilled until firm. Place slices onto the prepared cookie sheet so they are 1 inch apart.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 25 minutes in the preheated oven, until the bottoms of the pennies are lightly toasted and the tops are firm. Allow to cool completely before serving. Store in an airtight container at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Snacks",
            "Cracker Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Adrienne Anderson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.462962962962963,
            "ratingCount": 54,
            "itemReviewed": "Cheddar Pennies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "68.9 calories",
            "carbohydrateContent": "5.5 g",
            "cholesterolContent": "12.1 mg",
            "fatContent": "4.3 g",
            "fiberContent": "0.2 g",
            "proteinContent": "2 g",
            "saturatedFatContent": "2.7 g",
            "servingSize": null,
            "sodiumContent": "49 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-03T01:12:14.733Z",
                "reviewBody": "GREAT BASIC RECIPE, JUST A FEW CLARYFICATIONS NEEDED...  You may be wondering if the cheddar cheese should be melted or grated or chunked... well, I've tried it all 3 ways... grated is fine, just increase the butter by 1/2 cup and increase the salt by 1/2 teaspoon, at least.  You can tweek this recipe as you please as far as pepper, garlic salt, add'l seasonings, etc., add hot water or more melted butter to make it pliable.  I've done this cutting it, like it reads, and also, by rolling balls and crushing them with a glass to flatten.  The skys the limit as far as flavorings...  I perfected this to use in my Christmas Baskets this year.  In a vaccuumed package, these crackers will last a month or more...  don't be afraid to wet the dough, until your comfortable with it, thats the key.  Happy Snacking!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JuliaLC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1587169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T22:38:08.537Z",
                "reviewBody": "Years ago when I pregnant with my youngest daughter my doctor had just informed me that I had yet another \"toes first\" baby and that I was going to have a scheduled C-section again. With that he handed me a sort of cheddar cracker. I could taste the cayenne and something crispy. I loved them and have been searching for a similar recipe since. I found this purely by accident yesterday and although some of the reviews were less than favorable I decided to give them a try. Not that this is going to be of much help because I didn't measure anything however you experienced cooks out there will know what I mean. I used whatever shredded cheddar I had left over and put it in the food processor. I added my butter a lot more cayenne than called for some seasonings and about a third cup of flour. I pulsed and kept adding flour a little at a time until it looked right. The dough was nice and moist and easy to handle. I also folded in a single serving of rice crispy's. I made them more like quarters and baked for about forty minutes. They were excellent and very much like what I had eaten in Dr. Cohen's office. Thanks Adrienne for a really good start and for the extra five pounds I probably gained yesterday munching on these little goodies. The kids and hubby loved them too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T22:38:11.57Z",
                "reviewBody": "Very good!! Not what I expected though these are not like crackers you purchase in the store. I used my hands to knead the dough so it would form a ball. I made mine the size of 50-cent pieces and baked them for 20 minutes. I used cajin spice since I didn't have any white pepper. I also cut the slices placed them on the cookie sheet then used a small cookie cutter to make \"cracker people\". Next time I will add bacon-bits. I will use this recipe again! Yum-Yum!! OK I added real bacon bits and they turned out fantastic! I entered them in our State Fair and won 1st place! I cut them out with a \"doughnut holer\" but I didn't roll them very thin. I love to snack on these!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FARMCAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/265506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T22:38:13.13Z",
                "reviewBody": "These pennies are good. Mine were pretty crumbly but had a big cheese taste. My son didn't care for them but that was a while back. Maybe I'll give them another try in the future...see if he's changed his mind. Thanks Adrienne.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-31T00:08:07.827Z",
                "reviewBody": "This is a GREAT recipe. I am a 12 year old girl and for me it was so easy and fast! For my dad's birthday i made it as a starter than i followed it by a main course and a desert!! My dad and my family LOVED it!!!!!!!!!!!!! Thank You so much!!!!!!!!!1",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLGOODRECIPES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-10T22:37:55.53Z",
                "reviewBody": "Very crumbly. There was no way that these were going to roll into logs. I rolled them in hand and pressed them into rounds. I didn't see any need to grease a baking sheet as these are heavy in butter and the fat in the cheese. I rated them well overall though. Very tasty! They taste great with garlic and onion powder mixed in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mama_B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mama__b/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T09:45:00.06Z",
                "reviewBody": "I'm a grown up but I thought this was a fun recipe to make and tasted good to eat. I would suggest that for older kids and adults you might want to increase the salt and cayenne pepper a bit or experiment with other seasonings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURA J JOHNSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/378831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-12T22:04:56.757Z",
                "reviewBody": "After reading the reviews I made my own version of these crackers. They turned out very well- a little spicy and nice and cheesy. Here's what I did: Blend 1 cup all purpose flour 1/4 t garlic powder 1/4 t paprika 1/8 t cayenne pepper and 1/2 teaspoon seasoned salt in food processor. Add 1/4 cup cold butter that has been cut into little cubes. Pulse until the butter is well incorporated and the mixture looks like crumbs (you may need to scrape the sides of the bowl with a spatula). Add 6 ounces shredded cheddar cheese and process until the cheese is blended in scraping with the spatula if necessary. Dump the mixture into a mixing bowl and add about 1 tablespoon of milk. Mix it in with your hands and add more milk (1/2 tablespoon or so at a time) until the dough just comes together. Then roll the dough into marble sized balls put on a baking sheet and flatten with the bottom of a glass. You an experiment with different thicknesses. Poke each cracker with a fork a couple times so they don't poof up when being baked. Sprinkle each cracker with a little kosher salt and press the salt in. Bake at 350 for about 15 minutes (depending on the thickness of your crackers) until the bottoms are a little toasted. Excess dough can be put in the fridge until it's time to bake or if you accidentally add too much milk refrigerating the dough will make it easier to work with. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "The Bunny Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thebunnychef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T22:38:08.757Z",
                "reviewBody": "As suggested by another reviewer I ended up just breaking pieces of dough and kind of flattening out to the shape of a penny. I added water to the dough because I had a crumbly mess with just the butter. That probably messed up the dough by doing that but just the melted butter did not work. I was the only one in the house that did not care for these and part of that may have been frustration. They're not terrible and if you have a lot of patience these may work for you but I doubt I will make these again. Sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SHEILAR73",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/761065/"
                }
            }
        ]
    }
]