[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17158/desserts/chocolate/milk-chocolate/",
                    "name": "Milk Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/44715/chocolate-peanut-butter-cups/",
        "name": "Chocolate Peanut Butter Cups",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F344692.jpg",
            "width": 2848,
            "height": 4272
        },
        "datePublished": "2018-06-08T13:19:51.000Z",
        "description": "A simple but decadent confection that quells the urge to dip your chocolate bar in the peanut butter.",
        "prepTime": "P0DT2H0M",
        "cookTime": null,
        "totalTime": "P0DT2H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (11.5 ounce) package milk chocolate chips, divided",
            "1 cup peanut butter",
            "¼ teaspoon salt",
            "½ cup confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Trim 12 paper muffin cup liners to half of their height.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 1/2 chocolate chips in a microwave safe container. Microwave for 2 minutes, stirring after each minute. Spoon melted chocolate into muffin cups, filling halfway. With a spoon, draw the chocolate up the sides of the cups until evenly coated. Cool in the refrigerator until firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together peanut butter, confectioners' sugar and salt. divide into the chocolate cups. Melt the remaining chocolate, and spoon over peanut butter. Spread chocolate to edges of cups.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "Milk Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHAUNNSMOM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.67866323907455,
            "ratingCount": 389,
            "itemReviewed": "Chocolate Peanut Butter Cups",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "289.9 calories",
            "carbohydrateContent": "25.5 g",
            "cholesterolContent": "8.9 mg",
            "fatContent": "19.8 g",
            "fiberContent": "1.3 g",
            "proteinContent": "7.2 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "191.9 mg",
            "sugarContent": "21.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-09T01:20:25.977Z",
                "reviewBody": "This is the second time I made this recipe, but this time I took the suggestions of 2 reviewers. First, I didn't use paper cups; instead, I used oil spray directly on the muffin tin. (last time everything stuck to the little paper cups) The finished peanut butter cups popped out easily. Second, I took the suggestion of adding 1/4 cup crushed honey graham crackers and some vanilla to the peanut butter mixture. Adding a little bit of butter to the chocolate was also a helpful idea. The finished product was absolutely delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CITYGIRL22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1421542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-28T22:52:32.483Z",
                "reviewBody": "Shouldn't have made these.  My husband and I have been on a health kick, but I found these and wanted to \"try them\".  Honestly, the first day I didn't really care for them and almost gave them all away.  But the next day I tried one again and LOVED it.  Now I have to keep disciplining myself not to eat anymore.  They are now in the freezer...where they will stay for a while.  The thinner the chocolate shell, the better.  Oh, and I also used them without liners.  I just sprayed the muffin pan with oil and they popped right out after being in the freezer for a bit.  No oily residue or taste either.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RecipeAddict",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/870570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-08T00:00:38.747Z",
                "reviewBody": "I dont understand why no one has tried these yet!!  It may seem time consuming because the recipe says it takes two hours..but that's just waiting for them to harden (which if you put them in the freezer doesn't take as long as you think).  These are better than the regular Reese's(R) peanut butter cups!! So yummy and so much cheaper to make yourself!! Even my husband, who is candy and cookie making challenged made these!  Definately worth the wait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMANDAMS27",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/676050/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-17T18:43:20.567Z",
                "reviewBody": "these are really good and fun to make. i would not recommend using \"candy melt\" chocolate, since it's very waxy. i used dark chocolate chips, but next time i will have more on hand, since the whole package wasn't quite enough to make 12. i would also recommend making the bottoms thicker than the tops, just because it makes it easier to get them out (i also just put them right in without paper cups) . i used chunky peanut butter, but then had to add some creamy to make the sugar/pb mixture. either way, it was delicious. when you're adding the pb mixture, make sure you leave room around the edges so that when you pour chocolate on top it will touch the bottom layer, and not leave any holes.  i will definitly make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lockesmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1719054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-19T20:29:44.717Z",
                "reviewBody": "I found it easier to pick up paper cups in my hand & pull melted choc. onto the sides with a spoon this way.  It looked like too much choc., but I figured it had to be somewhat thick to hold the PB in.  Once the cups were filled, I'd used 1/2 bag of chips,as called for & was perfectly divided. Put in freezer for 20 min. Filled w/ creamy PB. I was unsure here b/c the PB mix was thick & seemed to be \"heaping\" out of the cup when I used all of it.  How was I going to cover it w/ choc & make them appear flat like the real thing?  But it turned out fine as the PB melted a little on its own & smoothed out nicely as it set at room temp. Then I stuck in fridge to keep cool while I melted rest of chips.  I evenly divided melted choc. among all 12 cups.(about 1 tsp. each)Do not try to keep muffin pan clean while you drag choc. to edges!  It's too time consuming trying to do that:)  It makes no difference in the end.  I put in freezer, then fridge & finally to counter.  But I think if they sit in fridge for a little while to set up,that is all that's needed.  They can be eaten almost immed. Tasted wonderful-kids said too much PB, I thought if anything, too much choc on bottom.  But overall, definitely hit the spot!  Fix these up in a short box, line with tissue paper, foil, etc. & fill with a  half dozen or so cups.  They look just like the real thing.  They taste rich, but so are the real ones. Mmmm! Thanks for something original, yet creative to make with the kids.  Will make again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chanex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1537215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-27T22:52:19.67Z",
                "reviewBody": "Amazing.  I think this one is my favorite recipe for these...only thing I did differently was to use crunchy peanut butter.  Can't wait to make again.  Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-22T07:51:32.467Z",
                "reviewBody": "What a wonderful addition to my Favourites! I used a large block of milk chocolate ( not cooking chocolate) and melted it for about 30 secs., stirred and then checked every few seconds until it was completely melted. I poured about a teaspoon into the top of aprox. 10 muffin paper cups and tilted the cup around until the cup was evenly covered. I then 'piped' the peanutbutter mixture into the cooled chocolate cups and then covered with the remaining chocolate and put in freezer for about half an hour. They were a big hit with everyone who tasted them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AustralianMum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/899139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-14T19:34:11.153Z",
                "reviewBody": "I made these last night for my family and co-workers as a Valentine's Day gift.  They all loved them and my co-workers demanded the recipe.  They were so easy to make.  I used a 1/2 pd chocolate bar, melted over a double boiler.  I also warmed the peanut butter mixture in the microwave to make it spreadable.  To help each step set up faster I used the freezer.  It only took about 8 minutes to harder which cut my hardening time in half!!!  You must try them, you will love them!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "michelle wallace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1771685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-12T21:00:11.23Z",
                "reviewBody": "This is a simple recipe. I made mini peanut butter cups. They tasted good but I think I am a recees fan.I didn't us any paper muffin cups and realized it was a huge mistake.s. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "shanny116",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3253535/"
                }
            }
        ]
    }
]