[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/226/world-cuisine/african/",
                    "name": "African",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/47439/african-curry/",
        "name": "African Curry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9285065.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2018-06-08T13:20:18.000Z",
        "description": "This is an African (Mozambique) curry that can be done with chicken, shrimp, or crab. Goes well with tomato chutney and onion hot sauce. For shrimp or crab, use 1 pound.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "1 onion, chopped",
            "2 cloves garlic, peeled and chopped",
            "1 bay leaf",
            "1 (14.5 ounce) can whole peeled tomatoes, drained",
            "2 teaspoons curry powder",
            "⅛ teaspoon salt",
            "1 (2 to 3 pound) whole chicken, bones and skin removed, cut into pieces",
            "1 (14 ounce) can unsweetened coconut milk",
            "1 lemon, juiced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large, heavy skillet over medium heat. Stir in the onion, garlic, and bay leaf, and saute until onion is lightly browned. Mix tomatoes, curry powder, and salt into the skillet, and continue cooking about 5 minutes. Mix in the chicken, and cook 15 to 20 minutes, until no longer pink and juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce skillet heat to low. Stirring constantly, gradually blend in the coconut milk over a period of about 10 minutes. Mix in lemon juice just before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "African"
        ],
        "recipeCuisine": [
            "African"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "VALERIEKOOKA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.385915492957746,
            "ratingCount": 355,
            "itemReviewed": "African Curry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "600.1 calories",
            "carbohydrateContent": "13.4 g",
            "cholesterolContent": "198.8 mg",
            "fatContent": "33.4 g",
            "fiberContent": "4.2 g",
            "proteinContent": "64.4 g",
            "saturatedFatContent": "21.3 g",
            "servingSize": null,
            "sodiumContent": "452 mg",
            "sugarContent": "3.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-06T22:50:28.89Z",
                "reviewBody": "I have no need to eat restaurant curry ever again as this recipe is fantastic IF you make some modifications! Before starting to cook, I marinated the cut chicken in a mixture of plain yogurt, tumeric, and pepper to give the chicken a great flavor and prevention against drying out. Once you start the actual dish, add extra onion and a lot of extra garlic (I used 6 cloves) and saute taking care not to burn the garlic.  I added a bit more canned tomato than the recipe called for and supplemented with fresh chopped plum tomatoes.  Add more curry than the recipe suggests - perhaps 1 Tbsp or more to suit your taste.  I was a bit heavy-handed on the salt and it was perfect.  The end result will be too bland if you're not.  Tasting as you go is your best bet.  Prior to adding the coconut I was sure to add a healthy dash of cayenne pepper to give the recipe a kick.  I only added 1/2 of the can of coconut milk as any more would have made the dish too soupy.  During this stage I also added about 1 Tbsp of light brown sugar and juiced only 1/2 of a large lemon.  \n\nThis dish will amaze YOU as well as your friends and family if modified to your liking. Don't be shy with experimenting with flavors.  The next modification will be to add vegetables to the saute.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Linarelli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1173651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-18T20:11:05.11Z",
                "reviewBody": "I thought this tasted really good. It was very silky and creamy. It was not very spicy, which I thought was perfect, but if you like hot curry, you would need to add heat. Since there has been so much discussion on the curry, I looked up a traditional recipe for African curry and used that. Here is the African Curry powder recipe:\n    1 tablespoon ground cumin \n    1 tablespoon ground coriander \n    1 tablespoon ground turmeric \n    1½ teaspoons ground ginger \n    1½ teaspoons ground allspice \n    1½ teaspoons garlic powder \n    ½ teaspoon cayenne pepper \n    ½ teaspoon chili powder",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/577508/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-10T23:58:46.193Z",
                "reviewBody": "This is a very good basic recipe, but I felt it lacked something, so I experimented a bit with it. Finally, I discovered that adding about tablespoon of brown sugar drastically improves the taste and helps balance the taste of coconut milk with tartness of tomatoes and curry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ITSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/744914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-01T01:14:29.53Z",
                "reviewBody": "this was beyond delicious but that could be bacause I am a beyond amazing cook.. hmm...:j My family says this tasted like something out of a resturant and they beg me to make it again and again! I did make some changes though which I will reveal in order to make your dish of curry as good as mine. Let's see.. first make sure you use bonless chicken cause it is a b h pulling the bones out of that sucker. On to the next step.. I used garlic flavored olive oil instead of regular but that isn't nescesary at all. My next change was to make absolutely certain the tomatoes were as drained as possible and to dice them as well. Next I used probably a total of 2 or more tablespoons of curry powder most of which I added during the coconut milk stage. Just be sure to tast it frequently and add the curry powder to meet your own personal preference. Next I added around 1-2tbsp of dark brown sugar and about a tsp of new mexico chili powder THIS STEP IS A MUST!!!! Next I added only about 3/4 can of coconut milk which I thought was perfect but I was told the whole can could of been used. Again it depends on personal preference so taste frequently. Last I ended up only using about 1/2 the amount of lemon juice which everyone thought was lemony enough. Last last be sure to serve over rice it's delicious that way! I hope I could help!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kayla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1780978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-08T17:03:46.217Z",
                "reviewBody": "I think the problem people had with this recipe turning out bland may have been due to the curry they used. I tried a 'regular' curry from a grocery store and got bland results. I bought curry from an Indian foods store and it is much stronger. (I've been told that there are many different varieties of curry.) I'll make this recipe with the Indian curry next time. Oh and I used lowfat coconut milk and it tasted great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "skeddy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/skeddy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T04:35:49.593Z",
                "reviewBody": "growing up eating curry and rice dishes, I find this recipe to be a good basic sauce that you can add ingredients. I personally love curry and made this recipe for my dinner guests,adding 1/8 tsp cumin,1/2 c sliced carrots, 1/2 c sliced green bell peppers, 1/2 c sliced mushrooms, and 1/2 c shrimp. saute the veggies until slightly tender add shrimp cook till pink tender.course you may want to add more coconut milk and a bit more curry depending on your taste and consistency of the sauce.Serve over rice. Over-all this is a great recipe for anyone to try! I myself tend to want veggies in my sauce. hmmm wonder how this sauce would be over asparaguss omitting the tomatoes of course! Job well done..Vickie! My guests loved the dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kitchenpanhands",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/835067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-26T20:44:40.637Z",
                "reviewBody": "I served this dish last night at a dinner party for some friends who are foodies. They LOVED it and one asked for the recipe to take back to France with her! I read through the suggestions and added some brown sugar and doubled the curry. I think the chicken tastes much better if marinated a short while ahead of time. I mixed some plain yoghurt with turmeric in a bowl and then put the chicken in (whole), covered it and stuck it in the fridge. Then I started chopping the onion and getting out the other ingredients. It can marinate anywhere from 30 minutes to several hours. While the onion cooks I take out the chicken and cube it. It tastes especially tender and delicious! I will definitely use this recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cressyk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1825241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-28T14:43:53.593Z",
                "reviewBody": "A real hit, whether I use chicken or shellfish.  Be sure to use regular coconut milk, not light milk, as the dish relies on the creaminess to counter the curry's fire. Also, if you have a variety of curries available, use one containing tumeric, cumin, and coriander instead of one emphasizing spices like cinnamon and cardamon.  And use the curry generously!  My guests tend to add curry to this dish if I've followed the recipe exactly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlliePeacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alliepeacock/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-10T15:12:28.077Z",
                "reviewBody": "My favorite recipe to date. This is saying a lot because I usually fix a gourmet meal each night. I could not get enough of this curry dish. I used 5 garlic cloves instead of 2. I also used 2 tbsp of curry and a dash of chili powder. This made the curry a little spicy but not too hot. I also used 2 fresh tomatoes and a large can of the peeled tomoatoes. Other than that, I followed the recipe and it was delicious. Serve over rice. Double the recipe if you want to have leftovers. It serves about 4 people.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLIECHADWELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1459439/"
                }
            }
        ]
    }
]