[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/49497/outstanding-chicken-dinner/",
        "name": "Outstanding Chicken Dinner",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3722010.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2018-06-08T13:20:35.000Z",
        "description": "An excellent taste for chicken - quick and easy to make! Boneless chicken breasts may also be used. My sister gave me this suggestion, and when I tasted the cream sauce she made for the chicken - WOW - I couldn't wait for the whole meal!  If there are any ingredients that you don't like, such as mushrooms, or artichoke, simply omit them.  It is the sauce that is the stunning aspect - and not the traditional 'canned soup' sauce!!  ENJOY!!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons unsalted butter",
            "1 (8 ounce) package button mushrooms, chopped",
            "2 cups chicken broth",
            "4 bone-in chicken breast halves, skinless",
            "1 (10 ounce) can artichoke hearts, drained and sliced",
            "½ cup unsalted butter",
            "½ cup all-purpose flour",
            "1 ½ cups half-and-half cream",
            "1 cup grated Parmesan cheese",
            "1 teaspoon dried rosemary",
            "½ teaspoon salt",
            "¼ teaspoon pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Melt 2 tablespoons of butter in a large skillet over medium heat. Saute mushrooms in butter until tender. Remove from the skillet, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the chicken into the skillet, and pour the broth over it. Cover, and simmer over medium heat for 20 minutes, or until the chicken is cooked through. Reserve 1/2 cup of broth from the pan, and discard or save remaining broth for other uses. Remove the chicken to a 9x13 inch baking dish, and top with artichokes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the remaining 1/2 cup of butter in a skillet over medium heat, and whisk in flour until smooth. Gradually stir in the 1/2 cup of reserved broth, and half and half cream. Cook, stirring constantly, until thickened, about 5 minutes. Turn off the heat, and stir in the Parmesan cheese, rosemary, salt and pepper. Pour sauce over the chicken in the baking dish. Place sauteed mushrooms on the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake uncovered for 30 minutes in the preheated oven. Let stand for a few minutes before serving to let the sauce thicken.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "HABERFAMILY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.069364161849711,
            "ratingCount": 173,
            "itemReviewed": "Outstanding Chicken Dinner",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "697.4 calories",
            "carbohydrateContent": "26.4 g",
            "cholesterolContent": "194.6 mg",
            "fatContent": "48.1 g",
            "fiberContent": "3.7 g",
            "proteinContent": "41.1 g",
            "saturatedFatContent": "29 g",
            "servingSize": null,
            "sodiumContent": "1130.5 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-03-27T04:27:44.14Z",
                "reviewBody": "This was delicious; it's an excellent dish to serve at a dinner party. It's elegant but not really that hard to make. I will say that the amount of flour called for is WAY too much....I made it as the recipe directed and it was not a sauce--it was paste. So I tossed out half of it and then added more half & half and some milk when I ran out of that. I think 3-4 Tbsp. would have been pleny and you could decrease the butter. Also needs plenty of salt and pepper. Other than that spectacular!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy Miles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17880008/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-27T04:28:35.107Z",
                "reviewBody": "Yummy--will make again. I did add a bit of fresh lemon juice....it tasted like a local resaurant's chicken!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "STREETANGEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/679875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-04T16:24:05.64Z",
                "reviewBody": "This recipe is very tasty. I lightened it up quite a bit by using fat free half and half and reduced fat butter. I also had to use the full amount of the flour even though I tried to get by with less based on what some other reviewers posted. Maybe it was because of the reduced fat ingredients I used needing a bit more bulk. Since I had some mixed color bell pepper strips to use up I sauteed those along with the mushrooms and threw in some frozen onion bits for good measure too. I omitted the artichokes although I will probably use them next time. We're not crazy about rosemary so that got left out too. I have to disagree with the poster who said this recipe was easy. Or maybe my definition of easy is different. But a recipe that requires the vegetables to be cooked first then the chicken then a sauce made separately then the whole thing baked isn't my idea of \"instant\". However I didn't mind too much because the dish tasted good and it was my day off so I had the time to devote to this recipe. However this isn't a dish I'd be able to whip up on most days after work. I served it over egg noodles with steamed asparagus on the side. A really delicious meal. I will make this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KathyG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/809340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-27T01:20:14.89Z",
                "reviewBody": "This is a delicious chicken recipe that my husband loved! I'm always looking for chicken recipes that aren't boring and this one for sure is a keeper. I sauteed 1 clove garlic and half an onion in 1 tbsp butter 1 tbsp olive oil. I added the 8oz of chopped mushrooms to this. Instead of just topping the dish with the mushrooms I mixed in my garlic onion mushroom mixture to the cream sauce and then poured it over the chicken. I left out the artichokes as well. The result was a wonderful flavor and a happy family. Thanks Christine!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LilWebb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1054614/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-19T05:25:16.873Z",
                "reviewBody": "Wow VERY Tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HABERFAMILY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/589049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T14:45:50.53Z",
                "reviewBody": "My family enjoyed this! I used 3 boneless chicken breast and cubed them. Did all in a skillet no baking. First cooked mushrooms. Removed and cooked chicken chunks for about 5-7 min. Used 1 (14 oz) can broth.There is approximately 1 1/2 cups in can so that is what I used. Removed chicken to the same bowl as mushrooms.I used all the broth to make my sauce. I used about 1/4 cup flour and mixed it with a little half and half. Bring broth to boil and slowly add flour until desired thickness. I'm not really fond of rosemary so I used thyme leaves in it's place. Once I got sauce ingredients together I added chiken mushrooms and artichokes. Cooked to heat through. Make sure you use a non stick pan or else it will stick with all that yummy cheese in it. I served it over linguine pasta. It was so good! The sauce is great! Thanks Christine for sharing this with all of us!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "awesome in tummy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-28T19:31:42.64Z",
                "reviewBody": "What a great starter recipe!! From others reviews I added 4 cloves fresh minced garlic which added wonderful flavor along with chopped sundried tomatoes garlic salt and fresh crushed rosemary. Also substituted 3/4 c milk for some of the half n half and the result was still creamy and delicious. Used boneless skinless chicken breasts and served with angel hair pasta. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RANCHGIRL_59714",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ranchgirl_59714/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-21T17:25:58.33Z",
                "reviewBody": "This was good but only after I changed it around a little. The recipe calls for WAY too much butter and flour for the roux - 2 T each would be sufficient. Also I would scale the sauce back a bit it makes a TON. I didn't poach my chicken yuck instead sauted it in butter/oil removed from pan and tented then cooked mushrooms etc. in the same pan (w/some onion) then added butter flour chicken stock half & half artichokes etc. right to the sauce. Instead of baking the chicken which would overcook it I finished it in the skillet. Much easier and yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Sell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T06:26:58.03Z",
                "reviewBody": "The sauce was great but this recipe seems unnecessarily complicated - why do you cook the chicken twice?! I'll make it again but I'll make the sauce first and then put it over the raw chicken mushrooms artichokes etc. in the baking dish and bake it altogether.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BEVINK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/670094/"
                }
            }
        ]
    }
]