[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17529/desserts/fruit-desserts/orange-desserts/",
                    "name": "Orange Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8101/mandarin-orange-cake-i/",
        "name": "Mandarin Orange Cake I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1088526.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1998-12-30T03:23:24.000Z",
        "description": "Start with yellow cake mix and Mandarin oranges to make this cake with a frosting made with pineapple, pudding mixture, and whipped topping.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 9x13-inch cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package yellow cake mix",
            "4 eggs",
            "1 cup vegetable oil",
            "1 (11 ounce) can mandarin orange segments",
            "1 (8 ounce) container frozen whipped topping, thawed",
            "1 (20 ounce) can crushed pineapple with juice",
            "1 (3.5 ounce) package instant vanilla pudding mix"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine cake mix, eggs, oil and mandarin oranges with juice. Beat until smooth. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the topping:  In a large bowl, beat together whipped topping, pineapple with juice and dry pudding mix until blended. Spread on cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Orange Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ellen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.646551724137931,
            "ratingCount": 696,
            "itemReviewed": "Mandarin Orange Cake I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "336.7 calories",
            "carbohydrateContent": "38.1 g",
            "cholesterolContent": "41.9 mg",
            "fatContent": "19.9 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "287.2 mg",
            "sugarContent": "26.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-10T16:22:41.117Z",
                "reviewBody": "Okay, here's what you need to do to perfect this recipe.... Add 1 teaspoon orange extract to the cake mix and cut the oil down to 3/4 cup. Other than those couple of things, follow the rest exactly and trust me, you will not be disappointed! I made two of these for a luncheon of 40 ladies and it was a huge hit. Several women asked me for the recipe and I was almost embarassed to let them know how easy it was! The topping is heavenly and could be used for lots of different things... maybe a big dollup on a slice of angel food cake or pound cake??? Yummy! Thanks for this wonderful recipe; I will be making it again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee Ridgeway",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-30T20:09:21.8Z",
                "reviewBody": "This showpiece cake has been a favorite for more than 25 years! It makes for a particularly perfect cake for spring or summer get togethers. The way I make it varies only a bit, but may be enough of a difference to be helpful. I use a 15-1/2 oz. can of pineapple, or the equivalent if that size can is not availabe, and I combine it with the pudding mix before folding in the whipped topping. I bake this in 3 9-inch layer cake pans (layers will be thin) for 20-25 minutes, and spread the frosting between the layers and on top and sides of the cake.  This makes for a very impressive presentation. Absolutely delicious, refreshing, and beautiful cake, great for birthdays!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-11T12:30:17.043Z",
                "reviewBody": "I made this cake with Betty Crocker Super Moist butter yellow cake and I got awesome response.  My sister who never asks for a recipe asked for this one.  The only difference was instead of beating all the topping ingredients together I mixed the pudding and the pineapple together and completely folded in the Cool Whip so it didn't break down.  Put in fridge for 3 hours before serving.  Keep refrigerated and it is good for 3 days easy.  Awesome cake.  Plan on using often.  One thing that gets me is some folks completely change the ingredients or pan size and complain that it's not awesome like those of us who follow the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LENDERLADYJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/570452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-03T19:44:02.843Z",
                "reviewBody": "I make this cake every Sunday for our pool party.  Everyone LOVES it!  I use only 3 eggs, 1/2 cup oil, and TWO cans of oranges.  Sometimes I even add coconut to the whipped cream to make it more tropical! Also, I reserve 18 orange segments to arrange on the top of the cake to resemble suns and call it \"Sunshine Cake\". :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLYTLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1453642/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-14T14:53:20.35Z",
                "reviewBody": "Edited due to smaller cake mixes. The Duncan Heinz website has a recipe for a cake mix extender. Cake mixes are now 15.25-16.25 ozs instead of 18.25 ozs. Rather than make 2 separate mixtures and mixing them together like the recipe states, I mix all dry ingredients together, then the wet and follow the cake mix recipe. My oranges come in a 20 oz can, rather than 11 ozs. I use all the oranges and pour out a little of the juice and it's just fine. I mix in the oil and eggs, then lightly mix in the oranges. I like a few chunks of orange in my cake. I mix the pineapple and dry pudding together and let it sit for a few minutes to thicken a bit. Then I gently fold in the cool whip, frost the cooled cake and chill for a few hours before serving. A lot of the cake mix recipes online have baking times for the larger mixes so it all works out, just test cake to be sure it's done. I adjust flavorings for the recipe, such as adding a tablespoon cocoa powder for chocolate cakes, or an extra 1/4 teaspoon orange or coconut extracts, etc, depending on what kind of cake I'm making. Duncan Heinz makes an Orange cake that I prefer over the Yellow cake. I like making 9\" layer cakes and using the extender makes for a taller, prettier cake. Thank you Ellen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYSUNSHINE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marysunshine1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-10T03:37:51.09Z",
                "reviewBody": "YUMMMM!!! I made a few changes tho. I made a Duncan Hines Moist Deluxe Yellow Cake forgot to add the oranges to it but made it a bundt style cake. I used a 20oz can of crushed pineapple (with juice) and 1/2 of a 10 oz can of mandarin whipped it up in the blender. I poured that into a bowl and added vanilla pudding mix. Then I took someone elses advice and added the cool whip after everything else was mixed. (that mixture in itself is delicious!) Then using a rubber spatula started at the top of the bundt and spread the frosting all around in swooshy patterns. I took the remainder of mandarin oranges and spread them around the top. Then sprinkled about 2 cups of coconut all over everything. Not only did it look pretty but the taste was outstanding! I would do it again this way in a heartbeat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISSYD70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1283163/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-04T23:34:37.86Z",
                "reviewBody": "I've been making this for a long time under the name of \"sunshine cake\" or \"pig lickin cake\" I have a gal at work that asks for it every year for her birthday. She asks that I make it low cal/low fat for her. I use applesauce for the oil, egg beaters rather than whole eggs, fat free cool whip and sugar free pudding. She just loves it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jayne Olivieri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/609875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-08T17:14:06.467Z",
                "reviewBody": "This is a great cake for spring/summer occasions but I made this for my husband's birthday with a few variations.  I made this using 2 9 inch cake pans (greased and floured).  For the middle layer spread a thin layer of orange marmalade and brush with pineapple juice (saved from the can you will use for the frosting. I used the drained pineapple for the frosting because the juice makes the frosting consistency too thin for my liking), repeat this on the top layer if desired.  For the frosting used drained pineapple, 12 ounces of cool whip topping and the pudding.  Fill and spread over entire cake, then add some chopped nuts (any kind) on the top for a really decorative touch.  For best results, cover and put in the fridge overnight before serving.  5 spoons up!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sydney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-20T12:55:25.31Z",
                "reviewBody": "Made just like the recipe stated however used two 9 inch rounds and placed topping in center. There was PLENTY of topping for the cake! For a teacher event I will dress it up a bit on the outside with toasted coconut. I like the idea of using the orange cake mix next time. I had a hard time finding just yellow! Made for two events and they were both a HIT! Love this recipe. It's easy and Yummy! We are not cake lovers here but his is a hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CALLY5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1397746/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-30T23:43:31.397Z",
                "reviewBody": "Kinda disappointed in this cake.  The topping was wonderful, however; the cake had no orange flavor whatsoever!  It was very moist, but didn't taste any different than your regular boxed yellow cake.  Next time I will try adding some orange extract.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Caryl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1313505/"
                }
            }
        ]
    }
]