[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17749/side-dish/vegetables/cauliflower/",
                    "name": "Cauliflower",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/55641/gobi-aloo-indian-style-cauliflower-with-potatoes/",
        "name": "Gobi Aloo (Indian Style Cauliflower with Potatoes)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F125180.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:21:27.000Z",
        "description": "This is a basic Indian dish that is very tasty! Adjust the spices to your preferences! To  make it even better, you could add a bit of stewed tomatoes.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "1 teaspoon cumin seeds",
            "1 teaspoon minced garlic",
            "1 teaspoon ginger paste",
            "2 medium potatoes, peeled and cubed",
            "½ teaspoon ground turmeric",
            "½ teaspoon paprika",
            "1 teaspoon ground cumin",
            "½ teaspoon garam masala",
            "salt to taste",
            "1 pound cauliflower",
            "1 teaspoon chopped fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a medium skillet over medium heat. Stir in the cumin seeds, garlic, and ginger paste. Cook about 1 minute until garlic is lightly browned. Add the potatoes. Season with turmeric, paprika, cumin, garam masala, and salt. Cover and continue cooking 5 to 7 minutes stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the cauliflower and cilantro into the saucepan. Reduce heat to low and cover. Stirring occasionally, continue cooking 10 minutes, or until potatoes and cauliflower are tender.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables",
            "Cauliflower"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHAHZADI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.032558139534884,
            "ratingCount": 215,
            "itemReviewed": "Gobi Aloo (Indian Style Cauliflower with Potatoes)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "135.3 calories",
            "carbohydrateContent": "23.1 g",
            "cholesterolContent": null,
            "fatContent": "4 g",
            "fiberContent": "4.4 g",
            "proteinContent": "4 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "331.5 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-02T04:21:31.983Z",
                "reviewBody": "A tasty and flavorful restaurant-quality dish.  Don't listen to some of the other \n\nreviewers: some did things to make a sauce/gravy; this dish isn't supposed to have a \n\ngravy.  (Look at the picture I submitted.)  But the concerns about drying out the\npotatoes and cauliflower are justified.  To solve this, during the times when\none is supposed to cook with the pan covered, make sure there is a little water at \n\nthe bottom of the pan.  Every few minutes uncover and add a little water.  This\nmakes sure everything stays damp and steams as it cooks.  I found it necessary\nto steam for an extra 5-10 minutes to cook the potatoes sufficiently.\nAlso, I used 50% more spices than listed.  Salt I added to taste *at the end*,\nnot where recommended in the recipe.  (How would one decide if something tastes\nright before the vegetables are done cooking?)  Finally, I forgot about the\ncilantro and didn't miss it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mark P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-12T20:26:12.543Z",
                "reviewBody": "I made this according to the directions, but it seemed so dry... I added a small can of coconut milk and a diced tomatoe at the end of the cook time, and then simmered an additional 8 minutes or so.  The result was delicious!  I think the tomatoe and coconut milk should really be included in the recipe.  Also, I used curry and a small amount of cumin instead of tumeric.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber Waite",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/386879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-06T17:40:49.743Z",
                "reviewBody": "I've made this a couple times and it turns out pretty good. I like this recipe because it's not as involved as recipes for aloo gobi in my Indian cookbooks. What is with the coconut milk though? If you want traditional aloo gobi, stop taking one reviewer's suggestion and don't add coconut milk. It's not part of this dish, and if you add it, you're making something completely different, and most likely, something sweet. Mustard seeds are always a great addition and the more cilantro the better, but if you find that it's too dry, add a 1/2 cup of crushed tomatoes and it will be perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefMia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-02T03:16:25.763Z",
                "reviewBody": "This is a very basic version of the traditional Aloo Gobi recipe. I did not find it any drier than other versions of this dish. It is supposed to be very dry; not all Indian recipies are intended to have a sauce!! I found the flavor however to be fairly bland though not disagreeable. This is a minimal recipe that would be good to use on a day-to-day basis not for company. The exclusion of onions is also regrettable since that eliminates a lot of the traditional flavor. the paprika is a little different from other Aloo Gobi versions I have tried but I would probably use less of it and add a little more zing via green chili peppers in my own version.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LUNACITY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-15T05:16:14.887Z",
                "reviewBody": "This dish is excellent with a few changes. Note that this recipe has no liquids which will becomes too dry. I followed the recipe up to the adding of the potatoes and seasoning but instead of cooking 5-7 minutes I put it in my crock-pot with 1/2 cup vegetable broth and a can of stewed tomatoes (because I didn't have diced tomatoes). Cooked on high for 2 1/2 hours (after the first 30 minutes I added the Cauliflower stirring to saturate with the spices. I added a little more milk (maybe 1/4 cup or less) after 2 hrs and stirred. The cooking time will depend on how big you cut the potatoes I cubed them about 1-2\" wide. I chose the crock-pot method because I was going to be busy preparing the Chicken Tikka Masala to serve with it. This turned out delicious!!! my picky teenager loved both dishes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2242941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-24T03:36:17.293Z",
                "reviewBody": "Although I cook with minimal oil I will have to say that this recipe requires more than 1 Tbsp as there is quite a lot of cauliflower. A couple of suggestions - cut the potatoes smaller than the cauliflower as they take longer to cook. Cover and cook over slow heat. Add cilantro after the vegetables have cooked and allow to heat through. This allows the fresh flavour to remain. Gobi Aloo is meant to be dry - it is not a curry so pls don't follow other reviews of adding coconut milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Niloufer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2532485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-23T01:22:53.96Z",
                "reviewBody": "The recipe is really good but it's missing some things. First off it was really dry and it should really have some curry to it. I realized that the colour wasn't catching on to all of the cauliflower... just the tops and bottoms. I used half of a big cauliflower which might have been more than a pound. I added tomatoes (which you really should put in) and one cup of water. The water made it lose a bit of flavour and it was still dry. So after reading the other reviews I added 1/2 can coconut milk and that made a good curry base. Also I didn't have cilantro so I used parsley instead which worked well. In total I put in twice the amount of spices that the recipe asked for for the half a cauliflower I used. This makes the curry rich and flavourful. You need to simmer the dish on low for about 20 minutes longer as well. In the end...it turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SOCAGYAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1220422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-24T18:03:43.03Z",
                "reviewBody": "My family and I thought this was delicious. I added about 1/3 cup half and half like another reviewer and also 1 can of diced tomatoes and the remainder of a bag of peas. Tasted great. The only change I would make would be to add the garam masala just about 5 minutes before it's done cooking otherwise it makes the dish taste a little bitter. A little lemon juice can cure the bitterness though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIEKID",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/263147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-01T01:29:36.453Z",
                "reviewBody": "This is a nice basic recipe. I agree with the reviewer who added tomatoes. It certainly enhanced the taste. I also added more garam masala because I like spicy food. To the reviewers who skipped the asafoetida while asafoetida does not appear to really add anything to the taste it's a traditional digestive added to Indian recipes. I find that it is especially helpful when you eat spicy or rich oily food. So do add a pinch even if you don't quite taste anything.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tigerlily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2229500/"
                }
            }
        ]
    }
]