[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/249/main-dish/casseroles/",
                    "name": "Casserole Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1006/main-dish/casseroles/vegetable/",
                    "name": "Vegetable",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/55605/cheeseburger-and-fries-casserole/",
        "name": "Cheeseburger and Fries Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F637659.jpg",
            "width": 3968,
            "height": 2640
        },
        "datePublished": "2018-06-08T13:21:27.000Z",
        "description": "Ground beef, condensed soups, and frozen fries combine to make a quick and easy family pleaser.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds lean ground beef",
            "½ medium onion, chopped",
            "salt and pepper to taste",
            "garlic powder to taste",
            "1 (10.75 ounce) can  condensed golden mushroom soup",
            "1 (10.75 ounce) can  condensed Cheddar cheese soup",
            "1 (16 ounce) package frozen French fries",
            "2 cups shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the ground beef and onion in a skillet over medium-high heat. Cook, stirring occasionally until beef is no longer pink, and the onion is translucent. Drain off excess grease, and season with salt, pepper and garlic powder.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return to the heat, and stir in the golden mushroom and cheese soups until well blended. Heat through, and remove from stove. Transfer the mixture to a 9x13 inch baking dish. Cover the ground beef mixture with a layer of frozen French fries.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 to 30 minutes in the preheated oven. When the fries are golden brown, remove the casserole from the oven, and sprinkle cheese over the top. Return to the oven, and bake just until cheese has melted.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Casserole Recipes",
            "Vegetable"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BETTINA_J"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.076023391812866,
            "ratingCount": 342,
            "itemReviewed": "Cheeseburger and Fries Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "511.1 calories",
            "carbohydrateContent": "21.1 g",
            "cholesterolContent": "120.7 mg",
            "fatContent": "32 g",
            "fiberContent": "1.8 g",
            "proteinContent": "33.7 g",
            "saturatedFatContent": "15.5 g",
            "servingSize": null,
            "sodiumContent": "1018.7 mg",
            "sugarContent": "1.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-22T14:46:54.687Z",
                "reviewBody": "We loved this, and we don't have any kids.  There are a few things I did differently though.  First, you MUST bake your fries for 10 mins.  This prevents them from becoming soggy and watering up your whole dish.  Second, I don't agree with the mushroom soup, because your typical cheeseburger doesn't have mushrooms.  I think that's what made others' taste \"off\".  So I substituted tomato.  As visually unappealing as it was, the combo of these 2 soups was oh so good.  I also use Campbells Healthy Request soup and lowfat cheddar because I'm on WW.  Should you do the same, you'll need to season the beef a little bit with salt, pepper and garlic powder (I have them all mixed together in a shaker.  1/2 tsp should do it.) to compensate for the lower sodium.  My husband said it was surprisingly delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KatieC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1782486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-01T23:03:11.627Z",
                "reviewBody": "Update:  I made this a while back and had no golden mushroom soup, so I used 3/4 cup lite sour cream.  It was delicious!  I've also used nacho-cheese soup in this recipe, and it is also great.  My family prefers tater tots to fries on this casserole, and I always bake them until they're crisp before putting them on the casserole.\nOriginal review: My kids really liked this.  They gave it a five.  I'd give it a three and a half if I could, but rated it a four because the rest of the family liked it.  I didn't change anything except adding garlic, oregano, a little worcestershire sauce and cayenne pepper, but the next time I make it, I will make some changes.  For example -- next time, I'll pre-cook the fries.  Though I bought the extra-crispy version, the fries were soggy.  I'll prebake next time, and might use waffle fries instead of regular, or even the extra-crispy tater tots.  The bottom line with this recipe is that it's a plain, easy week-night meal that won't threaten your kids.  UPDATE:  I made this again last night, and the changes I made improved it vastly -- I prebaked OreIda's Crispy Battered Fries for almost thirty minutes on 425, so they were nice and crunchy.  This cut down on the cooking time of the entire dish, as I only had to melt the cheese rather than wait for the fries to bake.  I subbed nacho flavored cheese soup for the cheddar, and added a dollop (about a quarter of a cup) of sour cream to the meat mixture.  Excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-05T22:11:01.92Z",
                "reviewBody": "Mmmmmm..very good! I took another's advice about blandness due to not enough seasonings so I was VERY generous. I added about/more 1 1/2tsp salt 2 tsp pepper 1 1/4 tsp garlic powder to ground beef mixture and than added a dash of salt and pepper to the fries before placing in oven. End result was delicious!! We served with ketchup at table and my fussy 3 & 6 yr old's ate seconds! Must admit I was very unsure about the end result due to the odd mixtures and about all the reviews about blandness but it was very simple to make and a big time family pleaser just don't be shy with the salt pepper and garlic powder. Thanx for sharing Bettina!! Our family loves it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chars3girls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/794805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-19T15:05:10.92Z",
                "reviewBody": "This was a great kid friendly meal. I only used 1 pound of meat and then used cream of mushroom soup instead of golden mushroom. I also added a can of green beans and a can of corn so we'd have our veggies in there! I baked the fries for about 10 minutes before adding to the top of the casserole and they came out nice and crisp!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Pulley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/hkp123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-19T03:21:03.237Z",
                "reviewBody": "I just found this recipe online but I have been making something similar to it for awhile now. I always add minced garlic to my ground beef and onions while cooking. Also I buy the seasoned steak fries and they are NEVER soggy. I think it depends on the fries you buy on whether or not they turn out soggy. Also I have always used 2 cans each of the cheddar cheese soup and the golden mushroom. I just made it for my in-laws Saturday and there wasn't anything left and they wanted me to cook it again and it has only been four days!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UOFIKAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1462829/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T18:17:04.1Z",
                "reviewBody": "Very quick and easy dish. I served it with ketchup for the kids. Next time I will add extra cheese soup it just wasn't cheesy enough for my tastes. Also I will cook it longer next time my fries came out soggy but tasty nonetheless. This is a good recipe to whip together after a hectic day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SeeMomShop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/436846/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-09T20:37:54.123Z",
                "reviewBody": "Super kid-friendly meal. The key is seasoning your ground beef properly. If you're saying this recipe is bland it's probably because you didn't add enough salt pepper and garlic to your meat. Also it's great with ketchup and mustard - added at the table.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TEN4RUTHIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-15T16:26:10.873Z",
                "reviewBody": "I cooked this one night for my boyfriend and I and it was AWFUL! The recipe was easy enough but it was very bland and had no taste. Won't make this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SK4JD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/661699/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T15:37:20.247Z",
                "reviewBody": "My family loved this recipe. They suggested using different types of frozen potatoes each time we try it to see what our favorite might be. I used shoestring this time but think I will try tator tots next time. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Bezemes Walstrom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/650/"
                }
            }
        ]
    }
]