[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15494/desserts/cakes/cake-mix-cakes/layer-cake/",
                    "name": "Layer Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8256/orange-cream-cake-iv/",
        "name": "Orange Cream Cake IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1044215.jpg",
            "width": 3568,
            "height": 2368
        },
        "datePublished": "1999-06-21T05:01:13.000Z",
        "description": "Just like the popular ice cream treat. This cake serves at least 10 to 12 people and it's mmm mmm good!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "2 - 9 inch round",
        "recipeIngredient": [
            "1 (18.25 ounce) package orange cake mix",
            "1 ¼ cups milk",
            "2 teaspoons orange extract",
            "1 (16 ounce) package frozen whipped topping, thawed",
            "¼ teaspoon orange extract",
            "16 ounces sour cream",
            "2 cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to temperature indicated on cake mix package. Prepare two 9 inch round cake pans according to package directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare cake according to package directions, but substitute milk for water, and add 2 teaspoons orange extract. Pour batter into two 9 inch pans and bake as directed. When cakes are cool, slice each layer in half horizontally, making four layers total.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Frosting: In a large bowl, combine whipped topping, 1/4 teaspoon orange extract, sour cream and confectioners sugar. Mix well to combine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread frosting between layers, on sides and over top of cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Layer Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Neris"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.411764705882353,
            "ratingCount": 51,
            "itemReviewed": "Orange Cream Cake IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "238.2 calories",
            "carbohydrateContent": "32.3 g",
            "cholesterolContent": "9.8 mg",
            "fatContent": "11.4 g",
            "fiberContent": "0.2 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "7.1 g",
            "servingSize": null,
            "sodiumContent": "159.9 mg",
            "sugarContent": "23.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-26T04:01:31.11Z",
                "reviewBody": "I made this yesterday for today (today being Christmas). I know it's not a very Christmas-y dessert but I wanted something completely different from the half-dozen things we had for dessert on Thanksgiving. I made the lemon variety and it was amazing! One could make this cake in such a variety of flavors limited only by what extracts you can find. I do have some advice regarding the frosting though. Make this cake the day (or at last many hours) before you are going to serve it. Chill the frosting for at least an hour before putting it on the cake as it will firm up and be able to support the layers better (allowing you to put more between each layer). Frost the cake reserve the leftover frosting and chill. When you serve it frost it again using as much of the frosting as you can. Its not sweet so don't be afraid to use LOTS of frosting. That's why the recipe makes as much frosting as it does because its GOOD. There's no need to waste it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NeitherSparky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/neithersparky/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-11T03:38:42.497Z",
                "reviewBody": "This recipe is GREAT! I had never heard of an orange creamsicle cake but when it was requested of me I of course turned to this website. My only suggestion is to cut down the recipe for the icing...unless you plan on icing more than your cake. I would say half everything and it should be more than enough without extra containers of it left over. This is the PERFECT orange cream cake and does really taste like the summertime favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CAITCANCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1043521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-23T00:10:14.327Z",
                "reviewBody": "I just made this cake and with a few adjustments it was perfect. It really tastes like a cream sickle you just got off the ice cream truck. The things changed are: I doubled the amount of extract in both the cake and icing (add to taste), I also added non-flavored gelatin (1 - 2 pkgs) in the icing (icing is a little thin), added food coloring to the icing to make it the color of the orange of a cream sickle and I used a white cake mix. It was perfect!! The icing is a little thin, even after setting, without the gelatin. I love the icing because it is not a real sweet icing. My daughter and I usually share a piece of cake, I eat the cake and she eats the icing. There will be NO SHARING TODAY. lol For an added twist I made a coconut cream version of this as well by: where ever it says water/milk I used coconut milk (canned of course, I'll try fresh next time, lol) and I used coconut extract (still doubling of course), as well as the gelatin, top with coconut and this is a coconut cake to die for!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "heavenlybaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4591490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-01T01:54:14.543Z",
                "reviewBody": "Fantastic!! Tastes just like the creamsicle! The cake is really moist and flavorful but it is the frosting that makes this cake. The frosting really has that creamsicle flavor that is so yummy! I chilled the cake briefly to make it easier to cut the layers. I used a generous amount of frosting between the layers and iced the top and sides as well. The cake looked beautiful after it was cut. The rich orange color and the creamy white - just spectacular. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JACQUELINE QUALLS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276510/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-05T15:39:01.91Z",
                "reviewBody": "This tastes just like a Creamsicle! The frosting is delicious (hubby was eating leftovers by the spoonful) and very light. I couldn't get mine to set up firm enough to stay on the cake (even after letting the frosting sit in the fridge for 5 hours) so I added in a packet of unflavored gelatin and stuck it in the fridge for another 1/2 hour. After letting the frosted cake refrigerate overnight it held up beautifully even when cut. Co-workers raved and it's perfect for the 100 degree weather we're having! I decorated it with orange slice gummy candies so it didn't look like a white blob and people couldn't believe I made it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1583126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-05T19:38:37.87Z",
                "reviewBody": "Only made the frosting. Frosted Bee Lian's Orange cake on this site. Creamy and not runny at all. I used 1/2 recipe for one 8x8 round cake. There was leftover but not enough for another whole cake. One suggestion: Mix the powdered sugar with the sour cream to get rid of the sugar lumps and then fold in the whipped topping. Leftover frosting makes a good fruit dip!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gloria Rice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-31T23:41:33.24Z",
                "reviewBody": "This is a great cake with a few adjustments. To the CAKE MIX use ORANGE JUICE instead of MILK and ADD one small box ORANGE GELATIN. (using juice makes a lighter batter but using milk is great if you prefer a more dense cake. Both methods are good) Reduce Orange Extract to 1 tsp. in cake. FOR ICING instead of sour cream I use CREAM CHEESE and replace the orange extract in the frosting with vanilla. This creates a dramatic taste difference for the orange-vanilla taste in Dreamsicles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "julesbai",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3827156/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-29T20:12:39.943Z",
                "reviewBody": "I read the previous reviews about how you can use white cake since orange cake is hard to find and many people commented on how the frosting was runny. So I used white cake instead of the orange and added orange juice instead of the milk as one reviewer suggested. I still used the orange extract in the cake but made a completely different frosting. I used a cream cheese frosting from this site and added a little bit more vanilla and powdered sugar than it called for to bring out the vanilla and have a good contrast between the orange and vanilla. After frosting the cupcakes I put an orange slice gummy on each (as another reviewer had done). These were sooooooo good and everyone at our BBQ loved them. I will definitely be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ERINDENISE21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1273346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:57:17.013Z",
                "reviewBody": "Wow!!! This is an excellent cake!!! I brought it in for a birthday at work and they just loved it. I did make one change I made it a sheet cake and added mandarin orages to the middle. Thank you for sharing the recipe. Lillian Cordova",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jazzynm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13625/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-13T16:36:04.827Z",
                "reviewBody": "I rated based on the exact recipe. Makes ALOT of frosting. Which could be a bad or good based on how much you wanna eat frosting! The frosting is also very very runny. It would be great for a sheet cake style cake but NOT a layer cake which I did. I had to make last minute adjustments that saved it! I placed skewers through the cake layers to keep it from sliding. And keep in mind all the layers were chilled overnite along with the frosting and it still was way too runny! I would advise to make a stablized whipped topping (16 oz. heavy whipping cream)from scratch then use only 8 oz. sourcream. I am a seasoned professional baker so I'm not speaking from lack of experience. The flavors are a wonderful combo! And if you need a luscious summer dessert in a hurry go for it! COLD refrigeration is KEY!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "renae92",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3012040/"
                }
            }
        ]
    }
]