[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15494/desserts/cakes/cake-mix-cakes/layer-cake/",
                    "name": "Layer Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8293/hamburger-cake/",
        "name": "Hamburger Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F564867.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "1999-07-12T20:23:09.000Z",
        "description": "This is a wonderful cake that looks just like a giant hamburger. I made one for my nephew and it was a delightful hit.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 large hamburger shaped cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package white cake mix",
            "1 (18.25 ounce) package chocolate cake mix",
            "yellow paste food coloring",
            "brown paste food coloring",
            "¾ cup prepared chocolate frosting",
            "24 orange chewy fruit-flavored candy squares",
            "12 leaf-shaped spearmint gumdrops",
            "3 large red gumdrops",
            "4 large white gumdrops",
            "6 candy lime slices",
            "1 tablespoon sesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven according to cake mix directions. Butter and flour one 8 inch round and one 9 inch round cake pan and one 2 quart ovenproof bowl 8 inches in diameter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare cake mixes. Pour 1 3/4 cups of the white mix into the 8 inch round cake pan, and the rest into the 2 quart bowl. Pour 1 3/4 cups of the chocolate mix into the 9 inch round pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 8 inch cake for 25 minutes, 9 inch cake for 20 minutes and bowl cake for 1 hour or until toothpick inserted into centers comes out clean. Cool in pans on racks 10 minutes. Remove from pans; cool completely on racks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In separate small bowls, tint small amounts of vanilla frosting red and yellow, to use as ketchup and mustard. Tint remaining vanilla frosting light brown, using brown and yellow food coloring.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For bun bottom, frost the 8 inch cake with light brown frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For hamburger patty, spread top and sides of 9 inch chocolate cake with chocolate frosting Lightly press all around sides of cake with folded paper towel, pulling towel straight out to create rough edge of burger. center cake on top of bun bottom.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For cheese, arrange orange fruit chews in single layer on microwave-safe plate. Microwave on High 10-15 seconds or until slightly softened. With hands, press and flatten chews together to form 9 inch square. Place on top of hamburger patty. On work surface sprinkled with granulated sugar roll out 5 leaf-shaped gumdrops to 1/8 inch thickness to form 1 large lettuce leaf; repeat rolling with 6 more gumdrops to form another leaf. Arrange over cheese near edges of burger. For tomatoes, roll out red gumdrops individually to 1/8 inch thickness. Arrange over lettuce around burger edges. For onion rings, roll out white gumdrops to 1/8 inch thickness. With round cookie cutters or sharp knife cut out circles; cut 1/4 inch thick rings from circles with small cutters. Re-roll scraps to make additional rings; arrange rings over tomatoes. Arrange fruit-slice candies over onions for pickles. Pipe red and yellow icing around edges of burger for ketchup and mustard.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For bun top: If necessary, trim bowl cake so that it will be flat on the bottom when inverted. Invert firm paper plate onto work surface. Center bowl cake, trimmed side down, on top of plate. Starting from the top, spread remaining light brown frosting in lines down sides of cake, turning plate after each section. Sprinkle with sesame seeds. Carefully place on top of the cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Layer Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Gail"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.394736842105263,
            "ratingCount": 38,
            "itemReviewed": "Hamburger Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "579 calories",
            "carbohydrateContent": "109 g",
            "cholesterolContent": null,
            "fatContent": "16.1 g",
            "fiberContent": "1.6 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "690.6 mg",
            "sugarContent": "78.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-10T11:35:16.56Z",
                "reviewBody": "I have made this cake several times and have found it to be easier to make peanut butter frosting for the bun rather than mess with food coloring. I also pour all the white cake batter in the oven bowl and cut it in half when cooled to form the halves of the bun. I also use the decorator icing or decorator frosting for the ketchup and mustard.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANMARIEC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/663451/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-18T22:01:16.217Z",
                "reviewBody": "It is a bit confusing not having all the ingredients at the top. I made this cake for my son's birthday using a brownie in the middle for the burger (no need to frost) and I used strawberries and kiwi for the tomatoes and lettuce. I used a bit of yellow frosting for cheese. To cut back on sugar content I used a yellow cake mix and opted to not frost the bun--I only used frosting in the middle for ketchup and cheese or mustard.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HELDT123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/589176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-29T20:44:21.8Z",
                "reviewBody": "I would have given this a 5 star if all of the ingredients would have been listed in the INGREDIENT section. Plus I don't like candy with my cake or brownies... so melting candy and using it as cheese didn't go over well... plus like other reviewers said it gets hard after it cools... so it makes it hard to cut the cake... I would just omit the \"cheese\" all together... HAMBURGERS don't have cheese on them... cheeseburgers do... and since this is a hamburger cake... no need... if you really want it... I'd think of something else... To make the lettuce easier... just get a plastic baggie green food coloring and shredded coconut put a few drops of food coloring in with some coconut and shake it up... I think coconut mixes much better with cake and icing vs some sweet candy. Anyway hope yours turns out good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JBLAZ17",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1351281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-11T18:53:45.74Z",
                "reviewBody": "I made this cake last minute for a pool party. I didn't take very long to make it and it was very easy to do. I didn't add all of the topping listed. The only toppings I used were lettuce cheese and mayo. Everything was buttercream except for the cheese I used fondant. I also made french fries out of sugar cookie dough and red frosting diluted with piping gel for dipping sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wendytails",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2979894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-02T05:33:47.42Z",
                "reviewBody": "Great idea something different from the same old layered cake and deceptively easy. I altered slightly by using fondant icing for the lettuce cheese onions and tomatoes. If I make this again I would use less sweet fillings and icings by the time this is complete it's ALOT of cake and icing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gourmet geek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2279547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-07T22:11:06.667Z",
                "reviewBody": "This is very easy to follow.I just did mine all in butter cream iceing.I have been wanted to make one of these and as of today i made one for my neighbor boy's boy scout troop.They just thought it was the coolest thing ever.Thnx much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/tarasb70/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-21T16:34:30.39Z",
                "reviewBody": "I hated making this cake for a lot of reasons: 1.It did not list all the ingredients you needed at the top. 2.It said to use white instead of yellow cake mix. Since white cake mix does not have egg yolks the cake fell apart. 3.The ingredients that you needed that were not at the top were NOT stuff you normaly would have around the house. 4.The recipe was not very specific. 5.The recipe did NOT look like a hamburger!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "used2luv2bake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-03T10:17:09.983Z",
                "reviewBody": "This is by-far the most fun I've ever had making a cake! Thanks SO much for posting this recipe!:) I think next time I make it I will try using fondant instead of candies for the toppings. Someone mentioned in their review to put crushed oreos in the chocolate frosting on the \"burger\" part of cake - that was awesome!! Really added texture! Great Idea! For the cheese I used Peachy-O's candies (i washed off sugar and microwaved to melt) then coated small square pan with cooking spray - dusted with white sugar and poured melted peachy-o's in (sugar was to keep candy from sticking again). That came out of pan nicely and square like slice of cheese. My white gumdrops for onions didn't turn out so I omitted. Will add next time when using fondant. Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer N.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2788161/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-03T22:54:39.983Z",
                "reviewBody": "I thank you for such a creative and fun idea! I opted for a from scratch cake but for kiddies the mix would be fine. I made this for my Dad's birthday....he's a burger freak and it got lots of laughs: ) Since it was for adults I used candied orange for the \"cheese\" and candied mint leaves for the lettuce! Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MALTOMEEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/442975/"
                }
            }
        ]
    }
]