[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13390/main-dish/pork/pork-chops/pan-fried/",
                    "name": "Pan Fried",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/66623/sweet-maple-pork-chops/",
        "name": "Sweet Maple Pork Chops",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F934899.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:22:48.000Z",
        "description": "Oatmeal breaded pork chops with a caramelized onion and mushroom maple syrup glaze.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 serving",
        "recipeIngredient": [
            "1 egg, lightly beaten",
            "1 quart heavy cream, divided",
            "salt to taste",
            "ground black pepper to taste",
            "6 boneless pork chops",
            "½ cup quick cooking oats",
            "1 quart vegetable oil for frying",
            "1 tablespoon butter",
            "1 large onion, cut into 1 inch chunks",
            "1 clove garlic, diced",
            "¾ cup maple syrup",
            "6 ounces sliced fresh mushrooms",
            "2 tablespoons chopped fresh basil leaves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix the egg, 3 cups heavy cream, salt, and pepper in a shallow bowl. Season the pork chops with salt and pepper, and dip in the cream mixture. Then dredge in the oats to coat. Repeat to coat chops completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a skillet over medium-high heat. Use tongs to place the coated chops in the hot oil, and fry until browned on both sides. Remove from heat, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a skillet over medium heat (you may use the same skillet if the oil has been drained), and cook the pork chops, onion, and garlic until onion is tender. Pour in the maple syrup, and mix in mushrooms and basil. Season with salt and pepper. Cover, reduce heat to low, and cook 10 minutes, or until pork chops are done. Remove chops from skillet, reserving sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the remaining cream into the skillet with reserved sauce. Bring to a boil. Cook and stir until thickened. Serve over the pork chops.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes",
            "Pan Fried"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DOWNGRADE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0576923076923075,
            "ratingCount": 52,
            "itemReviewed": "Sweet Maple Pork Chops",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "943.4 calories",
            "carbohydrateContent": "39 g",
            "cholesterolContent": "284.8 mg",
            "fatContent": "81 g",
            "fiberContent": "1.5 g",
            "proteinContent": "18.8 g",
            "saturatedFatContent": "41.5 g",
            "servingSize": null,
            "sodiumContent": "115.3 mg",
            "sugarContent": "25.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-07T23:46:53.357Z",
                "reviewBody": "This was a nice change of pace for pork chops I did a few things differently. First I dip the pork chops in the oatmeal then in the cream mixture then back in the oatmeal. I know everyone thinks the first coat will come right off but trust me it doesn't and the coating comes out much nicer. I do beleive this is probably the reason why I used more like 3 cups of Oatmeal and hardly any of the cream mixture. Second I used fat free half and half in place of the heavy cream to cut down on the fat and calories the flavor of the sauce was very good a little sweet (but hey what did I expect the recipe is called SWEET maple pork chops) but I think because of the fat free half and half it had a hard time thickening I added a little cornstarch to fix that up. Third I bought 2 packages of pork chops for a total of 8 chops I could only fit 6 chops in the pan with the onion/garlic/basil/maple syrup mixture. The remaining 2 chops I put in the frypan after I took everything out and cooked covered on low for 10 minutes by themselves. Having tried the chops both ways I don't feel this affected the taste at all and I would cook the chops this way when I prepare it again as it left the coating crispy and in tact on the chop. I definetely had trouble with the coating staying on the original 6 chops. Lastly I in no way used a quart of oil to fry these in if I were to approximate I'd say I used about a cup or so. We did enjoy the recipe and I'll be making it again. THANKS!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVECED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1280465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T23:01:53.287Z",
                "reviewBody": "I joined allrecipes just so I could rate this recipe and give credit to the person who suggested double dipping the chops in the oats. THE OATS DON'T FALL OFF it makes the coating nice and thick and really tasty! I now do this with everything I bread it's AWESOME for chicken cutlets!! So thanks for the recipe it's great--but even more thanks to LOVECED for her advice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "breezin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2721455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-23T00:51:05.09Z",
                "reviewBody": "I gave this 5 stars because it had a very nice flavor but it was a big mess the oatmeal wouldn't stay on during cooking there was more in the skillet than on the chops. Next time I am going to try putting the oatmeal in the blender first to make a powder out of it then dip the chops in it. Also I see no need to use a whole quart of oil next time I will use a small amount in the skillet I think that the oats will stick to the chops better that way. I don't see why all that cream is necessary seems like you would only need a cup to dip the chops in. But it does have a nice flavor and is worth trying again and hopefully I'll get better results",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Graden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1056521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T17:19:32.62Z",
                "reviewBody": "The only reason I rate this a 3 is because the flavor is absolutely delicious. However the actual recipe as far as quantity goes was way off from what I found. 3 cups of heavy cream for the coating is entirely too much. Turned out to be maybe 1 cup needed and 2 cups in the trash. In order to coat the pork chops a lot more than 1/2 cup of oats is needed as well. I don't see the need to double-coat them either as when you put the chops into the liquid after putting the oats on they just fall off into the liquid which wastes more oats. Most of the oats fell off while frying also and for pan frying you need nowhere near a quart of oil. Following the recipe exactly would mean throwing away at least 2 c. each of oats heavy cream and oil..which really spoils the recipe for me. The flavor of the sauce is incredibly good but in the future I will prepare the pork chops in a more practical and less wasteful way and then make the sauce seperately.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorielle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1409921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-22T17:44:47.843Z",
                "reviewBody": "Wow...these were absolutely amazing!! It took a while to prepare but in the end the taste was out of this world and very much worth the effort. Some of the oatmeal did come off but not enough to alter the taste. I fixed this meal for a special occasion and it will stay that way. We could easily eat this once a week but the high fat and calories would show eventually!:) UPDATE: To cut the calories I used Promise spread in place of butter half and half instead of the cream and used butter lite syrup. The taste was still amazing and I will prepare it that way from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAISYTAZZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/952468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-06T03:38:19.483Z",
                "reviewBody": "This was an excellent recipe. A quick recipe that had complex flavors that make it seem like a difficult meal. The actual amount of oats needed was closer to a 1/2 cup per chop the amount of cream was closer to one cup for the breading and one cup at the end for the sauce. The amount of maple syrup could be reduced to a 1/2 cup to avoid making the dish overly sweet. Also depending on the size of your pan the amount of oil could be reduced to 2 cups for browning chops. I would say this was an intermediate level recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BUSKAJS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/772429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-13T05:56:30.513Z",
                "reviewBody": "Wonderful! I was looking for recipes to get rid of a gallon tin of Canadian Maple syrup and was a bit iffy about preparing this but the reviews sold me. It turned out so great!! My extremely picky mate scarfed down his chop and helped himself to another. The dish smelled divine cooking it looked so great plated up too. (I served the chops on a bed of whole wheat angel hair with maple green beans.) I agree with the others I used a lot more oats then called for and I did not need near the amount of cream for the breading (I used 2 cups and still threw out a good 1/2 cup or more). I will be adding this recipe to my favourites!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIDNIGHTMUSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1313031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-18T19:42:53.377Z",
                "reviewBody": "This dish is fabulous. My whole family raved about it. Big hit with the kids because of the sweet taste. Used extra thin pork chops and doubled the portions except the maple syrup. Some reviewers did not like it too sweet and if I had doubled the syrup it would have overpowered the dish. Made it with panko (Japanese bread crumbs) which seemed to stay on pretty well. I also cut way back on the oil. I also used fat free half and half as another reviewer suggested. My husband is asking me to make this dish for the holidays! Thanks so much for this scrumptious recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cooking in Brooklyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1197590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-04T14:07:44Z",
                "reviewBody": "We tweaked this recipe some...used much less oil for frying added some grated Parmesean cheese to the oats for dredging replaced the maple syrup with a tablespoon or so of Dijon mustard and added more mushrooms...sort of defeated the \"maple\" aspect but since there was basil and garlic we made it a little more Italian",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Honey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1970532/"
                }
            }
        ]
    }
]