[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/68817/green-curry-thai-for-kings/",
        "name": "Green Curry Thai for Kings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2230674.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2018-06-08T13:22:59.000Z",
        "description": "This is my own recipe for green Thai curry. It's full of flavor, and it will warm you from the inside out. Special, elegant, and absolutely delicious. Watch out! This can be spicy. You'll be patting yourself on the back after this one. So will everyone else. I'd serve this to a king. Serve with white rice.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons canola oil",
            "3 shallots, finely chopped",
            "3 cloves garlic, sliced",
            "1 tablespoon finely chopped fresh ginger",
            "1 ½ tablespoons green curry paste",
            "1 pound skinless, boneless chicken breast halves - cut into strips",
            "salt and pepper to taste",
            "5 stalks lemon grass",
            "1 (15 ounce) can baby corn, drained",
            "1 (4 ounce) can water chestnuts, drained",
            "1 (10 ounce) can coconut milk",
            "1 bunch fresh Thai basil leaves, torn"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium-high heat. Cook and stir the shallots, garlic, and ginger in the hot oil 3 to 4 minutes, until shallots are tender. Mix in the green curry paste. Cook and stir 1 minute. Season the chicken with salt and pepper, and place the chicken and lemon grass in the skillet. Cook 5 minutes, until chicken begins to brown. Mix in the baby corn and water chestnuts. Cook and stir until the chicken is no longer pink and juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the coconut milk into the skillet, and bring to a boil. Reduce heat, and simmer, stirring occasionally, until the coconut milk has thickened. Top with basil leaves to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "PainterCook"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.253731343283582,
            "ratingCount": 67,
            "itemReviewed": "Green Curry Thai for Kings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "395.1 calories",
            "carbohydrateContent": "21.7 g",
            "cholesterolContent": "58.6 mg",
            "fatContent": "27 g",
            "fiberContent": "9.1 g",
            "proteinContent": "27.7 g",
            "saturatedFatContent": "14 g",
            "servingSize": null,
            "sodiumContent": "210.1 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-06T00:41:51.283Z",
                "reviewBody": "Great recipe! Although I did make a couple of adjustments: I added a bit extra green curry paste (only 'cause I like it real spicy) and anyways, I think it has alot to do with what kind/brand of paste you buy, some are just spicier than others. I also added julienned red and green bell peppers(1/2 a pepper each), omitted the corn, added a little extra ginger, added fresh squeezed lime juice of 1/4 of one lime, and 1 1/2 tablespoon of white sugar, and I used a small handful of fresh cilantro leaves instead of the basil. It was remarkably close to the taste of the green thai curry dish at my fave thai restaurant! DELICIOUS!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bohemianMAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2027574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-05T19:22:35.827Z",
                "reviewBody": "My favorite food is green curry and this dish was DELICIOUS! I recommend using less green curry paste to start off with like the other users said. Thanks to them I used only 1/2 tbs. of the paste and it still was pretty spicy! This recipe was about 18 dollars total if you do not have any of the ingredients. I also suggest getting jasmine rice from an asian grocery store and cooking it over the stove for about 15 minutes. The water level should be about 1 inch above the rice and cook it covered. Hope this helps! Definitely try it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JennaStL27",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1510939/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-15T17:39:49.54Z",
                "reviewBody": "Great taste, Really really lovely taste. The dish lacked colour. I think I would add a bit of red pepper and/or carrot strips to it next time. And adding a bit of lime juice and a couple tsp of sugar reduces the hotness but retains the flavour. A little trick I learned in Thailand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DianaRB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1661881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-15T17:08:30.877Z",
                "reviewBody": "This was pretty good, and pretty easy to make.  I made it with pork instead of chicken, and it turned out great, though I'd recommend cooking the pork in a separate wok first, with the garlic & oil.  I also added potatoes to this, which I think worked out great, just make sure you boil the potatoes first to even out the cooking time.  I'm not a fan of eating bits of ginger, so I put in 5 very large slices, and fished them out later.  I also used fish sauce instead of salt, much more authentic.  And I'm confused by previous reviewsthat said they had to cut down on the spiciness; this was actually very mild curry, by any standard (wusses! LOL... either that or a huge variation in different brands of prepared green curry pastes).  I had to add in some fresh chopped hot peppers & ground pepper to really get it going.  I'm not a frequent cook, so it was a welcome relief to have such a simple recipe turn out so good; made lots and shared with others in my building, who loved it too; and then froze the rest.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1678991/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-16T02:47:54.397Z",
                "reviewBody": "I love this recipe! It's sooooo good!! Don't feel threatened by the unusual ingredients. You can improvise in a lot of ways if you want. I mix it up regularly. You can even use a different curry paste too but I think the green is the best. My favorite Thai dish ever! Thanks so much Paintercook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PainterCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/931831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-09T18:19:37.38Z",
                "reviewBody": "This was a great recipes to combine with the one I already use. The additions that I made to what is posted is some of the straw mushrooms that you can find in the asian section. They are canned in salt water. I also added a cup of chicken broth we like the extra juice and it adds a little more flavor. A Tablespoon of brown sugar some sliced bell peppers and fresh celantro. We also use Japanese short grain rice or sushi rice. Just a better texture for us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2280093/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T23:52:12.193Z",
                "reviewBody": "This recipe is decent. THe lemon grass is a nice touch. This recipe is missing three essential ingredients.... FISH SAUCE chicken stock and brown sugar. I always add 3 tbspoons fish sauce 1/4 cup chicken stock and 2 tbspoons dark brown sugar. I find that with these additions this recipe really does taste like the green curry I find in local thai restaurants.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "nessturn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2385888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-11T00:56:48.997Z",
                "reviewBody": "my husband likes HOT.  i toned down to 1 tbsp of green curry (shrimp free)with a small extra squeeze, and it was very hot, to me.  he was left with a gentle tingle and probably would have enjoyed the full extra half TBSP, so those with high heat tolerance take note.  i added a tin of bamboo shoots, and used the light version of cocomilk.  dieters alert:  lite coco milk saves about 70 cals per portion and more than 8 grams of fat.  this was nice with basmati rice.   good recipe, my first ever curry.  two cleaned plates.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OSHUNS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/553759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-04T17:14:41.217Z",
                "reviewBody": "I followed this recipe exactly but I wasn't too excited by the results. It was tasty enough and easy to make but it didn't come close to the richness and complexity of green curries in Thai restaurants. Granted I've been spoiled because I've always lived near excellent Thai restaurants but I've never found a green curry recipe that comes close to approaching restaurant quality -- this one included.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1572426/"
                }
            }
        ]
    }
]