[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69410/seared-tuna-with-wasabi-butter-sauce/",
        "name": "Seared Tuna with Wasabi-Butter Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F375917.jpg",
            "width": 2604,
            "height": 2640
        },
        "datePublished": "2018-06-08T13:23:04.000Z",
        "description": "I've had the seared tuna in nice restaurants, but this is better than all of them. One tablespoon of wasabi sounds like a lot of heat, but somehow this cooking method mellows it to almost nothing, just leaves the flavor. Really really great.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 Servings",
        "recipeIngredient": [
            "2 tablespoons white wine vinegar",
            "10 fluid ounces white wine",
            "¼ cup minced shallots",
            "1 tablespoon wasabi paste, or to taste",
            "1 tablespoon soy sauce",
            "1 cup unsalted butter, cubed",
            "salt and black pepper to taste",
            "1 tablespoon olive oil, or as needed",
            "1 cup chopped cilantro leaves",
            "6 (6 ounce) fresh tuna steaks, 1 inch thick"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the white wine vinegar, white wine and shallots in a small saucepan over medium heat. Simmer until the liquid is reduced to about 2 tablespoons. Strain out shallot and discard, return liquid to the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the wasabi and soy sauce into the reduction in the pan. Over low heat, gradually whisk in butter one cube at a time allowing the mixture to emulsify. Be careful not to let the mixture boil. When all of the butter has been incorporated, stir in cilantro, and remove from heat. Pour into a small bowl, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat. Brush tuna steaks with olive oil, and season with salt and pepper. Place in the hot skillet, and sear for 3 to 5 minutes on each side. Be careful not to overcook, this fish should be served still a little pink in the center.  Serve with sauce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "DARLA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.66542750929368,
            "ratingCount": 269,
            "itemReviewed": "Seared Tuna with Wasabi-Butter Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "533.4 calories",
            "carbohydrateContent": "4.5 g",
            "cholesterolContent": "158 mg",
            "fatContent": "34.6 g",
            "fiberContent": "0.3 g",
            "proteinContent": "40.7 g",
            "saturatedFatContent": "20.1 g",
            "servingSize": null,
            "sodiumContent": "277.5 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-04-28T14:53:27.827Z",
                "reviewBody": "This simple-to-make recipe is guaranteed to bring you compliments- I would give it many more stars if I could.  This creamy sauce is worth every bit of exercise you might feel compelled to do-- count your calories elsewhere, and just enjoy this dish!  Your tastebuds will thank you!    My recommendations: 1) You must use a full-bodied, dry white wine, as the sauce's end result relies on that.  I recommend Mersault.   2) You should dedicate 20 minutes to making the sauce. The white wine, vinegar, shallot mixture should take at least that long to reduce, as it should gently boil over medium-high heat.  Don't let it boil rapidly, but don't let it just simmer either.  3) Use about half the butter called for, or use all of the butter and let the sauce reduce.  Experience has taught me that this sauce is always better when it is thicker and richer.  If the recommended amount of butter is used, the result is a thin, mild sauce.  By reducing the butter, you'll create a denser, creamier sauce that seems more appropriate for a thick tuna steak.  4)  If you take my recommendation for cutting back on the butter, realize that this will reduce the amount of sauce you make to about 3-4 adult portions.  5)  Lastly, I recommend serving this with orzo, freshly sliced tomatoes, and deep fried spinach (found on allrecipes.com).  The colors, textures, and flavors blend very well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlliePeacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alliepeacock/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-07T19:28:49.53Z",
                "reviewBody": "I liked this recipe so much that I created an account on the site just to write this:). I cut an 8oz tuna steak lengthwise for a 4oz serving for my wife and I. After coating each in olive oil and salt/pepper I seared it on the stove watching the middle of each half to where I had just the perfect sear:raw ratio. For presentation I cut each fillet into several thin (about 1/8 inch thick) medallions on the plate and fanned them out. For the sauce I haven't been happy with the wine so I substituted apple juice in for it instead. I still put the white wine vinegar in it however. Apple juice instead of wine might not sound that great but when you reduce it down far enough with the vinegar and onions you get a delious syrupy base. I only used 1 stick of butter and I think it was perfect that way. I stuck with the recipe on the 1tbs of soy and wasabi and was very happy with the result. Even though the \"heat\" pretty much cooks out the beauty in this recipe is the taste combination. Be very careful while the butter emulsifies. You want a good thick sauce but it REALLY wants to boil on you. Watch the heat. This is where cooking with gas helps because you have that instant temperature control. Once the sauce was done I drizzled it over the tuna medallions and served it with rice. Fantastic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dano Stu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2649708/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-21T19:07:59.64Z",
                "reviewBody": "What you want here is the sauce, as it's more delectably remarkable and delicious beyond any I have EVER encountered!!  Use yellowfin or ahi/sushi grade tuna, thickly sliced.  If you don't marinate it, at least cover it with olive oil then coat generously with black/white sesame seeds which have been combined with chopped fresh herbs such as Italian parsley, cilantro, basil, etc., whatever you may have on hand.  Place the fish on wax paper and refrigerate for 30 minutes.  Heat olive oil in a heavy skillet, and quickly sear the tuna on both sides (1.5 minutes), do not let the tuna cook or you destroy the true flavor (it's like eating the finest rare beef steak, you can't tell the difference).  Served with the butter and wild rice/lemon pilaf or greens, it's total heaven!  And all I do with the refrigerated leftover sauce and to cook another tuna meal is let the butter get to room temperature, scoop an amount on a plate, and set the hot fish upon it.  Unless you reheat the butter VERY carefully and slowly, it will separate such as in a clarification process, changing its flavor and quality.  This is absolutely my favorite meal!!!!  TEN stars on the sauce, and wasabi away to your tasting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DakotahGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2433573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-10T18:20:00.17Z",
                "reviewBody": "There is a restaurant near us that serves seared Ahi tuna with wasabi butter and a pineapple chutney that I absolutely love. This recipe means I can make it myself too! The sweetness of the pineapple chutney is a perfect addition to the tuna and wasabi flavors, give it a try! Serve with jasmine rice and steamed vegetables for a plate full of heaven. This is a recipe for a good fresh pineapple chutney that I found: \r\n2 tablespoons vegetable oil\r\n1/2 red bell pepper finely diced \r\n1/2 sweet onion finely diced\r\n2 tablespoons minced fresh ginger \r\n2 cups fresh pineapple medium diced\r\n1/2 cup white vinegar \r\n1/3 cup brown sugar \r\n1 teaspoon salt \r\nIn a 12\" sauté pan, heat oil over medium-high heat until hot. Add red pepper and onion and sauté 5 to 7 minutes stirring constantly. Add ginger. Sauté one minute. Add pineapple, white vinegar, brown sugar and salt. Reduce heat to medium low and simmer 10-15 minutes (or until liquid is reduced by half)-remove and cool to room temperature.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-05T16:43:55.483Z",
                "reviewBody": "We loved this!!!  The sauce is definitely the time-consuming part, it probably took me 45 minutes to make.  I read all the reviews and took the consistent suggestions of doubling the wasabi and cutting the butter in half.  So glad I did because the sauce had great flavor!  I could see how 1 cup of butter would be too much.  I also subbed a yellow onion in place of the shallot and used a Chardonnay for the wine.  I bought fresh, sushi grade tuna, wow, I will never buy the frozen yellowfin junk again.  This was so rich and meaty, and not fishy at all, its like you are eating a filet mignon steak.  Let the tuna steaks come to room temp. before searing, because if you do it straight out of the fridge you will end up with a cold center of the fish.  I seared mine for 90 seconds a side (as per some reviews), and we all felt (me, my husband, and my brother-in-law) uncomfortable because it was still very rare.  I know its sushi grade and can be eaten raw but we threw ours back on for probably an additional 90 seconds per side and that was much better.  More like a medium - medium rare steak.  Which this  recipe calls for searing a minimum of 3 min. per side anyway, will definitely do that next time.  I also coated the tuna with sesame oil instead of olive oil, felt that it would be more consistent with the other flavors.  Served with asparagus sauteed in garlic and olive oil and roasted fingerling potatoes to complete the gourmet meal.  We enjoyed very much a",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MomSavedbyGrace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1366670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-27T08:15:22.373Z",
                "reviewBody": "This is one of the best recipes for seared ahi tuna. If you're watching fat and calories you can reduce the amount of sauce you put on the tuna or reduce the amount of butter as I did and it is still wonderful (I reduced both the amt of butter in the recipe and the amt of sauce i put on each serving so figure 1C = 16T. I used 3/4C (12T) or so and used about 1/8 of that sauce on each serving (equates to less than 2T butter per serving). Recipe is also very simple and quick. Why spend more time on a more complex recipe that doesn't taste as good? Seared tuna can be somewhat sweet in flavor on its own and many recipes over enhance this. If I could give this more stars I would.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOODEXPERT007",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1407726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-22T19:06:14.757Z",
                "reviewBody": "Highly reccomended recipe. I used low sodium soy sauce margarine 2 tablespoons of wasabi and an extra dash of soy sauce onion instead of shallot. Also I used plain white vinegar. It turned out sooooo delicous. I only needed to sear my tuna for about 1 minute each side. This dish is served best when the tuna is RARE on the inside and seared on the outside.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ashley Schulte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1520164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-18T13:14:11.33Z",
                "reviewBody": "Served this as an appy for our Father's Day celebration. For our tastes the sauce needed a bit more wasabi but it was still very good. If you've never made tuna before please don't go by the photo of this recipe. If you're tuna looks like that it's way overcooked and will be extremely dry. It'll make good tuna salad but cooked properly it should be nice and pink in the center. We cooked these on the grill for about one minute on each side and even the peeps who had never experienced real tuna before became instant fans. Thanks so much Darla!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T14:58:43.183Z",
                "reviewBody": "Excellent! I had dry powdered Wasabi and used same measure and it was fine. This is dinner party caliber good eats.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "R Vennerbeck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2052457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-15T18:45:16.927Z",
                "reviewBody": "It's a nice sauce for the tuna but I found it disproportionately high in fat/calories for the flavor. Another general tip: let yellowfin warm up to room temperature before you sear. You want your tuna rare not cold.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSICA RL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/796217/"
                }
            }
        ]
    }
]