[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17528/desserts/fruit-desserts/cherry-desserts/",
                    "name": "Cherry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69984/venice-high-school-cherry-butter-cookies/",
        "name": "Venice High School Cherry Butter Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F756110.jpg",
            "width": 2195,
            "height": 2194
        },
        "datePublished": "2018-06-08T13:23:11.000Z",
        "description": "I made these cookies waaay back when in Home Economics class at Venice High School in L.A., California. With a shortbread texture blended with walnuts and cherries, these are certainly unforgettable.  I usually bake them around Christmas, but they are super any time of year.  They are particularly great with a hot cup of coffee, I hope you enjoy these as much as my family does!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "3 1/2 dozen",
        "recipeIngredient": [
            "2 cups butter, softened",
            "2 teaspoons vanilla extract",
            "2 cups confectioners' sugar",
            "¼ teaspoon salt",
            "4 ½ cups sifted all-purpose flour",
            "½ cup chopped walnuts",
            "½ cup chopped maraschino cherries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the butter, vanilla and confectioners' sugar until smooth. Mix in salt, then stir in flour by hand until dough is stiff. Add the walnuts and cherries, and mix into the dough, kneading like bread on a clean floured surface.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough into ping pong sized balls, and place onto ungreased cookie sheets. Press down balls with a fork to make a criss cross pattern on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 17 minutes in the preheated oven. Let stand on the baking sheet for a few minutes before removing to wire racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Cherry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "bakinfool"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.429906542056075,
            "ratingCount": 107,
            "itemReviewed": "Venice High School Cherry Butter Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "160.3 calories",
            "carbohydrateContent": "17 g",
            "cholesterolContent": "23.2 mg",
            "fatContent": "9.7 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "5.6 g",
            "servingSize": null,
            "sodiumContent": "76.5 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-15T13:18:10.61Z",
                "reviewBody": "Great cookies! People, if you change the recipe, it's not the recipe anymore. Rate it the way it's written and if you want to change it--write your own!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "higgx5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2266941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-16T01:07:28.303Z",
                "reviewBody": "I am the original poster of this recipe (been trying to log-on to that account, but haven't been able to get the password right!)  Baking times are truly variable, depending on your oven.  You must watch cookies closely, I've found that once there is a light brown tinge, the time is right.  The cookie's thickness will also affect baking times and textures.  My avg is around 12-15 minutes, 17 minutes is too long, but of course all ovens are different.   Lastly, sifted flour is vital.  Regular flour makes it heavy and crumbly.  That being said, this is one of my all time favorites.  Rich, buttery and oh so good.  I always end up adding much more cherries and walnuts than the original recipe calls for:  usually up to 1c each, and I chop of the cherries very fine so that they are more evenly distributed.  Every Christmas I get asked to make these.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bakermd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2551923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-13T14:19:06.14Z",
                "reviewBody": "Very good cookie. Instead of using my kitchen aid I decided to use my hand mixer and it worked fine. I did not sift the flour. After everything was mixed I did have to mush it together by hand and I lightly kneaded in the cherries and nuts. The dough was wonderful to work with, was easy to form and lightly flatten with a fork. I baked them on a parchment-lined sheet for 13-14 minutes. Removed the sheet from oven and let them sit for about 2 minutes before transferring them to a cooling rack. I don't like airbake sheets but if you decide to use one you may need to bake longer. I'll try to use half vanilla and half almond extract next time to see if the almond will compliment the cherries. I made a little cherry drizzle out of maraschino juice, milk, almond extract, melted butter and powdered sugar. Also made a cocoa drizzle with vanilla, milk, cocoa powder and powder sugar. Drizzled all the cookies with both chocolate and cherry drizzle. Cookie tasted good, looks great, and freezes well. Will make great little Christmas or valentine cookies. And, they taste great with coffee! This cookie is a hidden gem here on allrecipes! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Texastwinkie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/360413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-24T23:04:02.077Z",
                "reviewBody": "I think the powdered sugar gives this a nice delicate texture, overall it has a very buttery kind of taste.  Delicious if you're into the shortbread type of cookies (which I am.)  I added Christmas colored non-pareils to give it a festive look.  I can easily see adding red white and blue ones for July 4th, pastel colored ones for Easter or birthdays, etc...  I also added the powdered sugar to the finished baked product.  A really great, tasty, butter cookie!  And I agree, I could really see these would go well with coffee or tea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carrotcakefreak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/272617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T19:31:26.813Z",
                "reviewBody": "I tried these for the first time this past Christmas and we all LOVED them. My son, home sick from school today, asked me to make them but we don't have any maraschino cherries. As it's getting close to Easter, I used chopped up jelly beans instead! I also threw in a mini box of lemonade-flavored Nerds candy for good measure. I know it sounds like a weird combo but they are FABLUOUS! The jelly beans are chewy and the Nerds are crunchy...yummmm!! Just watch the time-mine were perfect in 12 minutes, any more and they would have been overdone. They should be just a pale light brown on the bottom. I wonder what else I can throw in these cookies??? :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "luvmykids",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2926455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-24T21:07:13.463Z",
                "reviewBody": "A hit at Thanksgiving!  It is VERY important to use confectioner's sugar and SIFTED flour.  I noticed the first time I made these I didn't use the sifted flour and they turned out the way \"Shanny\" described, undercooked in the middles and browned at the bottom.  It is also VERY important that when you smash it down with a fork, you do it enough to make it somewhat flat, something like the pictures that were submitted.  Again, this will avoid the undercooked middle and overcooked outside.  Absolutely excellent!  Wonderful texture and taste!  A new holiday tradition, can't wait to make again in a few weeks for Christmas!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shelby101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2635405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-08T23:07:46.17Z",
                "reviewBody": "Very good! First batch I undercooked I took out when they started to brown but the insides weren't done. Next batch I left in recommended time and came out great! Thanks for recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TCSTEFFEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1434246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-01T17:40:17.497Z",
                "reviewBody": "I made these without the walnuts and with a few extra cherries and they turned out great. I also tried using an electric mixer to add the flour and it worked but it was harder to form the dough into balls that stuck together.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANLICHLY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1377074/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-16T22:10:23.287Z",
                "reviewBody": "A hidden treasure on allrecipes!! The basic recipe is divine. For my own liking I added two jars of chopped maraschino cherries and pink coloring gel rolled them into balls and into rainbow sprinkles then flattened them slightly by hand. Left the nuts out. They are the perfect cookie for all occasions. Love love love this recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pinksnowkittys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2073531/"
                }
            }
        ]
    }
]