[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/71555/italian-pork-tenderloin/",
        "name": "Italian Pork Tenderloin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4547362.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2018-06-08T13:23:26.000Z",
        "description": "Fresh sage, sun-dried tomatoes, prosciutto, and cream give this pork tenderloin dish its rich flavor. It's absolutely wonderful and simple! Chopped ham can be used if prosciutto is unavailable.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "¼ cup chopped prosciutto",
            "2 tablespoons chopped fresh sage",
            "2 tablespoons chopped fresh parsley",
            "2 tablespoons chopped oil-packed sun-dried tomatoes",
            "¼ cup chopped onion",
            "1 ½ pounds pork tenderloin, cut into 1/2 inch strips",
            "½ cup chicken broth",
            "½ cup heavy cream",
            "¼ teaspoon salt",
            "½ teaspoon ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a skillet over medium-high heat. Saute the prosciutto, sage, parsley, sun-dried tomatoes, and onion 5 minutes, until onion is tender. Mix the pork strips into the skillet, and brown about 10 minutes, turning once.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the broth and heavy cream into the skillet, and season with salt and pepper. Bring to a boil. Reduce heat to low, and simmer 20 minutes, stirring occasionally, until pork reaches a minimum temperature of 145 degrees F (63 degrees C) and sauce is thickened.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "ANNACOYNE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.678743961352657,
            "ratingCount": 414,
            "itemReviewed": "Italian Pork Tenderloin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "356 calories",
            "carbohydrateContent": "3.1 g",
            "cholesterolContent": "121.8 mg",
            "fatContent": "25 g",
            "fiberContent": "0.5 g",
            "proteinContent": "28.9 g",
            "saturatedFatContent": "10.3 g",
            "servingSize": null,
            "sodiumContent": "390.3 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-14T14:35:05.06Z",
                "reviewBody": "This recipe is just yummy...I did make two changes, though.  First of all I added garlic to the mix, because I love it and I only cooked the pork for the inital 10 minutes.  I then removed it while I cooked down the cream and broth mixture.  Once the sauce had cooked down, I put the pork back in to heat it up.  This is a terrific recipe and I really appreciate having found it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIBBYHAB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/653590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-25T23:21:22.39Z",
                "reviewBody": "This was spectacular - We made the 4 servings for the two of us and didn't stop until it was all gone.  Based on the reviews and what I had on hand, I made several changes. First, I used 1/2 tsp each dried sage and parsley in place of fresh.  I added 1 clove minced garlic, 1/2 tsp oregano and 1/2 tsp basil, all of which I associate with good Italian recipes. I also added an extra tablespoon sun-dried tomatoes.  I substituted fat-free half and half for heavy cream and used 1 cup along with 1 cup chicken broth.  I also added 2 tablespoons flour mixed with water to thicken the sauce.  The entire mixture was spooned over penne pasta at the table.  This can be made from uncooked pork tenderloin as the recipe calls for or from left-over tenderloin grilled using a marinade.  If using the left-over, add pork strips at the same time as called for, but remove prior to adding the broth and cream.  Keep warm, then add back to the sauce after thickened.  This is very easy to make and is a real gourmet treat.  Thank you so much Anna and reviewers!\n\nUpdate: Fresh seasonings make ALL the difference.  I use FRESH sage, parsley, basil and oregano.  We make it so much we started an herb garden almost entirely for this recipe.  They are in 12\" pots and come in the house during the winter.  Fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RISINGMARKET04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1186270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-16T00:35:46.717Z",
                "reviewBody": "Even better when 1-2 T. sugar are added and double the broth & cream then serve over pasta...yummmm",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/333142/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-06T22:56:24.013Z",
                "reviewBody": "I am not a huge fan of pork, but my husband loves it so I thought I'd give this a try. I have made this a few times now, and it has quickly become one of our favorite meals. I do make a few changes. I sautee mushrooms and minced garlic along with the onions, herbs, and prosciutto. The first time I made this the tomatoes got a little too done for me, so now I throw them in with the pork instead of with the above ingredients. To make the recipe a little healthier, I use fat free half and half in place of the cream, and it's still great. When I have spinach on hand, I throw that in as well. Typically I omit the salt since there is already enough salt from the pork/prosciutto/broth. We eat this over brown rice. This is a simple dish to make that looks much more difficult and is great for company.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958806/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-29T01:17:28.31Z",
                "reviewBody": "Absolutely fantastic! Simple to prepare and it looked beautiful. I served with mashed potatoes instead of pasta. Also, poured a Covey Run Cabernet Sauvignon ($8 a bottle). Terrific match of flavors. The only tweaking I did was to use dried sage because I couldn't find any fresh and added a bit of fresh minced garlic. You cannot have Italian cooking without garlic. I may have added a bit more heavy cream and chicken broth because I didn't measure. This was wonderful and I cannot wait to make it again. This is in my top five of all time great Allrecipes contributions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDVMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-12T13:32:27.67Z",
                "reviewBody": "This was a very tasty recipe for pork tenderloin.  I did make changes as suggested by other reviewers.  I pan-seared the pork first which I cut into 1 inch thick medallions rather than strips and then removed them.  I didn't have fresh herbs so used 1/2 tsp. each of oregano, sage and basil and added garlic & mushrooms to the rest of the suggested ingredients.  I deglazed the pan with about a 1/4 c. of wine and let some of it boil off.  For extra sauce, I used 1 cup cream and 1 cup chicken broth mixed with 2 tbsp. flour to thicken it.  Once thickened, I added the pork to re-heat and cook through.  Served over mashed potatoes with steamed broccoli and my family just loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CzeckCzick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1914726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T23:22:23.833Z",
                "reviewBody": "Lots of prep work for a dish that was  okay, but not stand out memorable. Even though I'm Italian and grew up with the stuff, I never did like prosciutto so I used bacon instead.  Used shallots because that's what I had, and added some garlic.  I sliced the tenderloin into medallions, dredged them with flour, then sauteed them. I removed them to a platter and set them aside while I sauteed the bacon, shallots and garlic. I deglazed the pan with white wine, then added the sun dried tomatoes, sage, parsley, broth and cream. I returned the pork tenderloin to the pan and cooked over medium heat until the meat was cooked through and the sauce had thickened. It certainly was a beautiful dish, but just didn't have the same wow factor in taste. I've made far tastier pork tenderloin dishes with fewer ingredients and half the effort. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-08T12:51:35.297Z",
                "reviewBody": "Very good. A few notes: I added garlic, and just before serving (over penne pasta) I added about 1/4 cup grated parm. The sauce did not thicken even after 20 minutes...but it was still very tasty. Next time I probubly wont use the sage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURA82",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1008820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-14T14:27:35.483Z",
                "reviewBody": "OMG!!! This was incredible and is my new favorite from All Recipes…what a great low carb dish!  I made this last night for my very picky in-laws and my neighbor who doesn't like pork tenderloin.  I was a little nervous about the sage and considered using basil instead; luckily the grocery store was out of basil.  Both my husband and father-in-law had seconds and my neighbor said not only does he now like pork tenderloin but also it was the best meal I have ever made (and we cook together a lot.)  Even the kids ate it up.\n\nPer other recommendations I did double the sauce (good thing because we ran out!) and I also added a few cloves of garlic before I sautéed the first 5 ingredients.  I would also recommend thickening the sauce if you can stand the additional carbs.  I served it with gigli pasta (flower shaped) and sautéed spinach with garlic.  We also passed Parmesan for sprinkling.\n\nEveryone asked for the recipe and I can’t wait to make this again, thanks Annacoyne!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim in Denver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kimindenver/"
                }
            }
        ]
    }
]