[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/72878/cheesy-ranch-potato-bake/",
        "name": "Cheesy Ranch Potato Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F358961.jpg",
            "width": 2150,
            "height": 1896
        },
        "datePublished": "2018-06-08T13:23:42.000Z",
        "description": "This is a delicious side dish with cheese, potatoes, and Ranch! What's not to love?! I am always begged to bring this wherever I go. It is a great complement to a barbeque or any potluck meal. I have experimented with using more chili powder and using seasoning salt instead of regular salt.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "4 pounds russet potatoes, cut into 1/4 inch cubes",
            "2 teaspoons chili powder",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "6 tablespoons butter, cubed",
            "1 (8 ounce) package shredded colby-Monterey Jack cheese blend",
            "1 (8 ounce) bottle Ranch dressing"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the potatoes in the baking dish. Season with chili powder, salt, and pepper. Evenly distribute the butter over the potatoes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover dish with aluminum foil, and bake 1 hour in the preheated oven, until potatoes are tender. Remove from oven, and mix in the cheese and Ranch dressing. Continue cooking 10 minutes, or until cheese is melted and bubbly.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JENNYBRIANNE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.466321243523316,
            "ratingCount": 965,
            "itemReviewed": "Cheesy Ranch Potato Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "331.3 calories",
            "carbohydrateContent": "27.5 g",
            "cholesterolContent": "37.6 mg",
            "fatContent": "21.8 g",
            "fiberContent": "2.9 g",
            "proteinContent": "7.5 g",
            "saturatedFatContent": "8.7 g",
            "servingSize": null,
            "sodiumContent": "571.2 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-22T18:21:30.967Z",
                "reviewBody": "AWESOME! I made this for the first time for a pot luck at work. I made a few changes based on previous suggestions that were submitted. I used seasoned salt instead of regular salt. I used only 2TBS of lite melted butter (6 is way too much). Melted butter works better because it's easier to mix the seasonings in with the potatoes. I baked the potatoes for an hour the night before. The next day at work, I put the potatos in a crock pot, added the cheese, Ranch dressing, garlic and bacon pieces and cooked on low for 3 hours to melt the chesse. By lunch time it was all ready and it turned out perfect! I had A LOT of people ask for the recipe. It was the first dish to be completely eaten! And the best part was it was so easy to make!! The hardest part was cutting all the potatoes. I will denfinately be making this many more times!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ang329",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1529605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-26T22:20:39.5Z",
                "reviewBody": "I'm begging anyone that is about to make this recipe to please please please exclude the 6 tbsp of butter!!!  I just spooned over 2/3 cup of grease out of the pan.  This could be a wonderful comfort dish with a great melding of flavours but the butter is totally unnecessary! I gave it 4 stars cuz I will make it again, just no butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KITCHENWHIZ1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/952825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-14T02:05:55.607Z",
                "reviewBody": "Delicious and easy--you will not be disappointed!  After reading several reviews with tweaking suggestions, here is what I did to produce the delectable result:  I cubed red potatoes, leaving the skin on. I cut the butter amount by 1/3, and sautéed 1/2 cup chopped onion in it until softened.  I then added the seasonings, and poured the mixture over the potatoes in the casserole dish, tossing to coat.  After baking, I added 1/4 real bacon bits, along with the cheese and dressing, to the potatoes.  The dish accompanied charcoal grilled hamburgers--a VERY tasty meal!  I will definitely make this potato dish again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Corinne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1849671/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-20T00:03:26.343Z",
                "reviewBody": "WOW! This are great! My husband goes crazy for them every time I make them. I cut the recipe down to 4 servings & used: 1 1/4 lb potatoes, 1/2 t chili powder, 1/4 t salt, 1/8 t pepper. 1/3 C cheese, 1/3 C Ranch & no butter I just sprayed the pan with cooking spray. Very delicious. I make this with BBQ pork. Thanks for the wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Snowflake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1279509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-21T03:45:51.843Z",
                "reviewBody": "Looking for another potato bake I decided to give this one a go. For extra taste I added sauteed leeks and bacon at the point of adding the cheese and ranch dressing. Although this dish was very tasty I found that the butter made the dish extremely greasy. I felt that spraying the baking dish lightly with oil would have been adequate and that the butter was really quite unnecessary. I made the dish a second time completely omitting the butter it was definitely less greasy hence a much healthier potato bake. The chilli powder gives this dish a bit of oomph and was a great addition. I will definitely make my version of this dish again. Thank you for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1552078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-04T04:29:05.377Z",
                "reviewBody": "I've made this dish numerous times now and like to  tweak it a bit here and there. I usually cut the chili powder and butter in  half, use mild cheddar instead of Monterey Jack  and add some season-all, celery salt, garlic and paprika.  Also good to add: sliced leek, chives or green onions. Lastly, we prefer Ken's Ranch over Hidden Valley.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EXQWIZME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1381960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-11T17:59:55.437Z",
                "reviewBody": "Husband and I loved this dish my picky 10 year old didn't but I'm not sure if he actually tried it or just looked at and decided (which he does quite often). I did change one thing instead of using butter I mixed the potatoes and seasonings in a ziplok bag with olive oil - I wanted to make it a little healthier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2001640/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-26T18:07:57.38Z",
                "reviewBody": "I am rating this at 4 stars as I made it EXACTLY as written. Liked this but sure didn't love the sheer amount of greasiness that comes with using 6 tbsps of butter hence the 4 star rating. Since my initial foray into this recipe I have since reduced the butter to 1.5 tbsps of butter and I cannot detect any loss of flavor. HELPFUL HINTS: Use Simply Potatoes with onions for ease in preparation and homemade Ranch dressing and Pepperjack cheese to increase flavor. Thank you Jennybrianne for a different way to prepare a side dish staple!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-02T19:12:30.183Z",
                "reviewBody": "The family loved these! I made just a couple modifications. I used 2 bags of frozen cubed hash browns and just let the bags thaw on the counter for an hour or so before mixing with the seasonings. Added 1/4 c green onions, chopped and 3 T of real bacon bits. Also, used 3T butter and a few drizzles of olive oil.  Then because the of using the hash browns just let it bake 30-35 minutes before adding the ranch and cheese. Everyone went back for seconds!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenni AB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3759604/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-29T20:45:05.077Z",
                "reviewBody": "I cut this recipe in half. I used organic red potatoes and instead of bottled ranch dressing, I used my own homemade out of scratch dry ranch dressing mix mixed with a third cup each of lowfat mayonnaise, reduced fat sour cream and fat free plain yogurt. We thought this was good but we all agreed that it would have been better had the potatoes been mashed with the butter and ranch dressing, then spread into a baking dish with the cheese on top. I think it could use a little more spice, too. Maybe some chopped chives?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            }
        ]
    }
]