[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/73981/home-made-farmers-cheese/",
        "name": "Home Made Farmer's Cheese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F267521.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:23:54.000Z",
        "description": "My Polish friend's mother gave me this recipe years ago.  She has been making this cheese forever in her house and also ate it while growing up in Poland.  This is an easy home made farmer's cheese.  It doesn't age well, so be sure you eat it within a week after it's made - well, if you can let it last that long.  If you bake with it, it melts very beautifully.  It makes a perfect soft cheese for snacking.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "1 pound",
        "recipeIngredient": [
            "1 gallon whole milk",
            "1 pinch salt",
            "1 large lemon, juiced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour the milk into a large pot, and stir in a pinch of salt. Bring to a boil over medium heat, stirring occasionally to prevent the milk from scorching on the bottom of the pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the milk begins to boil (small bubbles will first appear at the edges), turn off the heat. Stir lemon juice into the milk, and the milk will curdle. You may need to wait 5 or 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a sieve or colander with a cheesecloth, and pour the milk through the cloth to catch the curds. What is left in the cheesecloth is the Farmer's Cheese. The liquid is the whey. Some people keep the whey and drink it, but I throw it away. Gather the cloth around the cheese, and squeeze out as much of the whey as you can. Wrap in plastic, or place in an airtight container. Store in the refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MLYIN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.264150943396227,
            "ratingCount": 106,
            "itemReviewed": "Home Made Farmer's Cheese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "147.8 calories",
            "carbohydrateContent": "11.8 g",
            "cholesterolContent": "24.4 mg",
            "fatContent": "8 g",
            "fiberContent": "0.3 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "4.6 g",
            "servingSize": null,
            "sodiumContent": "97.8 mg",
            "sugarContent": "11 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-09T03:16:34.873Z",
                "reviewBody": "this recipe makes wonderful, versatile soft cheese!  i think the other reviewers had a problem because of the temperature of the milk when they added the juice.  also, lemons vary in size, so measure the juice (or white vinegar works, too). to a gallon of milk, heated to 190 degrees, 1/4 c vinegar or lemon juice should work. and please, use a thermometer!  don't rely on \"bubbles\" which could form at a much lower temperature depending on your altitude! also, let it sit for a full 10 minutes to let the curds fully form!  i use 4 layers of cheesecloth (it usually comes folded in half in the packages i buy, so i fold that in half again) so no curds slip through.  strain your whey into a container and if it is not yellow, but WHITE, heat the milk and do it all again... the white means there are still milk solids (cheese) contained in the whey that you can extract.  when it is through dripping whey out of the cheesecloth (an hour or two) unwrap it and put it in a container in the fridge.  i usually make ricotta out of it by sticking the curds in the blender, adding a little milk and blending until smooth.  i have made the BEST lasagna with it... VERY creamy mouthfeel and melts delightfully!  next, i'm going to try making tangier cream cheese by mixing it with plain, lightly salted  yogurt cheese (recipe from this site, but leave out the garlic and black pepper) which is much smoother!  PLEASE don't give up on making cheese!  try my tips and see how it turns out!  thanks, mlyin!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sourdough girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/453904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T22:50:47.25Z",
                "reviewBody": "I've made this sort of cheese for 35 years and I can tell you that one must beware of ULTRA Pasteurized milk. I couldn't figure out why all of a sudden I had little curd formation. Thought I had lost my touch or something...but found that the problem wasn't me...it was my buying a real good brand of milk (vs a store brand) that was ULTRA Pasteurized.  Since then I have read it has poor yield if it even works at all.  Not worth the time and effort. Hope this helps those who had issues. It probably wasn't you...just the milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tangrene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1670897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-22T20:03:32.13Z",
                "reviewBody": "I use buttermilk and it works much better. I just put the half gallon container in a large pot, turn it on and wait for the water to boil when the water starts boiling, wait 10 minutes and turn water off. let sit in the water until cooled (about 2 hours) then pour into cheesecloth and drain for 4-12 hours and \"bam\" great farmers cheese!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Doug E. Fresh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2128377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-22T21:33:39.893Z",
                "reviewBody": "(Sept. '08)Since lemons vary so much in acidity and yield of juice, I have had much better and more consistent results using white vinegar.  I started with a quarter cup, as I did not want a vinegary taste, but it was not sufficient to fully curdle the milk, and I had to repeat the process.  A scant half a cup worked perfectly, and no vinegar taste that I could discern.\nAlthough the whey looks kind of gross, it's a great ingredient, especially for stews and soups, to which it adds body and richness. I, however, usually mix it with my dog's food.  He LOVES it\nOK fast forward 2 years...(Oct, 2010) I've probably made this 40 or 50 times - whenever milk is on sale- and it always works.  Sometimes the curd is finer than other times.  Sometimes it takes longer to set up.   but it's always good.  I only use whole milk and I only use white vinegar.  It gives a more consistent result and I think a better, cleaner taste.\nI pour about a cup of milk out of the gallon jug (to make room), set the jug in a pot of water big enough to hold it, and put it on very low heat.  When the water simmers, I turn off the gas, add a half cup of vinegar, give it a quick stir with something long, and just leave it for a couple hours until everything is cool (be careful. At first, the jug is very hot and pliable)  - then just pour it out of the jug into the prepared sieve.   I like that there is nothing much to clean up. I salt to taste afterwards depending on what I'll use it for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "easyguy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2886174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-18T16:15:13.48Z",
                "reviewBody": "That's almost the way my Grand Mother was doing it except she wouldn't use lemon (as it was not really avaiable in polish country side) but just let stay fresh unpasterized milk for about 2 days to allow it to get sour by itself. The rest is the same. I would suggest not to throw away whey - if drunk it is a all-natural detox for your body (ie. hangover) if applied on skin cure for sunburn and well it taste good as well:) As for variations - traditionally we add finelly chopped fresh herbs (parsley spring onion's green) with more salt and some pepper but you can add about anything (my Mother's special was farmer cheese mixed with smoked mackrel and onions - tastes great but no kissing afterward;) ).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lech",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2988835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-14T23:30:08.153Z",
                "reviewBody": "We were skeptical and scared yet hopeful after reading everyone elses reviews on this recipe.  But we tried it.  We stood over the pot for a really really really long time.  We finally saw some bubbles and got excited and added 1/4 cup of lemon juice and waited 10 minutes.  We were crushed because it only yielded about 1/4 cup of cheese.  My friend here cried and swore she would never make cheese again.\r\n\r\nSince it sort of worked and we had all this leftover milk, we decided just to do it again.  We had nothing to lose.  We heated up the milk again (which took much less time since it was already almost boiling) and when it started to bubble we threw in another 1/4 of lemon juice.  (This makes two lemons of juice now.)  This time, we had almost immediate results!  The glee and glory we felt was great.  It actually made a good pound or so of cheese this time.\r\n\r\nWhat next?  Disneyland.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ZEBRACANDY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1440806/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-30T05:27:19.04Z",
                "reviewBody": "I tried this recipe tonight and the results were excellent. I had only 4 cups of milk so I used 1 tablespoon of lemon juice. I heated the milk to 190F removed it from the heat and stirred in the lemon juice then let it sit for 10 minutes then drained it in cheesecloth. Perfect -- I'm going to use this recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendi Dunlap",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3171721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-14T18:29:52.69Z",
                "reviewBody": "This recipe worked wonderfully for me. It made a cream-cheese-like cheese. My only compliant might be that it wasn't salty enough. But I suppose you could put this on salty crackers and it would be fine. Note---I halved the recipe just to try it---1/2 gallon of milk juice of 1/2 a lemon. Also I didn't use fresh milk I used week-old milk. Worked beautifully thanks for the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanaquil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1982546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-27T17:38:47.09Z",
                "reviewBody": "I followed the tips from some of the other reviewers and was able to get a wonderful amount of cheese from this recipe! This is so great and easy to do!: )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3505671/"
                }
            }
        ]
    }
]