[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76346/bacon-y-bok-choy/",
        "name": "Bacon-y Bok Choy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1118138.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2018-06-08T13:24:26.000Z",
        "description": "Super easy side dish for those nights you want something different and fast!  This can also morph into a main course if served over rice.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 slices bacon, chopped",
            "2 pounds baby bok choy",
            "1 teaspoon olive oil",
            "½ small red onion, chopped",
            "1 teaspoon red pepper flakes",
            "1 teaspoon minced garlic",
            "salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fry bacon in a large skillet over medium heat until crispy. Remove bacon and drain the fat, reserving one tablespoon of the grease in the skillet. Add the olive oil, onion, red pepper flakes and garlic. Cook and stir over medium heat until the onions are starting to be tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the bok choy, and place a lid on the pan. Let cook for 3 to 5 minutes. Remove the lid; cook and stir until the bok choy is tender but still crunchy, about 2 minutes. Stir in the bacon, and season with salt. Serve piping hot!\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHUNPR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.420289855072464,
            "ratingCount": 207,
            "itemReviewed": "Bacon-y Bok Choy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "97 calories",
            "carbohydrateContent": "6.6 g",
            "cholesterolContent": "10.2 mg",
            "fatContent": "5.6 g",
            "fiberContent": "2.6 g",
            "proteinContent": "7.1 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "361.8 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-25T03:57:00.22Z",
                "reviewBody": "One of the wonderful things about baby bok choy, aside from its taste, is its size and the beautiful presentation it makes. One perfectly cooked and seasoned baby bok choy on a dinner plate is almost like a bow on a package. I think those who are chopping this, or substituting mature bok choy, or those who are adding other vegetables are totally missing the beauty of whole baby bok choy for its visual appeal. Having said that, the simple seasoning and braising in this recipe makes this not only a beautiful and unique presentation on the dinner plate, but a delicious one at that. I used shallots rather than onion and added a little chicken broth, and found I needed to cook the little guys a couple of minutes less than directed to keep them crisp-tender and to retain their shape and color.  Impressive and very pretty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-11T04:14:55.873Z",
                "reviewBody": "This is excellent!  I made it exactly according to recipe, except that I used regular instead of baby bok choy, and it took a little longer to cook.  I waited until the white parts were almost soft, which took about 25 minutes, but the green parts weren't slimy at all, as mentioned in a previous review.  This is definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUEENY123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/373474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-30T19:04:06.11Z",
                "reviewBody": "I'm happily giving thes recipe a high rating. It was exactly what I was looking for. Something interesting and new, healthy and not very expensive, It sure was easy and quick to prepare and met the approval of everyone at my dinner table. I did add more bacon,(how bad can that be)as I needed to use it up. I probably added a little more garlic too. The direction of 1 tsp. of red pepper flakes is not too much for the average person but could be lessened for those with tender palates. The bok choy is a huge heap in the frying pan. Don't worry though, it will soon soften up and drastically shrink in size. Be cautioned - the bok choy must be rinsed very thoroughly before use. Lots of dirt hiding in the leaves. I guarantee you will kick yourself if you bite into a gritty forkful and don't get to eat this. I would like to start enjoying at least 1 night a week with a meal containing veggies only. This for sure will be on the menu. Thanks so much for sharing this one.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cynjne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1447121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-04T15:17:33.75Z",
                "reviewBody": "This is really great. Simple flavours and so easy. The bacon adds a wonderful salty flavour and I used mature bok choy instead of baby as that's all I had. With preparing this dish I did as you would do for stir -fry by chopping everything up beforehand. I also added 1 green onion half an ear of corn and 1 stick of celery all chopped up because I'm always looking for ways to eat more veg. Totally delish! I did separate the stalks and the leaves and only added the leaves in the last two minutes. The stalks had about five minutes cooking time. Perfect instructions too. Don't leave your pan on too high when you put the stalks in - your garlic will burn. Thankyou for a wonderful recipe that has left me with lunch tomorrow! Update: I have made this again but added some mushrooms. This recipe is the bomb!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AUSSIEMUM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1414774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-30T01:04:04.92Z",
                "reviewBody": "Yum!  I was looking for a new way to make bok choy and this one is a keeper!  I made few changes, i used baby bok choy cuz its more tender.  We didn't have any bacon, so i just stir fried some ham finely diced slowly to draw out the flavor.  We like our food highly spiced so I added some paprika and cayenne pepper to the red pepper flakes AND threw in a tablespoon of black bean sauce and a tsp of pureed chili sauce (found at your neighborhood asian food mart) to the mix.  Rave reviews all around my house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gingerB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1921203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-04T23:05:55.553Z",
                "reviewBody": "This was okay once I added about a tablespoon each of hoisin and black bean sauce. I only had large bok choy which I had to chop so that may have been part of the problem. The leaves became sort of slimy but the stalks were fine. I will try this again using baby bok choy or I will either cook the stalks and then add the leaves just at the very end so they retain some texture. It would have been great were it not for the texture which may have been my fault.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Blackie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/636807/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-17T07:53:52.42Z",
                "reviewBody": "This recipe was very good. I made it for dinner serving 8 people (serving it only over rice). I chopped up 2 packs of the store-bought bacon and fried it in the wok until the bacon was nice and brown almost crispy. I drained out all fat and left about 1 tblsp. Didn't need to use olive oil just because I thought it'd be too oily. Also I used just regular bok choy instead of the baby because that was all they had at the grocery store. With those I just chopped them up and threw them in and it turned out fine. I seasoned to taste with hoisin sauce and extra black pepper just because I love black pepper with bacon. Next time I would like to try it with the baby bok choy just because I know that they will come out more tender than regular bok choy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "anny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1938462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-16T19:43:21.3Z",
                "reviewBody": "very tasty and easy side dish to make. I loved the taste that the bacon adds to the baby bok choy. Baby bok choy is an easy vegetable to prepare. I cooked the bacon chopped up then set it aside. I used the grease leftover from the bacon with a drizzle of olive oil to heat up together. I added the baby bok choy stem hard parts to cook first. They take a little longer to cook than the bok choy leaves. About 2 minutes into the cooking process I added the leaves and stirred to combine everything. I added the bacon back to the baby bok choy and seasoned with a pinch of salt and black pepper to taste. I did not add any red pepper flakes since no one really likes it spicy. I was careful not to overcook the bok choy stems while leaving enough of a crunch. I ended up with nice bright green color that bok choy gives and wonderful bacon-y flavor with a crunchy texture! This was such a delicous side dish and it complemented the \"Chicken Fried Rice II \" also from this website. This dish is easy to prepare and doesn't take but a few minutes to put together. A definite keeper to use again in the near future!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-04T15:45:16.813Z",
                "reviewBody": "delicious and simple- what could be better? i make this every time there's bacon in the house its a great way to get my bf to eat some vegetables! just as good with half the oil too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Briar Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1814082/"
                }
            }
        ]
    }
]