[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76713/norwegian-potato-klub/",
        "name": "Norwegian Potato Klub",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3281535.jpg",
            "width": 2000,
            "height": 2001
        },
        "datePublished": "2018-06-08T13:24:32.000Z",
        "description": "Norwegian Klub is a dish my mother made when we were growing up. I like to have it topped with bacon grease, and my wife likes them brushed with butter and sprinkled with sugar. Sliced and fried the next day these are a hearty breakfast meal. If you have a grinder, you may grind the potatoes instead of grating.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 slices bacon",
            "2 cups all-purpose flour",
            "½ teaspoon baking powder",
            "10 medium potatoes, peeled and shredded",
            "2 teaspoons salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place bacon in a large skillet over medium-high heat. Remove bacon from the pan, and reserve the grease.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the flour and baking powder. Stir in potatoes to make a sticky dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil, and add 2 teaspoons of salt. Squeeze the potato mixture into 6 or 7 dumplings, or your desired size. Drop carefully into the boiling water. Simmer for 45 to 60 minutes. Remove to a platter with a slotted spoon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Serve with bacon grease brushed over the top, and crumbled bacon. These may also be sliced and fried the next day for another great meal.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "THOMAS ELLEFSON"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 36,
            "itemReviewed": "Norwegian Potato Klub",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "553.5 calories",
            "carbohydrateContent": "94.1 g",
            "cholesterolContent": "19 mg",
            "fatContent": "13.3 g",
            "fiberContent": "8.9 g",
            "proteinContent": "14.7 g",
            "saturatedFatContent": "4.4 g",
            "servingSize": null,
            "sodiumContent": "1071.2 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-03-25T22:22:42.49Z",
                "reviewBody": "We call it 'FreskaKrub.' Make a dent to put in diced salt pork & heavily pepper before sealing it. Boil for 1 hour (about the size of a baseball) Serve with butter. Make the dumplings with WET HANDS..rinse after each one! Wonderful fried in butter the next day. Someone said 'remove the salt pork'??? Sacrilege!! I've just set down to wait for my 'Freskies' to finish cooking. I thought I'd add a few notes to this review. For those of you who didn't have a mom or grandma to tell you a few secrets about cooking this wonderful dish: Do this next to the sink where you can have a slow stream of water to rinse your hands well. Your hands need to be really wet to avoid sticky messes. Work Quickly. After every 2 or so dumplings are added to the pot use a wide spatula to keep the dumplings from sticking to the pan. Soon they will float but 'til then keep using the spatula. Have a butter knife nearby when mixing the dough. You'll need it to scrape away the thick dough from your hands. I try to do as much as I can with one hand leaving the other free to add flour. REMOVE ALL RINGS AND BRACELETS (don't believe me-try it-you'll see why) Have an extra pan of water simmering on the stove to add hot water if necessary. I'm not so sure about the ratio of potatoes to flour in the recipe. This is a 'by feel' recipe. We don't use baking powder. Clean all surfaces and yourself WELL Nothing worse than dried paste stuck to hairs on your hand & arm. Practice to get the feel-not too sticky",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Penny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2634872/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T07:02:40.71Z",
                "reviewBody": "When I lived in Norway in Sor Trondelag, the Klubb was made with Barley flour and the shredded potatoes were first rinsed (get some the starch out). the Salt Pork was served on the side. The Klubb was served with a sauce made with Geitost (brown goat cheese), hot salt pork bits and fat, and, for some, syrup! with boiled potatoes and rutabages on the side. Yum! it was delicious on a cold winter evening after skiing all day. the brunost sauce was basically a thin white sauce with plenty of shredded melted brown goat cheese (to taste). ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "selbusis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2623589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-29T08:19:55.743Z",
                "reviewBody": "My Norweigian great grandmother made this receipe for her husband and 12 children growing up on a farm in Minnesota. Klub (we call it KRUB). I was raised on this stuff which is my favorite food in the world. Just a note: We eat it exactly the same was the first day but the second day is even better. I fill a frying pan with about a cup or so of milk. As the milk is warming on a medium burner cut the potato Klub into bite size pieces. I just slice with a knife over pan. Cook until the milk has formed a \"gravy\" consistancy stirring constantly. Serve on plates with dabs of butter. Yummy! I can't wait to make this again!!! Thank you for sharing this great receipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debi Michela Jacques",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2962000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-04T03:04:52.077Z",
                "reviewBody": "This is similiar to the recipe I grew up with. We didnt use baking powder though and instead of dropping the dumplings in boiling water we actually put them in cheese cloth and so you can make larger portions. We put bacon in the middle and salt and pepper. It definitely hands down is even better the next day fried for breakfast. Oh and I grew up calling it potato crub.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doolittlenomnoms",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doolittle/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-16T19:04:34.663Z",
                "reviewBody": "Good basic recipe. As a full blooded Norwegian growing up in Norway I would suggest halving the all purpose flour and doing the rest of it with barley flour. You can also use oatmeal to make them heartier.\nIt is important to squeeze as much water out at possible. \nAnother suggestion would be to have rutabaga cut and sliced in the broth as well. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "H. L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1752888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-20T19:36:17.75Z",
                "reviewBody": "This is a comfort food for anyone with a Norwegian heritage. The only difference is we added ground cloves to the potato mixture and served with butter. She is right when saying that they are great the next day.... fry them up in a frying pan with butter and they are even better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARRYCALGARY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1444605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T18:52:21.92Z",
                "reviewBody": "Excellent Recipe the potato balls were firm and tasty. Next time I will try to squeeze more of the water out since they tended to fall apart when I first put them in the boiling water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CathyA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1520432/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-01T19:18:13.41Z",
                "reviewBody": "I was reading other members reviews and I noticed that people were having problems with their Klub falling apart. I make Klub several times a year by grinding my potatoes in an old fashioned meat grinder. After grinding potatoes I mix with flour and turn out on board and knead flour into potatoes(just like bread) until it reaches a non-sticky consistancy(usually takes 15 minutes) I use 5 lbs of flour to 10 lbs of potatoes. I then stuff with salt pork and drop into salted boiling water for 2.5 to 3.5 hours. this recipe/technique has been in my family for over 100 years and so far my klub has never fallen apart:).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon10",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4265283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-04T03:10:40.997Z",
                "reviewBody": "Oh gosh was I excited when I seen this! My Grandma Dole use to make this all the time while I was growing up. After she passed nobody knew how to make it my Mom never learned! This is definately a good Norwegian recipe. Thanks for posting it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ames179",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2304217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-15T18:01:06.763Z",
                "reviewBody": "It looked exactly like the picture but tasted bland.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "cowthersamyk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4619194/"
                }
            }
        ]
    }
]