[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77156/dijon-tarragon-cream-chicken/",
        "name": "Dijon-Tarragon Cream Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3605032.jpg",
            "width": 2322,
            "height": 4128
        },
        "datePublished": "2004-10-14T17:00:16.000Z",
        "description": "Chicken breasts bathed in a delicate mustard tarragon sauce. A quick and simple recipe that you can serve on a weeknight but tastes like a French chef came to your house!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon butter",
            "1 tablespoon olive oil",
            "4 skinless, boneless chicken breast halves",
            "salt and pepper to taste",
            "½ cup heavy cream",
            "1 tablespoon Dijon mustard",
            "2 teaspoons chopped fresh tarragon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt the butter and heat the oil in a skillet over medium-high heat. Season chicken with salt and pepper, and place in the skillet. Brown on both sides. Reduce heat to medium, cover, and continue cooking 15 minutes, or until chicken juices run clear. Set aside and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir cream into the pan, scraping up brown bits. Mix in mustard and tarragon. Cook and stir 5 minutes, or until thickened. Return chicken to skillet to coat with sauce. Drizzle chicken with remaining sauce to serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DELTAQUEEN50"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.524405506883604,
            "ratingCount": 799,
            "itemReviewed": "Dijon-Tarragon Cream Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "310.1 calories",
            "carbohydrateContent": "2.1 g",
            "cholesterolContent": "120.3 mg",
            "fatContent": "21 g",
            "fiberContent": null,
            "proteinContent": "27.1 g",
            "saturatedFatContent": "10.2 g",
            "servingSize": null,
            "sodiumContent": "226.8 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-19T14:12:58.357Z",
                "reviewBody": "This recipe looked great as is, but after reading other reviews, I decided to take some of their suggestions. I coated the chicken with lightly seasoned flour prior to browning them. After the breasts were cooked, I removed them from the pan and sautéed 2 minced cloves of garlic, ½ of an onion, chopped, and 1 cup of sliced mushrooms until the onion was soft and the mushrooms were mostly cooked. Then I added the cream, mustard and tarragon with the garlic, onions, and mushrooms. I also tripled the cream-mustard-tarragon “gravy” as we like extra. I served this wonderful chicken with mashed potatoes and asparagus. We will definitely make this again!  UPDATE: I have made this dish again, and this time I made a few more changes that previous reviewers had mentioned. I rubbed a light coating of Dijon mustard on the chicken breasts a few hours before cooking and let them sit. I still coated the breasts in seasoned flour before browning. Once the chicken was cooked and I removed it from the pan, I added a splash of white wine (slightly less than a quarter cup) to deglaze the pan prior to sautéing the onions, garlic and mushrooms. My husband said it was the best! This time I served it with Stove-Top chicken dressing and a salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANICER8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1275952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-03T13:32:04.857Z",
                "reviewBody": "This recipe was very good.  I added a few things that rounded out the flavors.  Changes I made:\r\n1. I coated the chicken with seasoned flour before sauteing in butter/oil mixture.\r\n2. Once the chicken was done, I added 2 minced garlic cloves and 1 minced shallot to the drippings and cooked until soft.  \r\n3. I deglazed the pan with a glug of white wine before adding the cream.\r\n\r\nThe garlic, shallots and wine deepened the flavors and gave the dish a better finish.  This will definately be one of our favorites from now on!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LABSARE4ME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/607566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-05T23:03:32.733Z",
                "reviewBody": "I'm a personal chef who uses allrecipes ALL of the time. Put this together and it was an incredible hit, had two guests that were from New York City and the other from Philadelphia, both cities incredible hot spots for the worlds best restaurants, they couldn't believe they found a dish comperable if not better here in the Montana mountains that parallel the big cities best. Thank you and allrecipes for all my great recipes",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janie Hubshman-Edinger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-25T17:00:35.467Z",
                "reviewBody": "As is I would say this was an okay recipe but with a few modifications it is excellent. I coated the chicken in dijon mustard about 3 hours before cooking. Then I dipped in flour and sauteed in oil & butter. I made the sauce as directed but increased the cream so there would be more sauce. Yummy! The chicken was incredibly tender and moist. My husband raved about it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HUGSMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-09T23:09:23.043Z",
                "reviewBody": "I too made some adjustments on this recipe.  I took the advice of others and dusted the chicken with flour and I doubled the sauce recipe.  PLUS, after removing the chicken I deglazed the pan with dry white wine, after it reduced by half I added finely chopped shallots.  After the shallots cooked for a few minutes I then added the cream.  Instead of tarragon in the sauce I added Herbes de Provence, stirred then added back the chicken.  I garnished the chicken with fresh chopped tarragon.  We used the sauce for the asparagus on the side.  My kids (10 & 12) loved the sauce and the chicken.  They actually used the sauce to disguise the taste of the asparagus.  This is a keeper recipe and I've shared it with friends.  Nice and easy but definitely a show stopper.\r\n\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321285/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-05T20:51:42.47Z",
                "reviewBody": "Tasty easy recipe. My husband loved it and I didn't let on just how easy it was. I changed it some based on the reviews and on our dietary needs: Marinate the chicken breasts for a few hours in white wine and lemon juice. Convection bake at 325 for 20 minutes while making sauce. (These two pre-steps tenderize the chicken.) In a sauce pan melt 1 TBS unsalted butter and add about 1/4 cup diced red onions cooking a few minutes. Add about 1/3 cup sliced portabello mushrooms and saute until mushrooms are cooked. Pour into bowl and set aside. Pour 1/2 cup of fat-free half & half to heated saute pan and heat on medium until hot. Whisk into cream 2 TBS Dijon mustard. Stir in 2 TBS chopped fresh Tarragon. Add in onion-mushroom mixture and lower heat to a low simmer. Place baked breasts on a lightly greased heated grill pan and grill 3 minutes each side or until chicken is cooked through. Sprinkle with salt and pepper. Place on plates and ladle sauce on top. Voila! A gourmet meal awaits.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chi-love",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2047908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-23T18:02:21.36Z",
                "reviewBody": "Excellent recipes and good company fare. The only changes I made is to deglaze the pan with white wine (next time I will try brandy) added some chopped garlic and used unsalted butter. Always find that unsalted butter (or sweet butter) gives a much better flavor and does not burn as quickly",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EILISH40",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1446852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-04T15:09:05.743Z",
                "reviewBody": "I used to make this recipe all the time when I still ate meat. Now that I'm a vegetarian I still eat this but with mock-chicken instead. It's a delicious and quick recipe that has impressed every single person I know who tried it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunFlower",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1144581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-22T15:40:43.733Z",
                "reviewBody": "coated chicken with salt pepper and herbs of provence and let sit for the afternoon. increased tarragon to 1 Tbs used white wine to deglaze the pan and added 1 tsp of garlic with the wine. used only 1/2 and 1/2 and milk to cut down on fat. good and classically french recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "foodlover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/211953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-08T17:52:32.873Z",
                "reviewBody": "At first I didnt understand. Ive never made something with high ratings that went so bad. I read over the other reviews and I see a lot of people have not made this recipe as is. People have made their changes and then rated the recipe 4-5 stars so I really think this 5 star rating is way off. Way too strong of a mustard taste for me. I tried again with less mustard and garlic and served it over chicken stuffed with prosciutto and smoked gouda. It went better with it but I still dont think its that great. Wont be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/660536/"
                }
            }
        ]
    }
]