[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/653/main-dish/pasta/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8696/chicken-tequila-fettuccini/",
        "name": "Chicken Tequila Fettuccini",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4232.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "1999-04-26T16:38:22.000Z",
        "description": "This dish is wonderfully different.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (16 ounce) package fettuccine pasta",
            "⅓ cup chopped fresh cilantro",
            "2 tablespoons minced garlic",
            "2 tablespoons minced jalapeno peppers",
            "3 tablespoons butter",
            "½ cup chicken stock",
            "3 tablespoons tequila",
            "2 tablespoons fresh lime juice",
            "3 tablespoons soy sauce",
            "1 ¼ pounds skinless, boneless chicken breast halves - cubed",
            "¼ red onion, sliced",
            "1 red bell pepper, thinly sliced",
            "½ yellow bell pepper, thinly sliced",
            "½ green bell pepper, sliced",
            "1 ½ cups heavy whipping cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, saute the cilantro, garlic and jalapeno pepper in 2 tablespoons of butter or margarine over medium heat for 4 to 5 minutes. Add the stock, tequila and lime juice. Bring the mixture to a boil and cook until reduced to a paste-like consistency. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour soy sauce over the chicken and set aside for 5 minutes. Meanwhile, In a medium sized skillet, saute the onion and the red, green and yellow bell peppers with the remaining tablespoon of butter or margarine, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, cook fettuccini according to package directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the peppers have wilted, add the chicken and soy sauce. Toss and add the reserved tequila/lime paste and cream. Bring to a boil. Gently simmer until chicken is cooked through and sauce is thick. Toss with well drained fettuccini and garnish with cilantro. Serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Behr"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.537209302325581,
            "ratingCount": 430,
            "itemReviewed": "Chicken Tequila Fettuccini",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "922.6 calories",
            "carbohydrateContent": "71.1 g",
            "cholesterolContent": "227.5 mg",
            "fatContent": "46.1 g",
            "fiberContent": "4.8 g",
            "proteinContent": "49.4 g",
            "saturatedFatContent": "26.5 g",
            "servingSize": null,
            "sodiumContent": "1093.1 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-08T21:05:37.747Z",
                "reviewBody": "This recipe was lovely!! However I have a few suggestions that might take it from great to FANTASTIC!! 1) Boiling chicken often gives it a dry less succulent texture and flavor. I would suggest grilling the chicken in a pan cutting it into cubes and tossing it into the sauce once it has thickened. If time allows you might like to marinade it in some lime juice and maybe even a bit of tequila (along with the soy sauce). I found that I needed to add a little extra lime juice to the sauce... so definitely taste test before serving. If you like your food spicy don't rely on the number of jalapenos given in the recipe to satisfy your craving for kick. Add more. If you're truly courageous... add some habanero... but that's only for the truly brave and daring!! Otherwise I loved the recipe I just thought the chicken could be a little more moist and flavorful. Fantastic dish. My italian father is very picky about \"creative pasta\" dishes... and he loved it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "www.jessicadonofrio.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/715030/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-06T20:58:26.04Z",
                "reviewBody": "I made this for friends who love to cook!  We decided it was far too conservative and needed adjustments.\n\nUse 1 cup of tequila with the 3 cups chicken stock for a glaze reduction, reducing 4 cups down to 1.5 cups.  \n\nUse 3-4  whole limes for the juice, add this to the garlic and jal. peppers and cilantro,  which thickens and carmelizes the paste, and use olive oil instead of butter.  \n\nForget the soy sauce, not neccessary.\n\nIn Step 4-Combine paste and chicken, cook thru, then add cream last so it doesnt break down, and mix.  THEN, pour the reduction mix over the top, so that the flavors do not mix and are distinctive from one another.\n\nOtherwise flavors are okay, just could be so much better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Li-Li",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2365665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T21:06:34.95Z",
                "reviewBody": "This recipe was very similar to and just as good as the Sammy's Woodfired Pizza and California Pizza Kitchen versions, which I love.  My guests absolutely loved it and would not stop talking about it.  CAVEAT:  I personally would not have given this recipe 5 stars had I not read and heeded some of the advice of the reviews.  First of all, I doubled the jalapenos and it was still not too hot --- just much more flavorful.  I also put more lime and tequila in the chicken marinade.  Very important:  cooking the chicken in the method called for in this recipe yielded rubbery and overdone chicken.  Next time I will cut my chicken into strips and broil or grill them.  I will then throw them in at the end just to warm them up again.  One aesthetic consideration, too, is that the chicken marinaded in soy sauce gave it a rather unappealing color.  I would probably put the soy sauce in the sauce next time and not directly on the chicken.  Another important consideration:  don't cook onions and peppers until they are mushy or too limp.  I was careful to get mine done enough while maintaining a little body to them, and that was key. This recipe definitely was more time intensive and probably not good for a week night.  It is, however, a very special recipe and one you should try for your guests.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JHUTCH3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/863184/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-26T18:38:10.677Z",
                "reviewBody": "Found the cooking method to produce rubbery chicken, so back to the drawing board I went!  2nd time, I had leftover grilled chicken which I needed to use up and I doubled the cilantro, garlic, jalapeno pepper, stock, tequila, and lime juice which enriched the flavor.  Folded in the grilled chicken as the last step and it has now joined the ranks of \"favorites\" in our household!  Thank you Behr!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-31T19:20:17.43Z",
                "reviewBody": "Our favorite pasta recipe! We do double some of the ingredients: jalapeno butter stock tequila and lime juice...it makes more sauce and much more flavor. The extra jalapeno does NOT make it too spicy (and I am a WIMP!!). We also cook the pasta in chicken broth instead of water.:) YUMMMM!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LindsayG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:44:32.543Z",
                "reviewBody": "Very similar to CPK. It took a little longer to prepare than I anticipated but it was worth the wait. I marinated chicken in balsamic vinegar instead of soy sauce and also went a little crazy with the peppers. I added one each of green red orange and yellow. Delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "schmerna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-25T01:58:44.28Z",
                "reviewBody": "Well I made a mess with this recipe. After I started preparing it I realized that my roomate drank the last of the tequila. I used beer instead and it was still quite good. A wonderfully different meal to add a little kick to your kitchen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAYTEANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mayteana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-15T19:55:41.827Z",
                "reviewBody": "very good like alfredo with a southwest kick... will make again but is rather rich! if it was more low fat i would give it a 5:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Leesha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/250353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-05T19:47:06.607Z",
                "reviewBody": "oh my! What a delicious dish! So packed full of flavor the insides of my mouth tingle just thinking about it! When I read the descriptions I thought it sounded just like the California Pizza Kitchen dish and yup it is! All I had was red peppers and I had some of that fresh Butoni brand spinach fettucine which really gave it a lot of color..I think if I were to use the regular pasta I would definitely use all three colors of bell peppers though. Step 1 takes a little longer than I expected it took a while to get the sauce reduced to \"paste-like consistency\" stage. The chicken was already cooked and had to be set aside way before the reduction of the sauce was ready. A little more labor intensive for a late weeknight dinner but when we finally sat down to it we agreed it was worth the wait. Next time I'll make this wonderful dish on a Saturday! Thanks Behr!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISS YVONNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/521614/"
                }
            }
        ]
    }
]