[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/250/main-dish/pizza/",
                    "name": "Pizza Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1036/main-dish/pizza/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/82487/chicken-avocado-pizza/",
        "name": "Chicken Avocado Pizza",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F910228.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:25:55.000Z",
        "description": "A deliciously different California inspired pizza made with avocado spread in place of pizza sauce, and topped with chicken and Monterey Jack cheese. Great for a light meal.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 avocados - peeled, pitted and diced",
            "1 tablespoon chopped fresh cilantro",
            "1 tablespoon fresh lime juice, or to taste",
            "salt to taste",
            "1 clove garlic, peeled",
            "4 (7 inch) pre-baked pizza crusts",
            "1 tablespoon olive oil",
            "1 cup chopped cooked chicken breast meat",
            "1 cup cherry tomatoes, quartered",
            "1 cup shredded Monterey Jack cheese",
            "1 pinch cayenne pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat your oven's broiler. If you have a pizza stone, place it in the oven while it preheats.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a food processor, combine the avocados and cilantro. Puree while adding lime juice and salt to taste. Cover, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice the garlic clove in half, and rub the cut side onto the tops of the pizza crusts for flavor. Brush both sides of the crusts with olive oil. Spread the avocado mixture thickly over the top of each crust, then arrange chicken and tomatoes on top. Sprinkle with cheese, and season lightly with cayenne pepper. Place pizzas on a baking sheet if you do not have a pizza stone.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Broil for about 5 minutes in the preheated oven, or until the cheese has just melted and the crust is lightly toasted.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pizza Recipes",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "postpunkmom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.356756756756757,
            "ratingCount": 185,
            "itemReviewed": "Chicken Avocado Pizza",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "798.3 calories",
            "carbohydrateContent": "82.4 g",
            "cholesterolContent": "65.6 mg",
            "fatContent": "38 g",
            "fiberContent": "10.1 g",
            "proteinContent": "38.9 g",
            "saturatedFatContent": "11.6 g",
            "servingSize": null,
            "sodiumContent": "1010.9 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-10T06:08:44.623Z",
                "reviewBody": "Boy am I glad I tried this recipe despite my initial doubts.  I made my own pizza dough and used halved topping to make a 12\" pizza, baked at 400F for 15 minutes and it was perfect.  The avocado and cheese blended really nicely and the cherry tomatos are little pockets of flavor to bite in to.  Will be making this many more times.\r\n\r\nThe only thing I'd do differently (since I'm using raw pizza dough) is to slightly undercook the chicken first and let it fully cook with the rest of the pizza in the oven, otherwise it's a bit dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnInHK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/422932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-11T13:14:56.723Z",
                "reviewBody": "This was very very good. I did make a few changes. I added a small clove of garlic to the advocado mixture. I also had some bacon bits on hand so I put them on the pizza. I also chopped up some roasted red pepper to add. I think without the pepper it might not have been as flavorful thus the 4 stars I gave it. I also used a full pizza crust (whole wheat) and cooked it in the oven instead of the broiler. It was awesome. Thanks for the idea. Really you've inspired me I am going to try a lot of new pizza ideas this way. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "alexsmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1820530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-22T03:07:38.15Z",
                "reviewBody": "It's 2 of my favorite indulgences: guacamole & pizza, merging together to form a culinary party in my mouth. Awesome recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mezo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2392528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-08T19:24:35.94Z",
                "reviewBody": "I absolutely LOVE this recipe! I have made it a few times and it is always a hit with my family. I like to mix a little garlic powder in with the avocado mixture. I also sprinkle dried basil and oregeno on the top of the pizza with the cayenne pepper and I use mozarella cheese. This ends up looking and tasting like a high-end bistro pizza! My coworkers couldn't believe I made it and just HAD to have the recipe. It's just as good the next day as leftovers. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2488611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-04T05:00:33.863Z",
                "reviewBody": "My husband and I really enjoyed this pizza what a great twist! We crushed garlic into the avocado and cilantro mixture instead of rubbing it on the pizza crust. We also waited until the pizza was done cooking and sliced the tomatoes and put them on top. JUST EXCELLENT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2050355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-23T23:47:19.453Z",
                "reviewBody": "This was great and did make for a light meal. We paired it with a nice light salad of romaine lettuce the rest of the cherry tomatoes some cucumber and ranch dressing. The pizza looked beautiful and smelled delicious. The only thing is that I felt like it was missing some flavor and I wanted to add something to give it a little more pizzaz but couldn't put my finger on what was \"missing\". Next time I think I will try adding ground cumin or extra cilantro to the avocado mixture. I am also wondering if about half an onion chopped and pureed into the sauce would add some good flavor. I did find the pizza to be more flavorful the next day after the flavors had time to set. I also took advice from other reviewers and used uncooked readymade dough for the crust. Added the ingredients to the uncooked crust and baked in oven for about 20 minutes at 400 degrees. Came out beautifully. Will definitely make again just adding some extra flavors. Thanks for the recipe! My girlfriend loved it and was impressed:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pastina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730802/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-07T16:58:55.85Z",
                "reviewBody": "DELISH! I expanded on the recipe just a teensy bit. First i cooked the chicken with a rub using cayenne powder garlic salt and sugar (pretty much whatever i had in my spice cabinet!) let it cool and then shredded it with my hands. I used two 8-9 inch pizza crusts that were actually cornmeal based. My avocados were a little hard so i added olive oil and mashed them by hand. It was a bit \"chunkier\" -- but i liked it that way! i also added green onions which i would say is an essential addition! I baked for 7 minutes and then broiled for 3 and voila! This was truely a yummy unique dish that was easy to make. will DEFINITELY make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hsck6488",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7301084/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-30T06:09:27.373Z",
                "reviewBody": "My husband and I love this recipe. My kids even though they love avacado didn't like the \"sauce.\" If I made it for my kids again I would add a little less lime and cilantro but I love it as is. We couldn't taste any garlic. I would either leave it out or add it into the sauce. I didn't add cayenne because of the kids but can't wait to try it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kirsten Johnson Chou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1317977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-12T17:04:29.53Z",
                "reviewBody": "My husband is very very picky and so I was surprised when he absolutely loved this pizza! I brought a piece to a co-worker today and she immediately asked for the recipe. It was delicious! My son thought it was just okay but I think he would have loved it too if I had put the cayenne on it which I left off. I used an already roasted chicken bought at the store (they're so cheap!) and next time I'll use a little more cilantro. I also used half Monterey Jack and half Mozzarella cheese using about twice what the recipe called for. An amazingly easy recipe! Oh and I only oiled one side of the pizza. Oiling both sides sounded messy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill Erfle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/601166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-23T01:55:28.013Z",
                "reviewBody": "This was just okay...I didn't really like it and now I realize why I like my guacamole chunky...because pureed I feel like I am eating baby food. Since there was so much of the avacado \"sauce\" globbed on it was totally unappetizing to me. I even tried scraping it off the crust as I was eating it. The combination of ingredients sounds pretty good...and if you generally like baby food-consistency guacamole then you'll probably like this recipe. I just didn't.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "nyladenise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4108611/"
                }
            }
        ]
    }
]