[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/82713/blissful-rosemary-chicken/",
        "name": "Blissful Rosemary Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7588.jpg",
            "width": 1504,
            "height": 1000
        },
        "datePublished": "2018-06-08T13:25:56.000Z",
        "description": "An elegant and intensely flavorful way to prepare chicken breasts:  roll with prosciutto and cheese, skewer with rosemary sprigs, and marinate (or not).",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 sprigs fresh rosemary",
            "4 skinless, boneless chicken breast halves - pounded to 1/4 inch thickness",
            "4 slices smoked fontina cheese",
            "4 slices prosciutto",
            "½ cup white wine",
            "½ cup chicken broth",
            "¼ cup olive oil",
            "1 tablespoon freshly ground black pepper",
            "4 cloves garlic, halved",
            "salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Use a knife or grater to sharpen the thick ends of the rosemary sprigs. Soak sprigs in water for at least 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Layer each chicken breast with 1 slice fontina and 1 slice prosciutto. Roll tightly, and skewer each with a rosemary sprig to secure.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, whisk together the wine, broth, oil and pepper. Pour into a medium baking dish. Place rolled chicken breasts in the dish. Place 2 garlic halves under each breast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 25 minutes in the preheated oven, until chicken juices run clear. Remove from baking dish, reserving sauce, and allow to stand 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer remaining sauce to a saucepan, and bring to a boil. Drizzle over chicken to serve. Season chicken with salt to taste.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CHEFSINGLEDAD"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.512,
            "ratingCount": 125,
            "itemReviewed": "Blissful Rosemary Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "448.3 calories",
            "carbohydrateContent": "3.4 g",
            "cholesterolContent": "112.7 mg",
            "fatContent": "29.8 g",
            "fiberContent": "0.6 g",
            "proteinContent": "35 g",
            "saturatedFatContent": "9.9 g",
            "servingSize": null,
            "sodiumContent": "639.5 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-07T13:01:02.593Z",
                "reviewBody": "Growing up in my family of outstanding Italian cooks (and being a pretty mean Italian cook myself!) I recognized this recipe as having all the combination of ingredients for a take on a great Italian dish Chicken Saltimbocca. Sad to say both hubby and I were pretty non-impressed. First let me say I made the recipe with no changes so I could be fair in my review. That said because the chicken basically \"poaches\" in all that liquid it turned out moist and tender-a good thing! However because the chicken basically \"poaches\" in all that liquid the chicken had no color so it was pretty anemic looking-a bad thing. The pan \"juices \" which should be thick and velvety were instead watery. Blechh. The flavor of the chicken was bland lost to the overpowering rather than subtle flavor of rosemary. Yet this recipe does have potential with minimal changes. Salt and pepper the chicken. Sprinkle with a LITTLE minced garlic and a LITTLE chopped rosemary then roll up with the the prosciutto and cheese as the recipe directs. Brown the chicken in a little olive oil over pretty high heat about two minutes on each side until golden. Then add all the liquid to the pan scraping up the brown bits and continue to cook until the liquid is reduced to about half another several minutes or so. Swirl in a couple tbls. of butter. Serve the chicken drizzled with some of the reduced liquid and insert a sprig of rosemary for a nice presentation. Mmm bravo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-06T09:28:11.703Z",
                "reviewBody": "Update from the author: What I love about this site is all of the input. Specifically your comments on cheese garlic and rosemary have made all the diff here. Re cheese: I still prefer smoked fontina but use what you want. Tip: slice it and then let it warm to room temp. It will roll better that way which lets the layering happen a bit better. Re garlic: yeah just mince and drizzle it into the breasts before you roll. Think about how much your guests like garlic. You might just get away with slicing a clove and rubbing a la bruschetta. Your call. Re rosemary: while skewering is a nice touch you can simply lay the sprig in the pounded breast perpendicular and roll it up alongside everything else. Be sure to moisten well however so the ends don't totally fry. Alternatively just minced and add to the roll-up! I'm glad so many of you have enjoyed this. Thank you for the input!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFSINGLEDAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-11T03:34:05.017Z",
                "reviewBody": "This was my first attempt at slightly \"fancier\" cooking. I'm a complete novice and I could not have been more pleased with how great this recipe turned out. As a bit of a beginner there's nothing more disheartening than working hard and it somehow not coming together - but this was clear enough for even me to follow and it came out beautifully with lots of compliments. Update: I've made this dish several times now and have found that instead of bothering with sharpening the rosemary and spearing it it tastes better to just wrap the rosemary sprig in with the prosciutto and cheese. It slides right out of the chicken with a little pull but leaves MUCH more flavor. Just secure the chicken with toothpicks so it'll hold together when cooking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Arena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1609825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-15T20:35:07.75Z",
                "reviewBody": "This was absolutely delicious though I did make a few slight changes. 1. I used provolone cheese instead of fontina. 2. I browned the chicken before baking as others recommended. 3. Instead of mixing the wet ingredients in a separate bowl I mixed them in the pan I browned the chicken in. I added crushed garlic and dried rosemary to the mixture and let it simmer a bit before adding it to the baking dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kerry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1545748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-31T07:36:40.403Z",
                "reviewBody": "I had my doubts when I made this. Also didn't think I could secure the chicken with a rosemary sprig. In the end I used chicken thigh for more flavors and rolled the rosemary in the center and used a bamboo skewer pierce everything together. Make sure you buy really good porscuito and cheese. You won't be sorry you splurged.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnInHK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/422932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-31T17:37:21.277Z",
                "reviewBody": "This is a great recipe! ChefSingleDad come over to my house and cook for me some night! I didn't have any fresh rosemary springs so I added about 1 tsp dried rosemary to the marinade. I put the chicken rolls on skewers and let them marinate overnight and baked them the next night. They came out so tender and juicy probably because I let them marintate so long. When the chicken was done I used a baster to get the sauce out and put it in a small saucepan. I added a little bit of half and half to make the sauce more creamier. Then I added some cornstarch at the end to thicken it up a bit and poured the sauce over the chicken before serving. I will definately make this recipe again next time I think I will try some different meats and cheeses to roll up with the chicken. Thanks for this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ali",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1274392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-14T17:19:37.513Z",
                "reviewBody": "This is fabulous! I have made it many times and even my picky 12 yr. old daughter likes it. I have used flattened chicken tenderloin pieces instead of the breast halves at times. They're smaller but look just as nice with the sprig of rosemary holding them together. I've made it exactly as the recipe calls for but have also substituted lean deli ham for the prosciutto when I didn't have any on hand. Thanks for the great dish--it's definitely good enough for company.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M.J.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1521177/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-10T20:57:34.83Z",
                "reviewBody": "I've made this twice now and love it! Each time I've used smoked mozzarella instead of fontina and it's tasted delicious. Browning the chicken before baking did make all the difference in appearance. Thank you for this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JesCPSU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2709501/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-06T13:52:51.31Z",
                "reviewBody": "This was indeed an intensely flavorful chicken. I followed Single Dad's idea of browning a bit in the pan before marinating. I marinated for about 24h and then popped the pan in the oven for 15 minutes. Very good and juicy with the wine sauce but I thought a little too peppery. Next time I'll use a bit less pepper. And Single Dad how do you keep the rosemary from burning? The tips of mine burned so I pulled them off and served the part in the chicken only.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MBRox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1520652/"
                }
            }
        ]
    }
]