[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
                    "name": "Vegetarian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/265/everyday-cooking/vegetarian/main-dishes/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15166/everyday-cooking/vegetarian/main-dishes/stir-fry/",
                    "name": "Stir-Fry",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/84406/tofu-peanut-stir-fry/",
        "name": "Tofu Peanut Stir-Fry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9345413.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2018-06-08T13:26:18.000Z",
        "description": "This is absolutely the best way to eat tofu, especially for first timers. The tofu has a slightly crunchy exterior while the inside is nice and soft. I used to make my stir-fry with chicken or beef, but my husband won't have it any other way than tofu now! And my 2 year old loves it! It is a delicious, easy, quick, and inexpensive meal. Serve with Asian noodles or with steamed rice. Enjoy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 teaspoon vegetable oil",
            "1 (16 ounce) package frozen stir-fry vegetables",
            "½ teaspoon minced fresh ginger",
            "salt and pepper to taste",
            "2 eggs, beaten",
            "1 cup cornstarch",
            "salt and pepper to taste",
            "1 (14 ounce) package firm tofu, drained and cubed",
            "½ cup vegetable oil",
            "¾ cup peanut sauce",
            "¼ cup chopped peanuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet or wok over medium heat, and cook the vegetables until tender. Mix in the ginger, and season with salt and pepper. Remove vegetables from skillet, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the eggs in a bowl. In a separate bowl, mix the cornstarch, salt, and pepper. Dip tofu cubes first in the egg, then the cornstarch mixture to coat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the remaining oil in the skillet or wok over medium heat, and cook the coated tofu 5 minutes, or until golden brown. Stir in the peanut sauce and peanuts. Continue to cook and stir until sauce has thickened and tofu is well-coated. Serve with the vegetables.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegetarian",
            "Main Dishes",
            "Stir-Fry"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ani"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1298076923076925,
            "ratingCount": 208,
            "itemReviewed": "Tofu Peanut Stir-Fry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "416.8 calories",
            "carbohydrateContent": "27.4 g",
            "cholesterolContent": "46.7 mg",
            "fatContent": "28.7 g",
            "fiberContent": "2.7 g",
            "proteinContent": "15.2 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "812.1 mg",
            "sugarContent": "2.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-24T15:47:08.98Z",
                "reviewBody": "My wife loves when I cook this for her. I made a few changes to make it a little more interesting though. First I use The Best Thai Peanut Sauce recipe I found on allrecipes. Instead of frozen stir-fry veggies I use fresh red bell pepper a yellow pepper fresh snow peas and a can of sliced water chestnuts. I also use a light flour instead of the cornstarch. Before serving I also add a little extra sauce as my wife likes it that way. Personally I really enjoy making this dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Darter02",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2354544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-20T19:31:57.97Z",
                "reviewBody": "We loved this and declared it \"restaurant good.\" We used fresh veggies (snow peas mushrooms onion red pepper green onions). I did not batter the tofu just soaked it in soy sauce and sauteed it. I made my own peanut sauce from this recipe: 3/4 cup light coconut milk 1 tsp. red curry 1/4 cup smooth peanut butter 2 Tbs. brown or raw sugar 1 Tbs. lemon juice 1/4 tsp. salt. It was a little sweet so I recommend less sugar and adding some pepper flakes or paprika. Making your own peanut sauce ensures the sauce is vegetarian which many store-bought ones are not.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avellana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2377188/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-14T02:10:36.733Z",
                "reviewBody": "Excellent tofu!! (To make sure the tofu didn't fall apart in the wok, I placed the tofu block under a cookie sheet with a coffee can on top to weight it down. I let it sit for probably 45 minutes. That squeezed out all the excess water.) The veggies were a little on the plain side because they're stir-fried with no sauce, so I added some soy sauce to taste at serving time. I will definitely keep this recipe for the future!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAJORSKY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415609/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-27T02:07:23.343Z",
                "reviewBody": "Great recipe changed it a bit added 1 tsp chinese 5 spice to the veggies. I also used raw veggies green & red pepper broccoli mushrooms kale chopped fine 1 zucchini cooked until tender Only veggies i had then added 1 scallion chopped 1/2 red onion chopped 2 green onions 1 cup of bean sprouts tossed only to mix in. Cooked the tofu as per the recipe but added some more chinese 5 spice 1/2 tsp. Also 1/2 tsp sambal oelek (HOT) for heat. cooked as per recipe then added (homemade peanut sauce) 1/2 cup whole almonds. Stir in cooked veggies serve. So good no need for any side rice or veggies. Even my 6 & 7 year old liked it. Great recipe thanks Ani. Diane",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angel of Harlem",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1753822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-22T01:56:43.2Z",
                "reviewBody": "I really enjoyed this dish. A few tips: (1) Use FIRM to EXTRA FIRM TOFU (a response to those complaining about it \"falling apart\"); I used MEDIUM: that's all I had. (2) I took some frozen green beans thawed them cut onions added celery salt and FRESH ginger. Great vegetable dish. (3) My minor complaint: too much oil so I will probably use 1/4 C oil next time. (4) If you have a Trader Joe's in your area i would strongly suggest using their Peanut Sauce. Fabulous! I only have about 1 TBSP left over but it was great. I now know to not use too much sauce next I make this dish. Good luck and thanks for reading.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RODCMC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1440864/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-25T06:08:25.473Z",
                "reviewBody": "This is a great recipe! I used fresh veggies: Broccoli red pepper green pepper red onion bamboo shoots celery carrot and bean sprouts. Buy extra firm tofu and cut it into 1/4 to 1/2 inch squares. If you drain the tofu it shouldn't crumble. By cutting it smaller you get more peanut taste instead of tofu. I also poured the rest of the peanut sauce from the jar over the dish when I was done. I might suggest pouring some peanut sauce over the veggies too and heating through if you really like peanut sauce like we do. This makes a great left over for lunch. I added soy sauce to the rice I served it on and it was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "seattlespice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2773457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-22T04:13:53.467Z",
                "reviewBody": "I do not hesitate in giving this recipe five stars.  My son loves cooked carrots, tofu & peanut butter--so to throw all those flavors together into one recipe turned out to be a real HIT with my preschooler.  That means we were able to get peas, broccoli & water chestnuts into him unawares with the fabulous coating of peanut sauce.  My husband upped the hot sauce on his serving tableside, my son did not consider his own as-is serving too spicy, & this is a wheat-free recipe (for me), so it won all all fronts!  We loved the textures with the fried tofu over rice vermicelli and the crunch of crushed peanuts.  NOTE--there is a lot of peanut in here, so if you have even the slightest sensitivity, beware.  2nd note--the time to make this is underestimated.  It took lots of prep time--namely making the peanut sauce (I used a recipe from a Stir Fry book, which tasted delicious, but required some food processing).  A new favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisandreasings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484409/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-31T13:21:07.953Z",
                "reviewBody": "I was very pleased with the way this dish turned out. I didn't follow the recipe exactly as stated because I didn't have all of the ingredients on hand. I also added some additional ingredients to suit my taste. Instead of stir-fry veggies I used a mixture of frozen sliced carrots with broccili and cauliflower which I added to one chopped sauteed onion and three 3 cloves of minced garlic. Powdered ginger was used but next time I will be sure to use fresh. I skipped the eggs and tossed the tofu in arrowroot instead of cornstarch before cooking it in the hot oil. I used a very good prepared Thai peanut sauce and added whole almonds as suggested by another reviewer. To enhance the flavor more I added five spice powder garlic powder and soy sauce. We all loved this dish and found it was best served over rice. The almonds complimented the flavors well and added a nice crunch. This is definitely a keeper. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gilda George",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ebony3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-11T19:01:57.86Z",
                "reviewBody": "Before this recipe I hadn't discovered a way to make tofu's texture and taste appealing--and this created an incredible stir fry that even kept well over a few days in the fridge. Very good!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2661359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-25T20:28:13.65Z",
                "reviewBody": "It was good but I will definately do less peanut sauce and tofu next time. It was very overpowering for the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Morgan Lane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1660554/"
                }
            }
        ]
    }
]