[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/172/soups-stews-and-chili/soup/cream-soups/",
                    "name": "Cream Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/86274/wisconsin-natives-beer-cheese-soup/",
        "name": "Wisconsin Native's Beer Cheese Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6983562.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2018-06-08T13:26:46.000Z",
        "description": "As a Wisconsin native, I'm accustomed to a fantastic beer cheese soup. This is the recipe I've created, as a salute to my home state...America's Dairy land...and a state that brews a mighty fine beer! Serve with lots of popcorn floating on top!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ½ cups diced carrots",
            "1 ½ cups diced onion",
            "1 ½ cups diced celery",
            "2 cloves garlic, minced",
            "1 teaspoon hot pepper sauce",
            "⅛ teaspoon cayenne pepper",
            "½ teaspoon salt",
            "¼ teaspoon black pepper",
            "3 cups chicken broth",
            "2 cups beer",
            "⅓ cup butter",
            "⅓ cup flour",
            "4 cups milk or half and half",
            "6 cups shredded sharp Cheddar cheese",
            "1 tablespoon Dijon mustard",
            "2 teaspoons Worcestershire sauce",
            "1 teaspoon dry mustard",
            "popped popcorn, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium heat, stir together carrots, onion, celery, and garlic. Stir in hot pepper sauce, cayenne pepper, salt, and pepper. Pour in chicken broth and beer; simmer until vegetables are tender, about 12 minutes. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, heat butter in a large soup pot over medium-high heat. Stir in flour with a wire whisk; cook, stirring until the flour is light brown, about 3 or 4 minutes. Gradually stir in milk, whisking to prevent scorching, until thickened. Remove from heat, and gradually stir in cheese. Keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir beer mixture into cheese mixture. Stir in Dijon mustard, Worcestershire sauce, and dry mustard. Adjust for hot pepper sauce. Bring to a simmer, and cook 10 minutes. Serve topped with popcorn.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Cream Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SAVVYHOSTESS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.331807780320366,
            "ratingCount": 437,
            "itemReviewed": "Wisconsin Native's Beer Cheese Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "564.9 calories",
            "carbohydrateContent": "21.2 g",
            "cholesterolContent": "119.1 mg",
            "fatContent": "39.7 g",
            "fiberContent": "1.9 g",
            "proteinContent": "27.1 g",
            "saturatedFatContent": "24.5 g",
            "servingSize": null,
            "sodiumContent": "908.3 mg",
            "sugarContent": "9.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-18T19:48:31.187Z",
                "reviewBody": "I've been a Wisconsinite most of my life (am originally from Minnesota) and while I don't proclaim to be a Beer Cheese Soup expert I do know what I like and I do know what tastes good.  And this is some good soup! Given some of the reviews I had extra flour on hand in case it was too thin, and Velveeta in case it wasn't creamy enough. This needed neither. I wasn't crazy about the cooking method which I believe wasn't as good as it could have been. I didn't like the idea of boiling the vegetables rather than sweating them, and two different mixtures, a \"beer mixture\" and a \"cheese mixture\" was totally unnecessary. I sweated the vegetables in the butter for about 10 minutes, added the flour, then cooked that another couple of minutes. Stirred the half and half in gradually, added the beer, chicken broth, mustards and Worcestershire sauce, brought it to a boil and simmered for about 10 minutes, stirring fairly constantly, until creamy and thickened. I removed it from the heat, then stirred in the cheese a little at a time until combined. I garnished each serving with crisp, crumbled bacon which only gave it an extra flavor punch (I swear bacon makes EVERYTHING taste better!). This is creamy, silky smooth, not too cheesy but cheesy enough, and very pleasantly flavored.  Sometimes cheese soups (especially in restaurants) can be gloppy and pasty but this was refreshingly light by comparison. So while the cooking method needed work this still is a solid four star recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-28T20:48:02.25Z",
                "reviewBody": "The flavor is excellent, but you will have definite texture issues if you follow the instructions as written. Cheese and cream curdle very easily! To prevent the gritty texture many complain about here (and cut down on wasted extra pot to clean), I suggest making the following changes:\n1st saute the vegetables in butter until they are tender. Then add the flour and dry mustard, stirring constantly until well mixed. Then add broth, beer, hot sauce, and spices. Cook for about 10 minutes or until warm, and then REDUCE the temperature to medium low. This will prevent curdling when you add your dairy next. Gradually add half and half and simmer for 10-15 minutes to thicken, stirring periodically. DO NOT ALLOW TO BOIL as this causes curdling. )Watch carefully, as this can happen quickly.) Then remove the pot from heat and gradually add cheese by small handfuls, stirring constantly. Stir in Dijon and Worcestershire, and put the pot back on to simmer on LOW for about 10 minutes.\nThe key thing here is to keep the temperature low! Also, adding cheese at the end will prevent it from reacting with the beer, which can also cause it to curdle, especially if it is too hot or cold when added.\nBy the way, this recipe is great the next day, too. Just remember to reheat it gently!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pauline Sundby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3247168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-13T01:33:30.51Z",
                "reviewBody": "Against my better judgment, I followed the instructions exactly.  The finely chopped vegetables never got very soft and I cooked them for about 30 minutes.  It smelled great, but the texture was disappointing.  We ended up straining out the vegetables.  I used a bottle of Sam Adams Boston Ale, but it was a little bitter.  I will make this again, but with the following 2 changes.  I will saute the vegetables in butter until they are extremely soft, then I will simmer in the broth and a pale ale.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah McKeown Schafer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/914492/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-29T22:45:49.3Z",
                "reviewBody": "As is this soup rates a 5. It's delicious relatively simple and includes my favorite veggies to have in creamy soup. I've made it a few times just like the recipe and changed it once adding diced red pepper and cumin along with half pepper jack garnishing with tortilla strips for a southwestern thing. Both versions are on semi-regular rotation now! Not only is this a great recipe but it's a good jumping off point too. Also the flavor of the beer really shines through and dark beers work better (not stouts but a heavy lager is perfect!).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "METALMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/420855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-26T21:06:34.577Z",
                "reviewBody": "Simple and delicious, earns bonus marks for freezing well. However, I don't recommend putting popcorn on the top - mine turned soggy within moments, so I scooped the pieces out and substituted for croutons instead. Otherwise, no problems! This is a definite keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHELS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2255136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-14T00:29:44.42Z",
                "reviewBody": "This Chicagoian knows that any cheesehead recipie is going to be good! It has the right blend of spices.  I used a little different cheese...I used a 2 year aged Wisconsin white cheedar (to make it even more Wisconsin-like). My beer of choice was Blue Moon.  This made for a very warm and fuzzy feeling!  Served with a hot pretzel! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2636867/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-05T20:06:37.653Z",
                "reviewBody": "This is the first beer cheese soup I have tried to make and it turned out great! I've had differant varieties of it at differant Super Bowl parties over the years and Have always enjoyed it. The only thing I did a little differant is I grilled some Brats untill well done and smokey then ground them up and put them in the soup. It was AWESOME! Go Seahawks!! Also used a little more cheese one cup of shredded parmigon chese and a bout 2 bottles of henrys fall lager.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SALMONSNAGGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/785040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-14T02:35:57.92Z",
                "reviewBody": "I'm also a Wisconsin native and have had my share of Beer Cheese Soup around this fair state. This one just didn't do it for me - mainly because it just wasn't rich and creamy. The rest of the family enjoyed it though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicki Lanzendorf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wintermom9597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-03T16:59:57.047Z",
                "reviewBody": "This was a great base recipe, but I followed my instincts and changed a few things around, which made for a successful, delicious and filling soup!!  I used a full stick of butter and divided it.  I put half in my stock pot, let it melt a little, then threw in all my veggies.  I also added two more cloves of garlic.  I omitted the hot sauce (I don't care much for the vinegary flavor of hot sauce), but I liberally sprinkled the veggies with cayenne, a touch of chili powder, paprika, kosher salt and cracked black pepper.  I sauteed them for about 8 mins together.  Then, I sprinkled about a Tbsp of flour across the veggies and allowed that to cook for about 4 or 5 minutes more.  I poured in the beer first, so the flavor could penetrate the veggies, and let the alcohol cook off.  Then I added the stock and a dash or two of worcestershire.  I allowed that mixture to cook for about 30 mins.  In another pan, I melted the other half of a stick of butter.  I used the flower to build a roux and allowed that to brown.  Then, I added the half and half, little by little, incorporating it completely into the roux.  I stirred until smooth and creamy, then slowly added it to the simmering beer mixture.  I added a tsp of dijon mustard, a few more splashes of Worcestershire, about a tsp of dry mustard, cayenne, salt and pepper (if needed).  I let it sit on low, for about 10 more minutes just to let the flavors meld together.  I served with a large crusty baguette and it filled up the family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christie Biggers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/807903/"
                }
            }
        ]
    }
]