[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/509/main-dish/pasta/macaroni-and-cheese/",
                    "name": "Macaroni and Cheese Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16831/main-dish/pasta/macaroni-and-cheese/stovetop-macaroni-and-cheese/",
                    "name": "Stovetop Macaroni and Cheese Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/87860/creamy-macaroni-and-cheese/",
        "name": "Creamy Macaroni and Cheese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F268654.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2018-06-08T13:27:06.000Z",
        "description": "Macaroni and cheese is perfect supper food. It's a kids' favorite, and adults like it too. My recipe is simple and almost as quick as the boxed variety.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 tablespoon salt",
            "1 pound elbow, shell or other bite-size shaped pasta",
            "2 (12 fluid ounce) cans evaporated milk",
            "1 cup chicken broth",
            "3 tablespoons butter",
            "⅓ cup flour",
            "1 ½ tablespoons Dijon mustard",
            "½ cup grated Parmesan cheese",
            "Freshly ground black pepper",
            "1 pound grated extra-sharp cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring 2 quarts of water to boil in large soup kettle. Add salt and pasta. Using package directions as a guide, cook until al dente. Drain. To prevent sticking, drain and immediately pour onto a large lipped baking sheet and let cool while preparing sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, microwave the milk and chicken broth in a 4-cup Pyrex measuring cup or bowl until hot and steamy (not boiling). Melt butter in the empty pasta pot; whisk in flour, then hot milk mixture. Continue to whisk until thick and bubbly, 3 to 4 minutes. Whisk in mustard, Parmesan and pepper. Turn off heat, stir in cheddar until melted.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add drained pasta (and optional flavoring ingredients, see notes) to sauce, and stir until everything is well combined over low heat. Stir to heat through, and thin with a little water if the sauce is too thick. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Macaroni and Cheese Recipes",
            "Stovetop Macaroni and Cheese Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "USA WEEKEND columnist Pam Anderson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.067357512953368,
            "ratingCount": 579,
            "itemReviewed": "Creamy Macaroni and Cheese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "529.1 calories",
            "carbohydrateContent": "47.1 g",
            "cholesterolContent": "82.3 mg",
            "fatContent": "26.5 g",
            "fiberContent": "2.2 g",
            "proteinContent": "25.1 g",
            "saturatedFatContent": "16.1 g",
            "servingSize": null,
            "sodiumContent": "1202.9 mg",
            "sugarContent": "8.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-06T23:09:37.187Z",
                "reviewBody": "This is absolutely amazing mac and cheese and I am picky when it comes to my mac and cheese! Here are my thoughts:\n1. For those who think its too saucy or grainy, it may be because it wasn't whisked long enough in the part where you whisk the flour/butter and milk mixture. The recipe said 3-4 mins, but it took me almost 12 minutes to get it thick and bubbly like it asked for. I know in making things like this before, if you don't do it long enough, it won't be quite right. So put in the extra elbow grease and stir! : )\n2. I am a cheese lover. I used fresh grated parmesan and also added 1 cup of mozzarella in addition to the sharp cheddar. I also find adding other cheeses to sharp cheese sauces helps to cut out any graininess.\n3. I omitted the step of pouring the noodles onto a cookie sheet. I simply added a teaspoon of oil into the water when cooking the noodles, drained them and left them in a strainer with a plate on top. I had no problems with sticking and it was easy.\n4. This makes a TON and I mean a ton! I will probably 1/2 the recipe next time since there are only 2 of us but we already are looking forward to eating leftovers!\n5. I omitted the salt, took out 1 T of butter, used 2% milkfat cheese and low fat evaporated milk and there was no difference in taste.\n6. This will be a hit at potlucks, baby dinners, etc..and we will make it often!\n7. My picky 4 year old ate two bowls!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Warner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-27T15:54:52.063Z",
                "reviewBody": "This macaroni and cheese is awesome! I also used Alton Brown's recipe until I found this one. Its easier and just as good if not better! If you really like Kraft or Velveeta brands of mac/chs you probably won't like this. If you like real homemade Mac&chs you will love this! I changed the servings to 4 and it still made a ton! The only changes I made was to use ground mustard instead of Dijon (too strong) and only 1/2 of a tsp (for 4 servings) or 1 tsp for the full 10 servings. Too much is overwhelming. I also substituted heavy cream instead of evaporated milk and that made it unbelieveably creamy. In fact I tried the evaporated milk when I made it a second time and I will NEVER make it that way again. It did not compare to the cream. I would recommend half and half or cream. And I also used a few slices of velveeta to make it creamier and not grainy but if you cook the butter and flour well you won't get the grainyness anyways. Very very delicious. My new favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1490790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-20T17:48:55.89Z",
                "reviewBody": "Superb.  The best homemade mac and cheese.  Huge hit hit the kids. I excluded the parmesan cheese, mustard, and pepper and it still came out great.  It didn't stir for 30 minutes as other raters did, although I did stir for 10 minutes which is longer than the recipe said.  Left overs heat up excellent without the cheese getting clumpy.  Excellent for school lunches.\nWill definately make again.\nUpdate:\nWhen I made the second time I found that heating the broth mixture for five minutes in the microwave reduced the amount of time needed for stirring to five minutes.  Also, if you stir too long before adding the cheese then it comes out too clumpy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Yvonne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/577835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-21T22:41:59.153Z",
                "reviewBody": "This was really really good and so much easier than the mac & cheese recipe I've been using (Alton Brown's). It was a bit thick though so next time I think I'll add an additional can of evaporated milk. Also to suit my family's tastes I added a bit of garlic and onion powder to the roux before adding the liquids. Also used dry mustard powder (maybe 1/2 a teaspoon?) instead of the dijon. I also used a third each of sharp cheddar mild cheddar and monterey jack. The \"grittiness\" several previous reviewers noticed is due to using only sharp cheddar-- I just read about that somewhere and using milder cheeses definitely results in a smoother creamier texture. Finally I did pour this into a casserole and baked it for about 30 minutes until it started to brown on top. My picky 11 year old loved this as did my husband (and I!) so this is now going to me my new mac & cheese recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/213749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-02T17:03:43.43Z",
                "reviewBody": "I would give this zero stars if I could. The dijon mustard overpowered the dish and I'm pretty sure the parmesan also played a part in that. The sauce is way thick and the sauce to pasta ratio is way off. I would never recommend this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CariMel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2105978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-04T00:36:45.22Z",
                "reviewBody": "Fantastic Mac & Cheese!! Only thing I did different was use 1/4 tsp Dry Mustard instead of Dijon and one can of milk. Only bad thing about this recipe was everyone ate all of it and I had none for a late night snack. Boo Hoo. This one is a definite keeper!! Thank you for sharing. I am now the official Mac & Cheese maker for all family functions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avg_Guy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2723944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-29T00:04:46.217Z",
                "reviewBody": "This is perfect..except for the amount of time needed to stir & thicken sauce (on medium heat)it took me 30 minutes of constant stirring, which is the right way to do it if you want to avoid graininess. I only had one can of evap. milk,so i just refilled the can (to measure)with 2% milk. I didnt have dijon, and liked it better anyway with dry mustard. I added the salt & pepper periodically, and think i used less than a tablespoon of salt.I didn't want the sauce too thick, so i added the rest of the 14 oz can of chicken broth i opened.I also added just a dash of tumeric(its yellow & good for you). This recipe is a keeper, thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonnie Franklin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/915821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-24T16:52:40.22Z",
                "reviewBody": "Although this was the creamiest mac and cheese I ever had it was WAY to saucy for us! Also I didn't care for the Dijon in the sauce (I even cut back a little on the Dijon) and it overpowered it. We had to throw the whole batch out:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Sell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-03T16:56:44.973Z",
                "reviewBody": "This was really good homemade mac and cheese. I omitted the parm cheese and baked it for 20 min. Very yummy. I do like the Dijon mustard but if you don't the base works without it and you can jazz it up with your own custom flavors (garlic onion etc.).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "leslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2441809/"
                }
            }
        ]
    }
]