[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/90397/apple-coconut-bread/",
        "name": "Apple Coconut Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F495339.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:27:33.000Z",
        "description": "A fresh tasting quick bread with apples, coconut and cranberries. Perfect for a chilly fall day. It can also be made vegan if you use a vegan margarine in place of the butter.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "4 teaspoons baking powder",
            "1 teaspoon baking soda",
            "½ teaspoon salt",
            "1 tablespoon ground nutmeg",
            "1 ½ tablespoons ground cinnamon",
            "¾ cup soy milk",
            "1 tablespoon vanilla extract",
            "½ cup butter or margarine, melted",
            "3 apples, cored and chopped",
            "½ cup sweetened dried cranberries",
            "1 cup flaked coconut"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, baking powder, baking soda, salt, nutmeg and cinnamon. Make a well in the center, and pour in the soy milk, vanilla and melted butter. Stir just until dry ingredients are moistened. Mix in the apples, dried cranberries and most of the coconut. Reserve a small handful for sprinkling over the top of the loaf. Pour into the prepared loaf pan, and sprinkle reserved coconut on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 40 to 45 minutes in the preheated oven, until a knife inserted into the loaf comes out clean. Cool for at least 5 minutes before removing from the pan.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Im A StAr"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 2.4285714285714284,
            "ratingCount": 7,
            "itemReviewed": "Apple Coconut Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "262 calories",
            "carbohydrateContent": "38.4 g",
            "cholesterolContent": "20.3 mg",
            "fatContent": "10.3 g",
            "fiberContent": "3.2 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "402.7 mg",
            "sugarContent": "10.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-11T19:20:20.7Z",
                "reviewBody": "The ingredients in this recipe sounded so great I decided to try it. My first hint of trouble was when I mixed the batter and it had the consistency of flour and water - very gummy and hard to stir in the cranberries and apples. I could never really get the apples to 'blend' into the batter because it was so thick and doughy..it was unlike the consistency of any quick bread I've ever made. Not \"pourable\" at all... and then i realized it had no sugar in it whatsoever. But I mixed it as best I could and put it in the oven...set at the recommended temp and set the timer....to make a long story short it took about 30% longer to bake than suggested (inserting a knife as the ultimate test). When it was finally done and cooled we tried it - very disappointing. A very tasteless batter and the apples sticking out on the top (since I couldn't get them all mixed in) and coconut topping were overdone. A very expensive failed experiment. I even carefully checked to make sure I had not left something out. Nope. I followed the directions to the letter. Fortunately my husband is the ultimate tightwad and will eat just about anything rather than see it go to waste. Have a party hon!;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNDI!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-22T22:46:14.917Z",
                "reviewBody": "The idea of the recipe is fantastic. The combination of apples (I used tart granny smith) and sweet shredded coconut along with sweet and tart cranberries is magnificent. Ok the measurement of the recipe has a little problem so what? It can be fixed easily. Use 2 cups of flour 1-1.25 apples 1/4 cup of oil or more if needed and keep everything else constant. I omitted putting additional coconut on top but it would have been fine to either way. I just didnt feel like having any on top. It's a very tasty recipe. Perhaps the original cook had 2 loaves in mind and messed up with the liquids. At any rate my philosophy cook with your eyes and hands and let your experience lead the way. Don't rely on exact measurements. Recipes are created from the heart not cups and spoons. Measuring with your eyes is way more accurate than measuring utensils because everyone has unique tastes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "creativeoutlet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5119883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T19:16:58.237Z",
                "reviewBody": "I also thought the combination of ingredients for this recipe sounded great however this turned out to be the worst bread I have ever made! It was missing sugar and when baked the actual color looked terrible. When I cut it it looked like some kind of uncooked meat. It also required an additional 30 to 45 minutes of cooking time which then burned the coconut on the top. The recipe also did not specify the type of apples to use and the combination that I used just did not work...very bland. I do not suggest making this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ginger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2615979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T17:41:21.317Z",
                "reviewBody": "There's not too many reviews on this and most of them are a bit unhappy so of course I had to try the recipe (I'm a little contrary that way). This does need adjustments I agree but I also agree with creativeoutlet in that it's okay to change recipes around to fix the issues with them. I looked at the comments and used 2 cups of flour like creativeoutlet did put all the coconut in the dough and topped with some brown sugar instead of the coconut. The dough is very interesting (no eggs--weird!--since the submitter said something about making it a vegan recipe and regular the butter makes that impossible (and I'm sorry but I'm not going to look for vegan butter in the groc store)--maybe sub oil to make it vegan all the way so there is less confusion?) and sort of is like a thick muffin batter this way. The bread did need another 30 minutes to bake but that's what toothpicks are for. No oven is the same and mine tends to need to cook quick breads longer. Just keep testing and adding another 10 min onto the bake time until your bread is done. The bread ends up a little crumbly almost like a moist scone and it was enjoyed by all. We had guests this weekend who ate several pieces and I also took it to a baby shower and the mom to be as well as her guests loved it. So with a little tweaking this recipe is great and can be a hearty not too sweet breakfast treat. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-13T21:35:07.603Z",
                "reviewBody": "I read the other reviews followed to flour suggestion added 3 oz honey and used mixed dried fruits namely pineapple and papaya then treated it like a drop bisquit baked it for 30 min and let it rest another 10 before trying it its actually like a moist muffin just abit on the dense side. hope this helps",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "daunp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dauncooks/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-22T21:24:16.34Z",
                "reviewBody": "I baked this recipe the max time and it was still very raw in the middle so i had to nuke it to finish cooking it before we could eat it...also it doesn't say to peel the apples I think they should be peeled...having to chew the peel while eating a soft quickbread is a weird sensation...and the peels of red delicious apples turn green. The bread as a whole tasted like pine tree.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Raine Christie Ravenwolf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7905834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-12T17:22:01.11Z",
                "reviewBody": "Pretty sure it should've had sugar in the ingredient list. I added milk to moisten it up and put frosting on it to make it palatable.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10306941/"
                }
            }
        ]
    }
]