[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
                    "name": "Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/103067/jewish-grandmas-best-beef-brisket/",
        "name": "Jewish Grandma's Best Beef Brisket",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8732472.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2018-06-08T13:29:21.000Z",
        "description": "My mother makes a GREAT beef brisket. She got the recipe after watching a friend's Jewish grandmother make it. It is perfect, delicious and easily kosher for Passover. Enjoy! Great with mashed potatoes or potato latkes (latkes with this meal are also kosher) or roasted vegetables (with olive oil, salt and pepper - also kosher). Mazel Tov!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P0DT4H20M",
        "recipeYield": "1 beef brisket",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "1 (4 pound) beef brisket",
            "ground black pepper to taste",
            "2 onions, thickly sliced",
            "2 cloves garlic, peeled and cut in half",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large deep skillet or pot over medium-high heat. Season the brisket generously with black pepper. Place in the pan and cook until the surface is a rich brown color, not burnt, but dark. Lift the roast and scatter the onions in the pan. Place the uncooked side of the roast down onto the onions. Repeat the browning process.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the garlic to the pan, and fill with enough water to almost cover the roast. Bring to a simmer. Reduce heat to low and cover with a lid or tight-fitting aluminum foil. Simmer for 4 hours, turning the roast over once halfway through. The roast should be fork tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the brisket to a serving platter. Bring the broth in the pan to a simmer, scraping the bottom to loosen any browned bits. Cook until reduced to a thin gravy. Taste and season with salt and pepper if needed.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "FRIENDLYFOOD"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.211538461538462,
            "ratingCount": 52,
            "itemReviewed": "Jewish Grandma's Best Beef Brisket",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "327.3 calories",
            "carbohydrateContent": "2.3 g",
            "cholesterolContent": "74.5 mg",
            "fatContent": "26.4 g",
            "fiberContent": "0.4 g",
            "proteinContent": "18.9 g",
            "saturatedFatContent": "10 g",
            "servingSize": null,
            "sodiumContent": "49.4 mg",
            "sugarContent": "0.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-07T21:24:19.823Z",
                "reviewBody": "Needs more -- vegetables, carrots, celery, onions -- for a rich pot liquor.  Don't use water -- use a rich beef stock.   For an excellent piece of meat, be certain to buy a FIRST-CUT BRISKET!! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "philabean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2459691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-22T11:34:27.53Z",
                "reviewBody": "I am a first time cook of Beef Brisket, not to mention, that I don't often cook too much of anything else either, but I longed for the Beef Brisket Sandwich you get in a good Jewish Deli without going all the way to New York ;)  The Brisket turned out great; the flavor was exactly what I was aiming for. I thought that I had drown the brisket, as some of the other's did, the pot size is very important in proportion to the size of the piece of brisket, but as the recipe directed, ‘after removing the Brisket from the pot’, I simmered the broth with the Pot Lid ajar, until it reduced (about 1hr) to a fine delectably tasty gravy.  Yes this recipe will be well used and some of the hints in the other reviews as well, But, let us not forget this was and is the only recipe that I found that met my requirements for a Delicious mouth-watering Brisket of Beef sandwich.  My Gratitude and Appreciation to you FriendlyFood for submitting and sharing your Mothers Recipe.  Note: This was the first time since my Mother passed that I used her old seasoned & blackened (Dutch oven), I think that’s what it’s called?  Anyway it brought back many fond memories of her in the kitchen cooking her favorite recipes such as pot roast or turkey & giblet gravy.  Thanks & Regards\n\nRECIPE NOTES:\n •  Be careful with the pepper (Don't over season, you can't change after it is cooked and too much pepper will make the Brisket inedible. If your not sure(try dusting off excess pepper before cooking)\n\n•  Be sure to N",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Easycooker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3140365/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-20T21:20:12.33Z",
                "reviewBody": "I made this recipe and added one more ingredient it turned out fabulous!! The other ingredient I added was a packet of onion soup mix. I did not add the beef broth but added water as the recipe directed and with the onion soup mix the gravy turned out thick and wonderful! Thank You.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sabrina S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1862380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-18T23:34:23.327Z",
                "reviewBody": "I'm not a fan of corned beef which is how most people prepare beef brisket. I have used a similar recipe like this for years the only differences are: I brown the roast completely before adding the onions and as I allergic to garlic I leave that out. The size of the pan determines how much the liquid will reduce. If you roast in a dutch oven there will not be much reduction so use less water. When I make it I fill only half up the roast. If you use a more shallow pan fill to cover the roast. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mermaid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2317889/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-10T18:38:45.563Z",
                "reviewBody": "This recipe saved my dinner. I had an extra large brisket so I cut it in two and made this and Oh So Tender Brisket. The other turned out like jerky (my fault I think the recipe has great potential) so I was happy to have this as backup. I had a few issues with the actual execution of the recipe. I couldn't figure out how the uncooked side of the meat would brown on top of onions so I browned it before adding the onions. Because the onions were thickly sliced adding the liquid to nearly cover the meat results in swimming meat when the onions cook down and a LOT of liquid left at the end. I used beef broth (1 can regular 1 can Campbell's double strength). I made gravy and the flavor was good but pretty salty so I'll adjust the broth content next time. The meat was wet but not moist (if that makes sense). I've never made brisket before so that may just be the nature of the beast. The simple ingredients really allowed the meat flavor to take center stage and meat purists will appreciate the taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMABEAR2TWOCUBS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1464766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-28T21:33:11.7Z",
                "reviewBody": "My picky bf and son loved this. This was my first time to cook a brisket so I don't know what I did wrong. I followed the recipe exactly but the brisket did not come out fork tender as stated. Also my gravy was more like water (maybe I put too much). I put enough to almost cover the meat. I will try this again with less water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/206576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-22T01:47:33.85Z",
                "reviewBody": "This was my first time making brisket and it was awesome. It was so tender and flavorful and the gravy was so good. I can't wait to have it again. Thanks for posting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MGBJERRY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1052210/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-25T19:00:35.207Z",
                "reviewBody": "This is truly fabulous. I used Better th n Boullion kosher salt and dried onion for my base in addition to the list here...Also added carrots (baby peeled) celery and extra fresh garlic and fresh onions. I served it with garlic mashed potatoes. I did one major thing different: For the first 2 1/2 hours I simmered it in a covered deep saute skillet on the stovetop. Then I transferred it for the remaining 2 hours to the oven covered at 260 F. I found that this made a thicker richer liquor. At the end of 4 hours we ate (it was terrific) and I left it in the oven for another 3 hours on 200 F and it was even better. I bet by tomorrow it will be so tender that it will melt in the mouth. Thank you so kindly for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "L Gascco",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4942621/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-08T02:07:14.523Z",
                "reviewBody": "I really love brisket after all I'm Jewish. The thing is this recipe and most I have found leave this overcooked dry outcome. Whenever I go to those fancy buffets that serve brisket they are serving it with lots of pink inside and to be honest this is the way I really like it. The other way requires lots and lots of soaking in sauce to make it tender and I don't really have the patience or inclination to do that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tricia ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1570625/"
                }
            }
        ]
    }
]