[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2268/main-dish/savory-pies/pot-pie/",
                    "name": "Pot Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16181/main-dish/savory-pies/pot-pie/chicken-pot-pie/",
                    "name": "Chicken Pot Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/113131/simple-classic-chicken-potpie/",
        "name": "Simple, Classic Chicken Potpie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F528193.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2018-06-08T13:30:52.000Z",
        "description": "Shredded rotisserie chicken and sherry lend this classic potpie a rich, comforting flavor.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H38M",
        "totalTime": "P0DT1H23M",
        "recipeYield": "2 pies",
        "recipeIngredient": [
            "6 cups roasted, shredded rotisserie chicken",
            "1 (15 ounce) package refrigerated pie crusts",
            "2 tablespoons vegetable oil",
            "2 medium onions, chopped",
            "3 small stalks celery, cut crosswise 1/4-inch thick",
            "2 cups chicken broth",
            "1 (12 fluid ounce) can evaporated milk",
            "⅓ cup butter",
            "9 tablespoons all-purpose flour",
            "¾ teaspoon dried thyme",
            "¼ cup dry sherry or white wine",
            "Salt and ground pepper",
            "¼ cup chopped fresh parsley",
            "1 (16 ounce) package frozen peas and carrots, not thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Adjust oven rack to low-center position; heat oven to 400 degrees. If using whole rotisserie chickens, separate meat from skin and bones, and tear into bite-size pieces. Discard skin and bones. Then remove pie dough from its box and follow directions for bringing to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in Dutch oven over medium-high heat. Add onions and celery; saute until just tender, about 5 minutes. Transfer to a large bowl along with the chicken; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, microwave chicken broth and milk in a microwave-safe bowl until steamy, 3 to 4 minutes. Heat butter over medium heat in the empty pan. When foaming subsides, whisk in flour and thyme; cook until golden, about 1 minute. Whisk in hot milk mixture. Bring to simmer, then continue to simmer until sauce fully thickens, about1 minute. Turn off heat, stir in sherry or wine, and season to taste with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir chicken mixture, parsley and the peas and carrots into the sauce. Divide mixture between two 9-inch deep-dish pie plates. Top each with pie dough, and flute crust by pinching with your fingers. Set on a baking sheet and bake until pastry is golden brown and filling is bubbly, 30 to 35 minutes. (Optional: Wrap second potpie in freezer wrap and freeze for a later meal. Remove wrapping, place potpie on a baking sheet and bake at 400 degrees until golden and bubbly, about 1 hour.)\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Pot Pie Recipes",
            "Chicken Pot Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "USA WEEKEND Pam Anderson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.744897959183674,
            "ratingCount": 196,
            "itemReviewed": "Simple, Classic Chicken Potpie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "479.5 calories",
            "carbohydrateContent": "29.4 g",
            "cholesterolContent": "77.3 mg",
            "fatContent": "29.6 g",
            "fiberContent": "3.1 g",
            "proteinContent": "23.6 g",
            "saturatedFatContent": "10.2 g",
            "servingSize": null,
            "sodiumContent": "398.2 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-05T01:51:15.563Z",
                "reviewBody": "Simply the best chicken potpie I have tasted and my family loves it. This is my second time making it and decided to use Sherry Cooking Wine, definitely tasted a lot better than White Wine. I would recommend a bottom and a top crust, but cook the bottom crust for about 5 minutes that way your bottom crust will be more crispy. Also, add a 15 oz can of diced potatoes and cut the frozen vegetables to 1 cup of carrots or corn and 1 cup of peas (if you like them) and I mixed everything in one pot this time and still turned out GREAT!!!  Too many dishes last time. Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Terri Newton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2724089/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-19T18:52:33.697Z",
                "reviewBody": "This is absolutely a great recipe. It lays out the steps of making a roux and when to add fresh veggies or frozen. I doubled the veggies at the begining adding 4 carrots, onion, celery and 3 cloves minced garlic. I also sauted 4 cups of mushrooms until the liquid had evaporated and set them aside to add with the peas. I also added red pepper flakes for some heat to the sauce. Lastly to lighten it up, I used fat free evaporate milk and low sodium broth. I made this in a casserole dish and used Bisquick for the crust. Followed the recipe on the box,  2cups bisquick, 1 cup milk and 1 egg.  After 10 min in the oven I brushed it with egg white wash.\nIt turned out beautiful and brown. I let is rest for almost an hour. It was perfect to cut into, maintained its shape. What awesome comfort food!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARNZ01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1265197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-06T19:09:28.603Z",
                "reviewBody": "Classic comfort food!  I made my own crust...so easy:  2 cups all purpose white flour, 2 1/2 t. salt, 1/2 cup vegetable oil, 1/4 cup cold milk, waxed paper.  Place flour and salt in small mixing bowl.  Measure milk and oil, then pour together over flour.  Quickly stir with a fork (do not over mix).  Press dough into ball--do not knead and cut ball in half.  Working with each half, press into flattened circle and place between 2 sheets of waxed paper.  Using a rolling pin, roll each dough half to size needed to cover pie plate.  Remove top waxed paper and using bottom paper to assist, flip crust over onto pie plate.  Then remove second wax paper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tizzylizz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1150935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-09T20:45:19.007Z",
                "reviewBody": "This was fantastic! In addition to the vegetables called for I added a small diced potato and some frozen peas. The sherry is an absolute must for a rich savory sauce. Will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCARLETT1211",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1350411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-08T23:21:59.093Z",
                "reviewBody": "I couldn't believe how good this turned out. I joined the Allrecipes club just so I could rate this recipe. I was never a fan of peas and carrots but I used baby sweet peas (which were great!) and instead of carrots I used corn and whole button mushrooms. I also added a little nutmeg and I used 2 crusts for each pie (1 for top & 1 for bottom) instead of only 1 crust. The cream sauce tastes wonderful and when the pie is cut the sauce does not run out like with frozen pot pies so it cuts very nicely. I also boiled boneless chicken breasts instead of using rotisserie chicken and it came out great! Enjoy! It really tastes great!!! I will make it again & again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2278357/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-01T23:35:48.577Z",
                "reviewBody": "This is my favorite meal to give to friends when a new baby comes or someone could use an easy dinner. What's best is that it makes 2 so I can keep one and give one away. I've made it several times now and do not vary at all from the recipe. I may try adding the bottom crust sometime but I do love it as is. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1911434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T00:31:00.32Z",
                "reviewBody": "My husband is not a fan of of chicken potpie but LOVED this recipe. Made half the recipe (should have made the entire recipe as it was that good) and added a clove of garlic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mtarrango",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6378024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-02T12:50:07.187Z",
                "reviewBody": "I was looking for a recipe for chicken potpie that was not made with canned soup. I was so please when I ran across this recipe - IT IS PERFECT. I made just as stated with the exception of adding two minced cloves of garlic. To be honest I think the garlic was not a good addition and I will not include it next time I make it. (This coming from a garlic lover!) I could taste the sherry in this dish and it just made over-the-top good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1725045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-01T09:16:05.003Z",
                "reviewBody": "Uncluttered, uncomplicated goodness. As those diners from the 40s used to advertise in neon window lights, \"Good Eats\"!! The Sherry imparts a subtle sweetness. Knowing this, I used half Chardonnay in place of half the Sherry. I also sprinkled in about 2 tsp fresh lemon juice and laced gently with a tsp of white wine Worcestershire sauce, which lends a lovely depth to the flavor, but is by no means required. Also stirred in one tsp Dijon mustard and some snipped rosemary from the garden. Just lovely. Comfort food, times 10! BTW, if you want to prep it completely the night before, you can do so by simply brushing a thin coating of butter on the bottom crust (to seal the pastry against becoming soggy from the moisture in the filling,) pouring the filling in the sealed crust, topping with the second crust, fluting, covering and refrigerating. Just preheat the oven and bake when you come home from work for a complete, easy, homey dinner. Edited to add: Since this is now a beloved family favorite, I invested in a super dry Sherry from Jerez, Spain, the home of genuine Sherry.  Expensive, but so worth it! I have dropped the half white wine, using only this  Sherry. Outstanding! I wouldn't have thought it was possible to improve, but this increased the wow factor exponentially.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-10T00:58:49.733Z",
                "reviewBody": "Eh I don't know this was just o.k. for me. I followed the recipe exactly and didn't find anything special about this recipe not any better than any of the other chicken pot pie recipes I have tried. I might try it one more time but it's not at the top of my list.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LRD1974",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/908499/"
                }
            }
        ]
    }
]