[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1469/main-dish/beef/pot-roast/",
                    "name": "Pot Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/131931/stove-top-pot-roast/",
        "name": "Stove Top Pot Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3930316.jpg",
            "width": 3072,
            "height": 4096
        },
        "datePublished": "2018-06-08T13:44:13.000Z",
        "description": "This is a simple and savory stove top pot roast made with turnips, carrots and potatoes. Warm up a nice loaf of bread and toss a salad, and you have a hearty meal.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT3H15M",
        "totalTime": "P0DT3H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "1 (3 pound) beef chuck roast",
            "1 red onion, chopped",
            "4 cloves garlic, crushed",
            "4 stalks celery, chopped",
            "1 tablespoon dried basil",
            "salt and pepper to taste",
            "6 medium red potatoes, quartered",
            "6 turnips, peeled and cut into chunks",
            "6 carrots, peeled and cut into chunks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large pot or Dutch oven over medium-high heat. Place the roast in the pot, and quickly brown on all sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill the pot with enough water to cover the roast. Add the onion, garlic, celery, basil, salt and pepper. Bring to a boil, then reduce heat to low and simmer for 2 hours and 15 minutes, adding water if needed to keep the roast covered. Add potatoes and turnips; simmer for an additional 15 minutes. Add carrots; simmer for 30 minutes, or until roast can be pulled apart with a fork. Taste, and adjust salt and pepper if needed before serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Pot Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "sarah"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.166666666666667,
            "ratingCount": 108,
            "itemReviewed": "Stove Top Pot Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "607.9 calories",
            "carbohydrateContent": "52 g",
            "cholesterolContent": "103.4 mg",
            "fatContent": "30.2 g",
            "fiberContent": "8.7 g",
            "proteinContent": "33 g",
            "saturatedFatContent": "10.8 g",
            "servingSize": null,
            "sodiumContent": "231.4 mg",
            "sugarContent": "11.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-08-22T00:32:49.83Z",
                "reviewBody": "I think this would have been boring if I made it as described.  With a few slight modifications it became a complete delight.\n\nI used some diluted chicken broth (didn't have beef) instead of water.  Your liquid will cook down so you don't need to use the stock at full strength.\n\nI used a smaller roast (1.5 pounds).  Added a splash of shiraz, a dash of worcestershire sauce, and about 2 tbsp of molasses at the same time as the stock.  Also, I added the celery tops and thin bits (don't throw out the leaves - they are good seasoning in stews and roasts).  When adding the potatoes, I also added a splash of soy sauce and about 1 tsp of tarragon flakes, and another tbsp of molasses.  At the end of the line, about 5 minutes before removing from the heat, I added a good splash of shiraz and a very healthy grind of fresh black pepper.  Don't put the pepper in too early as the recipe instructs, as you will cook the flavor out of it.\n\nI cooked this recipe with a lid half on, and had to add about 1 cup of water halfway through.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DannyBoy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2413853/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-24T01:51:15.327Z",
                "reviewBody": "This review is for mainly the method. I'd never braised a roast on the stove top before so I was very happy when my boneless shoulder roast came out very tender. We don't like our veggies too mushy so I didn't cook them with the roast. I just followed the recipe for the spices. Smelled great while cooking and the roast was tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRICIAJONES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/948695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-12T19:51:59.923Z",
                "reviewBody": "I used beef stock instead of just water to give it more flavor.  This is a really great classic roast beef dinner.  I did leave out the turnips though, noone in my house will eat them.  But with the carrots and potatoes it was still great.  This is defenitly a new favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "tanyaj122",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1715132/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-22T23:47:50.04Z",
                "reviewBody": "This was the most aromatic and delicious dish I have ever made!  I did change a lot around, though, and am so happy that I did.  I also added beef stock, molasses, worcestershire and extremely healthy \"splashes\" of red wine.  I used a great deal of sea salt and fresh cracked pepper to season the roast.  Then, I chose to use 3 tbsp of olive oil and put a really hard sear on the beef so that all those yummy juices were sealed in.  I added the onion to the oil and cooked for about 4-5 minutes, then the garlic for about 2 minutes, so some nice carmelization could add texture and depth of flavor.  I used about 3 parts beef stock to 1 part water until I covered the roast, and then added some Worcestershire and a good dose of red wine (I used a Zinfandel).  Once it came to a boil and I reduced heat to a simmer, I also added 2 bay leaves and the stems from the fresh parsley that I add later in the recipe.  When I added the potatoes, I doused the stew in wine again.  And again when I added the carrots.  Once I turned off the heat, I chopped up from some fresh Italian parsley and basil and added them, along with salt and pepper.  Fresh herbs retain their flavor best if added at the end of cooking.  Finally, I removed the roast and tore it into chunks, then I added it all back to the pot and cooked another 10 minutes just to really add to the tenderness of the beef.  It was just so wonderful!!  In fact, I found myself in there picking at the potatoes again and it's 7am!  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christie Biggers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/807903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-12T19:49:26.753Z",
                "reviewBody": "We loved this method of cooking pot roast! The roast was tender and juicy. We took some of the tips like using beef broth to cover the roast and omitted the turnips. It is replacing our bake in oven bag method we have used for years. Thank you for posting this recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Toni R",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1823834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-07T22:17:20.697Z",
                "reviewBody": "I followed the suggestion to substitute beef broth and the recipe was very good. My roast was almost 4 pounds but for some reason it cooked in less than 2 hours. Use a meat thermometer to check if the roast has reached the desired temperature so you don't overcook it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Darlene M Wermers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2422666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-31T13:21:49.247Z",
                "reviewBody": "What can I say about this wonderful recipes?!? NO LEFTOVERS!! The only substitute I did was using beef broth. This took the place of my usual pot roast recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LisaB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2222971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-19T22:07:31.757Z",
                "reviewBody": "It was a nice change of pace rather than roasting in the oven or the slow cooker. I added boullion to the water, as well as worcestshire sauce, red wine, and a small can of tomato paste. I didn't even have to thicken the sauce since it was thick enough after cooking down the meat. My 3.25 lb. roast took about 1.5 hours to cook with the lid partially on, then another 30 minutes for the carrots and potatoes (the store didn't have any turnips). We really enjoyed it, and are looking forward to open face sandwiches and gravy tomorrow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine LaRue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1999857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T15:50:08.53Z",
                "reviewBody": "This rating is based on the cooking method only. I make pot roast one way but will change the cooking method from the crockpot to slow cooking it in the oven. I kept forgetting to put the roast on to cook because I was sick and distracted. Finally I thought of the stove top method and found this recipe to help me out. I browned the pot roast as directed. Seasoned it with salt and pepper and browning sauce. Put a can of beef broth in the pot and simmered away. I kept checking it the way I would if it was in the oven but I really didn't need to. I never had to add any additional water. It was so tender and the gravy was wonderful. This will be my method from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amanda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1453067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-02T22:11:38.807Z",
                "reviewBody": "Made this as directed and was disappointed with how bland everything was. The meat just tasted like boiled meat - the seasonings didn't penetrate the meat like other recipes I've tried. Also I don't think the vegetables spend enough time with the beef in this method. They were lacking that yummy \"infused\" taste. I have a friend who makes the best pot roast and she does it on the stove top so I had high hopes for this recipe. This was definitely the least enjoyable pot roast I've ever made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Tasha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2457404/"
                }
            }
        ]
    }
]