[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/135645/russian-chicken-with-feta-cheese/",
        "name": "Russian Chicken with Feta Cheese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F216945.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:45:01.000Z",
        "description": "This is a great recipe for anytime-but it's especially great for those of us who like to cook several meals on the weekend in preparation for a busy week. You can make this half way and then thaw and finish mid week... it's great.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "8 chicken breasts",
        "recipeIngredient": [
            "3 tablespoons butter",
            "8 skinless, boneless chicken breast halves",
            "2 tablespoons butter",
            "1 clove garlic, minced",
            "¼ cup finely chopped onion",
            "1 tablespoon all-purpose flour",
            "¼ cup vodka",
            "1 tablespoon tomato paste",
            "¾ cup chicken broth",
            "½ teaspoon salt",
            "½ teaspoon ground black pepper",
            "1 ½ teaspoons dried parsley",
            "1 ½ cups sour cream",
            "¼ cup crumbled feta cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt 3 tablespoons of butter in a large skillet over medium-high heat. Add the chicken, and cook until browned on both sides and no longer pink in the center, about 10 minutes; place into a 9x13 inch baking dish and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce the heat to medium, and melt the remaining butter in the pan. Stir in the garlic, and onion, and cook for 2 minutes, stirring constantly until the onion has begun to soften. Stir in the flour, and continue cooking 5 minutes more. Add the vodka, and bring to a simmer over medium-high heat, stirring constantly. Allow to simmer for 2 minutes, then stir in the tomato paste, chicken broth, salt, pepper, parsley, sour cream, and feta cheese. Reduce heat to medium-low, and simmer 20 to 30 minutes stirring frequently.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the hot sauce over the chicken breasts, and bake in preheated oven until the top has browned, about 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TRUDY_FLETCHER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5607476635514015,
            "ratingCount": 107,
            "itemReviewed": "Russian Chicken with Feta Cheese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "382 calories",
            "carbohydrateContent": "3.9 g",
            "cholesterolContent": "139.2 mg",
            "fatContent": "21.3 g",
            "fiberContent": "0.3 g",
            "proteinContent": "37.8 g",
            "saturatedFatContent": "12 g",
            "servingSize": null,
            "sodiumContent": "372.9 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-05-11T17:39:46.14Z",
                "reviewBody": "I really want to give this recipe a 3, but my guys loved it so I'm compromising with them by giving 4 stars and whining a bit. As written, there are a couple of problems. First, if you brown your chicken breasts until they are 'no longer pink in the center,' they are DONE; any additional cooking time is overcooking them. I chose to call them done and pour the finished sauce over them, skipping the baking step. Second, there is not enough sauce for 8 chicken breasts. Double it if you are making that many. Finally, I think this recipe is a little involved for the final product. The finished sauce did not bowl me over. It's good - definitely edible, but not something I want to spend an hour making. Browned chicken breasts, bottled vodka sauce, sour cream, and feta would give you arguably more flavorful results in about 20 minutes. Again, my husband and son loved it so thanks for the recipe! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-03T16:11:37.843Z",
                "reviewBody": "I would give this more stars if possible! My husband and his friend loved this dish - especially the sauce. I only used 3 breasts and kept the rest of the recipe the same. We used the extra sauce over brown rice but it would do really well over pasta as well. The guys were even spooning the sauce over their bread! My hubby asked for it to be added to \"our faves\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNR8ER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jennr8er/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T20:00:34.073Z",
                "reviewBody": "This chicken has a great sauce! I did add a little more vodka before simmering the sauce as mine was too thick. Also I doubled the garlic and replaced the dried parsley called for with fresh. We LOVED it!!! Definitely double the sauce if serving over so mething like pasta or rice. Will make again and again! So good! Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Singer6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mattsbelly/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-10T17:46:58.043Z",
                "reviewBody": "Yummy. I used more garlic and added a little cornstarch for thickening. I didn't have quite enough sour cream but the sauce turned out fine. Also made more sauce because we like it that way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Irene Y",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/irene/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-02T13:07:27.897Z",
                "reviewBody": "I made this as written except that I doubled the sauce portion as others had suggested. I also used goat cheese instead of feta for personal preferences. I made whole wheat penne pasta and added it to the casserole dish for serving. What a combnation!! This chicken and sauce are so tender and flavorful. This was a wonderful change from typical chicken dishes. Everyone raved about this!! Served with whole wheat penne pasta a loaf of French bread and any green vegetable you choose this is the perfect meal..Yum!!!!! Thank you so much for this recipe. We loved it! UPDATE: This recipe should come with a warning. I have many other recipes that are waiting to be tested but I am having serious cravings to make this again instead. It is so good that you will go through withdrawl and crave it again and again-lol.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4068481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-08T04:00:00.237Z",
                "reviewBody": "This was delicious! I was about a quarter cup short on sour cream and doubled the garlic (because I always do) but otherwise followed the recipe. Made double the sauce and poured the extra over some gnocchi. Also used some of the extra sauce as 'gravy' over some egg foo young. This would make a great pasta sauce as well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2469726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-30T21:56:39.55Z",
                "reviewBody": "First it takes an exceptional recipe for me to rate it a 5. My judging criteria: \"normal\" ingredients ease pf prep and cooking of the recipe and of course if the whole family loves the outcome. This recipe blew away all the criteria! Easy to make with only having to buy a few ingredients and seriously the whole family really did LOVE it. I did double the sauce but only used 4 chicken breasts to start because I didn't want to waste more chicken if it was bad. (Needless to say I cooked more chicken to go with the rest of the sauce) Other than doubling the sauce followed recipe exactly. Loved the tang that the feta gave the sauce the garlic and onion still had texture and the tomato paste gave it just enough acidity to balance the richness of the sour cream and feta. The vodka was undetectable to me hubby said he tasted it. (I used a cheaper brand of vodka) Served with roasted garlic mashed potatoes and french bread. Hubby thought the sauce would be a good \"dip\" for the bread as an app-will try that idea out at my work party this week:) Thank you so much Trudy for an awesome NEW chicken recipe for us!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Mae Hinken",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16893109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-03T20:47:35.537Z",
                "reviewBody": "Tried this recipe tonight. Just thought it was okay. The flavor was good but definitely not a \"must have\" in the recipe box. We won't be making this again but worth trying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PantryDreams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1204230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-02T20:30:41.787Z",
                "reviewBody": "this dinner was ok. i made it exactly like the recipe except i added canned mushrooms. i think it had way to much sour cream. so if i make it again i would probably use only 1 cup. you couldn't taste the vodka so i will leave that out too. if serving over something definitely make extra sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "blyessing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2164181/"
                }
            }
        ]
    }
]