[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17530/desserts/fruit-desserts/peach-desserts/",
                    "name": "Peach Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/143242/peach-beehives-with-hard-sauce/",
        "name": "Peach Beehives with Hard Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F266518.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:47:42.000Z",
        "description": "These wonderful beehives melt in your mouth! Make sure each peach is completely wrapped and sealed in the pie dough strips. This way the peach skin practically dissolves during baking. This dessert is delicious, rich and different, a treat your family and company will enjoy.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 small ripe peaches, washed and dried",
            "1 (9 inch) prepared, unbaked pie crust, thawed",
            "¼ cup butter",
            "½ cup confectioners' sugar",
            "1 teaspoon vanilla extract",
            "¼ teaspoon ground allspice",
            "1 pinch salt",
            "¼ cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). Lightly grease the bottom of a shallow baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Unroll the prepared pie crust onto a lightly floured surface, and cut into 1/2 inch wide strips. Place peach stem side down, and wrap strips of dough--over-lapping rows--around the fruit so it's completely covered. For ease, twirl the peach while holding the pastry in place and overlap rows. When completely wrapped, the peach will resemble a beehive. Make sure the entire peach is covered and sealed inside the crust. Repeat with remaining peaches. Arrange the wrapped peaches in a shallow baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake peaches in preheated oven until crust turns golden brown, 35 to 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, cream butter with 1/4 cup confectioners' sugar in a mixing bowl until light and fluffy. Beat in the vanilla extract, allspice, salt, and heavy cream until well blended. Stir in the remaining 1/4 cup confectioners' sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, place baked peaches in serving bowls. Slice each peach in half and remove the pits. Spoon hard sauce over the peach halves.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Peach Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Linda B. II"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.444444444444445,
            "ratingCount": 9,
            "itemReviewed": "Peach Beehives with Hard Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "444.2 calories",
            "carbohydrateContent": "36.6 g",
            "cholesterolContent": "50.9 mg",
            "fatContent": "32 g",
            "fiberContent": "1.7 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "14.4 g",
            "servingSize": null,
            "sodiumContent": "321.8 mg",
            "sugarContent": "15.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-13T00:27:43.44Z",
                "reviewBody": "This was surprisingly easy even though I was a bit leary. I'm not very good at cutting pie crust into even slices but it doesn't really matter. LOL! I was a bit skeptical about leaving the peach pit in but it comes out extremely easily when it's sliced. Just watch your fingers--it's hot! Either my pie crust was too small my peaches were too big or I'm not very good at wrapping because I only had enough dough to make 3 beehives. I did have a tiny bit of dough left over so I decided to make bees. Don't laugh at the picture! I've never made them before! The crusts only browned a bit on top so maybe an egg wash would produce a better golden color. I didn't like the hard sauce plain before I put it on the peaches but hot over the peaches it's wonderful. It melts down and is a perfect complement. I think one peach half is a perfect serving not one peach so I guess I'll get several servings out of my three peaches.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-10T02:08:52.023Z",
                "reviewBody": "These were pretty good. My husband loved them and the kiddies thought they were really cool. I used homemade pie crust. The peaches were a little hard to wrap but it does make it easier as stated if you hold the dough in place and twirl the peach around to wrap. I also found it easier to seal the pieces with a dab of water. Do not wrap them too tight or they will break open in the oven. I had two of them do this. The cooking time was right on for me done to perfection after 40 minutes. I doubled the hard sauce because you need plenty to serve with these.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "homeschooler3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2968948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-04T07:05:14.713Z",
                "reviewBody": "Wow. These are harder than they look - Pomplemousse makes it look easy. Very cute idea - and tasty too! I used biggish peaches so only got 2 per crust (ate a whole one too!). I followed Pomp's egg wash and bee suggestions. I had a hard time getting my dough to stick to itself and ended up brushing some water on. Also be careful not to wrap your peaches too tight - they expand while baking and may crack your hive. Thanks to Linda for the recipe and Pomplemousse for the beze (yours are way cuter and resentment is the secret ingredient... xo).:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-06T12:58:34.12Z",
                "reviewBody": "I am not a fan of baked fruit ususally but my guests loved these! They are very easy other than the wrapping could be a bit time consuming. I made a homemade pie crust which was probably a lot easier to work with beacause it would stick better. Keep a bit of water next to your working space to use it as glue on the crust. I brushed thses with egg whites and sprinkled them with sugar. When making the sauce make sure your butter is soft or the sauce will be clumpy. The sauce was a great addition to these! I didn't dare try making the bee out of the crust....it would have been the funiest looking bee you ever saw!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tonna Jacobson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7334589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-23T19:41:55.847Z",
                "reviewBody": "Really really good. I'm so glad I got to this recipe before the end of peach season. I adored the hard sauce as did my husband who normally doesn't like sweets. I did a few things differently. I intended to use homemade pie crust but found some puff pastry in the back of my freezer so I used that instead. I'm not a fan of store bought pie crusts. Also it seemed complicated to me to cut the peach in half after it baked to get the pit out since I imagined the pastry crumbling. So I halved my peach took out the pit and then covered each half in pastry. (If you're gonna have to halve it before serving it anyway this seems easier. Added bonus - you get more dough and I love pastry! I'd make it again tomorrow if I didn't want to stay a size 8!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NKTAUBE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1083948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-25T19:32:11.027Z",
                "reviewBody": "This is the recipe that introduced me to Allrecipes. I absolutely love and can't bake the traditional peach pie anymore. So easy that young children can actually bake their own peach pies. I love the fact that it only uses the natural sweetness of the peach with no sugars or sweeteners added. A boom for guests who worry about their diets. It also makes a wonderful presentation if you just wrap a crust around the fruit without making a \"beehive\". I like to add a sprig of mint to look like a leaf. Yesterday I served it with bee pollen and creamed cinnamon honey from the bee farmers instead of the sauce. Totally addictive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stkimmie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4678136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-18T14:38:14.077Z",
                "reviewBody": "After reading the other reviews I think I had higher expectations for this but my guests and I found this to be only so-so. The hard sauce is very good but everyone said they would just rather have a peach pie. It is a novel way to present this but the flavor is not amazing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Auntie D in MN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861084/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-21T19:01:59.483Z",
                "reviewBody": "VERY GOOD! I used \"Basic Flaky Pie Crust\" for my dough strips and it worked very well. I added yellow food coloring to make the sauce look like honey. Thank you Linda B for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            }
        ]
    }
]