[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/916/side-dish/sauces-and-condiments/gravy/",
                    "name": "Gravy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16858/side-dish/sauces-and-condiments/gravy/pork-gravy/",
                    "name": "Pork Gravy",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/161819/bacon-gravy-for-biscuits/",
        "name": "Bacon Gravy for Biscuits",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5188110.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2018-06-08T13:50:39.000Z",
        "description": "Nothing makes biscuits better than being smothered in a Southern-style bacon gravy. Delightful!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "4 thick slices bacon",
            "1 cup milk, or as needed",
            "¼ cup all-purpose flour",
            "salt and pepper to taste",
            "1 (10 ounce) can refrigerated biscuit dough"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bake biscuits according to package directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the bacon in a deep skillet over medium heat until crisp, about 10 minutes. Remove bacon to a paper towel lined plate and keep the grease in the pan. Gradually stir in the flour so that no lumps form, then mix in the milk, continuing to cook and stir until thickened. Crumble the bacon into the gravy and season with salt and pepper before serving.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Split biscuits in half, top with gravy, and enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Gravy Recipes",
            "Pork Gravy"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Nikki Lakey"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.08955223880597,
            "ratingCount": 134,
            "itemReviewed": "Bacon Gravy for Biscuits",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "281.6 calories",
            "carbohydrateContent": "31.4 g",
            "cholesterolContent": "15.5 mg",
            "fatContent": "12.8 g",
            "fiberContent": "0.6 g",
            "proteinContent": "9.7 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "841.6 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-03T16:14:07.857Z",
                "reviewBody": "I have not made this recipe, but I have made bacon gravy since I was big enough to stand at the stove.  I gave this a 3 star (even though I haven't made it) because the recipe is PRETTY close...but if you follow Alisha's suggestions, you will get something much closer to a smooth, rich bacon gravy.  Something my mother and grandmothers passed on to me was this (if I can word it properly!)  \"Keep the numbers the same, for whatever amount of gravy you want to make.  If it's 2 Tbsp. of grease, use 2 Tbsp. of flour and 2 cups of milk.\"  I have always made my gravy following this rule and have NEVER had gravy that was too thick or too thin.  Also, do NOT add your milk all at once.  Add about 1/3 cup at a time and stir until smooth...and let it get warm before adding more milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Raoulysgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/572250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-08T02:47:45.807Z",
                "reviewBody": "Good starter recipe. It's important to have enough bacon to yield the amount of grease needed. 4 slices is a bit on the low side. I usually buy an entire pack of thick bacon and make it all. After it's all cooked and crisp, I mix flour into the grease little by little until it becomes pasty but not clumpy. Last, add the milk little by little stirring between each addition until the gravy reaches it's desired consistency. You have to wait inbetween each addition because the consistency of the milk will change when it is heated. Remember to crumble the bacon into the gravy BEFORE seasoning with salt and pepper. If you have not made bacon gravy before, the best thing to do is to take a few teaspoons of it out, put it in a cup, and season those few teaspoons until you like the taste... then season the whole pot until you match that desired taste. This way, you won't ruin an entire pot of gravy by overseasoning it.\n\nThe most important thing to realize about making gravy is that it's more intuitive than it is following a specific recipe. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alisha Fleming",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2031261/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-21T17:25:04.617Z",
                "reviewBody": "I grew up on this!  Most people know of sausage gravy and biscuits, but I had not until I was married with children of my own and moved to North Carolina.  In my house, we always ate bacon gravy and biscuits, sometimes as an evening meal!  It is so simple and absolutely deliscious, but I would suggest that you buy lower sodium bacon, it does help cut down on the sodium count.  If you use regular bacon, make sure to add it to the gravy before you test it to season it or you will make it taste briney.  This is also deliscious served with scrambled eggs and fried potatoes.  I would suggest upping the recipe by at least double, as the suggested amounts would make a very small amount which won't serve many.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tessa Kib",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/tessakib/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-03T17:26:12.94Z",
                "reviewBody": "I just love it how people blame the recipe giver for their inability to make gravy. Even if you had her sitting right their next to you it wouldn't guarantee that you'd be able to make it! Gravy is difficult to learn at first, but once you've learned it you never forget it. I can't tell you how many times I ended up w/ a skillet of lumpy \"oatmeal\" \"elmers glue\" etc.... It's all in the process of learning. There is no exact amount of flour, oil, or milk to put in. It's just kind of one of those eyeball things. Sure you can have a pretty good gestimation. Oh and there is no set time on how long it takes for the oil/flour to get to the right consistency,or when to remove from heat. If your new to this you're bound to end up w/ a skillet full of lumpy mush. If not way to go you mastered gravy a lot faster than most of us. So the moral of this rant is chill out peeps and quit criticizing her! I give her 5 stars for having the melons to put her recipe out there. You go girl!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Becca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2028368/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-09T18:37:34.993Z",
                "reviewBody": "Mine turned out great.  I followed the tidbit that raouglysgirl gave: \"If it's 2 Tbsp. of grease, use 2 Tbsp. of flour and 2 cups of milk.\"  I took note to pay attention to adding the flour and milk slowly.  I used bacon grease I had reserved from cooking bacon previously which probably created greater flavor.  I wanted to mimic my grandma's recipe and it was very close.    I'll make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "tbs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2587719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-24T14:36:27.253Z",
                "reviewBody": "I really wanted biscuits and gravy for dinner the other night but didn't have the sausage I normally use so I tried this recipe with bacon. I pretty much doubled all ingredients to make enough for my family. I had never made gravy from scratch before this and I found the directions simple and easy to follow. Other than accidentally over salting it a bit, it tasted delicious. I added a couple dashes of steak seasoning. Next time I will use less salt and pepper and more steak seasoning. I will 100% use this recipe over and over again. Reviewers claiming their gravy was \"bland\" and/or \"flavorless\": uh, it says season \"to taste\" ??? Right?!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bat Ma'am",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7485748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-14T19:57:30.18Z",
                "reviewBody": "This was really good but I added a few things. I made gravy as directed but I put an egg scramble on the biscuits before I topped them with the gravy and it was SO good. I sauteed pieces of ham banana peppers and red pepper flakes in butter then added the eggs. I put the eggs on the biscuits topped with cheddar cheese and then topped with the gravy. It was awesome.....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NME33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3131652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-31T16:52:43.993Z",
                "reviewBody": "This was a horrible recipe. Following the instructions exactly I ended up with a pan full of Elmers Glue! Slightly browned of course.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kellylee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2751422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-19T14:53:46.64Z",
                "reviewBody": "Be sure to follow Raoulysgirl's advice about the grease/flour/milk ratio, e.g., if you have 3 T of grease, you'll need 3 T of flour and 3 cups of milk.  It was perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "xynthee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1220392/"
                }
            }
        ]
    }
]