[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/163998/creamed-eggs-on-toast/",
        "name": "Creamed Eggs on Toast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F221205.jpg",
            "width": 2288,
            "height": 1712
        },
        "datePublished": "2018-06-08T13:50:55.000Z",
        "description": "This is my husband's favorite use of leftover hard boiled Easter eggs.  Great comfort food!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "12 hard-cooked eggs, peeled",
            "¼ cup butter",
            "½ cup all-purpose flour",
            "3 cups milk",
            "1 tablespoon chicken bouillon granules",
            "6 slices white bread, lightly toasted",
            "salt and white pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Separate the egg whites from the egg yolks. Place the egg yolks into a bowl and mash with a fork. Chop the egg whites into small pieces and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a saucepan set over medium heat. Stir in flour until smooth. Gradually mix in the milk and chicken bouillon so that no lumps form and stir constantly until the mixture comes to a boil. Add the egg yolks and mix until dissolved. Stir in egg whites. Serve over toast and season with salt and white pepper.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chrissy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.518987341772152,
            "ratingCount": 316,
            "itemReviewed": "Creamed Eggs on Toast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "390.9 calories",
            "carbohydrateContent": "27.6 g",
            "cholesterolContent": "454.2 mg",
            "fatContent": "21.7 g",
            "fiberContent": "0.9 g",
            "proteinContent": "19.8 g",
            "saturatedFatContent": "9.9 g",
            "servingSize": null,
            "sodiumContent": "586.4 mg",
            "sugarContent": "8.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-10T10:27:51.25Z",
                "reviewBody": "I have been making (and eating) Creamed Egg for years.  I never thought I'd see a recipe in print - I thought it was something my Mother made up!  She made lots of vatiations, using browned hamburger, or browned sausage, or creamed dried beef instead of the hard boiled eggs.  The basic sauce recipe is so versitile that you could creme anything!  I bet some crumbled bacon would be delicious with the eggs in this recipe.  This recipe is a little different from my Mother's in that it called for Chicken Boullion. I gave it a shot and got great reviews.  I made it for breakfast yesterday for my two best friends and they loved it!  They wanted the recipe.  I directed them to allrecipes.com!  Thanks for another great recipe (one I thought my Mom was the only one who knew how to make it)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jbrhen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2933181/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-08T00:15:28.22Z",
                "reviewBody": "I was just about to add this as a recipe of mine, but I did a search first and found this. My grandma used to make this for me all the time -- the morning after I would spend the night at her house. It's hands down my favorite breakfast item! My family makes it pretty much the same way as listed here, but this honestly looks better (we use less eggs and more butter per serving -- the rest is the same). The eggs are the best part, so I find my rating to be valid, I would give my own recipe 4 stars. I like the idea another reviewer to put crumbled sausage in this. My GOSH! That would be heavenly! For those of you who are questioning whether or not to try this: it sounds a lot more weird than it really is. I have yet to make this for someone and have them not like it. This is a classic breakfast dish in my family that's been made for over 40 years! And so well loved that we've all memorized the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Coral C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2709489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-27T05:01:45.87Z",
                "reviewBody": "I have been eating and making this dish for over 50 years. My mom made this every Easter, and called it \"Goldenrod Eggs\" because of the sprinkled yolks over the creamed egg mixture. We add a pinch of dry mustard to our version.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "phyllis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1801056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-22T23:42:28.237Z",
                "reviewBody": "This is one of my go-to recipes for my\nhusband's bad days. I made this for him when we first got together and he's still raving about it.\n\nThe only thing I do different is fry up\na pound of ground sausage and use the \ngrease from the sausage, with a little \nbutter, to make the milk gravy. Then,\nI don't need to add bouillion. Just \na little pepper and Tabasco. Then, I add\nin the eggs.\n\nReally good for a hangover.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-22T05:19:53.953Z",
                "reviewBody": "Time-saving secret and tips: \n\nSince a child, mother patiently sturred the heating milk and flower to thicken. Forget it! All trained chefs know to heat the milk to just below a boil in microwave or on stove while preparing the white roux (flour and butter). \n\nProportions for cream sauce are 2 tablespoons each butter and flour per cup of liquid. Cook white roux over medium heat 3 minutes stirring with a whisk. Do not brown the roux, as this will destroy the thickening potential. Add the heated liquid (milk for this recipe) all at once and whisk briskly for perfectly smooth sauce in less than a minute. \n\nI use two hard-boiled eggs per cup of sauce cut two directions in an egg slicer to stir into the sauce. Salt and fresh ground white pepper to taste\n\nOption 1 - reserve one yoke to press through tea strainer for a garnish. Add chopped fresh parsley and a dash of paprika. \n\nOption 2 - add 1/2 teaspoon of curry powder per cup of sauce.\n\nOption 3 - Serve over fresh baked buttermilk biscuits split, buttered and toasted under the broiler. (Good buttermilk biscuit recipe on this site.)\n\nCaution: Do not introduce saliva into starch sauces with the tasting spoon. Enzympes digest (break down) starches and can cause watery sauce, particularly with cornstarch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chouray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7911965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T17:55:14.323Z",
                "reviewBody": "Great Recipe!  My grandmother taught me a version of this, we chop the whole egg, no smashing the yolks seperately, add 1-2 tsp of worchestershire sauce, salt to taste, 1 med. onion diced fine and fried until soften but not brown (at the beginning of the recipe, makes a flavorful sauce base).  When I was about 10 and just learning to cook, my grandmother told me to start the peas one day when we were making this for lunch...I thought she meant to put the peas in the sauce with the eggs...it was a happy accident, now if this is served in my house for lunch or a quick supper, we always add peas and some parsley, and you have a different twist on this classic!  Isn't it interesting, I am from western canada and here it is a sauce, my husband is from eastern canada and there the same recipe is a gravy!  I was interested to see that phenom. here too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2969612/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T14:29:49.923Z",
                "reviewBody": "How lovely to see this recipe appear! My college roommate turned me on to it almost 40 yrs ago.\nI do variations on it like many of you.\nI want particularly to address the remark that its appearance is \"not for company\". I disagree! I have served it for special brunches with smoked salmon (lox) and steamed asparagus: The colors together are beautiful and the flavors perfect together. \nI chop and add the whole egg so that the yoke is not fully mixed in; the mixture is spooned over toasted sourdough French bread which I like for its tartness to complement the richness of the other ingredients. The asparagus is laid over the eggs with the salmon on the side. Sprinkle fresh chopped parsley over the eggs.\nI use the variations others have noted, and also prefer half and half which is not as sweet as milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Eiffert",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6507774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-12T23:04:23.763Z",
                "reviewBody": "I admit that this tastes great and is a good use for massive amounts of leftover hard-boiled eggs. However, it looks kind of like something the dog threw up. Definitely not a company dish. I honestly think adding a little mayonnaise to sliced eggs and making egg salad is the better option.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Audra Slusher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3550814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-23T18:26:52.203Z",
                "reviewBody": "this was delicious.  I made it for a day when I knew I would have to get dinner on the table in a hurry, boiled the eggs the day before and then threw the rest together that night.  My only suggestion is to make sure that you add the milk slowly and give it a good chance to thicken.  This would be just as good (probably better) for breakfast but what can I say, if it's easy and it's tasty, it's dinner in our house!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "m.cecil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2152359/"
                }
            }
        ]
    }
]