[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1426/soups-stews-and-chili/stews/gumbo/",
                    "name": "Gumbo Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/200618/momma-made-em-chicken-and-sausage-gumbo/",
        "name": "'Momma Made Em' Chicken and Sausage Gumbo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1658100.jpg",
            "width": 1944,
            "height": 2592
        },
        "datePublished": "2018-06-08T13:54:00.000Z",
        "description": "Straight from my mom's kitchen in St. Charles Parish, Louisiana! Chicken, sausage, and okra gumbo that warms the soul.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H15M",
        "totalTime": "P0DT3H55M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 (3 pound) whole chicken",
            "½ cup all-purpose flour",
            "½ cup vegetable oil",
            "1 (10 ounce) package frozen chopped onions",
            "1 (10 ounce) package frozen green bell peppers",
            "5 stalks celery, finely chopped",
            "1 tablespoon Cajun seasoning (such as Tony Chachere's), or to taste",
            "2 whole bay leaves",
            "1 (28 ounce) can diced tomatoes",
            "1 pound fully-cooked smoked beef sausage (such as Hillshire Farm®), sliced",
            "1 (10 ounce) package frozen sliced okra",
            "salt and black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large pot partially with lightly salted water, and place the chicken in the pot. Bring to a boil, reduce the heat to a simmer, and cook the chicken until the meat is no longer pink and the juices run clear, about 1 hour. Remove the chicken from the broth, and crack open the carcass to allow the chicken to cool. Reserve the chicken broth. After the chicken has cooled enough to handle, pick the meat from the bones, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the chicken is simmering, make a roux by whisking together the flour and vegetable oil in a large, heavy saucepan over medium-low heat. Cook and stir the mixture, watching constantly to avoid burning, until the roux is a rich chocolate brown color, 20 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "As soon as the roux has reached the desired color, stir in the onions, bell peppers, celery, Cajun seasoning, and bay leaves, and simmer, stirring occasionally, until the vegetables are tender, about 45 minutes. Pour in the reserved chicken broth, diced tomatoes, and beef sausage, and simmer, stirring occasionally, until the mixture has thickened, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix in the reserved chicken meat and okra, bring back to a simmer, and cook, stirring occasionally, until the okra is tender and the flavors have blended, 30 to 40 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Gumbo Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BelleTeteRouge"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.588235294117647,
            "ratingCount": 51,
            "itemReviewed": "'Momma Made Em' Chicken and Sausage Gumbo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "437.4 calories",
            "carbohydrateContent": "14.5 g",
            "cholesterolContent": "67.2 mg",
            "fatContent": "32.2 g",
            "fiberContent": "2.8 g",
            "proteinContent": "21.4 g",
            "saturatedFatContent": "9.3 g",
            "servingSize": null,
            "sodiumContent": "834.6 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-03T20:06:56.38Z",
                "reviewBody": "Down in South Louisiana we do tings a lil dif'rent Sha! We NEVER use a prepared creole or cajun seasoning mix. We ONLY use Andouille sausage & to make the roux we use bacon fat or butter NOT oil. Our TRINITY veggies are always fresh, NOT FROZEN, and a CAST IRON DUTCH OVEN is a MUST to cook in. Dar ya go Sha, try it dis way n you will dance!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sunny D Shines",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3933629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-11T18:43:48.273Z",
                "reviewBody": "Good gumbo recipe.  I used fresh veggies and my own seasonings (cayenne, oregano, thyme, etc.).  I also recommend using andouille sausage and searing it in a pan before adding it to the pot.  Also, saute the okra to \"de-slime\" before adding to the pot.  Lastly, making it a day in advance is a great idea for any gumbo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3913643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-25T01:25:43.063Z",
                "reviewBody": "Oh yum, yum, yum yum!  It took quite a while to make, but is very yummy!  Here are my changes: First I chopped the sausage and cooked it in a skillet, reserving the grease in a measuring cup.  I then cooked the chopped peppers, onions, and celery in the same pan until soft, the placed in a separate bowl.  Next I cooked bacon to render the fat and poured the fat into the measuring cup until it reached 1/2.  After removing the bacon, I poured back into the skillet the grease and flour and cooked to make roux for 20 minutes.  While that was cooking, I cooked 8 chicken thighs in a stock pot with one small can of chicken broth.  I removed the thighs when done, then cut them into pieces and put with the sausage and vegie mixture.  When the roux was ready, I poured the chicken broth into the roux and stirred, then added the meat and vegie mixture.  I added Zateran's creole seasoning to taste.  I did not have the okra, so I added one can of red beans and a bit of corn for color.  Stir well and serve!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jenvan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5626315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-26T23:36:52.303Z",
                "reviewBody": "All I do not know how to edit the recipe but please use whatever sausage you like. Personally I am not a huge fan of Andouille (even though it is more authentic) so I use my favorite. Thank you all for your reviews and comments! Everything on this recipe can be to taste. I now have to use fresh onion celery & bell pepper because I cannot find it frozen here in Dallas. Just work with what you have make sure to not burn the roux and it should all be good! Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BelleTeteRouge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1093474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-04T16:12:12.94Z",
                "reviewBody": "I saw no one had reviewed this and just had to give credit where credit is due. THIS IS SOOOOOO GOOOOOOD!! made it last night didn't have any onions (oops) so i had to use onion powder. also subbed creole seasoning and cayenne for cajun seasoning. Doesn't really take very long (as gumbo goes) so thats a plus. my wife is from the south (US)and said it was as good as any she had ever had. Maybe she was just being nice but still 5 stars man.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "matthan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3886358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-02T09:02:53.127Z",
                "reviewBody": "Oooh yum! I miss gumbo and jambalaya here in Mozambique but I am able to find most of these ingred. here (except I brought my own cajun seas. from the U.S.) so I made this and even the locals who are helping us here love this. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MangoTango",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-18T22:03:31.61Z",
                "reviewBody": "This was a great base recipe for gumbo. The beauty of making gumbo is that you can make it all your own. I PERSONALLY would NEVER make gumbo with anything other than andoullie sausage and if you want to serve some really authentic gumbo try serving over potato salad instead of rice. The tomato's are strictly for a creole style gumbo and NOT a cajun gumbo so I never use them either. Have fun and experiment with things. It's hard to mess up gumbo when you have a great roux.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cyndy Blackledge Bauers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1283153/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-22T23:19:23.67Z",
                "reviewBody": "Ok one can use canola oil as well as butter to make the roux. pre cut the onions celery bell peppers. At the magic moment that the roux looks like a dark peanut butter add the onions to cool it quickly and stop it from burning. carmelize then add the rest of the trinity. add water after this is cooked a bit then add the chicken. OUr family cooks the chicken with the bones to add more flavor. We also crack an egg for each person into the end of the cooking or serve the gumbo with rice and potatoe salad in the gumbo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "raginhoops",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8434881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-17T01:38:21.74Z",
                "reviewBody": "My husband thought this was very good! For convenience I used a rotisserie chicken with chicken broth. The only real changes I made was in step 3. Adding the vegetables to the roux without any liquid did not make sense to me. It was too dry so I added a can of chicken broth and let it simmer. However I don't know why everything could not just be dumped into the pot and let simmer together. Good flavor. Next time I will use bacon grease instead of oil for more flavor and certainly fresh vegetables when in season. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gloria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1712510/"
                }
            }
        ]
    }
]