[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/204308/tangy-mustard/",
        "name": "Tangy Mustard",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F717199.jpg",
            "width": 4320,
            "height": 3240
        },
        "datePublished": "2018-06-08T13:54:18.000Z",
        "description": "This is a nice mustard for use with all kinds of meats, cold cuts, and sandwiches.  Made from the whole mustard seeds it is a very grainy mustard. Kept in the fridge, the prepared mustard will keep up to one month after you open the sealed jar.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P15DT0H15M",
        "recipeYield": "3 half-pint jars",
        "recipeIngredient": [
            "½ cup yellow mustard seeds",
            "½ cup brown mustard seeds",
            "1 tablespoon Oriental mustard seeds",
            "1 ½ cups apple cider vinegar",
            "2 cloves garlic, minced",
            "2 tablespoons honey",
            "1 teaspoon salt",
            "1 teaspoon dried thyme",
            "3 half pint canning jars with lids and rings"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the yellow mustard seeds, brown mustard seeds, and Oriental mustard seeds in a bowl. Pour the vinegar over the seeds and stir. Cover and store in refrigerator for 24 hours. If the seeds absorb all the vinegar too quickly, add more as needed or add a little water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend the soaked mustard seeds, garlic, honey, salt, and thyme in a blender until it is to your desired consistency, depending on how grainy you like your mustard.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the mustard into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings. Refrigerate at least 2 weeks before using.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "pelicangal"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 19,
            "itemReviewed": "Tangy Mustard",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "31.1 calories",
            "carbohydrateContent": "4.2 g",
            "cholesterolContent": null,
            "fatContent": "1.4 g",
            "fiberContent": "2 g",
            "proteinContent": "1.8 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "98.3 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-09-05T18:02:34.853Z",
                "reviewBody": "HELLO magnificent flavor!!!! I couldn't wait 2 whole weeks to give it a taste so I dipped my spoon into it to try and ended up making sandwiches with it as soon as it came out of the blender. I used it on sharp cheddar and pastrami sandwiches and it held up very well against those strong flavored foods. My husband says we will NEVER purchase mustard again. I highly recommend making this if you enjoy a good hardy mustard!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Can_It_Rachael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/can_it_rachael/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-03T17:22:27.15Z",
                "reviewBody": "WOW! I barely know where to start...thanks to Can_it_Rachael's review and rave in the buzz I knew I would try this recipe. Try as I might I simply could not find ANY of the type of mustard seed this recipe calls for but since I was too impatient to order online I used simply \"mustard seed\" from my bulk store and \"hot mustard powder\" to replace the Oriental seed (as I gather they are the spicier of the three). The taste is simply incredible and like Rachael I couldn't wait two weeks to try it! I doubled the recipe and got perfectly enough to fill three 500 ml wide mouth jars. I used 1 tsp of \"hot mustard powder\" for the doubled recipe and got a very noticeable ZING (no complaints here!) but for those that prefer a milder mustard (and couldn't find the original mustard seeds called for and must substitute) they may want to start with 1/2 or even 1/4. I am so thrilled with how this turned out that I too will never purchase a grainy mustard again! Thanks so much I am so pleased! Update: This tasted spicier at first now after maturing it is more mellow...still 'tangy' but not hot. So next time I won't reduce the hot mustard powder and may even add more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5693502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-11T14:08:15.28Z",
                "reviewBody": "Delicious! The hardest thing was finding the right mustard seeds but after that - easypeasy! Perfect balance of flavors. I did add a good dose of black pepper to my batch and a bit more salt. Wonderful texture and it looks quite fancy too! I am adding this to my list of homemade goodies for holiday gifting. Thanks so much for the recipe! UPDATE I made a plain yellow variety for my daughter who prefers \"not so spicy\" Followed the recipe but used 1 cup yellow seeds. She loves it! I love this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "What's for dinner, mom?",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whats-4-dinner-mom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-26T23:15:01.4Z",
                "reviewBody": "This mustard is really good. I had a feeling I was going to like this very much. I special ordered the all the seeds. And it was rather easy to make...but I goofed on the 1st batch. I forgot the honey and it was totally a hot firecracker. It still has a bite even with the honey but it's all good. Now I choose to make 2 batches because I have a kid allergic to apples and I wanted her to be able to enjoy the mustard and not be told sorry can't eat it. So I made a batch with Distilled White Vinegar and that's the one I forgot to add the honey. And it was flaming. The 2nd batch with the Apple Cider vinegar is the one I added a sugar free honey and it was also when I realized I forgot the honey on the 1st. I pulsed and grinded the mustard down as far as I could. We love it....You can totally leave out the Oriental mustard seeds if need be that's where this recipe gets it's heat. I'm totally tickled stumbling across this recipe. It's a total keeper and it also helps with other ideas for mustards. Pelicangal I salute your recipe. If I can make my family mustard verses buying it in the store. I've saved some money. Because the seeds in bulk the ingredients that went with it sure makes up the difference. I don't mind making fresh when it's this easy. TY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-09T22:55:41.017Z",
                "reviewBody": "AWESOME! I can't believe I made my own mustard lol! I did have to omit the Oriental mustard seeds because I couldn't find them but that was my only change. This is spicy tangy and delicious! I made it yesterday but just had to try some today on my turkey sandwich lol. I can only imagine how good it's gonna be after 2 weeks if it already tastes this good after only 1 day! This was so much fun and very easy. I will be making my own mustard from now on! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-02T21:03:38.647Z",
                "reviewBody": "FANTASTIC!!!! Like others, I had to order the Oriental seeds, but that was easy enough. I too couldn't believe how much of the vinegar they were able to absorb! Who knew making mustard was so easy?!?! I've shared it with friends & family and we keep a jar in the office fridge - everyone Loves it! And \"tangy\" is the perfect description. Thank you, pelicangal!!! This recipe is SO a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Staci",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/staci/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-02T20:38:59.73Z",
                "reviewBody": "One word...delicious!  I forced myself to wait the entire two weeks.  I bought a fresh loaf of bread from the farmer's market this morning, got some premium lunch meat from the grocery store and sat down to one of the best sandwiches I have ever had...certainly the best I have made thanks to this mustard.  I couldn't find the Oriental mustard seeds so I just used a teaspoonful of the powder.  I no longer have to purchase mustard.  No store bought mustard will ever compare to this homemade one anyway.  Thanks pelicangal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tahoegirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2297575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-29T15:38:10.927Z",
                "reviewBody": "This mustard was awesome! Like others I cant believe I made my own mustard. I had to order the mustard seeds on myspicesage.com. I gave a jar to a friend who served it at a get together and it was loved by all. I will be making this again when my stock runs low. Thanks Pelicangal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CNM CATERING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/971546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-01T18:01:14.887Z",
                "reviewBody": "Very good mustard. Dried thyme is not a favorite for me so we omitted that and I didn't have any oriental mustard seeds and omitted those too. Nevertheless the mustard is very good already even though we just made today. I added more honey to one of the jars and that's great too. I will definitely make this again! ADD'L INFO: I mixed some of this mustard with a bit of heavy cream to make a mustard sauce for grilled chicken and steak....AWESOME!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wisweetp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sogirl_2/"
                }
            }
        ]
    }
]