[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2253/main-dish/savory-pies/beef-pie/",
                    "name": "Beef Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/211793/burek/",
        "name": "Burek",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6804488.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2018-06-08T13:54:50.000Z",
        "description": "This recipe is Eastern European in origin; being from Bosnia, my mom made this for me growing up and my whole family always looked forward to it! Serve with Balkan style yogurt for authenticity.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound lean ground beef",
            "1 tablespoon ground allspice",
            "1 tablespoon paprika",
            "salt and freshly ground pepper to taste",
            "1 potato, finely chopped ",
            "1 onion, chopped",
            "1 (16 ounce) package phyllo dough",
            "¼ cup melted butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brown ground beef in a large non-stick skillet over medium heat, 5 to 7 minutes. Drain fat; stir in allspice, paprika, salt, and pepper. Transfer beef to a large bowl and stir in potato and onion.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Unroll phyllo pastry and transfer 2 sheets to a work surface; stack sheets. Spoon 1/8th of the ground beef mixture down one long edge of the phyllo pastry. Roll phyllo into a tube, encasing beef. Shape the tube into a coil (snail shape). Place the roll on an ungreased baking sheet; brush with melted butter. Repeat, placing finished rolls up against one another to keep them from unrolling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake burek in the preheated oven until golden brown, 20 to 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Beef Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mms09"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 45,
            "itemReviewed": "Burek",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "797.1 calories",
            "carbohydrateContent": "72.8 g",
            "cholesterolContent": "115.6 mg",
            "fatContent": "42.1 g",
            "fiberContent": "4.7 g",
            "proteinContent": "29.9 g",
            "saturatedFatContent": "18.5 g",
            "servingSize": null,
            "sodiumContent": "707 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-14T21:29:27.51Z",
                "reviewBody": "This was very tasty.  It was much milder/blander than I expected with the given seasonings.  I accidentally undersalted since I had seasoned the ground beef but forgot to add more seasoning after adding the potatoes.  It was slightly dry--I might moisten with a little broth next time.  I used one small Yukon and one small sweet potato.  I wonder about adding chopped spinach or peas or shredded carrots next time.  Definitely worth trying again; I've never had this before but seems like it could be a good comfort food and is easy to make.  I used too many sheets of phyllo so it wouldn't easily bend so I left it in long tubular rolls.  I notice a 16 oz. box of phyllo contains 40 sheets (5 sheets per serving), so next time I would use that as a guide.  I was confused and didn't intially realize that this should create 8 individual rolls, and perhaps only uses half of a 16 oz. pkg. of phyllo if only using 2 sheets per roll.  I would think they could be shaped into a round spiral easier with fewer sheets of phyllo.  I ended up with five long rolls.  Definitely worth trying again.  Kids and hubbie all ate and liked.  We only ate about half of this so I would think it could easily serve 6 with a side dish.  Thanks for sharing your recipe--I love trying new food combinations and the allspice really intrigued me.  I might even add a little more allspice next time.  And maybe minced apple.  Hopefully fruit or other veggie additions would not completely destroy any ethnic authenticity.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanya C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1965694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T20:05:16.447Z",
                "reviewBody": "Great!! It wasn't spicy because it's not supposed to be. Being from a Serbian background this is what it's supposed to taste like!! odlican!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily McCann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1765987/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-28T20:20:59.46Z",
                "reviewBody": "Byrek rocks, one of the best home made meals in Albania. i grew up with it and i'll  eat till death set us apart. love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ceni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5110450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-14T21:20:47.707Z",
                "reviewBody": "We LOVE Burek!! This is pretty close to the Burek that they make in Montenegro. Thanks for posting this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "f.g.cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2153407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T21:10:12.457Z",
                "reviewBody": "This recipe is easy but not quite the MOIST burek I love so much! I think moisture is also the key to working with phyllo dough so here are a few ideas. \n1) Don't drain the beef too much - or at all! The grease helps to make the dough sheets pliable. 2) When you are not using the dough sheets cover them directly with a damp kitchen rag so they don't crack when you roll them up. 3) If the dough still isn't moist enough to work with you'll have to keep lathering on the butter as you roll it. Also I threw an egg in the beef mixture, which seemed to help.  \n\nA little more grease may not make it healthier but it definitely makes it more delicious and more authentic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gigerbopper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/914194/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:05:13.427Z",
                "reviewBody": "I do not know if this is authentic or not but my whole family enjoyed this. I made it as directed - only I 'browned' the potatoes and onions with the beef and seasonings. I couldn't make the pinwheels work so I cut the phyllo in half and made them more like large spring rolls. Didn't change the taste. I used sour cream seasoned with garlic dill and Mrs. Dash (garlic seasoning) as a dipping sauce. Very tasty and easy to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Natalie Hahn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3415982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-07T13:42:08.75Z",
                "reviewBody": "This is very authentic taste to it. I see a lot of complains about rolling the dough. I actually make my own phyllo dough as do most bosnians so when we use thr roll technique the dough is more water based. Buy you can always stack eith the store bought phyllo. My father loves it this way and since it does take a long time to dry your own homemade phyllo I just used the store phyllo and stack with layers. Also I dont use allspice, I guess i make it a little past the original by adding cumin to the recipe it really gives it a deeper taste. And I love the natural yoghurt but for those unable to get it you can always use butter milk and dip it in the buttermilk or even sour cream and just dip it like that. Also with this you can feel free to expirament with different fillings I love cheese filling, I just take some cottage cheese one egg and a little salt, some add spinach its very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dzejlana91",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7813248/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T22:03:21.337Z",
                "reviewBody": "I have been cooking for many years and enjoy trying different cultures foods. I decided to try my hand at making this because of the reviews and the fact that I've never made Bosnian food before. The meat turned out great but was dry. It needs a sauce to cover it or dip it in. One of the reviewers said that it was difficult to roll into spin wheels with more than 2 sheets. I can tell you with only using 2 and even trying 1 that rolling into spin wheels with packaged phyllo isn't possible. I tried with 2 and then with 1 and it just wouldn't work. My rolls ended up breaking. I think a softer wetter dough is necessary to make them into spin wheels.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "volsfan4life",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3877545/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-14T02:19:17.757Z",
                "reviewBody": "I make Burek but I make it in around 10 inch cake pan I layer the phyllo dough then about half way I put in amixture of pork sausage and ground beef then layer it the rest of the way. My brother-inlaw is from Macedonia and this is how they make it. I think it looks like an apple pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2500756/"
                }
            }
        ]
    }
]