[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/152/breakfast-and-brunch/potatoes/",
                    "name": "Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212456/roasted-red-pepper-and-goat-cheese-frittata/",
        "name": "Roasted Red Pepper and Goat Cheese Frittata",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1117859.jpg",
            "width": 2448,
            "height": 2449
        },
        "datePublished": "2018-06-08T13:54:57.000Z",
        "description": "A deliciously satisfying frittata featuring tastes of the French Mediterranean.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "6 small red potatoes, thinly sliced",
            "1 cup diced roasted red peppers",
            "2 tablespoons minced garlic",
            "salt and pepper to taste",
            "½ teaspoon minced fresh basil",
            "6 eggs",
            "⅓ cup heavy cream",
            "½ cup crumbled goat cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a cast-iron skillet over medium heat, and spread the potatoes into the hot pan in an even layer.  Cover the skillet, and cook the potatoes until they start to turn tender, about 10 minutes. Stir in the red peppers and garlic, and sprinkle with salt and pepper. Cook and stir the potato mixture until the garlic begins to soften, about 2 minutes, sprinkle on the basil, and cook the mixture, stirring occasionally, until the basil is cooked, about 2 more minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk the eggs and cream together in a bowl, and pour the egg mixture over the vegetables in the skillet. Sprinkle the top with goat cheese, cover the skillet, and reduce the heat to low. Cook until the eggs are set but not dry, 3 to 5 minutes. Uncover the skillet, and place it under the broiler until the top of the frittata has browned, about 2 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dave Stewart"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.083333333333333,
            "ratingCount": 12,
            "itemReviewed": "Roasted Red Pepper and Goat Cheese Frittata",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "500.9 calories",
            "carbohydrateContent": "46.3 g",
            "cholesterolContent": "320 mg",
            "fatContent": "27.5 g",
            "fiberContent": "4.8 g",
            "proteinContent": "19.4 g",
            "saturatedFatContent": "11.6 g",
            "servingSize": null,
            "sodiumContent": "412.9 mg",
            "sugarContent": "5.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-11T17:37:02.84Z",
                "reviewBody": "I made this as the Exchange group recipe for the week of March 8th. I chose to interpret \"crumbled goat cheese\" as \"feta\" even though I know that's not what the recipe intends. Hey feta came from a goat too I'm not ashamed! I had to sub dried basil for the 1/2 tsp. of fresh. I used 1/4 tsp. of dried and it was undetectable. I've made similar frittatas and always use milk where this recipe uses cream. I believe the cream does add a richer feel to the overall end product though I'm not sure the difference is enough to me to justify the caloric difference. Overall we liked this. Any recipe that starts with the smell of frying potatoes is a winner in my house and this was no exception. If I made this again -- and I might we do love a frittata around here -- I would add sliced white or yellow onions to the potatoes in the initial cooking step so that they'd brown and caramelize along with the potatoes. (Thought about doing that this time but since I was participating in a group thing I didn't! Kind of wish that I had!) Thanks for the recipe we enjoyed it:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JARRIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jarrie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-11T21:35:05.623Z",
                "reviewBody": "I made this for dinner tonight to try something different and as part of the recipe group and actually found it quite tasty! Made a few changes though. 1 1/2 red bell peppers that I roasted gave me about 1 1/4 cup of chopped red pepper so I threw it all in. Also added about 3/4 cup sliced baby bella mushrooms that needed to be used spiced the potatoes with paprika and red pepper flakes used skim milk instead of heavy cream and added the fresh chopped basil to the finished product after broiling. Basil's flavor cooks right out of it if it's cooked too long! I had to cook this in a smaller pan since I don't have a cast iron skillet so I cut back a bit on the potatoes but left everything else the same (next time I think I'll throw some red onion in as well!). The creaminess of the goat cheese really made this dish shine; make sure you let it get nice and brown before taking it out of the oven! I think it will be a new family favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NomNomDelicious",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nomnomdelicious/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-16T15:55:09.45Z",
                "reviewBody": "I also thought it was a bit bland needing something else. I had to use a small russet (baking) potato half&half (light) cream instead of heavy & since I had no fresh nor dried basil I whisked a pinch of basil-heavy pesto into the eggs. I used 1/2 creamy goat cheese & 1/2 (cow's milk) feta. I suspect Dave was inspired by the famous Spanish tortilla which is a sliced potato (& onion) omelette - that too can be considered bland but somehow it works better than this frittata. The roasted red bell peppers were the best part to me. I served this for breakfast with a side of sauteed grape-sized tomatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T15:47:12.143Z",
                "reviewBody": "Sassy I wish we could have shared this for brunch today. I followed the recipe as closely as I could except I used dried basil and feta cheese. I cooked the potatoes longer so they would be crispy. I broiled the pepper to bring out the taste. This was a good recipe but seemed to be lacking somthing. After trying it I ate the rest with some spicy salsa. Next time I will fry some onion or leeks with the potatoes and top with old cheddar cheese and crispy bacon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "recipes need gluten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3990518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-11T19:24:02.213Z",
                "reviewBody": "1st I must say I have never made or eaten a Frittata. So making it looked easy but it wasn't for me. I didn't have a cast iron pan and my gas oven proved to be a challenge with the broiler on the bottom. No small pans to fit in the broiler for my big famiy. I personally had questions through out the steps. I sliced the potatoes however in end result...I could have diced them for a quicker cooking process took longer for me. The potatoes didn't have much flavor and sort of bland. However the garlic and the roasted red peppers were excellent. I couldn't find \"crumbled goat cheese\" I thought maybe it was an error in the submission of the recipe and felt it might have been feta instead. I have never eaten goat cheese either and well that I can say is an required taste. Someone mentioned they thought the recipe bland when they made it in forum discussion so I got seasoned goat cheese. All together I didn't care for the dish I'm sorry. I probably could have waited to see other's changes or suggestions before attempting it but even though my son and I didn't like it. My 3 daughters loved it. I could attempt this again with some extra seasonings and different type of cheese and the potatoes done differently.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-16T01:16:55.33Z",
                "reviewBody": "I too have never made or eaten a frittata. Made this one for the recipe group. It seemed a little bland to me. I wasn t sure if I was supposed to stir the potatoes. So I did. I may have sliced too many. I did cook the potatoes a little longer till they were tender. After I added the garlic and peppers I stirred it all together and added the eggs. I did have to cook probably twice the amount of time for the eggs to set. It looked and smelled great. I used dried basil not having any fresh this time of year and subbed in sour cream/milk for the heavy cream. It only used 1/3 cup. Taste test as I said was pretty bland. I think it could have benefited from some onions in there somewhere and maybe some red pepper flakes on the potatoes while cooking. I did use the goat cheese on this could ve used some more actually. Making it non vegetarian I would love to throw some crumbled bacon in with it! Thanks for the recipe Dave!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-02T20:30:42.07Z",
                "reviewBody": "This was a good addition to our Christmas brunch. I used fat free half and half in place of the heavy cream but that was the only thing I changed. The next time I may try using rosemary in place of the basil. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-28T15:29:21.077Z",
                "reviewBody": "This was interesting. I love quiche so I've always wanted to try a frittata. I just happened to have everthing on hand and while it was good it was rather bland. I added onion for extra flavor and even more basil than the recipe called for. I think I'll try a frittata again although maybe without the potatoes next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Ambo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3723501/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-24T13:27:38.57Z",
                "reviewBody": "Good but definitely bland so needs some spicing up. I noted the reviews and added a Montreal Steak flavoring (garlic and onion) and worried it was too much since I dumped more than I intended but it worked really well and gave it a good flavor. Used regular instead of roasted red peppers and it was fine--just added to the latter half of the potato cooking time. I needed to let the eggs set longer about 20 minutes then put in the broiler (on low) for 4 minutes. Nice breakfast and definitely could work for dinner. However be aware that this is extremely thin so I was still hungry after one serving and ate two. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            }
        ]
    }
]