[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1785/soups-stews-and-chili/stews/irish-stew/",
                    "name": "Irish Stew Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214064/beef-stew-with-ale/",
        "name": "Beef Stew with Ale",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4531357.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2018-06-08T13:56:02.000Z",
        "description": "A delicious stew with a good brown lager flavor.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 pounds beef brisket, trimmed and cut into 2-inch pieces",
            "salt and black pepper to taste",
            "2 tablespoons all-purpose flour",
            "5 tablespoons canola oil",
            "2 cups diced portobello mushroom caps",
            "1 ½ cups red pearl onions, peeled",
            "1 cup diced carrot",
            "1 cup diced celery root (celeriac)",
            "1 cup diced turnip",
            "2 cloves garlic, minced",
            "2 (12 fluid ounce) cans or bottles brown lager beer",
            "2 cups beef broth",
            "1 cup diced potato",
            "1 tablespoon malt vinegar",
            "4 sprigs fresh thyme, chopped",
            "2 sprigs fresh rosemary, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the brisket cubes into a mixing bowl, and season with salt and pepper. Sprinkle with flour, and toss until evenly coated. Heat the canola oil in a Dutch oven or large pot over high heat. Cook the meat in small batches until browned on all sides; about 5 minutes per batch. Set the meat aside as the batches are done.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the meat has been browned and set aside, stir in the portobello mushrooms, and cook until browned, about 5 minutes. Remove the mushrooms, and set aside. Stir the pearl onions, carrot, celery root, and turnips into the pot. Cook and stir until the onions begin to turn light brown, about 5 minutes. Add the garlic, and continue cooking until the onions are golden brown, about 3 minutes more. Remove the vegetables and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return the beef to the pot, and pour in the beer. Bring to a boil, and cook until the beer has reduced to 1/3 of its original volume, about 8 minutes. Pour in the beef broth and return to a boil. Reduce heat to medium-low, cover, and simmer until the meat starts to become tender, about 1 hour. Return the browned vegetables to the pot along with the potatoes, recover, and cook 1 hour more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the reserved mushrooms, malt vinegar, thyme, and rosemary. Simmer a few minutes until heated through. Season to taste with salt and pepper before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Irish Stew Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Deron"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.717948717948718,
            "ratingCount": 39,
            "itemReviewed": "Beef Stew with Ale",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "224.1 calories",
            "carbohydrateContent": "13 g",
            "cholesterolContent": "30.7 mg",
            "fatContent": "12.5 g",
            "fiberContent": "1.3 g",
            "proteinContent": "11.1 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "189.7 mg",
            "sugarContent": "2.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-12-21T01:42:32.523Z",
                "reviewBody": "PORTION IS OFF!! I rated this recipe 5 stars because it is DELICIOUS! However the 12 servings that this recipe says it yields is WAY off! After following this recipe to the letter I barely had enough for 4 reasonably sized adult portions. I can't stress enough how DELICIOUS this recipe was soooo good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marlena05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6077957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-10T18:04:07.423Z",
                "reviewBody": "This stew is FABULOUS! However the last reviewer is right...the portions are WAY off. I can feed four adults well and have one small serving left over for lunch the next day. I couldn't find celeriac so used just celery instead and added parsnips - just because my family loves them. I have made this three times now and have used various kinds of beer (whatever I have on had - ALWAYS at least one can or bottle of something dark). It has been great every time. Thanks for sharing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paige Everly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3081269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:56:07.35Z",
                "reviewBody": "absolutely delicious. I couldn't get celery root at the store I was shopping at so I used parsnips and regular celery but everything else I followed to the letter. Just amazing! We fed a family of 5 and still have enough left over for another dinner tonight so I would say the portioning is pretty close.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OANDREA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1155936/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-02T16:48:45.123Z",
                "reviewBody": "FAB recipe what a hit and what flavours I made mine with ale dark beer I doubled the recipe as I had 8 people to feed including 4 hungry big eater men. Also I added mine to the crockpot to slow cook for the day after the initial browning and boiling. The smell is amazing never thought I would rave so much about the beer in the stew but its incredible with such a distinctive taste. You could really experiment with any strong flavorsome beer. Bought some crusty french stick bread to serve with it and added a handful of chopped corriander before serving. What a hit! boys loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "julz77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7429695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-14T18:14:10.653Z",
                "reviewBody": "Great basic recipe! Made the best beef stew I've ever had. I halved the recipe and added my own twists. Used 1 1/2 sweet onion cut in chunks; half a bag of baby carrots; no celery root or turnip; one bottle of Guinness beer added a can of fire roasted diced tomatoes about 1/2 cup of quick cooking barley (added the last 1/2 hour of cooking) and used some Montreal Seasonings. I didn't have fresh thyme so I used dry and added it when browning the veggies and then a bit more to the stew itself. Did use fresh rosemary at the end. I think the key is to season each layer and gradually build up the taste. Thank you so much for posting this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "union_98",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2538450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-24T20:54:14.02Z",
                "reviewBody": "I read the ingredients and read the reviews and I was excited about this recipe and ready to go. What I DIDN'T read was all the instructions. I've been pretty much a flour the meat brown throw in the rest of the ingredients and walk away for a few hours crockpot-like. This one is more labor-intensive than that and I was getting kind of bummed because I really had other things to do that day than fuss with dinner. I'm so glad I hung in there though! This was just the absolute best!!! I won't say that I wouldn't try to cut or combine a few of the steps to see if it makes any difference but I'll tell you what...if it DOES I will go right back to this one and stop whining! This is a just FANTASTIC stew...the flavors just meld so wonderfully. Thank you thank you thank you. I'm craving it as I write just thinking about it. SO tasty!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLFROMSCRATCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/herkypig/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-31T23:24:48.577Z",
                "reviewBody": "Wow this recipe is just amazing! I had never attempted beef stew myself and though this was involved the results were fantastic. I discovered the secret to tender beef is letting it cook for the full duration - I've had stew in the past where the beef is dry and tasteless and tasting this recipe throughout the process I found that the beef was wonderful after browning but then got tough when first boiled in the beer. The subsequent cooking allowed it to reabsorb the moisture from the stew and become tender again. I used Shipyard Brewer's Brown Ale which had a very robust malty flavor and made a gorgeous brown gravy. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jeninmaine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jeninmaine/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-19T01:17:11.747Z",
                "reviewBody": "The flavors in this stew are incredible! I had trouble finding celeriac so I just diced up some celery and I use Lagunitas India Pale Ale. Delicious recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HannahRose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/hannahrose/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-06T19:12:15.46Z",
                "reviewBody": "This recipe is delicious but after following the recipe I felt it could be simplified. Pearl onions are a pain and expensive I use diced onions and detect no difference. I used regular mushrooms as a cost saver and again no discernible difference. And most effective for me to save time after browning the meat I placed it in a pressure cooker with the celery root and turnips and carrots and broth for 10 minutes under pressure. Then back to the pot with it all and add the beer. I also used 1 T worcestershire sauce and 1 T double strength tomato paste to add to the glutamates and boost the beef flavor and I used small red potatoes so I didn't have to dice them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Guy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7491488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-25T23:05:15.38Z",
                "reviewBody": "We're quite sorry to be the only dissenting opionion on this to date but we thought the recipe far too time consuming and for modest results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Table for Two",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4699297/"
                }
            }
        ]
    }
]