[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
                    "name": "Stuffed",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16210/main-dish/stuffed-main-dishes/stuffed-zucchini/",
                    "name": "Stuffed Zucchini Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215681/creamy-meat-stuffed-zucchini/",
        "name": "Creamy Meat-Stuffed Zucchini",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F966538.jpg",
            "width": 1759,
            "height": 1764
        },
        "datePublished": "2018-06-08T13:57:09.000Z",
        "description": "Zucchini stuffed with a creamy meat filling is a wonderful variation from the Italian sauce, specially when you can find (or grow) big zucchinis in season.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 large thick zucchinis, ends trimmed",
            "1 teaspoon vegetable oil",
            "½ onion, chopped",
            "3 cloves garlic, minced",
            "¾ pound ground beef",
            "½ teaspoon ground paprika",
            "2 tablespoons butter",
            "3 tablespoons all-purpose flour",
            "¾ cup milk",
            "¼ teaspoon white pepper",
            "¼ teaspoon ground nutmeg, or to taste",
            "salt to taste",
            "¾ cup grated Parmesan cheese, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil, and immerse the zucchini in the boiling water. Set heat to medium, and cook the zucchini until they feel slightly soft when pressed with a wooden spoon, about 20 minutes. Drain the zucchini, and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a skillet over medium heat, and cook and stir the onion and garlic until the onion is translucent, about 5 minutes. Stir in the ground beef, and cook and stir the meat, breaking it up as it cooks, until the beef is no longer pink, about 8 minutes. Stir in the paprika, and set the beef mixture aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the zucchinis in half lengthwise, and scoop out the flesh with a spoon, leaving a 1/2-inch thick shell. Chop the scooped-out zucchini flesh, and mix into the ground beef mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over low heat, melt the butter and whisk in the flour until smooth. Pour in the milk, a little at a time, and bring the mixture to a simmer, whisking constantly. Whisk in white pepper, nutmeg, and salt, and stir in half the Parmesan cheese to create a smooth sauce. Mix the white sauce thoroughly with the ground beef mixture. Place the zucchini halves into a baking dish. Fill the zucchini shells with the creamy beef mixture, and sprinkle each with about 1 1/2 tablespoons of the remaining Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the Parmesan cheese topping begins to turn golden brown, about 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Stuffed",
            "Stuffed Zucchini Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PattyQ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3,
            "ratingCount": 10,
            "itemReviewed": "Creamy Meat-Stuffed Zucchini",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "357.6 calories",
            "carbohydrateContent": "15 g",
            "cholesterolContent": "83.8 mg",
            "fatContent": "22.5 g",
            "fiberContent": "2.4 g",
            "proteinContent": "24.5 g",
            "saturatedFatContent": "11 g",
            "servingSize": null,
            "sodiumContent": "355.4 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-07T16:02:58.57Z",
                "reviewBody": "This was delicious and less trouble to prepare than I had feared. Next time I might increase it to three zucchinis because there was way too much filling to fit in two. I guess it didn't matter that it overflowed though. I'm wondering if I could use sour cream or plain yogurt instead of milk for a more stroganoff-like taste. Mushrooms would be a tasty addition too. I'll try that the next time I find zucchini (it isn't easy to come by in Taiwan where I live).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Annie Douglass Lima",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3445026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-10T18:13:47.72Z",
                "reviewBody": "Very yummy but I am not sure if I made the sauce right it was more like a paste. I went ahead and finished and it tasted very good. Even my daughter who is a very picky eater liked it. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "poohnut",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2770760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-12T03:42:34.677Z",
                "reviewBody": "I had bought a ginormous (is that even a word?) zucchini at the 99 cent store and wanted a stuffed zucchini recipe that could be used as a main dish. This recipe suited my needs perfectly and we all loved it. I added an equal amount of panko crumbs to the Parmesan cheese on top to give it a little crunch. Since the zucchini was so large I doubled the filling ingredients but it turned out I shouldn't have done that. No worries though. I just put the extra filling in a casserole dish topped it with the Parmesan/panko mixture and baked it along with the zucchini. The topping didn't brown very well in the oven even after almost 30 minutes of baking so I put it under the broiler for a couple minutes to finish it off. This will definitely be repeated but I think I'll peel the zucchini dice it all up into the filling and bake it as a casserole instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3018112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-09T03:33:36.387Z",
                "reviewBody": "Just made this recipe and my Grandmother loved it. I liked it a lot too but it wasn't my absolute favorite. Really I may just not be a big nutmeg fan but it was still good. Not a whole lot of work actually fairly easy but it does make quite a few dishes:). Overall a solid four stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pritchetth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7790673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-17T17:07:00.34Z",
                "reviewBody": "Was a little skeptical of this recipe at first with the nutmeg because my husband can be very picky about his food. I LOVED it and my husband did too. My 4 year old loved the filling but is not very fond of zucchini. Quick and easy meal. Will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4420696/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-29T17:37:48.757Z",
                "reviewBody": "I was a little unsure about the recipe to begin with but was pleasantly surprised. My family really enjoyed it. I miss read the instructions and took the skin completely off instead of just scooping out some of the zucchini. I just turned it into a casserole with bread crumbs and cheese on top. Worked perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachelle Posein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7952759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-07-09T19:19:54.477Z",
                "reviewBody": "This was incredible. and my husband ate his squash as well as the filling. (He's as bad as a kid with some of his eating preferences.). I chose the recipe because it does not call for tomato sauce which gives him heart burn. I made some minor changes. I doubled the nutmeg and the garlic. Then since the sauce was very pasty I added an extra half cup of milk--much creamier. My husband does not like the taste of parmessan cheese so I used mild cheddar but mixed it in to the whole concoction before piling into the shells. Then since I used BIG squash ( one that had gotten away from me in the garden) I had to toss most of the pulp because the seeds would have been tough. So I took some nice small yellow squash sliced it then and cooked it until just tender in the meat after the meat was all browned. I also had some mushrooms I wanted to use up--maybe about 3/4 cup--so I tossed them into the meat mixture. Then I piled the whole mess into the shells sprinkled a wee bit more cheddar on top and baked it for 30 minutes. The combination of boiling and baking made even the skin on the large zucchini tender enough to be edible. It was really good. I think a person could use the base recipe and experiment with lots of different flavors. I actually forgot to put the paprika in but it was still awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KarenSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8507229/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-02T10:16:59.833Z",
                "reviewBody": "I live in Japan and since you wrote the temperature of the oven in Celsius it was much easy for me. I thought it was going to be complicated but it was not: easy fast and yummy. I had all the ingredients! Couldn't believe it! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11953978/"
                }
            }
        ]
    }
]