[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11590/springerle-v/",
        "name": "Springerle V",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F624637.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1998-12-19T21:38:04.000Z",
        "description": "This is the best tasting, easiest prepared springerle recipe I have baked over the past 35+ years.  I use a springerle board for ease, vs. the rolling pin.   My friends still love to receive these as gifts each Christmas.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 to 5 dozen",
        "recipeIngredient": [
            "4 eggs",
            "1 pound confectioners' sugar",
            "2 teaspoons anise extract",
            "4 ¼ cups sifted all-purpose flour",
            "2 teaspoons baking powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat eggs until light  with an electric mixer on high speed. Reduce speed and add the anise extract and confectioners' sugar. Continue beating at medium speed until well combined.  Sift together the flour and baking powder; stir into the egg mixture, dough will be quite stiff.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out dough to 3/8 inch thickness. Imprint with a springerle board and cut apart. Place cookies onto a cookie sheet and let rest uncovered overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Bake cookies for 7 to 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Shirley"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.588235294117647,
            "ratingCount": 17,
            "itemReviewed": "Springerle V",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "66.8 calories",
            "carbohydrateContent": "14.4 g",
            "cholesterolContent": "12.4 mg",
            "fatContent": "0.4 g",
            "fiberContent": "0.2 g",
            "proteinContent": "1.3 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "21.2 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-10T15:36:02.11Z",
                "reviewBody": "OK let me start that these aren't quite like my Nana's or my German relatives that owned a bakery up until recently but they are pretty darn close! I have tried several recipes and always ended up with a trash can case because I didn't know anything about them as far as making them. (another recipe my Nana failed to give any idea how to make) I am sure once they dry out a little more (because they SHOULD be hard almost like biscotti) they are going to be fabulous! My father is so excited...we used to pay big money for these and they were relatively cheap to make. Be sure to roll out 3/8 inch and I personally like the springerle roller...I have an antique that has quite a story and they came out amazing! Thanks to Shirley....I was able to recapture a little of my childhood this morning:) Do NOT cook this on the company that has the clay cookie/baking sheets...you MUST do it on metal ones!!! (I love their stuff but it will not bake right on it!!!) I did not have any of the problems the first poster suffered....the measurements are all correct. The trick is you MUST whip up the eggs until they are light. This requires some high speed on your mixer's part. I had no problem with anything other than using some of the wrong pans. I was actually even able to resurrect them by rebaking this on metal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "islandgirlejfan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/167795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T01:48:46.92Z",
                "reviewBody": "Tastes very good but the dough is too crumbly to work with as written. I decreased the flour to 4 cups and it was still crumbly but more workable than with 4 1/4.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JENCONGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/833687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-03T17:00:57.617Z",
                "reviewBody": "As an avid baker I am blown away----- These cookies are beautiful and tasty.. I made the first batch as directed and they are perfect..the second batch I added almond extrat and let cookies dry on sliced almonds both are perfect!!!! Thank you for this wonderful recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JPUTNEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/466684/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-29T22:10:33.237Z",
                "reviewBody": "These are great...I was looking for another recipe to try instead of my usual and these are very close to my usual recipe for springerle. I crush anise seed spread it on a cookie sheet and let the cookies dry overnight laying on that for even more flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2841496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T19:53:18.98Z",
                "reviewBody": "I remember my Grandmother making these cookies when I was young for my Dad. They were hard as rocks and he pretty much had them to himself. LOL. I wanted to surprise him by making some. I couldn't let them set overnight so a few hours was all I had before baking them. They were softer than normal but he really loved them. I only made a half batch so I now have fixin's for a second one later this year.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wellsteins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1499129/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-26T21:19:20.953Z",
                "reviewBody": "Yummy! And just like my husband's grandma used to make! I couldn't find Anise Oil (which is what her recipe called for) so I've been looking for a similar recipe one that uses Anise Flavoring instead --- The cookies puffed up perfectly and are soft inside a bit crusty on top. I used a springele rolling pin but Grandma used to use a large star on her cookie press and press out long strips of dough then cut them before leaving them to dry overnight. Thanks for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KathyL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3419593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-09T17:41:17.98Z",
                "reviewBody": "I followed this exactly and had no problem with the consistency. But I even put 3 teaspoons of anise extract - brand new bottle I got from health food store - and these had no anise flavor. I don't care for the anise seed as I have tried the seeds before and did not think they gave enough flavor. But the seeds seem to give a more genuine anise flavor to the cookies. I would always watch my mom and grandma make these every year - german heritage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "btemple8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5278201/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-16T04:04:43.67Z",
                "reviewBody": "This is almost exactly the recipe handed down from my grandparents however we use anise seeds instead of anise oil and add the zest from 1-2 lemons (I use 2). Once the cookies have been rolled place onto a cloth sheet covered with seeds to dry overnight. If the humidity is low you may want to gently roll the seeds into the dough before flipping it over and imprinting. The amount of flour required is heavily influenced by ambient humidity. In S. Florida we used 4 cups of flour; here in Maryland it varies from 3-3.75. You definitely need to eyeball it. Dough should be stiff to where it looks nearly crumbly coming out of the mixer (the dough hook works well for the last 2 cups of flour). We then refrigerate the dough in wax paper for an hour or 2 before rolling which helps keep it from sticking to the rolling pin. Fresh out of the oven they are crispy on top soft inside but will harden over a few weeks. When baking they should still be white on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AmandaZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10521283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-27T19:09:15.24Z",
                "reviewBody": "My mom was looking for these cookies so I decided to try making them... She loved them and said the were just like the ones her grandmother made",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jurameky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6435366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-22T13:51:37.297Z",
                "reviewBody": "I made 1/2 recipe to try this out. I had a barn animal mold that I bought at a flea market years ago. I knew it was a mold but wasn't sure what for until I found this recipe on here. With 1/2 the recipe I got about 15 cookies with the size mold I was using. I found the dough to be very hard to bind. I ended up finally resorting to adding 1 Tblsp. of water so that it came together but still remained quite stiff as suggested. I baked them this morning and they held up well. The downside: is I didn't think they tasted that great as they tasted doughy and floury. It kind of reminded me of a sweet unleavened biscuit. We ended up not eating more than one whole cookie. It appears this recipe is well liked. I am not sure if it is because the print holds up or I just don't care for the taste of springerle cookies? I found out today that shortbread also works in cookie molds so I might try that next time. It was interesting learning the method though and trying out my cookie mold for the first time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            }
        ]
    }
]