[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216187/lemon-star-bursting-cookies/",
        "name": "Lemon Star Bursting Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7293715.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2018-06-08T13:57:32.000Z",
        "description": "A melt in your mouth, lemony surprise!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "3 1/2 dozen",
        "recipeIngredient": [
            "1 cup all-purpose flour",
            "½ cup cornstarch",
            "½ teaspoon salt",
            "½ cup confectioners' sugar",
            "¾ cup butter",
            "1 teaspoon lemon extract",
            "1 cup confectioners' sugar",
            "1 (.25 ounce) package unsweetened lemonade flavor drink mix (such as Kool-Aid®)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sift the flour, cornstarch, and salt in a bowl. In a larger bowl, beat 1/2 cup confectioners' sugar with butter using an electric mixer until the mixture is creamy and free of lumps. Beat in the lemon extract, then mix in the flour mixture to make a smooth dough. Chill the dough for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). Mix 1 cup of confectioners' sugar with the lemonade drink mix in a plastic zipper bag. Close the zipper, and shake the bag to blend.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scoop up about 1 1/2 teaspoon of dough per cookie, and roll into balls. Place the cookies onto ungreased baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cookies are set, about 20 minutes. Remove from oven, and let cool on sheets for 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop the warm cookies into the bag of lemon sugar, about 5 or 6 at a time, and shake to coat with the mixture. Shake off excess sugar, and allow the cookies to finish cooling on wire racks. When cool, shake them in the lemon sugar one more time.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mariann Holohan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.6666666666666665,
            "ratingCount": 12,
            "itemReviewed": "Lemon Star Bursting Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "62.9 calories",
            "carbohydrateContent": "8 g",
            "cholesterolContent": "8.7 mg",
            "fatContent": "3.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.3 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "52.9 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-07T16:29:50.167Z",
                "reviewBody": "These cookies were easy and oh so delicate. There is No way to shake the coating on at the end of the baking time Way to fragile so I used a sieve to add the sugar mixture. It was just enough to make them more lemony. I made them in orange flavor as well. I was taking these to a birthday party at the park and was very concerned they would crumble when someone picked them up they held together and were being fought over by the 5 Yo birthday girls Mom and her sister. The party food was spicy Mexican food and the cookies were a Cool addition. Very good flavor. These would be really nice for a little girls tea party. These cookies spread like Crazy even keeping the dough/cookie sheet in the fridge and using half butter half shortening. Thank You Mariann01",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty Cakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ilovecarlos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-17T00:19:14.343Z",
                "reviewBody": "Two things are true: I love lemon and I often tweak a recipe. I thought these were going to be a little bland when I tasted the dough so I added a good 1/2 teaspoon of lemon zest. I have a lot of powdered sugar/Koolaid mix left. I got to thinking about that and figured that how do you cut in half that small of a package of Kool-Aid--and what would I do with the rest--so I will just save it for another batch. The Kool-Aid gives a sharp taste on the tongue and at first I wasn't sure if I liked that. I'll see how that holds up as the cookies set more. By the way the size of the Kool-Aid package is now.23 oz! The cooking time is right on target but I will make the cookies smaller next time (I used the smallest cookie scoop) so I'll watch the time. I got 36 cookies from this batch. I would definitely make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-12T18:19:45.427Z",
                "reviewBody": "I just finished making these cookies and they turned out awesome! I had no problem whatsoever and I followed the recipe adding fresh lemon zest (about a teaspoon) to batter. I used a little more than half the lemonade mix with the powdered sugar and it was just enough tartness! I had no problem with crumbling - didn't ruin one cookie. This recipe is a keeper and will be added to my favorites. Can't wait for my family and friends to sample them for the holidays! Definitely 5 stars",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marilyn V.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14874663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-03T00:54:05.27Z",
                "reviewBody": "This was exactly what I was looking for! Wonderful!!! Tart buttery and tender. Girl Scout Lemon Coolers have nothing on these lovelies! I measured my flour before I sifted which gave me balls that didn't spread or change much at all in the baking. (The reviewer who commented that they spread may have measured AFTER sifting which I USUALLY do). I needed 125 cookies for Christmas gifts and 4 recipes only gave me 100 - my cookie scoop wasn't working well because of the stiffness of the dough so mine weren't perfectly uniform. I under mixed being concerned about them turning hard. No such problem a few fell apart in my hands and had to be eaten (no hardship believe me). I also wondered if they would be lemony enough and considered adding some zest. I was glad I hadn't though - the sugar coating is very tart and needs the balance of the subtle dough. Also I made 2 recipes of the coating and had most of it left at the end. I will have enough to last me a very long time again no hardship. I did use the bag idea but one cookie at a time and VERY gently burying and unburying it. Give 'em a try if you are a lemon lover!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxanne Romanek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1303676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-03T02:54:58.533Z",
                "reviewBody": "Very good but my friend and I added about 1 1/2 teaspoon of lemon extract on accedent and as a suprise for our family members... it sure was!! Also the 3 stars was because it was very crumbly and fell apart easily but the taste was yummy. This was the first recipe I have made on this site and it was simple. The only other mistake was that we accedently put the confectioner's sugar and butter into the same bowl as the powder mix. It still turned out great but would probably make more carefully.:) Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "birdluv4ever",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sneeb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-02T19:17:39.02Z",
                "reviewBody": "great but I doubled the recipe but my sister told me to use 1 pkg of kool aid for the whole thing it was much better. (a whole package of kool aid for a single batch was too bitter)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12687247/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-01T19:09:02.37Z",
                "reviewBody": "Super easy to make. \"Drop them in the powdered sugar\" was laughable since they were terribly crumbly until the next day. It seemed they need 24 hours to cool before you could pick them up. I wasn't sure why but there was a terrible salty taste that stayed in my mouth afterwards. I wondered if the addition of an egg would make a difference in the crumbles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jonine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1386099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-06-30T03:34:34.48Z",
                "reviewBody": "To speed up the making of the balls form the dough into a rectangular disk about 3/4 inch thick. Refrigerate as directed. Then cut the disk horizontally and vertically into squares. Move to cookie sheet and bake. If some fall apart just press them back together. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4029530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-31T20:00:43.667Z",
                "reviewBody": "I just baked the first bunch. Actually even making rather small balls I didn't get more than 30 cookies. Since they are really yummy I'll just start over tomorrow... I was happy about the recommendation not to coat them using a bag. I also made two changes: I added 1/2 tablespoon of baking soda and I used \"Vanilla-Sugar\" (unfortunately it couldn't find it here so I braught some over from my last trip to Germany - I love to add that to my coffee along with a little cinnamon...) and a little less sugar. The vanilla taste comes through quite nicely and is just a little subtler than the extract.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ibake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9699488/"
                }
            }
        ]
    }
]