[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/672/meat-and-poultry/pork/sausage/",
                    "name": "Sausage",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216675/the-pacemaker-venison-burger/",
        "name": "'The Pacemaker' Venison Burger",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F701343.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-06-08T13:57:48.000Z",
        "description": "This massive venison burger is sure to do you in. Pile it high with a fried egg, maple bacon, avocado, caramelized onions, sauteed 'shrooms, thick slab of cheese -- and rest it on a foundation of iceberg lettuce with fresh tomato. Don't forget the toasted Kaiser roll and onion rings. Welcome to the World of Gluttony. Fire Dept. tested and approved.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "4 burgers",
        "recipeIngredient": [
            "2 ⅔ pounds ground venison",
            "⅓ pound bulk pork sausage",
            "2 tablespoons barbecue sauce",
            "salt and ground black pepper to taste",
            "1 (12 ounce) package frozen, breaded onion rings",
            "2 tablespoons butter",
            "1 tablespoon olive oil",
            "2 large onions, sliced",
            "1 (8 ounce) package sliced cremini mushrooms",
            "1 (1 pound) package maple-cured bacon",
            "1 tablespoon butter",
            "4 eggs",
            "4 large Kaiser rolls, split and toasted",
            "4 thick slices Cheddar cheese",
            "2 Haas avocados, pitted, flesh scooped out, then sliced",
            "1 large tomato, sliced",
            "1 head iceberg lettuce, shredded",
            "4 teaspoons ketchup, or to taste",
            "4 teaspoons mustard, or to taste",
            "4 teaspoons mayonnaise, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a bowl, thoroughly mix together the ground venison, pork sausage, 2 tablespoons barbecue sauce, salt, and black pepper. Divide the mixture into fourths, and form each fourth into a large patty. Refrigerate until time to grill.\n"
            },
            {
                "@type": "HowToStep",
                "text": "If using onion rings, preheat oven to 425 degrees F (220 degrees C). Spread frozen rings in a single layer on a baking sheet, and bake until hot and golden brown, about 15 minutes. Set the onion rings aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat butter and olive oil; cook the onions until they begin to brown, stirring occasionally, about 10 minutes; sprinkle with salt and pepper. Mix in the sliced mushrooms, and cook, stirring occasionally, until browned, 10 to 15 more minutes. Set the onions and mushrooms aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon of butter in a clean nonstick skillet over medium heat until the foam disappears. Crack the eggs into a bowl, and gently pour them into the butter. Pan-fry the eggs until the whites are opaque and the eggs slide around the pan easily, about 1 minute; carefully flip each egg over in the skillet, avoiding breaking the yolk, and pan-fry for about 1 more minute. The whites should be firm but the yolks should be runny. Transfer the eggs to a plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for high heat, and lightly oil the grate. Grill the venison burgers until they show grill marks and are cooked to your desired degree of doneness,  5 to 8 minutes per side for well-done. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). While still on the grill, gently top each burger with a fried egg and a slice of cheese. Lower the grill lid, and cook until the cheese has melted, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble, place the bottom half of a Kaiser roll onto a plate; spread with a layer of shredded lettuce, followed by tomato slices, the venison burger, a layer of mushrooms and onions, bacon slices, onion rings, avocado slices, ketchup, mustard, and mayonnaise. Place the roll top onto the sandwich. Good luck.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Sausage"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jraybuck"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 4,
            "itemReviewed": "'The Pacemaker' Venison Burger",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1751.8 calories",
            "carbohydrateContent": "82.9 g",
            "cholesterolContent": "544.5 mg",
            "fatContent": "108.7 g",
            "fiberContent": "13.4 g",
            "proteinContent": "112.1 g",
            "saturatedFatContent": "40.1 g",
            "servingSize": null,
            "sodiumContent": "2536.1 mg",
            "sugarContent": "12.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-09-16T00:43:12.25Z",
                "reviewBody": "Where do I even start with this review? Wow there is a lot going on in here and I gotta tell you that the end result was yumalicious! My hubby is the one that found this recipe over on Man Tested Recipes (sister company to allrecipes) and on that site it states that the onion rings are optional and I chose to leave them out to cut down on SOME of the fat. I made one substitution due to what I had on hand and only one. I used pepper jack instead of cheddar. My first thoughts while reading over this recipe is that it was too extremely \"gawdy\" and that all the individual flavors would get lost in each other or that it would taste just downright bad but I couldn't have been more wrong. I could taste each individual flavor with every bite and it all blended very nicely together. I especially liked the maple bacon with the venison. I did my direction steps a little different and out of order to suit my way around the kitchen but as written works too. I won't be making this one often due to the \"heart attack\" factor but I will be making again and it is one I will look forward to. Thanks for sharing Jraybuck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Soup Loving Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/souplovingnicole/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-06T19:32:17.957Z",
                "reviewBody": "I love this! I make it the same way but also add a roasted deseeded anahiem chili pepper! Gives it a nice spice pop!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Get Girly Recipes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8073236/"
                }
            }
        ]
    }
]