[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217281/apricot-chicken-provencal/",
        "name": "Apricot Chicken Provencal",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4464940.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2018-06-08T13:58:17.000Z",
        "description": "Delicious French-inspired chicken dish that features herbes de Provence and an apricot sauce. My ingredient amounts are estimated, particularly with the herbes de Provence. I made up this dish on the fly, and I generally cook based on smell and taste rather than strict measurements. It is important to note that using too much herbs de Provence may make the dish smell or taste too much like fancy soap, due to the lavender in herbs de Provence. Use your best judgment based on your personal tastes. Enjoy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "8 chicken drumsticks, with skin",
            "1 teaspoon salt, or more to taste",
            "3 tablespoons herbes de Provence",
            "2 tablespoons olive oil",
            "2 garlic cloves, minced",
            "1 tablespoon herbes de Provence",
            "6 fresh apricots, pitted and chopped",
            "½ cup apricot preserves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C). Grease a baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season the chicken drumsticks with the salt and liberally rub with 3 tablespoons herbes de Provence.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large skillet over medium heat. Cook the garlic in the hot oil until fragrant, 3 to 5 minutes. Add the seasoned chicken to the skillet and cook, turning to brown on all sides, 5 to 10 minutes. Sprinkle 1 tablespoon herbes de Provence, assuring all sides of chicken are covered with herbs. Transfer the chicken to the prepared baking dish, reserving the liquid in the skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until no longer pink at the bone and the juices run clear, about 20 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the chicken bakes, add the apricots and the apricot preserves to the skillet, scraping the bottom of the skillet with the back of a wooden spoon. Reduce heat to low and simmer until the chicken is cooked through. Add the chicken to the skillet and simmer with the sauce another 5 minutes. Spoon the sauce over the chicken to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "apple atcha"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.375,
            "ratingCount": 16,
            "itemReviewed": "Apricot Chicken Provencal",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "487.4 calories",
            "carbohydrateContent": "32.1 g",
            "cholesterolContent": "127.9 mg",
            "fatContent": "22.7 g",
            "fiberContent": "1.2 g",
            "proteinContent": "39.1 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "724.7 mg",
            "sugarContent": "22.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-07-18T01:59:10.927Z",
                "reviewBody": "This was the saving grace to our meal tonight and really, really good. Instead of legs, I used bone-in breasts as that is what I had. I also didn't have apricot jam, so I subbed peach for it. I did however have the fresh apricots. The one major thing I did that wasn't specified in the recipe was, after browning the chicken, there wasn't really any kind of liquid in the pan to deglaze with so, I added about 1/3 C of white wine to deglaze the pan and then added the preserves and apricots. Cooked on a very low heat so that the fruit would stay in tact and not burn or break down. Ended up using about 3 T. of the Herbe's de Provence rather than the 4 as stated in the recipe. I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avon- status quo PRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3326566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-20T12:13:59.377Z",
                "reviewBody": "This recipe was great!  Of course I made a couple modifications, but nothing crazy.  I used an extra clove of garlic when sauteing the chicken (I also used bone in half chicken breasts).  Then after I removed the chicken, I scraped most of the browned garlic out of the pan thne I added cubed red potatoes another clove a garlic, a little more oil and herbs, salt, pepper.  After they browned a bit I added them to the chicken pan and put them in the over.  \n\nFor the glaze, I decided I wanted onions in it to give it a little more savory, so I caramelized thinly sliced sweet vidalia onions in the same chicken pan before adding the other ingredients.  Also, I didn't have enough apricot preserves (only 1/3 cup) so I added 1/3 cup of orange juice, along with the preserves and apricots.  It was WONDERFUL.   \n\nThe chicken was still juicy when it came out of the oven in about 30 mins (they were big halves) and the glaze was perfection!!  I can't wait to make this again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADESSO79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/930171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-01T16:06:40.807Z",
                "reviewBody": "I used 1 packet of stevia instead of the preserve. Very good!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kara Ceschini",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/karaceschini/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-13T20:45:45.983Z",
                "reviewBody": "This has been my first complete cooking failure not of my own doing but rather from this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "kmae2323",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3881698/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-16T02:02:27.987Z",
                "reviewBody": "This. Was. Wonderful.  Everyone in the family (including a teenage boy) gave it an enthusiastic thumbs up.  I couldn't find herbes de provence at my grocery store, so used this substitution recipe (without the lavender)\n\n2 teaspoons dried thyme\n2 teaspoons dried savory\n1 teaspoon dried marjoram\n1 teaspoon dried lavender\n½ teaspoon dried rosemary\n½ teaspoon fennel seeds\n1 crushed Bay leaf\n\nI used about 1 1/2 recipes of the substitution and it was plenty for our tastes.  I rubbed it into the chicken, but didn't add any additional before baking.\n\nIt does need some liquid in the sauce, but instead of adding white wine like one reviewer, I just added a few tablespoons of water.  I also added an extra apricot or two.  The garlic, sweet apricots and spices make such a delicious combination.  I served it with rice and steamed vegetables.  It's definitely a keeper and I will make it whenever I have access to good fresh apricots.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Swedishmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9445617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-30T23:10:08.71Z",
                "reviewBody": "This is more of a guideline than a strict recipe but if you are flexible it is delicious. I followed the advice of another reviewer and used some sherry to deglaze the pan. I also added about a 1/4 of a thinly sliced onion with the garlic. I don't care for the taste of lavender so I followed a recipe by Emeril for making herbes de Provence. The chicken doesn't really release much juice while browning as instructed (I used thighs not drumsticks) but does while baking. So I added some of that juice back in at the final step and brought the sauce back to a boil. Served over rice it was wonderful. I do recommend using boneless chicken if possible as it was a bit messy to eat but worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jayme Hancock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7237223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-06-19T08:45:31.877Z",
                "reviewBody": "I am not a fan of chicken legs so I decided to make this recipe with boneless skinless chicken thighs instead. Because there's no bone I didn't think there was the need to use the oven so I changed the steps slightly and used a Dutch oven on the stovetop to prepare the whole meal. I seasoned and browned the chicken as directed. Then put the lid on the Dutch oven and let everything cook over medium heat for about 15 minutes. When the chicken was cooked through I removed it to another plate and deglazed the pan with red wine. Then I added the apricots and orange marmalade (we didn't have apricot jam). I stirred this together added back the chicken and let it simmer about ten minutes before serving over rice. I had really really ripe apricots and they fell apart in the pan. I didn't mind this at all because it formed a thick rich sauce that was delicious. Even my picky 5-year-old loved this once we removed the apricots form his plate and got him to take a couple of bites. The flavor is sweet and salty with the lovely note of lavender in the background. I think this would work quite well with boneless pork chops too and that's probably what we'll try next time we want to take this recipe for a spin. But we will also keep the chicken in our repertoire. It was delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny Weaver-Beal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3978833/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-02T02:41:59.6Z",
                "reviewBody": "Excellent! As some others did I sauteed half an onion in the pan then deglazed with a little white wine before adding the apricot and preserves. When I put the baked chicken back in the pan I included the juices. This was a really incredible meal which went nicely with Freekeh. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aimeelynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7207858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-24T04:54:16.283Z",
                "reviewBody": "I used more hdp garlic and apricots. I loved the smell and I chopped extra apricots for a raw garnish when plating. I didn't have preserves so I used orange-tangerine juice but the preserves would have been better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SassyCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6476725/"
                }
            }
        ]
    }
]