[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/916/side-dish/sauces-and-condiments/gravy/",
                    "name": "Gravy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229035/old-time-kentucky-bacon-milk-gravy-for-biscuits/",
        "name": "Old Time Kentucky Bacon Milk Gravy for Biscuits",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1093274.jpg",
            "width": 1920,
            "height": 1422
        },
        "datePublished": "2018-06-08T14:05:02.000Z",
        "description": "I grew up with this gravy! Everyone has heard of sausage gravy. Well, it don't compare to this! After frying your bacon for breakfast, use the bacon dripping to make true Kentucky biscuit gravy. Fattening? Oh yeah, you better believe it! Worth it? Yes! Pour over biscuits and serve with crispy bacon and eggs in any style.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "¼ cup bacon drippings",
            "¼ cup all-purpose flour",
            "1 teaspoon salt, or to taste",
            "1 teaspoon ground black pepper, or to taste",
            "4 cups milk, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat bacon drippings in a skillet over medium heat; whisk flour into drippings until smooth. Reduce heat to low and cook the flour mixture until it turns a caramel brown color, stirring constantly, about 15 minutes. Be careful, the roux burns easily. Stir in salt and black pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk 1/2 cup milk into the roux until thoroughly blended. Continue whisking milk into the gravy, 1/2 cup at a time, whisking in each amount of milk completely before adding more. Bring gravy to a simmer and whisk constantly until thick, smooth, and bubbling.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Gravy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tess DeFevers Ehling"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.542168674698795,
            "ratingCount": 83,
            "itemReviewed": "Old Time Kentucky Bacon Milk Gravy for Biscuits",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "190 calories",
            "carbohydrateContent": "11.8 g",
            "cholesterolContent": "22.4 mg",
            "fatContent": "13.1 g",
            "fiberContent": "0.2 g",
            "proteinContent": "5.9 g",
            "saturatedFatContent": "5.9 g",
            "servingSize": null,
            "sodiumContent": "469.4 mg",
            "sugarContent": "7.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-11-03T19:03:08.343Z",
                "reviewBody": "I grew up with this gravy as well. I and my mom and my mom's family came from the mountains of good 'ol KY. This recipe is the old original mountain milk gravy my mom was taught to make by her mom. My mom was a coal miners daughter living 2 coal camps down from Loretta Lynn.As a child I was always taught to keep the grease that came off the bacon back because we always used it for cooking.  Green beans,biscuits,cornbread,greens,fried cabbage,ect....I don't cook with it as much now learning just how unhealthy it is for my family and myself,but now and then I do go with those yummy home cooked meals from way back. This is awesome and you will love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michael and Lori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4245040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-06-12T02:46:24.153Z",
                "reviewBody": "This is a basic gravy recipe to which you can add to. I gave it a 3  because if you cook it the way it is recommended, it will come out way too thin. The thing you have to keep track of is your heat. Your roux will never thicken on low, and if you don't increase your heat when you add the milk you will never get it to simmer, much less thicken. The act of bubbling is what makes it thicken. you will never be able to make this in 36 minutes on low heat. Increase your heat to medium, season to taste, and it works just fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Neeta Chowdhry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3144261/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-29T15:38:27.587Z",
                "reviewBody": "Great gravy, but this recipe has errors so I couldn't give it a 5. First, it calls for twice the milk needed and would be very runny made as stated. 2 cups is plenty, 2-1/2 if you like it thinner. Also, I have never cooked a roux longer than 3-5 minutes. The reviewer who complained of burnt bacon taste should try greatly reducing roux cooking time, and stir constantly. As a general rule for nice, thick sauces made with a roux (fried flour) you should use a ratio of 2 tbsp. fat to 2 tbsp. flour per 1 cup of liquid. Stir constantly and have patience!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYSLEW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ladyslew/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-05T15:24:50.963Z",
                "reviewBody": "This is the same recipe my mom taught me to make best gravy for biscuits for sure. Great with some \"runny\" eggs don't forget fried potatoes and grits if you really want to go over the top. This gravy is for my once a month breakfast splurge or for the days I will be duing hard work and will burn it all off. The gravy will look very runny I was taught to turn off the burner when it bubbles and by the time you have everything else out on the table the gravy will be thickened- it must cool a bit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bobbi Mastin Hamilton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2718573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-17T21:23:45.23Z",
                "reviewBody": "This is the way I was taught to make it from a Southern grandmother.  We always use whole milk but when she was poor she cut it with water but it is much richer with whole.   I have even added a tablespoon of butter or a some dry coffee creamer. This is GREAT served over fresh summer tomatoes!  \nTips: This recipe is very forgiving so you can adjust.  Main thing is equal ratio of bacon fat to flour maybe more fat.  There has to be enough fat to fry the flour first without it drying or clumping. Frying the flour is what makes it taste so good. A heavy cast iron skillet also helps and fry on low and constantly stir. Have all ingredients ready before you start, it moves fast. When you go to add your milk, take it from the heat, this will help you blend it before it tries to thicken and will prevent clumps. For the one who said 4 cups is too much milk,  it is not. Just simmer a minute and it will thicken right up.If its just a single person you can add less it thickens faster. The longer it simmers with the milk the more flavor and 4 cups allows it to simmer.  This is usually served a bit on the thicker side but some people like it more thin like traditional gravy,again on low heat and ALWAYS STIRRING.   I don't add Salt until the end, some bacon is very salty and you don't need more salt. You can easily add salt as you eat it and pepper too.   Everyone doesn't like the pepper. Hope this helps someone.  Enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Owens",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7478231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-02T17:19:49.01Z",
                "reviewBody": "I made it this morning and it didn't need nearly the liquid that the recipe calls for. I wish I had trusted my instincts instead of continuing to add the milk. It tasted great and I'll use this recipe again. Next time I'll try about 2 cups of milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mkmelody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4771361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-16T17:31:58.38Z",
                "reviewBody": "Same recipe I've used all my life. Crumble the bacon and add it back to the gravy. Really Good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "enjkuck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5175952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-30T20:23:09.59Z",
                "reviewBody": "This is thoroughly delicious. Loved it. I do agree with the reviewer who said the ratio of flour:fat:liquid is off it is. Takes too long to cook it down thick enough. But it does eventually thicken beautifully and makes a plentiful serving so I wouldn't say it's \"wrong\" exactly. It's just slower. If it tastes burnt you probably used burnt bacon grease it's not likely that the roux cooking time had anything to do with it - roux for gumbo cooks for nearly an hour before you add liquid and while it can burn 15 minutes is the correct amount of time to turn the roux a caramel brown. I followed this recipe to the letter and had a superior product - you can too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JARRIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jarrie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-29T13:57:12.407Z",
                "reviewBody": "Yes good ole southern gravy been making this as long as can remember but it does only require 2 cups of milk unless you have a large pan of drippings and more flour needed for the extra milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "harbin724",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12511991/"
                }
            }
        ]
    }
]