[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229146/curry-kale-and-potato-galette/",
        "name": "Curry Kale and Potato Galette",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2615023.jpg",
            "width": 2448,
            "height": 2449
        },
        "datePublished": "2018-06-08T14:05:09.000Z",
        "description": "This is a really simple kale recipe that takes few ingredients, can be vegan, and delicious! A great recipe for kale first-timers. This recipe keeps well for 2 to 3 days in refrigerator, and is more pie-like if you allow it to be chilled. Serve hot.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 teaspoon olive oil",
            "1 onion, finely chopped",
            "1 garlic clove, chopped",
            "2 teaspoons curry powder",
            "1 teaspoon ground turmeric",
            "1 pinch ground ginger, or more to taste",
            "1 pinch cayenne pepper",
            "1 bunch kale, stems removed and leaves coarsely chopped",
            "3 potatoes, peeled and thinly sliced",
            "salt and ground black pepper to taste",
            "¼ cup melted butter",
            "¼ cup shredded Cheddar cheese, or more to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease a 2-quart casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in skillet over medium heat; cook and stir onion and garlic until onion is softened, about 5 minutes. Add curry powder, turmeric, ginger, and cayenne pepper; stir to coat. Add kale; cover and simmer, stirring occasionally, until kale is tender and wilted, 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover the bottom of the prepared casserole dish with a layer of potato slices; top with a layer of kale mixture. Season with salt and black pepper. Continue layering with remaining potatoes and kale mixture, ending with a potato layer. Pour melted butter over top layer of potatoes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until potatoes are tender and slightly browned around the edges, about 35 minutes. Sprinkle with Cheddar cheese and cook until cheese is melted, 3 to 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "thattubachick"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.608695652173913,
            "ratingCount": 69,
            "itemReviewed": "Curry Kale and Potato Galette",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "338 calories",
            "carbohydrateContent": "43.2 g",
            "cholesterolContent": "37.9 mg",
            "fatContent": "16.2 g",
            "fiberContent": "6.7 g",
            "proteinContent": "9.4 g",
            "saturatedFatContent": "9.1 g",
            "servingSize": null,
            "sodiumContent": "185.4 mg",
            "sugarContent": "2.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-12-10T03:56:42.403Z",
                "reviewBody": "This was a pain in the neck to make but was absolutely delicious. My husband complained I made a healthy food unhealthy with the addition of potatoes and cheese, but he seeemed to have no better luck than me at leaving the table!  I would reccomend using a large non stick Dutch oven.  I used a stainless saute pan and had to keep waiting for the kale to decrease in volume before I could add more.  I was afraid all the spices were stuck to the bottom of the pan and there would be no spices left for the kale, but this was loaded with flavor and truely unique.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARENKINM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/814556/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-23T01:03:39.1Z",
                "reviewBody": "Delicious! A great way to use kale. I got a little sack of red potatoes in my CSA basket, and had bought a big bag of kale that say, too. I had a feeling kale and potatoes would be good together, so I looked for recipes using both.I reduced the amount of curry powder just a tad, and I'm glad I did. I meant to add cayenne pepper but forgot. I don't miss it even though I like spicy food. My only complaint is the amount of butter. I thought this was too fatty overall, and will adjust the butter and oil amounts in the future. Great recipe, thanks! EDIT: I made this again, but forgot to check my previous review and used the full amount of butter. still too much, lol! definitely reduce the butter unless you want it pooling in the bottom of the pan (waste of butter). I used a mandolin slicer and yellow potatoes so I didn't have to peel. I used some nice aged white cheddar for the topping. The diections don't say to cover while baking, but I found mine cooked perfectly and right on time with it covered, and only uncovered for the cheese to bubble and brown. This recipe is so cheap and so easy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Margar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3863245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-11T06:08:53.653Z",
                "reviewBody": "Very tasty. I had spinach so substituted one large bunch of spinach for the kale. I only used 2 of the 3 potatoes. You don't have to be precise about the spices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christy Anderson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/703613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-05T01:55:02.85Z",
                "reviewBody": "Made this as a main course tonight and it was amazing! I used about 8 small potatoes and sliced on the mandolin. A large bunch of kale wilted down to only enough for one layer so potatoes kale potatoes and cheese. Used a lot more curry powder about 2 tablespoons. I could see adding in some sauteed mushrooms and chickpeas next time but this was really awesome as is. Thanks for the recipe I'll be making this again shortly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diania Merriam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4470667/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-19T01:17:19.997Z",
                "reviewBody": "This turned out pretty good. I think the reviews on it being too much butter depends on how much potatoes you use. \"3 potatoes\" is pretty subjective. I ended up using 4, two of which I would consider extra large. Made 3 layers of potatoes in 9x13 pan. Came out perfect. I think the recipe needs some salt and pepper added. Maybe just sprinkle on the potato layers as they are being added. I ended up using green beans instead of kale since that's what needed used up from our garden share.With only potatoes and one veggie, it seems lacking as a meal. And I got to thinking, you know what would be great in this? Some ground beef! And some carrots. Maybe mushrooms.  A very versatile dish that I will play around with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidirs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5159800/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-23T21:14:56.717Z",
                "reviewBody": "I just made this today for lunch. It was easy to make and turned out really well. I didn't bother to melt the butter I just dotted the top with about 2 Tbs of butter and I didn't add the cheese. I served mine with a spoonful of plain yogurt which I really liked. My 7 year old daughter ate hers with ranch dressing...kids are so weird...and loved it. I like what the other reviewers said about maybe adding chickpeas for protein next time. It has only been an hour and a half since lunch and I'm hungry again...could just be me though...maybe the cheese would have kept me satisfied longer. Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Casey Schoepflin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/caseys/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-08-28T06:41:39.34Z",
                "reviewBody": "Delicious! I used 1 T. butter and 3 T. whole milk to deglaze the kale pan then poured that over. I also added 3 crumbled pieces of bacon to the top to tempt my husband who went back for seconds!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "greenvillejets",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5820632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-04T02:36:49.8Z",
                "reviewBody": "this was so so very good I used sweet potatoes family asked for it 2 days in a row thanks for sharing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katie jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3426848/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-15T00:02:57.253Z",
                "reviewBody": "Loved this!!! I used 2 bunches of kale and topped with provolone cheese at the end. Make sure your potatoes are nicely browned on the top before you put your cheese on. Delicious and easy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Kasz Willmarth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-31T06:01:33.53Z",
                "reviewBody": "Yes I made changes. Not a bunch of kale about 2 cups raw 1 cup steamed before addition. 1 c blanched broccoli from my freezer. 1 Lg. Carrot sliced on cheese grater only 2 Potatoes sliced on cheese grater. 1 Cup of cheese after full cooking in last 5 minutes (covered). Further Additions: 2 Large Oven Roasted Portabella Mushrooms sliced & diced. Review After Tasting: By my own standards it was rather dull. Much more spice and UMPF needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Baygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24845555/"
                }
            }
        ]
    }
]