[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/231510/amazing-muffin-cups/",
        "name": "Amazing Muffin Cups",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4589482.jpg",
            "width": 3708,
            "height": 2628
        },
        "datePublished": "2013-02-25T18:40:50.000Z",
        "description": "Eggs, sausage, red bell pepper, and cheese are baked in hash brown potato 'cups' for a delicious breakfast that will feed a crowd.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "12 links Johnsonville® Original breakfast sausage",
            "3 cups frozen country style shredded hash brown potatoes, thawed",
            "3 tablespoons butter, melted",
            "⅛ teaspoon salt",
            "⅛ teaspoon pepper",
            "6 eggs, lightly beaten",
            "2 cups shredded 4-cheese Mexican blend cheese",
            "¼ cup chopped red bell pepper",
            "chopped fresh chives or green onion"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare sausage according to package directions. cool slightly and cut into 1/2-inch pieces; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, combine hash browns, butter, salt and pepper; divide evenly into 12 greased muffin cups. Press mixture onto sides and bottom of muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F for 12 minutes or until lightly browned. Remove from oven; divide sausage pieces into muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, combine eggs, cheese and bell pepper. Spoon mixture evenly into muffin cups. Sprinkle with chives or onion. Return to oven, bake 13-15 minutes or until set. Serve.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "From the Kitchen at Johnsonville Sausage"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.590673575129534,
            "ratingCount": 386,
            "itemReviewed": "Amazing Muffin Cups",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "223.9 calories",
            "carbohydrateContent": "8.7 g",
            "cholesterolContent": "114.2 mg",
            "fatContent": "18.3 g",
            "fiberContent": "0.7 g",
            "proteinContent": "11.2 g",
            "saturatedFatContent": "9.3 g",
            "servingSize": null,
            "sodiumContent": "412.6 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-04-28T12:44:57.95Z",
                "reviewBody": "Okay, before I start, I KNOW I made a lot of changes but it was only due to extenuating circumstances and a deadline!  I used Italian sausage, crumbled, instead of breakfast sausage.  I also shredded my own potatoes, on the suggestion of another reviewer, and added some shredded sweet potato when I realized I didn't have enough potatoes.  I doubled the recipe, also, and upon realizing I had no idea where I put my muffin tin, just tossed the entire thing in a casserole dish and called it a day.  Found out too late that I had no butter in the house, so I used olive oil instead.  I also used green and orange bell pepper because that's all I had, too.  Finally, I sprinkled the cheese on top right before I popped it in the oven instead of mixing it with the eggs.  I didn't MEAN to make all these substitutions, but the finished product was great regardless!  I fully plan on making it again, per the instructions, but if I can do all this and it still comes out fine, then the recipe is definitely a keeper!\nADDENDUM:  I made this closer to the original recipe, except I left out the hashbrowns and just made the eggs in my muffin tin.  My husband LOVES THEM.  They're great for him to throw on an English muffin for a quick, on-the-go breakfast and I can make them in a large batch at the beginning of the week so he can just grab one and go.  Keeps getting better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Justice Yost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nashvillenosher/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-08T19:39:21.487Z",
                "reviewBody": "I followed the recipe exact. I made these for brunch and they were egg-cellent! (Sorry had to!) We loved them. Very handy for breakfast on the go, a brunch or even a snack, too. Be sure to grease the muffin pans good or it will stick. I did have to cook the hash browns a bit longer than stated in the recipe to get a nice crisp to them. I will definitely keep this one handy. Possibilities are endless for mix -ins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janet Henderson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sweetnspicyjourney/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-04T16:01:08.31Z",
                "reviewBody": "I made these for a weekend breakfast but instead of frozen hash brown potatoes I used 3 medium sized russet potatoes, peeled and grated with the food processor then placed in the colander of a salad spinner and soaked in cool water to remove some of the starch.  Empty the water and spin the grated potatoes dry.  2 cups of cheese is WAY too much - there would have been no room for the sausage, peppers and eggs.  Bake times were perfect.  I have a few left over and think they will make for a quick on the go breakfast snack.  Update:  I made these again with just a couple of changes that worked well.  I used paper cupcake liners, sprayed with cooking spray.  I reserved the cheese to just add some to the top at the end of baking time.  This way I was able to fit a lot more sausage into each muffin cup.  Using the convection setting on my oven really helped to crisp up the potatoes.  These reheat very well, perfect for a quick breakfast on the go.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-07T13:02:20.763Z",
                "reviewBody": "Update: I have tried different potatoes in these. I have used potatoe tots, potato rounds, and hash browns. Tater tots\nWork great if you thaw them well and crush them up. I add garlic salt and chopped onion in the potato mixture and fill the tin half full with potatoes. I spray the tins with Pam and then spray the potatoes with Pam before baking. Make sure you push the potatoes down well. After baking fill with your families favorite ingredients. I fill the tin full and they rise up nice without running over. They puff up big but fall down after baking. A pound of tots makes 24-36 muffins depending on you ingredients.  After cooling I put two in a zip lock bag and freeze them. It is great grab and go breakfast or after school treat for kids. I keep these in the freezer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOK471",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-19T02:22:49.37Z",
                "reviewBody": "I understand this recipe is an ad for a sausage company. This said, I made with 1 lb. cooked until crisp, drained and crumbled bacon, 3/4 c shredded cheddar, and followed rest of recipe. Absolutely terrific! Will never try it any other way! Thanks for the inspiration, Johnsonville!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "flowergirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3293306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-08T22:10:50.58Z",
                "reviewBody": "Easy and yummy. I used fresh potatoes and 1/2 the cheese as suggested by Baking Nana. Thanks for a tasty recipe. Next time I will use less sausage too - the sausage overpowered a bit for us. These are great reheated!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Life Tastes Good",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mmyers168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-07T17:04:02.88Z",
                "reviewBody": "I reduced the amount of sausage for our family preference, but these have a nice, solid taste to them + were quick + easy to make. THIS IS AN EXCELLENT BASE RECIPE. I've already made several batches + here are my suggestions.  Skip the butter and just press the hash browns into a sprayed pan.  I do this by spraying the muffin tin and then dropping a small handful of hash browns in to each opening. Then take a 1/4 cup measure, spray the back side (bottom) of it, and squash it into the muffin tin holding the hash browns.  This presses it down + up the sides brilliantly. You may have to wipe off the 1/4 cup measure and respray it several times. Then I sprinkle with salt and pepper to taste.  Bake the 12 minutes as suggested.  Then, add in whatever finely diced toppings you like. Finally, pour in the egg over each cup and bake per the recipe.   A couple of thoughts on the cheese.   We try not to each much of it, so I have made these without cheese and they still taste great.  I've also tried topping them with cheese at the last few minutes of baking, which didn't turn out so well.  The muffins have a rounded top and the cheese fell off and crisped up along the sides of the tin.   This could be because I overfill mine with toppings...  but this is what I've experienced.   I love the flexibility of this recipe.  I love that I can jam some of these full of mushrooms, spinach, peppers and asparagus.  Right along side of the cheese and egg only for my picky eater.  Love love love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Montro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2305580/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-23T19:14:06.357Z",
                "reviewBody": "These truly were amazing.  The potatoes were crispy and buttery, and the layers worked really well together.  The top was fluffy and the hash browns sweet, with a layer of sausage-goodness in-between.  My family is craving this recipe so I'll be making it again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookie734",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookie734/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-08T22:16:05.027Z",
                "reviewBody": "I made the following substitutions: Being on a paleo diet the potatoes were OUT. I subbed shredded turnip and cauliflower. I used crumbled turkey sausage; instead of 6 whole eggs used 3 and subbed egg whites for the remaining 3 reduced the cheese and just added it on the top during the last few minutes of baking. Also added peppers onions and spinach oh boy my mouth is watering right now just thinking about it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "curlyd1239",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8753319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-26T06:47:52.683Z",
                "reviewBody": "The hashbrowns didn't crisp for me but the finished product did come out for the most part(I lost 2 due to them falling apart). Overall not very impressed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730569/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Amazing Muffin Cups",
            "uploadDate": "2018-02-20T18:32:30.684Z",
            "duration": "PT1M0.811S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F55f92d99-d9de-4382-a18f-6b64ba56dab2%2F247ab053-9f7a-49f9-a99c-9078d8eb3193%2F90x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5737294143001"
        }
    }
]