[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/222/side-dish/casseroles/",
                    "name": "Casseroles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14357/side-dish/casseroles/green-bean-casserole/",
                    "name": "Green Bean Casserole Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219472/french-onion-green-bean-casserole/",
        "name": "French Onion Green Bean Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F744590.jpg",
            "width": null,
            "height": null,
            "caption": "French Onion Green Bean Casserole"
        },
        "datePublished": "2011-11-09T22:26:46.000Z",
        "description": "The iconic green bean casserole is reworked with the flavors of French onion soup -- caramelized onions and Gruyere cheese.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "2 tablespoons butter",
            "2 large yellow onions, thinly sliced lengthwise",
            "salt and ground black pepper to taste",
            "1 tablespoon sherry vinegar",
            "2 tablespoons butter",
            "2 ½ tablespoons all-purpose flour",
            "2 ½ cups milk",
            "1 pinch ground nutmeg",
            "1 pinch cayenne pepper to taste",
            "¼ teaspoon ground thyme",
            "2 tablespoons melted butter",
            "⅔ cup panko bread crumbs",
            "2 pounds fresh green beans, trimmed",
            "4 ounces shredded Gruyere cheese, divided",
            "⅓ cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13 inch casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons of butter in a large skillet over medium heat.  Stir the onions into the pan; cook and stir until very soft and golden brown, about 15 minutes. Stir in sherry vinegar. Transfer to a small bowl, and reserve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the same skillet, melt 2 more tablespoons butter. Whisk in 2 tablespoons flour. Stirring constantly, cook over medium heat until the flour smells like baked pie crust, about 3 minutes. Slowly whisk in milk, about 1/2 cup at a time, then whisk in nutmeg, cayenne pepper, and thyme. Bring to simmer, and cook until thickened, whisking constantly, 3 more minutes.  Transfer to a bowl and reserve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt remaining 2 tablespoons butter in clean skillet; stir in panko until all crumbs are coated; reserve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large saucepan of salted water to a boil over medium heat, and boil beans until bright green and crisp but not raw tasting,  3 to 4 minutes. Drain very well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon half of the caramelized onions into the prepared casserole dish; top with green beans. Season with salt and black pepper. Spread reserved white sauce over the green beans; sprinkle with half of the Gruyere cheese. Top with the rest of the onions, and use the back of a spoon to push onions down into sauce and cheese. Top with the buttered panko crumbs, the remaining Gruyere, and Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until hot throughout and lightly browned, about 30 minutes. Let sit 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Casseroles",
            "Green Bean Casserole Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.532608695652174,
            "ratingCount": 184,
            "itemReviewed": "French Onion Green Bean Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "216.5 calories",
            "carbohydrateContent": "18.9 g",
            "cholesterolContent": "38 mg",
            "fatContent": "13 g",
            "fiberContent": "3.7 g",
            "proteinContent": "9.4 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "195 mg",
            "sugarContent": "5.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-11-27T07:59:11.13Z",
                "reviewBody": "Why are there only 5 stars? This recipe deserves 10! So much better than the canned soup version. Everyone declared it a hit, and hubby said it was the star of the meal. Made this exactly per the video instructions, and will do it again next year. I assembled it the day before, brought it up to room temp. while the turkey baked, then added the topping and popped it into the oven while the bird was resting. Gluten free Panko crumbs worked perfectly. Do use good quality Parmigiana-Reggiano cheese, it matters in this recipe.  Kudos to Chef John for updating a very tired classic. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lucylove",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lucylove/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-28T02:12:16.23Z",
                "reviewBody": "Made this for Thanksgiving.  Loved Chef John's video tutorial.  \"2 Large yellow onions\" was hard to judge for me.  Here in TX we grow 'em BIG.  I ended up using 2 pans to caramelize the plethora of onions.  Still, I used them all in the dish, when one of those biggies would have sufficed.  I used 1% milk and slightly less flour (my hand guesstimate was off).  It didn't thicken quite as much as I thought it would.  This could be due to my flour mismanagement or the 1% milk.  It worked fine in the dish, it just didn't give that soupy-creamy texture that is found when making the recipe using soup from a can.  Also, didn't have sherry vinegar so just used sherry on the onions.  Mmmm.  The Panko and Parm-Reggi was delightfully tasty.  The Gruyere added a nice bite and depth.  However, that cheese is really pricey.  I may make it with a less expensive brand next time.  The flavor of this dish was as wonderful as I thought it would be.  What with all the chopping of my BIG onions and the green beans, the caramelizing and sauce cooking, and cheese shredding, this recipe is a bit time consuming and labor intensive.  But the end result is elegant, tasty and gave me pride that I didn't do the soup version of this classic casserole.  Thanks Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KathyBarbieri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2378327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-19T15:39:33.007Z",
                "reviewBody": "If you are wanting a more decadent green bean casserole other than the regular boring soup kind, this is it!  This is one of my favorites now!  I pretty much went exactly by the recipe except I flavored the white sauce with a little onion and garlic powders and used canned green beans instead of fresh.  I was making a big turkey dinner with this, so I prepared it all the day before.  I assembled it all together except the topping and refrigerated it.  Once I was ready to cook I pulled it out of the refrigerator and topped it with the topping and put in the oven.  It was great!  It turned out nice and creamy and full of flavor!  With the caramelized onions in this, you won't miss those crunchy ones that are normally on top.  But Im sure you could still add those and it would give it another depth of flavor if you love them like I do.  The gruyere cheese is expensive and honestly if you go with a cheaper swiss or even a gouda cheese, it would taste just as good.  So don't get scared away with an expensive cheese because it will still be great with something cheaper!  Thanks Chef John for this delicious casserole!  I will be definitely making again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DanielleLyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2150775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-04T15:57:33.277Z",
                "reviewBody": "I was looking for a way to make the traditional 'green bean casserole' without having to resort to using the stuff from a can as I have to cook gluten-free. This version is way better and my taste buds were pleased! Yes--the cheese is pricey (I paid $4.99 for 4 oz) but it marries all the ingredients together perfectly -- savory and sweet. I didn't have access to fresh green beans and used 2 lbs of frozen -- I cooked them 2 minutes less than the package specified to avoid them getting mushy. I also don't keep milk in the house and substituted half-half. Of course, more calories and fat but the sauce was rich and creamy; I used rice flour to make the roux -- 4 tbsp. For the top, I used Kinnikinnick gluten free panko bread crumbs. This recipe is definitely a keeper in my household!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bigdreamer70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7363610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-18T19:17:01.537Z",
                "reviewBody": "This recipe was the hit of the big dinner party which included a delicious rack of pork and cheesy fantastic scalloped potatoes. It's rather a lot of work but I followed the recipe EXCEPT for adding 1/2 lb of cooked chopped bacon (divided) to both layers of the onions. I used the fresh haricot verts (fresh green beans) from Trader Joe's. Oh boy this is a guaranteed hit - go for it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAVERNEs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1805502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-06T06:44:51.347Z",
                "reviewBody": "This recipe is not worth the time or effort. It has some decent flavors but nothing that really makes it worth it. It looks good smells good and tastes mediocre. We love green bean casserole and were hoping this would be better then other versions. It's not and with all the amazing ingredients it's almost baffling. Like they wash each other out somehow. Just remember this review when your kicking yourself after laboring for nothing =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Schmolies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4304246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-11T14:44:59.493Z",
                "reviewBody": "It came out exactly how it looked on the video and the taste was AMAZING!!\nI was never a fan for green bean casserole but, with this recipe I am a convert\nI needed a recipe.  I got stuck with making this as a side dish for a dinner party.\nMy hubby won't eat veggies to save his life, he had second's and third's, if there were any left he would have requested left over's too. It was a huge hit, this recipe is a keeper no need to look any further.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetcocoa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10066341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-08T00:11:39.587Z",
                "reviewBody": "Nobody except my husband liked this at the Thanksgiving table. I thought it was pretty good, just not worth the effort that I put into it. Hate to say it, but I'll probably go back to the canned soup version.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2981481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-24T04:18:17.05Z",
                "reviewBody": "I made this for Thanksgiving because I didn't want to used french fried onions. It took longer than I expected it to, but it was delicious! My whole family loved it, even the people who don't normally like green beans. I used cheddar cheese instead of Gruyere cheese because that is what we had on hand. I also didn't add any cayenne pepper or thyme(because we didn't have any on hand). The video really helped me to know how long to cook the onions, since I've never done it before.\nOverall I love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bridgetydidgety",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5581924/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Green Bean Casserole",
            "description": "See how to make classic French onion and green bean casserole.",
            "uploadDate": "2012-07-17T19:59:37.362Z",
            "duration": "PT5M30.375S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F00317138-7a91-4bc5-b4d4-5709b46b6bd8%2F214ee6fe-f41e-4fd2-9925-77901b5101bf%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1739941955001"
        }
    }
]