[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/171/soups-stews-and-chili/broth-and-stocks/",
                    "name": "Broth and Stock Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15928/soups-stews-and-chili/broth-and-stocks/chicken-stock/",
                    "name": "Chicken Stock Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220417/roasted-chicken-broth/",
        "name": "Roasted Chicken Broth",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4562777.jpg",
            "width": 960,
            "height": 1112
        },
        "datePublished": "2019-10-10T04:50:25.000Z",
        "description": "Start this flavorful chicken broth by roasting the chicken first, then use all the dark meat to fortify the broth.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT3H45M",
        "totalTime": "P0DT4H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (3 1/2) pound chicken, giblets removed",
            "1 onion, peeled and quartered",
            "1 rib celery, cut in chunks",
            "2 teaspoons kosher salt",
            "3 cloves garlic, lightly smashed",
            "1 tablespoon ketchup",
            "2 quarts cold water, or more as needed "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken, onion, and celery in a Dutch oven. Sprinkle salt over the top of the chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast chicken, uncovered, in the preheated oven until chicken is no longer pink inside, the skin is browned, and an instant-read thermometer inserted into the thickest part of a thigh reads 160 degrees F (70 degrees C), 45 minutes to 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer chicken to a plate until cool enough to handle. Once cool, pick the meat from the bones; set aside chicken breast meat in a bowl for another purpose. Cover bowl of breast meat with plastic wrap and refrigerate. Discard chicken skin.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove chicken fat from Dutch oven, leaving the brown flavor bits in the bottom of the Dutch oven. (See note for reserving drippings if desired.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the Dutch oven over medium-high heat. Return chicken bones and dark meat from drumsticks and thighs to the pot. Add garlic cloves, ketchup and cold water. Bring to a boil, and use a spoon to scrape up and dissolve the brown flavor bits from the bottom of the Dutch oven. Reduce heat to low and simmer for 3 hours, adding more water if needed to retain same level.\n"
            },
            {
                "@type": "HowToStep",
                "text": "As broth simmers, occasionally skim off and discard any foam that rises to the surface.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove and discard bones, meat and vegetables. Strain broth through a fine mesh sieve to serve or use in recipes.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Broth and Stock Recipes",
            "Chicken Stock Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8354430379746836,
            "ratingCount": 79,
            "itemReviewed": "Roasted Chicken Broth",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "420.6 calories",
            "carbohydrateContent": "7.5 g",
            "cholesterolContent": "107.6 mg",
            "fatContent": "25.8 g",
            "fiberContent": "1.2 g",
            "proteinContent": "37.6 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "1333.6 mg",
            "sugarContent": "3.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-07T01:28:03.22Z",
                "reviewBody": "EXCELLENT! One of the things that I did different: After I removed all of the skin and the meat after the roasting time of the chicken - I roasted the bones and the veggies from the pot (I added more onions, carrot and celery) on an oiled baking sheet and baked them at 400°F for ~ 30 minutes so to extract a richer flavor from the bones and the veggies. I followed the remainder of the recipe except I substituted a large dried bay leaf in place of the thyme, added some fresh celery leafs from a celery bunch and black peppercorns after all of the foam and fat had been skimmed off. I never omit bay leafs, celery leafs or peppercorns when I make a broth/stock. I was leery of using ketchup in a broth but I used the Hunts® brand of ketchup because it doesn’t have any high fructose corn syrup in it. Note: I wash off the dirt but I never pare carrots nor peel the outside skin off of onions for making broth/stock because I strive for all of the natural flavor and color that I can get into a broth/stock. After all, the broth is strained well and the bones seasonings and veggies are discarded at the end. The end result was perfect for my tastes and the ketchup added a surprisingly nice touch of flavor to the broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dale1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-17T11:54:12.95Z",
                "reviewBody": "I have made this several times now as there was a tremendous sale on chicken I couldn't pass up!  I followed the recipe exactly with the exception of the ketchup.  There is so little of it and I just didn't want that in my \"natural\" broth.  It was good, but a little light on flavor for me and kind of too much work. (4 stars as written) So - I simplified.  I roasted the chicken & veggies as directed. I separated the meat then roasted the bones.  I placed the chicken bones and the veggies in my crock pot.  I deglazed the roasting pan with a good cup or so of white wine and put in the crock pot as well.  I added enough water to cover everything by an inch and set the crock pot to low.  I let this cook overnight.  In the morning I removed the bones and veggies.  I skimmed the broth and let it cool until I could put the whole thing in the refrigerator.  Once cold I removed the fat easily and underneath that was a beautiful, rich, gelatinous stock. Quite flavorful.  I froze the stock in 16 ounce containers. Easy and no babysitting the stove! (5 stars with these changes.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "What's for dinner, mom?",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whats-4-dinner-mom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-18T15:13:49.163Z",
                "reviewBody": "I've made this several times now and usually make enough to freeze some broth for later use. I wanted to make some of Chef Johns chicken noodle soup yesterday but only had one quart of broth. So instead of starting from scratch I bought one of those Rotisserie chickens, removed the breast meat and threw the bones, skin and all the rest into the stock pot with some carrots, onion, celery and garlic I'd carmellized in 2 Tb. butter. Simmered it for three hours as directed in Chef Johns recipe with his called for ingredients and Ta Da, I had 2 more quarts of stock that was just as tasty as the original home roasted one. I have found that the browner you get your roasted chicken to begin with the richer your stock will be. It does take all day if you roast your own chicken and mine is never browned or done in 1 hour so I usually make the stock on a day I have more time and then freeze it, if I'm not using it in the next day or so for soup. Love this recipe. I never liked my homemade chicken noodle soup until I found this recipe and his Chicken Noodle soup recipe also on AR. Thanks Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "figgy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2448396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-30T03:20:56.767Z",
                "reviewBody": "I use this broth for my soups all the time. It makes the best chicken soup ever! I followed the directions exactly the first time but sometimes I add my own touch. I do use some of the drippings to flavor the broth. I have also used rotisserie chicken to make this broth just make sure you save the drippings from the bottom of the rotisserie pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bombmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7349563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-08T06:52:20.84Z",
                "reviewBody": "Yes this was good and enjoyable to make as I love to cook but I can't help but think it was a waste of time money and most of all electricity. Even when using a pre-baked chicken for the broth it calls for 3 hours of simmering. That's 3 hours of constant gas-fire stove doing nothing to help my environmental footprint.. When weighing the cost benifits.why not just purchase a few boxes of Swanson Chicken Broth?? That's NOT a rhetorical question.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cooking 4 Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8786427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-01T00:58:47.087Z",
                "reviewBody": "So many reviewer's have expressed interest in why the small amount of catsup. Well it's the same reason one uses a small amount (1/4 to 1/2 cup) catsup or tomato paste in a true Italian Bolinaisse (sp) sauce just to add a brownish color. The things one learns when going for your Dietetics degree...hmmm. HTH & Blessings",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Just Tabitha & me",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8005857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-21T21:33:08.843Z",
                "reviewBody": "This is really pretty good but wasn't quite as flavorful as I expected. I have never used the secret ingredient \"ketchup\" when making Broth - I am not a huge ketchup fan nor do I hate it - I am not sure what it added to the overall flavor. I usually roast the bones with a few more vegetable scrapes after having removed all the meat - and achieve a similar broth with a bit more depth of flavor. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-13T14:17:05.917Z",
                "reviewBody": "Good food is good always, but never more so than when it nourishes someone who has lost interest in eating. This is one of the few meals my mother would eat while undergoing cancer treatment. Thank you, Chef John, for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sobriant",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8487415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-18T21:52:11.41Z",
                "reviewBody": "Yep! Chef J's recipes not only turn out great but somehow teach basic cooking skills at the same time. I had a 9-pound stuffer-roaster (!) and knew the broth I wanted from it would not fit in a single Dutch oven so I roasted the chicken and veggies then took everything out saved 2 T fat for his chicken soup deglazed and got the brown bits with water and then put everything in a big stock pot. And the dark meat rather than being discarded made our pups very happy for their supper! (very very careful to remove all bones of course)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynda Terry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10341874/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Roasted Chicken Broth",
            "description": "The key to delicious chicken noodle soup is the broth.",
            "uploadDate": "2012-02-23T17:44:06.777Z",
            "duration": "PT5M25.12S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F1ea7b97a-44b5-4f9d-9f29-8b1cbc5e215b%2F138910e9-b5f7-4809-acbe-74c621fe8ea7%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1468690359001"
        }
    }
]