[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17038/soups-stews-and-chili/soup/vegetable-soup/minestrone/",
                    "name": "Minestrone",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/223044/chef-johns-minestrone-soup/",
        "name": "Chef John's Minestrone Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4425236.jpg",
            "width": null,
            "height": null,
            "caption": "Chef John's Minestrone Soup"
        },
        "datePublished": "2012-06-06T20:21:10.000Z",
        "description": "This is the type of dish I never make the same way twice, but I hope you give this amazing minestrone recipe a try soon, but only once.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H25M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "3 ounces chopped pancetta",
            "1 onion, diced",
            "1 cup diced celery",
            "4 cloves garlic, minced",
            "4 cups chicken broth",
            "2 cups water, plus more as needed",
            "1 (28 ounce) can plum tomatoes, crushed fine",
            "1 cup cranberry beans, shelled ",
            "2 cups chopped cabbage, or more to taste",
            "1 (15 ounce) can garbanzo beans, drained",
            "1 teaspoon red pepper flakes, or to taste",
            "1 teaspoon Italian seasoning",
            "2 teaspoons salt",
            "1 bunch Swiss chard, chopped",
            "⅔ cup ditalini pasta",
            "salt and ground black pepper",
            "¼ cup extra virgin olive oil, for drizzling",
            "¼ cup finely grated Parmigiano-Reggiano cheese",
            "¼ cup chopped fresh Italian flat-leaf parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons olive oil in large stock pot over medium-high heat. Add pancetta; cook and stir until it begins to brown, 2 to 3 minutes. Stir in onions and celery; cook and stir until onions start to turn translucent, about 3 minutes. Stir in minced garlic and cook for another minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour chicken broth, water, and plum tomatoes into the pancetta and onion mixture. Bring to a simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir cranberry beans, cabbage, garbanzo beans, red pepper flakes, Italian seasoning, and 2 teaspoons salt into broth mixture. Bring to a simmer and cook until cranberry beans are tender, adding more water as needed if the soup becomes too thick, about 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in Swiss chard and simmer until softened, about 15 minutes. Season with salt and black pepper to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in pasta and increase heat to medium-high and simmer until pasta is tender, about 15 minutes. Ladle into bowls and top with extra virgin olive oil, Parmigiano-Reggiano cheese, and Italian parsley.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Minestrone"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7972602739726025,
            "ratingCount": 365,
            "itemReviewed": "Chef John's Minestrone Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "483.6 calories",
            "carbohydrateContent": "53.9 g",
            "cholesterolContent": "15.8 mg",
            "fatContent": "23 g",
            "fiberContent": "14.4 g",
            "proteinContent": "17.9 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "2019.6 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-09-09T15:35:44.52Z",
                "reviewBody": "Wow.  What a big soup indeed.  Not only did my husband offer the unprovoked, \"this is the best soup I've ever had,\" there were clean bowls at the end of the meal- four of them.  The significance?  My children ate vegetables- and liked it. \n\nFirst of all, I'm one of these cooks that shamefully can't leave well enough alone and cannot, will not, has not, ever left a recipe as is.  It's not in my genes.  Graciously, Chef John gives us all creative license in his video to waver from the recipe and I did. \n\nSo, let me tell you what I changed, mostly due to what I had on hand and wanted to use  up, and also because I'm pretty sure I was in the wrong grocery store to find \"cranberry beans.\"\n\nI used frozen chopped onions- (I know, but it's what I had) two 14 oz cans diced tomatoes, 1 can small white navy beans in lieu of the cranberries, and a large bunch of romaine lettuce instead of swiss chard and cabbage.  I refused to pay $4.99 for the chard and I forgot to buy the cabbage.  I did throw in about a half cut of large carrot dices that held up well, and fresh green beans cut into 1/2 in pieces.  Lovely.\n\nThat being said, everything else I left untouched- except- I did cut a bit of the parm rind and throw it in while it simmered- awesome call.\n\nIt was amazing.  We had a beautiful loaf of three cheese garlic bread from our local bakery to dredge up the beautiful sauce between hearty bites.  I will be placing this recipe in my PERMANENT collection, and you should too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ahansen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9683281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-24T15:16:13.803Z",
                "reviewBody": "This soup is excellent!  I made as written with the exception of the beans.  I couldn't find cranberry beans and I don't really care for garbanzo beans.  In their place I used light red kidney beans and cannellini beans.  Also, I never cook my pasta in the broth....I always cook it separate and add to the individual serving bowls.  This helps the pasta not get mushy and soak up all of the broth if I want to save some for later or give some away.  If I do give some away, I always give a bag of pasta to go with it!  I will definitely be making this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janmarie1964",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2448410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-27T17:48:30.08Z",
                "reviewBody": "Excellent dish.  Liked the pancetta and I would recommend adding more to the recipe.  My husband who is Portugese loved this dish and even said his parents would have enjoyed. Grocery store unfamilar with cranberry beans but I looked it up on the internet and now know what they are. John excellect selection of spices as it has the right amount of spicyness.  Highly recommend!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sunshine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9508060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-03T07:03:30.697Z",
                "reviewBody": "This is a great recipe.  I of course changed it a bit as chef john suggests most people will do.  My changes were I didn't put in any cabbage or Swiss Chard as I don't care for those very much in my soups.  Also the plum tomatoes I used two cans of diced tomatoes with green chilli's instead.  I am a garlic addict.. so I doubled the garlic... probably will not do next time as it was a little too strong even for me.  For the beans I used red beans, and garbanzo.  Anyway, it was great, loved it and will definitely make it again.  this recipe has earned a permanent spot in my recipe book.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kat Sorenson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6309876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-28T17:23:05.03Z",
                "reviewBody": "The soup is just as good using common ingredients like bacon, cannelini beans (or garbanzo), any kind of pasta, etc.  I did find Parmigiano-Reggiano but this is another way over priced ingredient.  Just use the standard shredded Parmesan and it will be just as good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Maralina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lcsfrevolution/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-12T16:16:15.873Z",
                "reviewBody": "Wanted to make minestrone with what I had on hand, but didn't think I could do it without zucchini and carrots. Then luckily, I ran across this recipe which called for just about everything I had. It turned out fantastic, thanks Chef John! It's my favorite minestrone I've ever made or eaten out. My whole family truly enjoyed it.\n\nI am vegetarian, so I left out the meat and cheese, but added portabella  mushrooms which I sauteed with the celery & onions. Instead of Italian seasoning, I used fresh thyme and rosemary sprigs. I used dried great northern beans, and added the cooking water to the soup which added a lot of flavor. Also, I cooked the pasta separately and added to individual bowls because I didn't want it to get soggy.\n\nThe cabbage made the soup really delicious. I used savoy cabbage because that's what I had on hand. And for the first time, my family ate Swiss chard without complaining...success!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATHERINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1297269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-11T23:19:26.397Z",
                "reviewBody": "I thought this was a fabulous recipe and very easy to make.  Of course, I love Chef John's recipe, always flavorful and he allows enough room for individual creativity and diversity with personal flavor preferences.  Here are the few subtle changes I made:  4 ounces pancetta because that is the portion I purchased from Trader Joe's, instead of cranberry beans, I used a can of white beans, instead of a 28 ounce can of tomatoes I substituted 2 15 ounce cans of basil-garlic chopped tomatos, left out the cabbage and used all Swiss Chard.  Lastly, I used 1/2 cup red wine in place of some of the water.  Seasoned to taste.  Thank you again Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stirring up Trouble",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7111996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-24T02:14:50.87Z",
                "reviewBody": "My third time making this recipe--love it.  Easy to adjust, to what you have on hand.  I kept the base recipe the same--chicken broth, tomatoes, onions, carrots, garlic and spices.  I've used black beans, have made it with chard the first time, then with a bag of \"greens\", which I kept to about 2 cups.  I left out the garbanzo beans and red flakes, as I thought that may be too much. I made it with pancetta the first time, was very good. Second time, I used chicken Italian sausage, to make it a little healthier. Another adjustment--I leave out the water, and as the soup reduces, I may add a little more chicken broth, but that's it.  That's just my preference--I like a thicker, richer soup.  I also cook the pasta separately. Finally, I add some nice grated parmesan---delicious! Thank you, Chef John.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lucythefloozie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9147017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-05-23T09:06:50.413Z",
                "reviewBody": "This is a fantastic recipe that is so delicious.  I did not have dried cranberry beans or canned garbanzos; used 2 cans red kidney and one can cannellini.  Chef John's recipes are so good, I stick with what is written if I have everything listed in the recipe.  If not, then substitutions are made out of necessity, primarily.  This time, I did add some fresh oregano and rosemary because it is in my garden and fresh herbs always make recipes so vibrant.  LOVED this soup -- but it makes ALOT OF FOOD!  Oh, I did add 1/2 teaspoon of balsamic vinegar to the soup -- it's some thing I add to most of my Italian soups and sauces----05/23/16.  I made this again tonight.  Since the last posting, have gone vegan, so used vegetable broth and did not add the pasta because I am avoiding gluten.   This is, basically, a very delicious vegetable soup with cranberry beans.  I added carrots the last 10 minutes of cooking and green beans the last 5 minutes of cooking.  And, of course, fresh rosemary and oregano and a splash of balsamic at the end.  Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "emilyv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5410293/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Minestrone Soup",
            "description": "See how to make classic, comforting minestrone soup.",
            "uploadDate": "2011-12-05T18:55:41.838Z",
            "duration": "PT5M37.771S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff3023bc3-89f6-4ab1-9195-e718c5cbb790%2F8ca153ff-2358-41ae-afd9-dbc3276b52e8%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1310917257001"
        }
    }
]