[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17048/soups-stews-and-chili/stews/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/234932/chef-johns-pork-al-latte/",
        "name": "Chef John's Pork al Latte",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5939564.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2013-10-10T18:27:23.000Z",
        "description": "When the weather gets a little colder, this pork stew really hits the spot. Pork shoulder meat is braised in a creme fraiche sauce until amazingly tender and delicious. Serve on polenta with crisp sage leaves for garnish.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H35M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "2 slices bacon, coarsely chopped",
            "1 ½ pounds pork shoulder, cut into 2-inch chunks",
            "salt and freshly ground black pepper to taste",
            "1 small yellow onion, diced",
            "4 cloves garlic, sliced",
            "1 ¼ cups chicken broth",
            "½ cup creme fraiche",
            "2 tablespoons chopped fresh sage leaves",
            "1 pinch red pepper flakes, or to taste",
            "¼ cup olive oil",
            "15 whole fresh sage leaves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour 1 tablespoon olive oil into a skillet, place over medium heat, and cook bacon, stirring often, until crisp and bacon fat has rendered into the skillet, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season pork cubes generously with salt and black pepper. Remove bacon from pan and set aside, reserving fat in pan. Turn heat to medium-high and brown pork pieces in bacon drippings until well browned on both sides, about 5 minutes per side. Transfer meat to a bowl, leaving pan drippings in skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn heat to medium and stir in chopped onion and a pinch of salt. Cook and stir onion until translucent and slightly browned, about 5 minutes. Stir garlic into onion and cook until fragrant, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour chicken broth and creme fraiche into onion mixture; whisk until smooth. Scrape up and dissolve any browned bits of food on the bottom of the skillet. Bring mixture to a simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return bacon to sauce and stir in 2 tablespoons chopped sage. Place pork pieces into simmering sauce along with any accumulated juices from the meat. Reduce heat to low, cover, and simmer until meat is almost tender, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Raise heat to medium and cook uncovered until pan sauce reduces and thickens and meat is very tender, about 20 more minutes. Stir red pepper flakes into sauce; adjust seasonings to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1/4 cup olive oil in a small skillet over medium heat; drop whole sage leaves into the hot oil and cook, lightly tossing leaves in the oil, until crisp, 10 to 15 seconds. Drain sage leaves on paper towels and crumble over pork.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.791304347826087,
            "ratingCount": 115,
            "itemReviewed": "Chef John's Pork al Latte",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "513.5 calories",
            "carbohydrateContent": "4.7 g",
            "cholesterolContent": "114.4 mg",
            "fatContent": "46.2 g",
            "fiberContent": "0.4 g",
            "proteinContent": "20.9 g",
            "saturatedFatContent": "15.9 g",
            "servingSize": null,
            "sodiumContent": "568.8 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-12-28T08:49:08.297Z",
                "reviewBody": "Prepared it like the recipe said -  even made it with the polenta.  (Although I skipped frying the sage leaves.)  I liked it with the polenta, my college age son skipped the polenta and just had the meat. My vegetarian hubby just ate the polenta. For once, something for everyone. Before making it, however, I had to research Crème Fraîche. Had no idea what is was. Midwest born and raised, I found out that it is a bit like sour cream but holds up better when cooking. It isn't stocked in my local grocery store, so I made my own by mixing one cup heavy whipping cream with one tablespoon yogurt (per one cooking discussion can also use buttermilk or even lemon juice). I then let it sit unrefrigerated for 24 hours. Since Chef John is a chef, maybe he gets his  crème fraîche at a speciality store or supplier, but this worked for me. In researching it, apparently  crème fraîche is not sold much in the states because (allegedly) laws requiring pasteurization of dairy products.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mama Bear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2382350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-18T02:55:02.01Z",
                "reviewBody": "I cooked this Pork Al latte today and Polenta. Indeed Chep John is true to his words.It is the most delicious pork stew I have ever cooked and eaten.I could not find fresh sage so I used dried sage from the Spice section of the supermarket here in Japan.I was afraid I would not find it and wondered what herb I could substitute.My family specially my son loved it and asked for the recipe.My husband is not really fond of cream but he had it with content.Thank you so much for this recipe and the most of his recipes that I have tried which are good as well.I have yet to rate them...Neri Kawashima Kawasaki City Japan",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Neri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12248252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-02T02:32:16.38Z",
                "reviewBody": "Absolutely fantastic!!! My first \"chef john\" recipe. I opted to double ssuce ingredients after reading reviews glad I did. I was in search of a recipe to use up my pork shoulder that wasn't pulled pork- this was so good! The part that was the most involved was browning the pork as I did it in batches due to size of my Dutch oven. Used creme fraiche (got at trader joes). Served over homemade mashed potatoes. Amazing recipe! THANKS CHEF!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2881231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-11T17:57:22.24Z",
                "reviewBody": "I made this tonight followed the recipe exactly. It was devoured! I did double the recipe because we had a 3 lb. pork roast. Hubby went crazy over it. Fresh sage is a must! I served it over mashed potatoes with a side of mixed vegetables and some crusty bread for sopping up the sauce. It's relatively easy to make however I did find I had to cook my pork over 2 hours to get it tender enough so take that into consideration (I had a pork sirloin roast maybe that was why?) Next time I might increase the sauce 50% or maybe even double it because it really needed just a little more sauce (I think hubby might have been a sauce hog haha). Even my picky toddler grandson inhaled it. Watch the salt though it shouldn't need any additional salt because you add it to the meat before cooking and also to help sweat the onions and that's plenty - also use low sodium chicken broth! I would highly recommend watching his video first before you make it the first time. You will not be unhappy with this recipe. I would also advise sticking to the recipe exactly the first time because you will see it doesn't need any changes. It will definitely be one of our favorites from now on. I could not find creme fraiche so I made it. It does take 24 hours so if you can't find it make it the day before. Whip together 1 cup heavy cream 1 to 1 1/2 - tablespoons buttermilk. Let it sit 12 hrs. room temp lightly covered and then refrigerate 12 hrs. before using. (will keep for 10 days in the frige).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kilyena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kilyena/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-20T20:38:33.677Z",
                "reviewBody": "Absolutely delicious. My favourite pork stew recipe. Don't change a thing. I serve with the Chef John's polenta recipe also found on this site or on Foodwishes.com as well and make my own Creme Fraiche a couple days before also using Chef John's technique (pint whipping cream 3 Tbsp Butermilk or plain active yogurt stir - 24 hrs lightly covered at room temp then 24 sealed in the fridge - viola Creme Fraiche) I love how Chef John's recipes rarely need any tweeking - perfect - every time. Try this and I doubt you'll regret it. While I go to the trouble to make my own creme fraiche I am sure sour cream would be just as lovely and in a pinch even plain whipping cream but it would lack that tiny tartness that the creme fraiche has... still with all the other flavours and the fact that this is a stew I doubt it would be missed much)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MYSTICL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mysticl/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-17T18:39:33.283Z",
                "reviewBody": "THE BEST PORK STEW EVER. I used heavy cream instead of crème fresh (I couldn't find it at the store) and it still turned out delicious! Rave reviews from everyone at the potluck (I came home with NO leftovers) and my hubby asked me to make a batch for the house after the potluck party. Definitely saved and pinned! Thanks Chef John!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPBB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2381811/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-15T04:28:02.873Z",
                "reviewBody": "This recipe was amazing. We couldnt find creme fraiche or sage in our local grocery store so we used 1/4 Cup of cream and 2 tsp dried poultry seasoning and served with Chef Johns Polenta.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15363258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-01T22:44:59.403Z",
                "reviewBody": "This was an outstanding recipe. The flavors of this dish were bold and rich. My family said that this was a keeper. Thanks for sharing Chef John",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DaveDV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12224978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-16T14:25:17.497Z",
                "reviewBody": "This turned out to be a tender and flavorful pork dish. I'm going to rank this in my personal top 5 recipes for sure! Thanks again Chef John.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aputler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8799009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-04-20T01:03:07.173Z",
                "reviewBody": "This was just ok. I had high hopes but it was very salty lived the polenta which was a great accompaniment. Not sure I would make it again if I did I would have to rethink it and do it in my instapot. Was time consuming.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "vicky C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25247973/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John’s Pork al Latte",
            "description": "Pork is simmered in crème fraiche until impossibly tender.",
            "uploadDate": "2013-09-30T22:39:16.555Z",
            "duration": "PT6M10.603S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F96ec4daf-3f93-43cc-9771-d8509163f27e%2F03347466-3668-4601-88ee-566a16242982%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2707975933001"
        }
    }
]