[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235710/chef-johns-ricotta-meatballs/",
        "name": "Chef John's Ricotta Meatballs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1077229.jpg",
            "width": 3066,
            "height": 3059
        },
        "datePublished": "2013-11-26T19:03:44.000Z",
        "description": "Ricotta-spiked meatballs are so tender, so flavorful, and so delicious. There are hardly any ingredients. Of course we're going to throw this over some spaghetti, because we're Americans and that's what we do with meatballs.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "32 meatballs",
        "recipeIngredient": [
            "½ onion, minced",
            "2 tablespoons olive oil",
            "3 cloves garlic, minced",
            "1 pound ground beef",
            "1 cup whole milk ricotta cheese",
            "¼ cup packed chopped Italian parsley",
            "1 egg, beaten",
            "1 ½ teaspoons kosher salt",
            "½ teaspoon freshly ground black pepper",
            "1 pinch cayenne pepper, or to taste",
            "⅓ cup dry bread crumbs",
            "2 tablespoons olive oil",
            "1 (28 ounce) jar marinara sauce",
            "1 cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Saute onion in 2 tablespoons olive oil in a skillet over medium heat until onion is translucent, about 5 minutes. Stir garlic into onion and turn off heat. Transfer onion mixture to a large mixing bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir ground beef, ricotta cheese, parsley, egg, kosher salt, black pepper, and cayenne pepper with onion mixture until almost combined; stir in bread crumbs and continue to mix until thoroughly blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll about 2 tablespoons of mixture into a 1-inch ball for each meatball. Pour 2 tablespoons olive oil in same skillet used to cook onions. Place skillet over medium heat and brown meatballs on all sides in hot oil, about 5 minutes. Hold a crumpled paper towel in a tongs and use it to remove excess grease from skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour marinara sauce and water over meatballs in skillet. Stir to combine and bring to a simmer. Reduce heat to medium-low and simmer, stirring occasionally, until meatballs are cooked through and no longer pink in the center, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.60774818401937,
            "ratingCount": 413,
            "itemReviewed": "Chef John's Ricotta Meatballs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "331.1 calories",
            "carbohydrateContent": "18.9 g",
            "cholesterolContent": "75.3 mg",
            "fatContent": "20.9 g",
            "fiberContent": "3 g",
            "proteinContent": "16.3 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "864.6 mg",
            "sugarContent": "9.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-12-18T11:11:19.38Z",
                "reviewBody": "Wonderfully delicious moist melt in your mouth meatballs. Since I was the first to make this recipe I followed exactly, even using the paper towel to drain my juice, a very nice tip by the way. I used my own homemade marinara sauce and had about 32 ounces, which was a nice amount to cover the meatballs and go over spaghetti noodles for four. I got 34 meatballs with my one inch melon ball scoop. The problem I had was the meatballs are very moist and were sticking to the pan and were falling apart, I had to be very delicate in cooking them and lost a few to crumbles. I will be making this one again, but think I'll put my meatballs on a baking sheet and bake them to brown them and then add to the sauce and simmer, hopefully that will keep them from falling apart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-05T03:18:55.75Z",
                "reviewBody": "These are so soft and cheesy!  I did not cook them as the recipe states though, just stuck to my normal, which is roll into balls place on a greased baking rack (over a baking sheet) and baked 25 minutes at 350.  Delicious :)  Served over Zucchini noodles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mommyluvs2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2995814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-27T20:55:00.183Z",
                "reviewBody": "Now I've been making meatballs for years and these are fantastic. Followed recipe as written except I did not add the 1 cup of water to the sauce since I like a thicker sauce. I also added 2 Tbl. spoon of parma cheese to the mix along with 1/2 a teaspoon of Italian Spice blend. Next time I will add just a little less ricotta since I like a firmer meatball. Bake in oven at 425 for 15 to 20 min.  I could'nt stop \"testing\" them before dinner was served. Very tender and flavorful. Excellent Meataball!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gjmstarman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11834922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-23T13:26:46.977Z",
                "reviewBody": "This is another Chef John winner!  I got close to 30 meatballs using my close to two tablespoon cookie scoop.  I used part regular parsley and part basil for the meatballs, but the marinara I used was an organic tomato basil marinara from Trader Joe's.  I followed the recipe as written otherwise.  I formed the meatballs earlier this afternoon and so they were cold when I added them to the pan.  My big mistake tonight was to use only my 10\" pan rather than the 13\" that would have made it all so much easier and without having to clean up my mess!  We have leftovers, and I think that's what I'll have for breakfast tomorrow!  Thanks, Chef!  EDIT:  After eating some of the leftovers, I wanted to add that you don't need to be afraid to add a little more flavor to these meatballs.  We thought that they could have used just a little more spice to them.  But, still, yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-13T02:32:54.68Z",
                "reviewBody": "These are delicious! For those who complained about the meatballs being too fragile, make sure you are actually following the recipe's measurements.  Ricotta cheese sold in the small containers contains more than one cup.  If you use too much ricotta, of course the meatballs won't hold together that well. (They'll still taste great, though.)  So make sure you are measuring and not just dumping in the whole container as I suspect some people might have done.  Another winner from Chef John - thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avendesora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6427522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-25T22:07:40.147Z",
                "reviewBody": "Great meatballs with a lovely soft texture!  Changes I made:  1.  I used dried parsley (1 Tbs.), basil (1 Tbs.) and ground marjoram (1/2 tsp.) because my own herb plants have not yet matured enough to harvest them and I wasn't about to go out and buy fresh when, I felt, the dried are absolutely fine in this recipe; 2.  I added about 1/4 cup of grated Parmesan to the meatball mixture because I cannot fathom meatballs without it; and 3.  I baked my meatballs in a preheated 350 degree oven (baking sheet lined with parchment) for 25 minutes, turning the balls once halfway through baking.  I simmered them in my favorite commercial marinara for the better part of the afternoon and served them over perciatelli pasta and with homemade garlic toast for dinner tonight (the leftovers will be used for meatball subs a little later this week).  My only beef is that although there was a pinch of cayenne pepper in the mixture, I could not detect any heat in the meatballs.  The next time I make these, and I will, I will add a good two pinches of cayenne.   Bravo, Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNNINMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/theblondeprofessor/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-20T22:55:19.253Z",
                "reviewBody": "I just finished frying these up and was disappointed at how fragile they are. You really need to take your time or use a very non-stick pan. I think I will do as the previous reviewer mentioned next time and bake them in the oven. That being said the flavor of these is absolutely wonderful! I didn't change anything and my sons are taking spoonfuls of it out of the pan right now and making \"num num num\" noises! We will definitely make these again so says my eldest! Maybe even tonight if I don't have enough for dinner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "simplytrue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7769060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-02T04:36:14.947Z",
                "reviewBody": "I made these Ricotta Meatballs today and they were delicious.  I followed the recipe exact, except i mixed fresh Basil & Parsley together to make 1/4 cup.  Since I like larger meatballs, I made each one about 2 1/2 inches, which gave me 13 and baked them on 375* for about 20 minutes turning a few times.  I finished off in the pan as the recipe calls.  For my hubby who loves pasta, a chopped the meatballs and put on top of the pasta.  Myself just ate them as is.  This is a recipe that I will definitely make again.  Served this with Chef John's Stacked Tomato & Burrata Salad also on this site, and a crusty garlic french bread.  Thank you Chef John for all of your wonderful recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janet Lee Levine-Silverthorne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5605681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-31T01:52:03.167Z",
                "reviewBody": "I've mad this twice now. The first time I neglected the egg. That was a disaster. They all fell apart. I've never had that problem with my meatballs before but I imagine that's because of the ricotta. I also had a giant pack of meat so the amount of balls was overwhelming for me. The second time I made these almost exactly as described. The only changes were no parsley, oregano instead. Both times I used ground turkey. This is amazingly moist and flavorful. Chef John never fails. I've been following his recipes since well before he joined allrecipes. He never disappoints.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4147845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-24T23:54:27.020Z",
                "reviewBody": "I made this with no changes except using chicken instead of beef (health thing).  I fried 2 to test and found it to have a good texture but way too bland for our taste.  I added more cayenne, red pepper flakes, basil, thyme, oregon, mustard powder, and some grated romano.  I baked rather than fried and they were excellent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "NWer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15678651/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John's Ricotta Meatballs",
            "description": "See how to turn regular meatballs into a ricotta filled sensation.",
            "uploadDate": "2013-09-23T19:03:49.368Z",
            "duration": "PT4M9.667S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff742c66d-945b-4c53-8f5b-0e7f54a78b3d%2F190efcf6-af02-4364-87f4-26a9d212765b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2686522492001"
        }
    }
]