[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
                    "name": "Rice Side Dish Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14364/side-dish/rice/pilaf/",
                    "name": "Pilaf",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/240606/persian-rice/",
        "name": "Persian Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5635715.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2014-12-10T00:52:48.000Z",
        "description": "I believe I've posted a few fool-proof methods for cooking perfect rice, but this Persian version takes the grand prize, and it's not even close for second. The beauty of this method is that it doesn't rely on any specific measurements, or even exact times. This will make some of you very nervous, but just go with it.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 quarts water",
            "3 tablespoons kosher salt",
            "2 cups basmati rice, rinsed",
            "1 pinch ground cumin",
            "salt to taste",
            "2 tablespoons olive oil",
            "1 russet potato, cut into 1/4-inch slices",
            "3 tablespoons butter, cut into thin slices, or to taste",
            "1 pinch saffron threads",
            "1 ½ tablespoons hot water",
            "1 tablespoon chopped parsley, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring water and kosher salt to a boil in a pot; add rice and cook, stirring, for exactly 7 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a pot over medium-high heat. Cover bottom of pot with 1 layer of potato slices. Sprinkle cumin and salt over potatoes. Cook until potatoes are sizzling, 2 to 3 minutes; top potatoes with rice to form an even layer. Reduce heat to low and place butter slices over rice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Top pot with a layer of clean paper towels and place lid over towels. Steam until rice is fluffy, about 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grind saffron threads with a mortar and pestle. Mix crushed saffron with 1 1/2 tablespoons hot water in a large bowl. Add a couple spoonfuls of rice to saffron mixture and stir until rice is yellow.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon remaining rice into a serving bowl, top with saffron rice, and line edges of bowl with potatoes. Garnish with parsley.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Rice Side Dish Recipes",
            "Pilaf"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7032967032967035,
            "ratingCount": 91,
            "itemReviewed": "Persian Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "254.8 calories",
            "carbohydrateContent": "41.6 g",
            "cholesterolContent": "11.4 mg",
            "fatContent": "8.3 g",
            "fiberContent": "0.9 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "2223.1 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-03-24T14:59:24.427Z",
                "reviewBody": "This \"Persian Rice\" recipe is how rice is prepared in Iran. I will add the following notes: (i) rinsing the starch out of the rice is of paramount importance and is usually done by swishing the rice around in a bowl of water and draining several times until the rinse water is clear (described as \"rinsed rice\" in this recipe, and shown as water running over rice in a sieve in the video); (ii) cumin in the potato crust (\"tahdig\") may be a regional variation but it is not common (at least not in Tehran) (sounds good though); (iii) sometimes the pot of steamed rice is just inverted over a plate with the potato crust left in place. If you want to do this, you need to have a few tricks up your sleeve to stop the potatoes and rice from sticking to the pot. For the potatoes, rinse the starch off the slices, dry them, and slide them around in the hot oil (so they are not sticking) before adding the rice on top of them. For the rice, use a wide spatula or egg lifter to mound the rice in the center of the pot (away from the sides) before steaming it. Before inverting the pot of steamed rice over a plate, put the bottom of the hot pot of rice (after steaming) in a sink of cold water to loosen the potato crust; (iv) always put a towel under the pot lid (as described in the recipe) or you will have soggy rice; (v) it is not necessary to add butter when steaming the rice (common but optional).   Kudos to Chef John for very clearly explaining this method of preparing rice (video)! Nice work!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ladybug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15234165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-02T19:26:53.573Z",
                "reviewBody": "using saffron and potato under rice shows that it's a really Persian style of our rice, but in Iran ladies love the lots of oil and use extra measure of oil however it makes the rice more delicious especially when the oil was not vegetable oil it must be the oil that extract from butter of milk. also in Iran ladies use potato under spaghetti and we sometimes use leaf lettuce and oil or thin naan and oil  instead of potato under rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Azin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17574537/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-05-03T06:14:04.757Z",
                "reviewBody": "Married to a Persian for many years, this recipe sounds about right. However, I suggest you boil the rice for only 6 minutes, tops.  I sometimes boil for only 5, depending on the rice I use. Cumin is not used in most Persian recipes, however, saffron is. For variety, you can make a pilaf after boiling the rice. Add baby Lima beans and dill weed for one. For another really yummy one, pre cook some lentils and steam them along with raisins and some dates and I like to add cinnamon, with the white rice.  Then you will have addas pollo, a Persian favorite.  There are many combinations which are wonderful. Rice with Shredded, sautéed sweetened carrots combined with shredded, candied orange peel with a dash of rose water is divine.  So many!  There is a great Persian cookbook called New Food For Life. If you like this most simple  of recipes, I'd invest in it. Full of pictures too and detailed recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CarolY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18107636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-06-24T03:11:15.48Z",
                "reviewBody": "I grew up with Persian rice and it's my favorite! I must strongly suggest rinsing your rice several times before cooking it. To make it easy, I put the rice in a fine-mesh colander and drop it into a pot of water. I gently swish it around for a bit, and repeat four more times with clean water. The rice will not come out very well if you don't rinse the starch off first. This recipe is foolproof for those who are uncertain how long to boil the rice before steaming it. It comes out perfectly every time. A kitchen towel or paper towels are absolutely necessary during steaming to prevent mush and to keep the rice beautiful and fluffy. I use lavash or pita for the tadig (crispy bottom layer), but one of these days I'm going to try the potatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hilary921",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9890713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-07T00:08:49.66Z",
                "reviewBody": "So good - I am totally converted and will make my rice this way from now on! So perfect with Chef John's Duck Fesenjan recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jennifermo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9079464/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-05-26T01:09:54.193Z",
                "reviewBody": "Rice cooked this way is delicious. And the recipe is quite authentic, just potato is substituted for local sort of thin bread called lavash (potato is not very popular in those places) . But potato makes it even better. Try to supplement this rice with meat (lamb or beef)  sautéed with fried onion, cilantro, dill, parsley, garlic chives in clarified butter and some lemon juice added",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Theodore Utkin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14871474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-24T02:40:52.01Z",
                "reviewBody": "This rice was wonderful! My whole family loved it which doesn't happen real often. The spices and herbs give this dish a very flavorful and fresh taste. It's labeled as Persian Rice but the flavor is mellow enough that it could be a side dish to pretty much any entree and not just Mediterranean food. It sounds like I contradicted myself by saying that it's flavorful and mellow but somehow both of those words describe it perfectly. I will make this rice again very soon. Thank you for the recipe Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2022938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-11-26T00:02:09.29Z",
                "reviewBody": "THIS is how rice should be made!! I have always been disappointed when I have made rice in the past gummy or undercooked or just plain tasteless. This rice came out perfectly and was very tasty. The potato slices were a wonderful added bonus. My husband commented on how attractively the rice was presented (with a splash of yellow on top and a circle of golden potatoes). Then he proceeded to have two servings and one by one ate all of the potatoes. I will never make rice any other way! Thanks for a wonderful addition to my repetoire. Even after 50 years in the kitchen I can still learn new and exciting things",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Slacster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5257294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-12-13T07:08:37.54Z",
                "reviewBody": "12.12.19 - made exactly as directed. The rice was loose just how Persian rice should be flavorful and the potatoes were to die for! Like little potato chips!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim's Cooking Now",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kimscookingnow/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-03-19T07:05:49.230Z",
                "reviewBody": "Bottom layer of rice grains were crunchy. Other than that, this was very tasty. Next time I’ll let the oil cool more first before adding the parboiled rice. I think maybe the rice fried in the hot oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Blair Blanks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5866197/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John's Persian Rice",
            "description": "Discover Chef John's recipe for fabulous, fragrant Persian rice.",
            "uploadDate": "2014-12-04T17:43:03.988Z",
            "duration": "PT6M32.726S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fea4acbe9-9b5d-4289-803c-ca96d8f71987%2Ff5544adb-9b40-4074-8410-5c6afca8f341%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3923845763001"
        }
    }
]