[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/509/main-dish/pasta/macaroni-and-cheese/",
                    "name": "Macaroni and Cheese Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16830/main-dish/pasta/macaroni-and-cheese/baked-macaroni-and-cheese/",
                    "name": "Baked Macaroni and Cheese Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219166/chef-johns-macaroni-and-cheese/",
        "name": "Chef John's Macaroni and Cheese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F969050.jpg",
            "width": 2341,
            "height": 2346
        },
        "datePublished": "2011-10-12T16:47:38.000Z",
        "description": "This easy-to-make old-school macaroni and cheese has a perfectly crispy crust.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (16 ounce) package elbow macaroni",
            "¼ cup butter",
            "¼ cup all-purpose flour",
            "¼ teaspoon dried thyme",
            "¼ teaspoon cayenne pepper",
            "⅛ teaspoon white pepper",
            "3 cups milk",
            "1 pinch ground nutmeg",
            "¼ teaspoon Worcestershire sauce",
            "1 teaspoon salt",
            "3 cups shredded sharp Cheddar cheese, divided",
            "1 teaspoon Dijon mustard",
            "½ cup panko bread crumbs",
            "1 tablespoon butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta is cooked through but still slightly firm, about 8 minutes. Drain well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1/4 cup butter in a large saucepan over medium heat. When the butter starts to foam and bubble, stir in the flour; cook on medium heat until flour just begins to turn pale yellow, 3 to 4 minutes. Add thyme, cayenne pepper, and white pepper; cook and stir another minute, then whisk in 1 cup of milk until smooth. Pour in remaining milk and whisk again. Bring the sauce just to a simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in nutmeg, Worcestershire sauce, and salt; simmer on medium-low heat until thickened, about 8 minutes, whisking often. Turn heat off, then add 2 1/4 cups of Cheddar cheese; stir until melted and combined. Add Dijon mustard.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the macaroni into a casserole dish, then pour in the cheese sauce; stir to thoroughly combine sauce with pasta. Mix panko bread crumbs and 1 tablespoon melted butter in a small bowl, and sprinkle crumbs on top of macaroni and cheese. Sprinkle remaining 3/4 cup of Cheddar cheese on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until bread crumbs and Cheddar cheese topping are golden brown, about 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Macaroni and Cheese Recipes",
            "Baked Macaroni and Cheese Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.379289940828403,
            "ratingCount": 1690,
            "itemReviewed": "Chef John's Macaroni and Cheese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "694.8 calories",
            "carbohydrateContent": "72.8 g",
            "cholesterolContent": "94.5 mg",
            "fatContent": "32.3 g",
            "fiberContent": "2.6 g",
            "proteinContent": "29.4 g",
            "saturatedFatContent": "19.9 g",
            "servingSize": null,
            "sodiumContent": "928.4 mg",
            "sugarContent": "8.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-12-11T13:07:46.33Z",
                "reviewBody": "I made this for the boys before I went to work last night. I did not try this myself but based on the message I got at my break--they absolutely loved it. To be honest, there were no leftovers for me! They thought the crust was the best part. Note to self: double the crust ingredients next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-30T23:00:07.393Z",
                "reviewBody": "Oh boy!  I finally found the  best macaroni and cheese I have ever had. I followed the recipe exactly, except I used only 12 oz. of macaroni, to make it more cheesy.  It was a perfect ratio.  I used 2% milk, and it worked great - creamy and satisfying. I  don't know which I liked better, the crust or the filling, they were both delicious.  You have to try this recipe!  Thanks, Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8131994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-25T16:31:59.027Z",
                "reviewBody": "Lordy, all anyone wanted was the crust.  New rule, take what's UNDER the crust, too.  This was the closest to my mom's, and all kidding aside, a terrific success.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8145552/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-21T04:48:32.3Z",
                "reviewBody": "My family really loved this dish.  The only changes I made was 1/8 cayenne (because of kid), made only 12 oz. of macaroni and used black pepper.  I didn't have panko crumbs so I made my own crumbs with leftover bread.  To be honest, I can live without the topping so I'll leave it out next time.  This will be my go-to mac and cheese recipe for now!  UPDATE:  This time I left out the thyme and worcestershire.  I added 1/2 teaspoon garlic powder and 1/2 teaspoon of onion powder to the roux. I used 10 oz. of macaroni.  I didn't add the breadcrumb topping.  I covered the dish with foil and baked it at 375° for 30 minutes, then uncovered and baked for 15 minutes more.  Nice and creamy and so delicious.  But I'll have to leave out the cayenne next time due to picky kid (although I love the kick of the cayenne).  How anyone can say this macaroni and cheese is bland is beyond me.  Perhaps you used cheap cheese which tends to be oily and doesn't have the best flavor and texture.  And BTW, if your dish turns out grainy, you probably didn't take the bechemel off the burner and SLOWLY (1/4 cup at a time) add cheese to it while mixing gently.  Dumping all the cheese at once to simmering bechemel that is still on the burner will result in a grainy texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Taco Cat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1159796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-30T18:29:52.45Z",
                "reviewBody": "Very good.  I am thinking that the people who commented that they were overpowered by the taste of thyme must have used ground thyme instead of dried thyme leaves.  1/4 tsp. of dried thyme leaves is not enough to overpower anything.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelly Dafoe Yates",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9223882/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-11T15:05:35.62Z",
                "reviewBody": "EXCELLENT!  EXCELLENT! I don't review much recipes, and this is one worth to review!  Please read! :)  \n\nI wanted to use the 16 oz. of elbow macaroni, but also wanted it cheesy as well.  So I \"almost\" doubled the wet ingredients (for the sauce).  I found this to be a PERFECT RATIO for the 16 oz. macaroni.  I used 3/4 cup butter, about 3/4 cup flour , 5 cups cheese total (I use half sharp cheddar grated myself and half regular cheddar) (reserving 1.5 cups of cheese for the top) and 5 cups of milk.  I adjust the seasonings as accordingly as well!  \n\n**I never add the nutmeg.  I'm a bit scared putting nutmeg in this dish, even if it's just a pinch! LOL  \n\n**Instead of the dijon mustard I use the mustard powder, and only use half the amount it states (only because I don't know how much of a mustard flavor it will pick up)\n\n**I up the panko bread crumbs to 1 cup, and the melted butter to 2 TBs.  The crust from that is amazing.  \n\n**I'm not a big fan of too much thyme, so I used italian seasonings instead.  \n\n**  The cayenne pepper is great in this, but I usually half it if kids are eating it in case they're fussy.  I have also sprinkled on crushed red pepper flakes instead.  \n\n**I do not use ALL sharp cheddar cheese.  I use half sharp (freshly grated myself), and half regular cheddar!!! \n\n**DO add the worsherchire sauce!\n\nThis is soooooo good!  I will never want to try another type of mac n' cheese recipe ever.  Thank you for reading! :)\n** I included a photo and it's photo #2.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawnie417",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12395088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-04T16:22:17.49Z",
                "reviewBody": "The best mac and cheese I have made in a long time. My family all stated the same. I followed the recipe with the exception of a couple of changes. After reading the reviews, I cut the pasta by a couple of oz and that worked out perfectly. I used fresh thyme, backed the ceyenne down to 1/8 teaspoon (my dad can't have spicey), and was out of dijon so I used about a 1/2 teaspoon of dry mustard. We loved that it was baked but still creamy! Definitely reminds everyone of grandma's mac and cheese. I will use this recipe from this point. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-30T01:47:26.14Z",
                "reviewBody": "Tweaker alert. I used the basic recipe but changed the seasonings due to my \"NON-Gourmet\" children who will never eat Thyme flavored anything. The sauce recipe works fantastic & I was quite proud of myself for pulling this off. You should not leave the stove during the sauce whisking portion. The reviews talked a lot about sauce vs. pasta amounts. My men like sauce. I used a 16 oz large elbow macaroni package. I \"sort of\" doubled the sauce. It was perfect. I am writing this up because I use other people's suggestions all the time. Hope this helps someone! I used: 1/2 c. butter, 1/2 cup flour, 1 T. Chili Powder (think chili), 1/4 + teaspoon of Red Chili Flakes, 5 cups of 2% milk, 1 tsp. Worcestershire Sauce, 3 tsp. Kosher Salt, 5 good handfuls of already grated Cheddar/Jack Mix (Costco), 1 good squirt of Dijon. Followed the sequence of directions, but changed the seasoning & amounts. For the crust - I discovered I DID NOT have the Panko Break Crumbs I thought I had. I used 2 T. Butter with 1/2 cup Italian Bread Crumbs + 1/4 c. Crunchy Onions (think green bean casserole), mixed well, sprinkled on top & baked in a 10 X 15 - greased. Wonderful - my men ate 1/2 of the tray last night & I am sure the rest will be gone today! Thanks Chef John for the basic recipe!\n\nUpdate: I still do what I wrote in my original \"tweak\" of this recipe, but if this is for an adult buffet, I have added jarred Jalapeno slices at the very last stage of putting it in the pan. It gets rave reviews!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jewels",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jewels/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-28T01:26:54.627Z",
                "reviewBody": "I have tried this recipe and it was good. For those who thought it was a little dry, I have found over the years that mixing hot pasta with hot sauce only ends up with a very dry pasta after baking in the oven. So to fix this I always cool my pasta on the counter before I add it to any sauce.  It stops the pasta from absorbing too much of the sauce and ending up dry. You can always make additional sauce, but that means extra calories. So I just cool the pasta while I am making the cheese sauce. I made a very small dish with the thyme but did not put it in the main recipe. Glad I did, the addition of thyme was terrible in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gobomel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6039429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-16T17:52:15.137Z",
                "reviewBody": "Tried this recipe because I was starting to think my tried and true mac&cheese was a little bland.  I was skeptical of the thyme so only filled the 1/4 tsp about 2/3 full.  Followed everything else to a T.  The thyme flavor was so overpowering, the dish was inedible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "melmmo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4622391/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John’s Macaroni and Cheese",
            "description": "See how to make Thomas Jefferson’s favorite comfort food.",
            "uploadDate": "2012-07-16T23:25:40.704Z",
            "duration": "PT5M17.788S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fee1a516e-055b-4045-8bb9-d5216cdb9e39%2F94ddbe4a-ec8e-4e2e-81f0-c70dd01654be%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1738264170001"
        }
    }
]