[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17157/desserts/chocolate/white-chocolate/",
                    "name": "White Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/185947/layered-peppermint-bark/",
        "name": "Layered Peppermint Bark",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4645138.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2019-12-06T04:21:55.000Z",
        "description": "I never liked peppermint bark until I tried this recipe. The soft ganache center contrasts perfectly with the crunchy peppermints.",
        "prepTime": "P0DT0H30M",
        "cookTime": null,
        "totalTime": "P0DT1H25M",
        "recipeYield": "2 pounds",
        "recipeIngredient": [
            "20 ounces white chocolate, coarsely chopped, divided",
            "30 peppermint candies, crushed, divided",
            "10 ounces dark chocolate, coarsely chopped",
            "6 tablespoons heavy cream",
            "1 teaspoon peppermint extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a 9x12 inch baking pan with aluminum foil or parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt half of the white chocolate in the top of a double boiler over just barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Spread the white chocolate into the prepared pan. Sprinkle 1/4 of the crushed peppermints evenly over white chocolate. Chill until firm, about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt the dark chocolate, heavy cream, and peppermint extract together in the top of a double boiler over just barely simmering water, stirring frequently, until just melted. Quickly pour the chocolate layer over the chilled white chocolate layer; spread evenly. Chill until firm, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt the remaining white chocolate in the top of a double boiler over just barely simmering water, stirring frequently, until just melted. Spread quickly over the chilled bark. Sprinkle with the remaining peppermint pieces; chill until firm, about 20 minutes. Cut or break into small pieces to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "White Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.614285714285714,
            "ratingCount": 140,
            "itemReviewed": "Layered Peppermint Bark",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "203.5 calories",
            "carbohydrateContent": "28.7 g",
            "cholesterolContent": "7.9 mg",
            "fatContent": "9.5 g",
            "fiberContent": "0.6 g",
            "proteinContent": "1.6 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "22.7 mg",
            "sugarContent": "22.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-21T01:16:22.523Z",
                "reviewBody": "Great peppermint bark I made EXACTLY per recipe. NEXT TIME I will do this: 1) Omit cream from chocolate it makes it too soft and melts on hands too easily. 2) Melt ALL of the white chocolate at one time and spread on sheet layer with 1/4 crushed candy 3) Spread all of the semisweet chocolate on top of chilled white chocolate the semisweet chocolate has a strong flavor so make the top layer of the semisweet chocolate thinner than the white chocolate ( I was temped to use equal parts chocolate just because I had the semisweet chips left). 4) Sprinkle with the rest of the crushed peppermint candy. Like I said I tried the exact recipe and the semisweet chocolate didn't ever set up correctly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kellie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2787221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-24T17:41:46.93Z",
                "reviewBody": "Excellent recipe. I only gave it 4 starts since I modified it after reading another review. I omitted the cream. I used crushed candy canes (4) and folded them into the white chocolate. I didn't have any peppermint extract so I just drizzled plain melted dark chocolate over the white choc/candy cane mixture and then cut thru it with a knife - so it looked swirly & pretty. Then I topped it with the remaining crushed candy cane. Chilled it then flipped it on the counter and cut it when it was room temp. It looks beautiful and is a hit on the holiday baking tray!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mandymuggins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2890883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-08T23:50:36.623Z",
                "reviewBody": "I got great reviews on my bark! I used about 1 lb of both milk and white chocolate for a 9x13 dish and also used peppermint oil vs extract. I crushed 12 candy canes and sifted the finer pieces out for the first layer and then topped everything off with the coarser pieces. Everyone loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ckandi007",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2852860/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-18T23:06:27.573Z",
                "reviewBody": "Fabulous!  I accidentally put in way too much peppermint extract into the dark chocolate layer, but it tasted perfect.  I did as others suggested and sifted the broken candy canes and added the \"peppermint dust\" to the white chocolate layer.  I did the dark chocolate in a double boiler, but then just did the white chocolate in the microwave.  Both came out great.  I did dark on bottom, white, then sprinkled the peppermint in on the top.  A lot of it fell out when I was breaking the bark, so next time I think I will either push it in harder or do as other recipes suggest and put the peppermint pieces on the bottom, pour white chocolate layer over, then dark chocolate layer on the top.  (invert when ready to serve).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Meredith Wong Hughes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-14T19:02:10.83Z",
                "reviewBody": "I made the recipe almost exactly as shown though I used semi-sweet instead of dark chocolate and used 24 oz of white and 12 oz semi-sweet (chocolate chips in 12 oz bags). I used the creme in the middle layer and it was not too soft as some reviews said but a great contrast to the hard white chocolate on the top and bottom. I \"chilled\" each layer in the refrigerator so that the next layer could be spread over easily and it has stayed hard even after completely warming to room temp. I took this to a holiday party and got a lot of compliments and requests for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Justin Fitch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1361518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-03T21:45:43.067Z",
                "reviewBody": "As an old time maker of this delicious treat it is important to get the timing of adding the white chocolate to the dark chocolate at right time.  Everyone always say to chill the white chocolate.  I never do.  I keep an eye on it and when the chocolate loses that super glossy look that shows that it is \"setting up\" that is when I add the white chocolate.  I must add that I live in New Mexico and we keep the house \"coolish\" so if you have a hot kitchen and want to put the dish in the fridge, go ahead, but watch it every minutes.  Putting one chocolate on top of another \"cold chocolate\" does not allow the two chocolates to hold on very well and will let the white chocolate come off of the dark when you go to cut it.  I follow the rest of the recipe, more or less, to the letter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cammy Kinstedt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cammyk/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-02T00:17:46.923Z",
                "reviewBody": "Make sure you use GOOD QUALITY chocolate (like Ghiradelli). Turned out delicious. I was a little nervous about the dark chocolate layer squishing out after reading the other reviews but decided to go ahead with the recipe as is. I'm so glad I did!! The ganache does not squish out not even at room temperature and the flavor and texture are amazing! I'm a huge fan of peppermint bark and this was a great recipe! I really liked it! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FoodeliciousCraig'sWife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2574024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-14T04:22:39.147Z",
                "reviewBody": "Taste and presentation is 5 star esp. with the cream & extract added to the chocolate and if careful to layer edges evenly. Which puts this above some other peppermint bark recipes in my opinion. I rated 4 stars because I thought the mechanics of the recipe could be better. First \"30 peppermint candies\" is vague to me. I used 12 regular/large candy canes: and it was just enough for my tupperware 9x13 (who has a 9 x 12?)that I used instead of foil or parchment:it flexes just enough to work well. I found double plastic bagging and pounding with a meat mallet worked best to crush the peppermint but not pulverize. Also the chocolate layer doesnt separate as easily (when cutting)if you don't let it set in fridge more than a few minutes instead of 20 to add the next layer. And white chocolate \"chips\" works fine. But be aware to melt LOW and SLOW ( I did in microwave in 20 second intervals on 50% power stirring each time) as chocolate seizes up easily(trust me I know!:) I also added a little (1 tsp)veg oil to help to liquify/spread easier. And do slightly press top layer of candy canes into the white chocolate. It falls off when cutting if you don't. And lastly i will use another full 10 oz bag of white chocolate for a 9x 13:it was barely enough with only 1 \" larger pan. Although these are notes to myself. Hopefully this helps someone else when making this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T23:13:42.46Z",
                "reviewBody": "I followed this recipe exactly and it was wonderful! If you omit the cream you will not get the ganache filling that makes it so awesome! I spread the white chocolate and made a little ridge around the edges of the pan then cooled it. Then I put in the chocolate filling and put it in the freezer until it was frozen. Then when I spread the last of the white chocolate on the top the white edges seal together. Just don't spread it around too much or it will melt the chocolate and it won't look as nice. I cut mine with a large sharp chopping knife and it worked great. Thank you for this awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAHLERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1100827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-18T22:58:57.1Z",
                "reviewBody": "I made this because it sounded s-o-o-o good. It tastes good-----BUT. When it came time to cut it the Dark Chocolate layer completely serperated from the bottom. In fact the bottom white chocolate layer was left as an almost solid sheet. I was going to take this as a refreshment to a concerty of my wife's. I ended up munching on it at home (it was edible) and throwing the rest away.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Bobo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4249466/"
                }
            }
        ]
    }
]