[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/145757/kohlrabi-with-white-sauce/",
        "name": "Kohlrabi with White Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7525683.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2007-07-21T12:18:24.000Z",
        "description": "When I was a nanny in Germany, this recipe was one I'd make often for the family. Tender kohlrabi cubes drenched in a creamy white sauce with a hint of nutmeg is a simple, mild, but flavorful side dish. Try this sauce over baked or fried potatoes, too.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 medium (blank)s kohlrabi bulbs, peeled and cubed",
            "½ teaspoon salt",
            "2 tablespoons butter",
            "2 tablespoons all-purpose flour",
            "1 cup milk",
            "3 tablespoons cream",
            "1 teaspoon salt",
            "1 teaspoon ground nutmeg",
            "2 teaspoons white pepper",
            "½ bunch fresh parsley, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the kohlrabi and 1/2 teaspoon salt in a saucepan. Cover with water, and bring to a boil over medium-high heat. Cook until kohlrabi can be pierced with a fork, but remains firm, about 5 minutes. Drain, reserving 1 cup of cooking water. Place kohlrabi in a bowl, and cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the butter into the same saucepan, and melt over medium heat. Whisk in the flour, and stir until the mixture becomes paste-like and golden brown. Gradually whisk the milk and reserved cooking water from the kohlrabi into the flour mixture, stirring until thick and smooth. Stir in the cream, 1 teaspoon salt, nutmeg, white pepper, and parsley until well blended. Continue whisking until sauce thickens, then cook 10 minutes more. Stir in the kohlrabi, tossing to coat evenly with sauce.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Valerie S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8055555555555554,
            "ratingCount": 36,
            "itemReviewed": "Kohlrabi with White Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "91.1 calories",
            "carbohydrateContent": "8.2 g",
            "cholesterolContent": "17.7 mg",
            "fatContent": "5.8 g",
            "fiberContent": "2.9 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "487.3 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-20T00:50:22.51Z",
                "reviewBody": "I submitted this original recipe and I want to warn you that the amounts of nutmeg and pepper were too much (compared to my original recipe)!!! This is definitely a taste-as-you-season sauce! Start with 1/4 tsp. of each and build up from there as you taste! Thanks for trying my recipe:) As with any recipes on this site it's a good idea to use your own judgement when it comes to any ingredients--it's also nice when people put tips for improvements in their posts!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T15:23:00.817Z",
                "reviewBody": "\"Kohl\" is german for cabbage and \"Kohlrabi\" is a german word. Thus saying kohlrabi will taste like cabbage or Broccoli... Great recipe - just like we do it here in Germany. I didn't put any cream in or did I let the sauce cook the extra 10 min. After the sauce thickened enough I put in the kohrabi. The extra flavor in the sauce comes from using the drained cooking water for it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AmiGermanCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3023647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-29T04:25:38.793Z",
                "reviewBody": "Today was 'try a new vegetable' day. This dish was very tasty and the nutmeg was indeed a nice touch. I steamed mine for 8 minutes instead of boiling but I don't think it would make a huge difference. I didn't have any cream but didn't substitute anything either. I eyeballed everything in the sauce pretty much but the quote from the husband is \"hardly ever does a vegetable taste that good\". It seems to have a cabbage-like flavor over potato-like texture. I'll be saving this and will serve it to company at next chance. A warning to those who are new to the lumpy purple thing like me: there were some infrequent fibrous bits present which I attributed to my being a kohlrabi-peeling novice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRIFFAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1105060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-23T14:50:47.543Z",
                "reviewBody": "This recipe looked appealing as I've just been exposed to kohlrabi. I agree with another reviewer that being a novice when peeling I didn't get all the fibrous peeling out. HOWEVER I found that the 2 tsp of white pepper was way too much -- making the dish inedible. However I will try again without adding the pepper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "taitmich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1630246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-13T23:17:34.003Z",
                "reviewBody": "I would have given this a higher rating if it wasn't for the white pepper. I should have realized before I added it to the sauce that it was too much. I don't really like my food spicy hot and even if I did the amount of pepper is overwhelming. That's all I tasted. I'm going to make this again but this time just a dash of the pepper. The sauce did have a lovely creamy flavor/texture that complemented the kohlrabi.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "cherylg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795970/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-05T08:28:12.13Z",
                "reviewBody": "I saw kohlrabi in the store today for the first time in years and looked up the recipe here as a memory enhancer. My German Nana used to make it this way with one addition. She always boiled the green leaves in a separate pot until soft; drained and then chopped them; and mixed them into the cooked sliced bulbs and sauce. It added an extra dimension to the flavor. If you have too many bulbs for the number of people you can freeze them (raw or cooked without the sauce) in a freezer bag for another time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooklyngal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3097521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-25T21:45:18.6Z",
                "reviewBody": "This is the first time I've made kohlrabi and we (my husband and I) loved it fixed this way. I didn't have the cream for the sauce so I just added a little more butter and thickened it more with a little bit of cornstarch. The flavor of the nutmeg came through nicely. This one's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol K. in Clyde, NY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2409477/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-13T18:32:05.533Z",
                "reviewBody": "This was good. I remember eating this at Juergen and Britta's house often in Germany. It was one of my favorite dishes at their house. I couldn't find any here in the US but I grew some myself this year. Just like cabbage (which it is) it grows well and is one hearty plant. I don't remember it tasting so much like cabbage in fact at the time I had no idea it was cabbage but she sliced it thinner than I did and I believe she cooked it more than I did. Next time I'll boil it longer and maybe not save the 1 cup water. I've got more Kohlrabi so I'll perfect it over time. I tried to go conservative on salt and pepper due to another review but needed to add more after it was done. I added a little black pepper too. The seasoning depends on how much Kohlrabi you have etc so you have to season to taste. It was good but I think the good company also made it better in Germany.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "goldochsen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5053358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-03T01:21:23.22Z",
                "reviewBody": "Fantastic!!! I got my first vegetables from the CSA (community sponsored agriculture) for the year and had no idea what to make with kohlrabi and potatoes. I did a Google recipe search and it brought me this tasty filling vegetarian dish. Wonderful!! I recommend making this with less than the listed amount of kohlrabi - I used only one but kept the rest of the recipe the same (needed a touch more flour to thicken the sauce though.) It makes it very saucy which is great for ladling over sauteed scalloped potatoes. Yum! This recipe has made me a die hard kohlrabi fan! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3824394/"
                }
            }
        ]
    }
]