[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/273162/sams-instant-pot-chicken-salad/",
        "name": "Sam's Instant Pot&reg; Chicken Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6592045.jpg",
            "width": 4032,
            "height": 1960
        },
        "datePublished": "2019-05-04T06:14:17.000Z",
        "description": "This is a low-sodium, low-acid, IC-friendly chicken salad recipe that tastes great and is made in an Instant Pot&reg;. I created this recipe for my husband who has a number of dietary restrictions and it turned out so well I thought I'd share. You can optionally add the dried cherries, cranberries or chopped green grapes mentioned in the last step. If you have IC, you should skip this step or make sure you are using something that works with your condition. In my opinion, green grapes taste the best, but they might not work if you suffer from IC. Serve cold between slices of potato bread, perhaps with some green leaf lettuce and sliced fresh tomato.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds organic boneless, skinless chicken breasts",
            "1 (32 ounce) carton low sodium chicken broth, or as needed",
            "1 (16 ounce) jar organic mayonnaise (such as Sir Kensington's®)",
            "½ small onion, diced",
            "¼ cup dried cherries",
            "potassium salt and freshly ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pound chicken with a meat tenderizer to reduce any gristle, then cut into 1/2-inch pieces, discarding any pieces with excessive fat or gristle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add chicken pieces to a multi-functional pressure cooker (such as Instant Pot&reg;) and pour enough chicken broth on top to just submerge the chicken. Close and lock the lid. Select the meat or stew setting according to manufacturer's instructions; set timer for 45 minutes, disabling \"keep warm\" function. Allow 10 to 15 minutes for pressure to build.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Broth and chicken should have reached a temperature of about 190 to 203 degrees F(87 to 95 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use a heat-safe plastic cooking spoon to shred the chicken directly in the pot, breaking up larger pieces. If the chicken does not shred, heat again for 15 minutes with the same settings, adding additional chicken broth to submerge the chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Empty contents of the pot into a strainer, allowing the broth to drain away. Transfer shredded chicken to a large bowl. Add 1 cup mayonnaise and mix in with a metal spoon. Add more mayonnaise until you reach the desired consistency. Mix in onions and dried cherries. Season with potassium salt and pepper. Refrigerate for 1 to 2 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Salad"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mattycakes"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "Sam's Instant Pot&reg; Chicken Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "559.5 calories",
            "carbohydrateContent": "5.8 g",
            "cholesterolContent": "88.1 mg",
            "fatContent": "48 g",
            "fiberContent": "0.4 g",
            "proteinContent": "25.9 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "452.3 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": []
    }
]