[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/693/meat-and-poultry/turkey/ground/",
                    "name": "Ground Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/222084/healthier-baked-ziti-i/",
        "name": "Healthier Baked Ziti I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7542161.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-12-31T07:50:07.000Z",
        "description": "I love pasta but it is not always the healthiest thing to have for dinner. To make this one a little less guilty, I use turkey and add a carrot to the sauce. So tasty!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 pound ziti pasta",
            "1 onion, chopped",
            "1 pound lean ground turkey",
            "2 (26 ounce) jars spaghetti sauce",
            "1 carrot, chopped",
            "6 ounces provolone cheese, sliced",
            "1 ½ cups reduced-fat sour cream",
            "6 ounces mozzarella cheese, shredded",
            "2 tablespoons grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees (175 degrees C). Lightly butter a 9x13-inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add ziti pasta and cook until al dente, about 8 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium heat; cook and stir onion and ground turkey until onion is translucent and turkey is no longer pink, about 7 minutes. Add spaghetti sauce and carrot; simmer until heated through, about 15 minutes. Layer ingredients into prepared baking dish as follows: half the ziti, Provolone cheese, sour cream, half the sauce mixture, remaining ziti, mozzarella cheese, and remaining sauce mixture. Top with grated Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until cheeses are melted, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Ground Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MakeItHealthy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.403846153846154,
            "ratingCount": 52,
            "itemReviewed": "Healthier Baked Ziti I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "524.8 calories",
            "carbohydrateContent": "58 g",
            "cholesterolContent": "74 mg",
            "fatContent": "19.9 g",
            "fiberContent": "5.6 g",
            "proteinContent": "27.6 g",
            "saturatedFatContent": "9.5 g",
            "servingSize": null,
            "sodiumContent": "914.4 mg",
            "sugarContent": "15.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-07-18T23:45:47.857Z",
                "reviewBody": "Simply delicious! And to think this is a healthier version of an all time favorite makes it even better. This is very easy to throw together and perfect for a hearty weeknight meal. So if your're in the mood for Italian but think you don't have the time - think again. I added some fresh minced garlic to the ground turkey and onion. And to the sauce I added a little red wine and some Italian seasoning to give a bit of a flavor boost. The sour cream was a nice change from the usual ricotta cheese as well as the carrot. I just eyeballed everything when layering. I covered it and baked it a little longer than 30 minutes leaving it uncovered for the last 10 minutes. Great with a fresh garden salad and warm bread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-27T01:09:58.42Z",
                "reviewBody": "This was a good spring board recipe.  I made a few changes that I believe made it not only healthier than this recipe, but tastier!  Rather than use plain turkey, use turkey Italian sausage.  If you can find it use smoked fresh mozzarella and chunk it up and add as a layer on top of the pasta as you do your layering.  Lastly, add more veggies, I added a whole broccoli stem and all chopped up along with adding a giant handful of spinach to the pasta right after it drained.  I also used about 1/2 of the amount of sour cream called for since I tossed the pasta and spinach with it before I started layering.  The result was a must make again baked ziti!  Yum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Moreland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3757085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-28T00:47:32.81Z",
                "reviewBody": "A great re-make of one of my favorites. I didn't think that the 50 Calorie per serving difference between the original and this recipe was that significant. I used Whole Wheat Pasta only 1 cup (8 oz) of sour cream which I stirred into the pasta before layering. I used only 3 slices of Provolone cheese. These changes knock a few more calories off and the family didn't even notice. Good stuff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-18T18:16:25.707Z",
                "reviewBody": "This is a great recipe that is customizable. I used vegetarian crumbles to make it meat-free, and added a thawed/drained box of frozen spinach. The provolone I thought I had turned out to be Havarti, didnt have mozzarella or sour cream, and in the interest of time and the spirit of creativity I substituted cheeses and just hoped for the best. Used the Havarti for the layer of provolone, considered yogurt but went with cottage cheese instead of cream, and used Colby instead of mozzarella. I started with sautéing onion and garlic to make the jarred sauce better, and left out the carrot. SO obviously I made a very different dish! But I layered and topped and baked as instructed and we had to stop ourselves from eating the entire pan. I plan to make this again using the same crazy cheese choices - maybe more cottage cheese this time, as it resembled ricotta. DELICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SNOWCROFT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/snowcroft/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-10T01:06:58.047Z",
                "reviewBody": "Delicious very hearty. Added some mushrooms as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "2furrytails",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4900638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-03T01:30:22.33Z",
                "reviewBody": "Loved this - I don't miss the beef at all, and I love that it's healthier and has carrots snuck in. I followed the recipe to the T with the addition of 1 more carrot since the one I had was small.  Threw it in into my food processor to get grated carrots (since someone said their carrots weren't cooked through).  I though this would be sweeter but it wasn't. I kept eyeballing the '2 jars of sauce' and wondering if it was all needed, but it was. I undercooked the ziti by 2 minutes and I'm glad that I did.  This totally filled my 9x13 which made me happy.  The only thing I would do differently next time is since I used provolone slices (that's what i had on hand and it kept the sauce from hitting the ziti), I would switch up the order and put the pasta, sauce, then provolone.  Used Barilla Mushroom which tasted great and added another veggie in there. UPDATE: Made this with 16 oz cottage cheese instead of the sour cream (which I did love also - it cooks into a ricotta-like texture) to make it even healthier and it just added to the cheesiness. Love it both ways, but the hubby went crazy over this and said he would bring this to any potluck.  20 month old ate it up too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STARDUST_331",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/stardust_331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-07T17:24:26.22Z",
                "reviewBody": "I really enjoyed the flavor of this dish. I would avoid adding the carrot unless you don't mind the crunchy texture in the sauce- I did add the carrot and even sauteed it with the onion but it still were pretty firm. I would definitely make this again but avoid the carrot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lizhess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3383831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-11T00:59:49.447Z",
                "reviewBody": "I thought this was a great recipe. I love the fact that ground turkey was used. The cheeses and the sour cream worked well together. I will say that I didn't use fat-free sour cream though used the real stuff. I also got a little confused when layering the items so I ended up just mixing them all together except for the last two. At the end I did add 8oz of shredding mozzarella and then sprinkled the parm on top. I listened to some others and shredded the carrots instead of slicing. I had some mushrooms that I needed to use up so I chopped up about 3-4oz of mushrooms and sauteed them with the onions and I also added 2 cloves of garlic(got to add garlic when using onions). It really was a great dish and I will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "keebdaisy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10558172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-20T23:50:44.197Z",
                "reviewBody": "A good recipe. I cut it in half (except for the meat) and put it in an 8x8 pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sonhe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3701747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-17T21:09:56.68Z",
                "reviewBody": "very bland did not like the carrots. Will not fix again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "pesteach",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7331716/"
                }
            }
        ]
    }
]