[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16563/soups-stews-and-chili/soup/tortilla-soup/",
                    "name": "Tortilla Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19766/six-can-chicken-tortilla-soup/",
        "name": "Six Can Chicken Tortilla Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2242813.jpg",
            "width": 2988,
            "height": 5312
        },
        "datePublished": "2000-01-13T18:07:01.000Z",
        "description": "Delicious and EASY zesty soup recipe that uses only 6 canned ingredients! Serve over tortilla chips, and top with shredded Cheddar cheese. Throw away the cans and no one will know that it is not from scratch!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (15 ounce) can whole kernel corn, drained",
            "2 (14.5 ounce) cans chicken broth",
            "1 (10 ounce) can chunk chicken",
            "1 (15 ounce) can black beans",
            "1 (10 ounce) can diced tomatoes with green chile peppers, drained"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Open the cans of corn, chicken broth, chunk chicken, black beans, and diced tomatoes with green chilies. Pour everything into a large saucepan or stock pot. Simmer over medium heat until chicken is heated through.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Tortilla Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Terryn"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.528662420382165,
            "ratingCount": 2198,
            "itemReviewed": "Six Can Chicken Tortilla Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "214.2 calories",
            "carbohydrateContent": "27.2 g",
            "cholesterolContent": "32 mg",
            "fatContent": "4.9 g",
            "fiberContent": "6.7 g",
            "proteinContent": "17.2 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "1482.5 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-09T16:15:31.903Z",
                "reviewBody": "Doctor it up!  I've made this recipe for over a year and passed it along by request.  It's a definite 5 star, especially for your time invested.  However, you MUST add seasoning.  This recipe gives you the base.  I would rate it 2-3 stars without additions.  My suggestions...substitute 1/2 broth with Cream of Chicken soup.  Rinse your black beans well!  Add cumin and chili powder...don't be shy.  It gives your soup depth.  Add cilantro and garlic powder, if available.  Grab a rotiserie chicken from your grocery.  I wouldn't expect a 5 star recipe to have canned chicken, would you?  Serve with chunked avocados, cheese, a squeeze of lime and whatever else your heart desires.  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SSCHULTE14",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1145246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-27T03:39:41.793Z",
                "reviewBody": "Two words best describe this soup:  \"EXCELLENT and EASY\"!  Several reviewers mentioned that soup was \"too salty\".  I figured out why.  DO NOT use \"condensed\" chicken broth; I made this mistake myself.  Recipe calls for \"chicken broth\", which means plain broth (Swanson and some other companies make it in a 14 1/2 ounce can).  I tried making it again using the correct broth; however, I found it (like other reviewers) to be too watery -- tortilla chips at the bottom of the bowl helped to soak it up though.  I made recipe again; however, this time I used only one 14 1/2 ounce can of chicken broth -and- two cans of condensed cream of chicken soup (99% fat free by Campbells--I DID NOT add water).  The soup tasted SUPERB this way!  I discovered that there was no need to add tortilla chips at the bottom of the bowl because soup was a bit creamy, but without being heavy tasting.  I added some shredded cheddar cheese on the top with a dollop of sour cream, and it looked great, too!  (Note:  \"Rotel Diced Tomatoes w/Green Chili Peppers\" is offered in varying degrees of spicyness.  I used the \"milder\" version which gave soup a tiny kick without giving a case of indigestion afterwards.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLLY-MOLLY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/856820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-21T15:42:20.517Z",
                "reviewBody": "This recipe is so quick, easy, and cheap...just open the cans and boil. I only spent about $10.00 on ingredients.  My company thought it was really good.  After reading the other reviews, here's what I came up with which was perfect:  I only used one can of chicken broth (not condensed or it will be too salty), I added 2 cans of condensed cream of chicken soup so it wasn't too watery as other reviewers suggested, used a milder version of tomatoes with green chiles (Rotel tomatoes with lime/cilantro work well).  Be sure to rinse the beans and make sure to season with garlic powder, salt, peper, chili powder, and cumin otherwise there won't be much flavor. Many reviewers suggested adding cilantro which I will try next time. Top with sour cream, cheddar cheese and some tortilla chips and it is perfect.  You really can't go wrong with this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rolanda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1074761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-09T04:58:50.233Z",
                "reviewBody": "Ok I don't exactly follow this recipe but it gave me some great ideas. I've cooked variations several times now - the ingredients depend on what I have on hand. Here's a sample of what I've put in at different times - Carrots dark and white chicken breasts I've browned in butter allowed to cool and shredded canned diced green chile green chile enchilada sauce rice green onions yellow onion canned corn can of kidney beans minced fresh garlic or garlic powder red chile powder the list goes on and on. It's quick to prepare - but tastes best when I put it in the slow cooker and let the flavors really infuse for about 6 hours but one time I made it quickly with rice chicken green chiles and canned corn - and sent it with my husband when he was visiting his sick mom. GET THIS! She can't stop raving about it!! She brags about my cooking to everyone now!! This is a miracle recipe! Don't worry if you don't have all the ingredients or want to add other stuff - just use what you have and people will love it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Noelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/381748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-27T03:37:04.06Z",
                "reviewBody": "I have made this recipe so many times and always with rave reviews, which is saying a lot from my picky husband!  As well as others, I use one can of cream of chicken soup in place of the 2 cans of chicken broth and I don't drain the can of diced tomatoes and chiles so it is still \"soupy\", I also use a can of mexican corn, drained or frozen corn if I have it on hand instead.  I drain and rinse the black beans because I prefer them that way.  While the soup is simmering I heat the oven to 350 and use a pizza wheel to cut flour tortillas in small, thin strips, bake them for a few minutes until crispy and top the soup with those and a dollop of sour cream. This recipe will remain in my kitchen for years to come and there are so many things you can do to change it up.  Thanks for a great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPRING1ONU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/326013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-24T15:31:29.217Z",
                "reviewBody": "I used one can of chicken broth and one can of condensed cream of chicken (with 1 can of water). It gave the soup a nice thick consistency. You may want to blend the broth and cream of chicken before adding the other ingredients. The soup's flavor was great, especially the next day. The undrained black beans contributed an unattractive greyish color but I personally love black beans and appreciated them here, as well as the corn (which I don't usually like in recipes). They both added a nice texture. Would have added cumin, etc. but my can of tomatoes + chiles happened to have plenty of seasoning already in it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHAMMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-25T16:55:22.733Z",
                "reviewBody": "I made this recipe twice so far.  The first time I followed the recipe exactly and it was so boring I forgot that I made it until my husband reminded me while I was cooking it the second time.  He wasnt too excited to see me cooking it again.  So the second time I made lots of adjustments and it was AWESOME!! I used a 48oz box of chicken broth, added 1 can of condensed cream of chicken soup.  I used a rotesserie chicken chopped up. I stuck with the same on corn, rinsed my black beans, and added the drained can of rotel. I added 1 tsp of cumin, 1 tsp of garlic powder, and 2 tsp of chili powder.  It was spicy.. but it seemed to calm down after I added a dollop of sour cream, handful of cheese and some crushed up blue tortilla chips to each bowl.  This recipe must be adjusted to make it awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "careyditges",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4973171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-04T21:31:22.437Z",
                "reviewBody": "I'm glad I gave this recipe a shot. I changed it a little by cutting up a chicken breast in place of the chunk chicken, replacing one of the cans of chicken broth with cream of chicken soup, and adding 1 tsp. cumin. I also drained the beans and corn first to keep it from getting too watery. The result was surprisingly flavorful and filling. The best part was that I didn't need to make a trip to the store for the ingredients, and it took less than 20 minutes. My wife and I have added this to our list of favorites!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Drew",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/236579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-22T19:50:10.03Z",
                "reviewBody": "I've been using this recipe for about a year now and all my friends and relatives have started using this recipe too. This soup is great when you're sick because its easy to make and clears you right up. I use the Carribean-style black beans w/ lime and peppers and Rotel Mild tomatoes with lime and cilantro. These two cans make a huge difference. Then I top with shredded cheese sliced olives chips and cubed avacado. YUM! Thank you Terryn for a family staple in our house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOPEYDUCK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/93268/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Six-Can Chicken Tortilla Soup",
            "description": "See how to make simple tortilla soup using basic ingredients commonly found in the pantry.",
            "uploadDate": "2012-10-16T20:24:31.870Z",
            "duration": "PT1M13.173S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7d3c6c97-4d52-43e7-9552-897794a5283c%2F526140b3-530c-4c61-a81e-2d4ce13aac85%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1904630459001"
        }
    }
]