[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/249/main-dish/casseroles/",
                    "name": "Casserole Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1005/main-dish/casseroles/noodles/",
                    "name": "Noodles",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19912/sandys-casserole/",
        "name": "Sandy's Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F170259.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-06-19T17:24:04.000Z",
        "description": "A chicken casserole that has Cheddar cheese and elbow macaroni as the main ingredients.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 cups uncooked elbow macaroni",
            "2 (5 ounce) cans chunk chicken",
            "2 cups shredded Cheddar cheese",
            "2 cups milk",
            "2 (10.75 ounce) cans  condensed cream of chicken soup",
            "1 (4 ounce) can sliced mushrooms",
            "¼ cup chopped onion"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl combine the macaroni, chicken, cheese, milk, soup, mushrooms and onion. Mix together and transfer mixture to a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for about 45 minutes, or until bubbly and golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Casserole Recipes",
            "Noodles"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SOONER SANDY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.236979166666667,
            "ratingCount": 384,
            "itemReviewed": "Sandy's Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "508 calories",
            "carbohydrateContent": "40.2 g",
            "cholesterolContent": "83.5 mg",
            "fatContent": "24.6 g",
            "fiberContent": "2.1 g",
            "proteinContent": "30.3 g",
            "saturatedFatContent": "11.8 g",
            "servingSize": null,
            "sodiumContent": "1252.8 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-13T21:45:21.617Z",
                "reviewBody": "I was hesitant about trying this recipe, after reading prior reviews that said the noodles didn't completely cook.  I went ahead and made it exactly according to the recipe instructions and boy was it good!!  Dee-lish!  There were a few noodles that turned out to be a little crunchy when it was done, but this did not detract from the casserole.  The few noodles still crunchy after baking had been located on top of the casserole, where they didn't get as much moisture from the liquid ingredients as the rest did.  Stirring one time halfway through cooking will solve that; that is the only change I will make to the recipe when I make it next time.  The flavor was really delicious and it's very easy to prepare.  Glad I tried it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURAROXANE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/458107/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T23:29:33.123Z",
                "reviewBody": "This recipe was one of the quickest and most delicious i found on the web.  It was VERY easy to whip together.  I did change it a little.  I added cream of mushroom soup for one of the cans of cream of chicken soup and omitted the mushrooms because that's what I had in my cupboard.  I also covered the casserole with tin foil for alotted 45 minutes and then removed it for an extra ten minutes.  This helped the noodles cook.  I also topped it for the last ten minutes with French Fried Onions.  It was delicious!!!  I will definitely cook this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EASTBLOSSOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/674067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-18T00:28:10.947Z",
                "reviewBody": "This was fantastic! I was very skeptical after reading that the noodles didn't cook all the way through in several reviews. My 2-1/2-year-old helped me assemble this and actually ate it which is saying something for my picky little girl. My husband who has a hard time trying \"new\" things was very surprised and actually ate seconds. He said it was \"very good.\" I did substitute one can of cream of chicken soup for cream of mushroom soup. I also added some salt and pepper to the mixture before baking. I baked mine for 65 minutes with stirring once after 25 minutes. I covered it with aluminum foil for the first 45 minutes then topped it with a layer of french fried onions. It was delicious. The noodles were perfect. The casserole was not runny! I will make this again and again. Thank you Sandy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ISLAYTOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/640102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-23T04:08:24.407Z",
                "reviewBody": "This was such a fast and easy recipe. I'm definitely going to make this again for dinner. I was really confused at first about whether or not the pasta needed to be cooked first so I ended up cooking it for 5 minutes in the pot. It didn't do any damage and the casserole turned out great! Also I think its better to keep the foil over it at all times unless you want some cheese on the top. I bet it will taste even better with a little bit of oregano or green onions. I retried this recipe without cooking the pasta and it didn't turn out as great. So people please make sure to cook your pasta for at least 5 minutes before mixing it in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2458115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-12T18:57:37.513Z",
                "reviewBody": "This recipe was a good kid friendly recipe. I did modify a few things so I could use ingredients I already had at home. I used egg noodles and cooked them part way. I also used 1 can fat free cream of chicken and 1 can fat free cream of mushroom soup with only 1 soup can of milk. I used 1lb fresh chicken instead of canned I just boiled the chicken and chopped it up. I also used light velveeta cheese instead of cheddar. I also put it into my crock pot instead of baking it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/841462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-13T14:52:55.577Z",
                "reviewBody": "Oh wow what a simple and DELICIOUS recipe!!! I love the simplicity of the ingredients and how fast it was to whip up and pop in the oven. We mixed up the ingredients popped it in the oven and went to play at the park with our daughter. We came home 45 minutes later to the house smelling yummy and a delicious meal! Unlike previous reviews our macaroni was cooked all the way through so there were no problems with that. We left out the onions and used all white meat chicken breast in the can and it tasted great! Thanks Sandy for posting it...be sure to try this one for one of those nights when you want to whip up a fast and easy meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Verna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/102071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-17T16:05:03.013Z",
                "reviewBody": "Very good although a little bland. I used whole wheat macaroni traded one cream of chicken for a cream of mushroom added frozen broccoli omitted the can of mushrooms and added onion powder instead of the onion. I covered it with tin foil while cooking until the last 10 minutes and stirred halfway and the pasta turned out perfectly. Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1448109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:41:54.857Z",
                "reviewBody": "Sandy your a genius! What a fast easy and great meal!! I used 1 can cream of mushroom instead of 2 cream of chicken and also added diced pimentos for color. Cooked covered until the last 10 minutes. Everything turned out great! Nobody would've guessed I prepared this in less than 5 minutes. Will make this easy dish again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T21:42:53.287Z",
                "reviewBody": "Wow what a delicious and quick dish!! Everyone loved it including my 3yr old and 10 yr. old. I don't know if canned chicken is available here in Canada but I couldn't find it in my grocery store so I poached a couple of chicken breast in garlic and basil then cubed them. It was really delicious and flavourful. I also added some peas for colour and I think next time I'll try other veggies as well--maybe some broccoli or aspargus.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARILKEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/449258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-27T21:32:30.06Z",
                "reviewBody": "After reading the reviews I made the decision to cook the macaroni before adding it to the casserole ingredients. I think making this decision helped keep some of the excess starch and gummy-ness out of the casserole and I didn't have to worry about undercooked pasta. I used two large cubed chicken breasts that I sauteed with a little butter/EVOO before adding the chopped onion FRESH mushrooms (I don't keep canned mushrooms on hand) and some fresh minced garlic in with it. This really only needed about 20 minutes in the hot oven to heat through seeing as I pre-cooked the macaroni. We didn't really care for this as is. I think it could use some spices or something to make it a little more pleasing to the palate. It's a good start. I think using fresh chicken fresh mushrooms and adding garlic made it a little better than written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            }
        ]
    }
]