[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16664/spinach-quiche/",
        "name": "Spinach Quiche",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F03%2F7778617-2000.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2000-03-04T13:45:39.000Z",
        "description": "Let me start by saying that I devised this recipe myself, and I just sort of add 'this and that.' This recipe is VERY forgiving, so you can add or remove ingredients according to your taste!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 - 9 inch quiche",
        "recipeIngredient": [
            "½ cup butter",
            "3 cloves garlic, chopped",
            "1 small onion, chopped",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained",
            "1 (4.5 ounce) can mushrooms, drained",
            "1 (6 ounce) package herb and garlic feta, crumbled",
            "1 (8 ounce) package shredded Cheddar cheese",
            "salt and pepper to taste",
            "1 (9 inch) unbaked deep dish pie crust",
            "4 eggs, beaten",
            "1 cup milk",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium skillet, melt butter over medium heat. Saute garlic and onion in butter until lightly browned, about 7 minutes. Stir in spinach, mushrooms, feta and 1/2  cup Cheddar cheese. Season with salt and pepper. Spoon mixture into pie crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, whisk together eggs and milk. Season with salt and pepper. Pour into the pastry shell, allowing egg mixture to thoroughly combine with spinach mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 minutes. Sprinkle top with remaining Cheddar cheese, and bake an additional 35 to 40 minutes, until set in center. Allow to stand 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Bailey"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.698099415204679,
            "ratingCount": 2736,
            "itemReviewed": "Spinach Quiche",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "612.6 calories",
            "carbohydrateContent": "23.9 g",
            "cholesterolContent": "232 mg",
            "fatContent": "48.2 g",
            "fiberContent": "2.8 g",
            "proteinContent": "22.9 g",
            "saturatedFatContent": "26.6 g",
            "servingSize": null,
            "sodiumContent": "1155.1 mg",
            "sugarContent": "6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-20T02:09:13.763Z",
                "reviewBody": "As already mentioned before in the reviews, the measurements on this recipe are a little off. If baked as per recipe, the quiche will be too oily and will not fit into one deep pie dish.  Instead, I suggest making 2 quiches!  Keep the same amount of spinach/mushroom/cheese mixture and separate it into 2 portions.  Use the 4 eggs and 1 cup of milk (can decrease to 3/4 if you like) and half of the spinach/mushroom/cheese mixture for one quiche, and the same for the other quiche.  Only use 1 tbsp of butter instead of the 1/2 cup recommended as it is WAY too much butter if you stick to the recipe.\r\nThe quiches turned out delicious and had a beautiful colour to them! Since this was my first quiche, I was afraid it would be too watery, but it came out firm.  Tastes great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1615403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T13:58:54.717Z",
                "reviewBody": "As many reviewers noted, this is a very forgiving recipe. I used some olive oil while cooking down fresh spinach and therefore no butter, 1/2 cup milk, and less chedder cheese.  It turned out great!!!!!  I recommend putting empty pie crust in oven for 5-7 min prior to filling to give it a crispy bottom crust  - no more soggy bottom!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIANECOOKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/536094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-06T21:06:34.607Z",
                "reviewBody": "This was delicious.  I used fresh mushrooms and skipped the crust.  Divided batter into muffin tins, baked then froze them.  They reheated great!  My family loved them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CSANDST1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/115553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-06T03:32:12.34Z",
                "reviewBody": "Why oh why can't there be a six star rating?  Let me preface this by saying that I have never been a big fan of quiche.  I told my husband I'd make one, so I found this recipe.  This is not only the BEST quiche I have ever had; I'd venture to say it is one of the most delicious foods I've ever eaten.  Next time, I will try to make it with less butter as others have suggested.  I used plain feta and added a dash of oregano, basil, rosemary and seasoned pepper.  I made the Pastry for a Single Crust Pie from this site, and it was great for this dish.  (Probably not so great for a sweet pie).  Anyway, thank you for the fantastic recipe Bailey, you are single-handedly responsible for finding a way to get my six year old to not only EAT spinach, but to eat it with gusto!  I am in your debt.  :)\n\nEdited to add:  If you ever plan on making this \"healthier\" by cutting back on the butter, I highly recommend you do it the FIRST time, so you won't be disappointed in the difference.  It's still a good quiche with 1.5 Tbsp of butter, but it's a GREAT quiche with the whole stick.  LOL",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eileen in AR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/argreenmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T01:36:55.03Z",
                "reviewBody": "I made a few changes only because I was looking for a particular recipe that I couldn't find...I used swiss cheese instead of cheddar...left out the mushrooms (because I don't like them) used 1 heaping Tablespoon of margarine (instead of the 1/2 cup butter) eggbeaters for the eggs and skim milk and this was Fantastic.  I served it along with other things at a brunch and this dish was gone in 10 minutes..When I make it again (and I will) I will make 2 or 3 of them! I made this the day before, refrigerated it overnight and then warmed it in the oven the morning of the brunch (covered in foil to prevent overbrowning) It reheated perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RACHNJEFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/444288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-08T06:37:05.03Z",
                "reviewBody": "This was great!  I made a few variations to lower the fat content.\r\n\r\nI used margarine instead of butter and halved it, per everyone's suggestions.  I used skim milk, and I used egg whites instead of eggs.  I also reduced the cheddar a bit. And it was still great!  I can only imagine how wonderful it would be if I used all the real ingredients instead of the low-fat stuff.\r\n\r\nAlso, I used fresh mushrooms and sauted them with the onions and garlic.  Veeeery yummy.  I made mine without a pie shell.  Other fun things to try next time include bacon bits, a handful of almonds or pecans, raisins, or topping it with bread crumbs, croutons or fried onions!  There are just too many fun things to do with this recipe, so I'll definately be making it again.  And again.  And again.  And... ;)\r\n\r\nThank you so much!  Okay, I'll shut up now.  :D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CCRAUDER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-12T22:34:35.5Z",
                "reviewBody": "The flavor blends in this spinch-feta-garlic quiche were very tasty. Follwing the advice of others I decreased the butter from 1/2 c to 6T.....it was still too greasy. Next time I will reduce it to 3T or maybe use a little olive oil. I will also omit the salt altogether. Every family member mentioned how salty it was. Feta and cheddar make it salty enough. I used fresh baby spinach steamed instead of frozen. I think with these changes the flavor blends will have a chance to blossom.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "veggiemommie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1572309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T13:39:45.09Z",
                "reviewBody": "Awesome quiche. \r\nThe only suggestion I have would be to cook the pie crust for maybe 5 minutes before adding the ingredients to brown it a little. \r\nI will make this recipe again and again!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIANEMMM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/607200/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T13:58:25.983Z",
                "reviewBody": "WOW.  This was so excellent.  I made it for my Bridesmaid's Luncheon and everyone loved it.  I should, however, have read the reviews first and not used as much butter-- maybe only 1/2 or 2/3 as much.  I would call this less of a quiche and more like the Greek dish Spanikopita (spinach pie).  I left the mushrooms out and just used the spinach and the cheese.  The extra butter made the pie crust nice and flaky (in some spots-- in others is was just soggy and greasy) like the phillo dough used in Spanikopita.  I used Sundried Tomato and Basil Feta (all I could find) and it was delicious.  The cheddar cheese and egg on top were a very pleasant contrast to the spinach and feta mixture on the bottom.  A past reviewer said her egg mixture overflowed in the oven, even though she used a deep dish pie crust.  Maybe that was because you used eggs that were too large?  I don't think I'd use anything bigger than a large egg for this recipe.  Also, I think a cup of milk is too much to add to the eggs.  I only used between 1/2 and 3/4 of a cup.  This turned out way better than I expected.  It's also one of those great dishes you can get creative with depending on your mood.  Just change the ingredients to whatever you have on hand or feel like using!  A++",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNALOU18",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/783817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-04T17:36:35.093Z",
                "reviewBody": "We were excited to try this version of Spinach Quiche, especially after reading the reviews.  We were disappointed.  The flavors were bland, even with the garlic herb feta, and there was just nothing that stood out about this quiche.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "lefinley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/410495/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Spinach Quiche",
            "description": "See how to make this easy, top-rated spinach quiche.",
            "uploadDate": "2012-05-23T02:04:20.918Z",
            "duration": "PT3M16.905S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa6830d99-c208-407f-bcf3-c5ab8e0aaa13%2Faa8dbba7-19e1-4cb8-b434-22a27bf118ef%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1651408832001"
        }
    }
]