[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/116/appetizers-and-snacks/spicy/",
                    "name": "Spicy",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217143/baked-buffalo-chicken-strips/",
        "name": "Baked Buffalo Chicken Strips",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1124342.jpg",
            "width": 1500,
            "height": 979
        },
        "datePublished": "2020-01-16T08:50:57.000Z",
        "description": "A game day favorite.  Full of flavor! Serve with ranch or blue cheese dressing.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 cups low-fat buttermilk",
            "½ cup hot pepper sauce (such as Frank's RedHot®)",
            "2 skinless, boneless chicken breast halves, cut into strips",
            "1 (8 ounce) package panko bread crumbs",
            "1 cup liquid egg substitute (such as Egg Beaters®)",
            "cooking spray",
            "1 dash hot pepper sauce (such as Frank's RedHot®), or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk together the buttermilk and 1/2 cup hot pepper sauce in a bowl, and pour into a resealable plastic bag. Add the chicken breast strips, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 1 hour or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C). Grease a baking sheet; set aside. Remove the chicken from the marinade, and shake off excess. Discard the remaining marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the panko bread crumbs and egg substitute in separate dishes. Gently press the chicken into the bread crumbs to coat and shake off the excess. Dip into the beaten egg, then press into bread crumbs again. Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Arrange the breaded chicken on the prepared baking sheet. Spray chicken strips lightly with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 10 minutes, then gently flip the chicken strips and spray with cooking spray again.  Continue baking the chicken until golden brown and no longer pink in the center, about 10 minutes more. Add a dash more of the hot pepper sauce, a return to oven. Bake until the sauce dries, about 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Spicy"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kattygirl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.162162162162162,
            "ratingCount": 37,
            "itemReviewed": "Baked Buffalo Chicken Strips",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "359.7 calories",
            "carbohydrateContent": "52.7 g",
            "cholesterolContent": "37.8 mg",
            "fatContent": "10.3 g",
            "fiberContent": "0.2 g",
            "proteinContent": "27.6 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "1389.6 mg",
            "sugarContent": "6.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-23T18:37:31.06Z",
                "reviewBody": "I absolutely love your recipe idea but I would like to suggest to use half the amount of buttermilk and half the amount of panko crumbs you suggest if you're only going to be using two chicken breast halves. That much marinade (you can turn the chicken half way during the marinating) and that much crust is wasteful for such a small amount of chicken because you can't reuse the rest of the excess marinade nor the panko crumbs that the raw chicken have touched as it has been contaminated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Deeli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3816489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-01T18:15:24.15Z",
                "reviewBody": "Hey everyone - this is my recipe, But a few things seem to be changed by Allrecipes since it was published.  I do a few things differently.\n\n1)  Do not place the full amount of bread crumbs or egg substitute out at once.  I start with small amounts and replenish as needed.  It minimizes the amount of waste.\n2)  I also spray with cooking spray pretty generously.  I don't leave them swimming in it, but if you use too light of a hand, you have a higher chance of the breading falling off.\n3)  You do have to REALLY spray the baking sheet to less breading sticks to it.  I am very gentle when I turn them, but you will typically lose some breading.  I don't tend to lose a lot though.\n4)  When they are done cooking, I put buffalo sauce in a bowl and literally coat them in it.  This really gives them true wing flavor.  That said, it also makes them pretty spicy.  If you don't like as much heat, a dash works fine.  I then return them to the over to bake for the 5 minutes indicated.\n\nPlay with the recipe and see what works for you.  I was just happy to have a non-fried alternative that had some crunch to it.  Happy cooking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KATTYGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/946711/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-03T22:42:13.28Z",
                "reviewBody": "Used chicken tenders. They were great! Will make again for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gummy2008",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3069626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-02T23:46:58.4Z",
                "reviewBody": "I just made this and it got a thumbs up from my wing loving kid! I used a tip from another recipe on the site that I saw. I placed a cookie cooling rack on the baking sheet sprayed the rack liberally with Pam and baked the strips directly on the rack and they were crisp on both sides and barely lost any breading. With 5 min left in the cook time I drizzled buffalo sauce on half of them for my family that likes it hot. The remainder with out the added sauce were great too. I used 3 huge breast cut into large strips. Definitely plenty of marinade and breading for more chicken. This is a keeper for my recipe box!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danadwoodrn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9700805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-28T20:19:35.683Z",
                "reviewBody": "I tried baking chicken strips and I just don't like them that way. I have a deep fryer and prefer to use that. Anyway...I don't bother w/buttermilk - the acid in the hot sauce thickens plain ol milk. I go half n half with amounts of milk & hot sauce. I use a regular egg mixed with a bit of milk. I also season up the panko with celery salt garlic powder fresh grated parm and a some cayenne pepper. I do leave the chicken to marinade overnight. With my changes these rock and you can quickly toss with a buffalo wing sauce if you really want to kick things up! Easier eating vs chicken wings (although I like those too).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MakeItWork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/makeitwork/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-14T17:35:58.01Z",
                "reviewBody": "Made these last night for my chicken strip lover of a boyfriend. Didn't realize I had ran out of Frank's so used Sriracha instead - a delicious alternative! 1 cup of buttermilk to 1/4 cup hot sauce marinated with 3 sliced chicken breasts produced very moist and flavorful chicken strips. They got a huge stamp of approval from the boyfriend but as delicious as they were we couldn't even finish them all. But not to worry the boyfriend had the leftovers finished by 10am the next morning. I did find the breading a little heavy though. I don't usually use egg when I bread meats (which is quite frequently) which is perhaps the difference?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VeXedPiNk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4056447/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-19T22:44:21.81Z",
                "reviewBody": "These taste really good...they're probably worth 5 stars if done correctly but I didn't have buttermilk or Egg Beaters so I used plain milk and eggs. Also I didn't pay close attention when reading the recipe and didn't dip in the panko BEFORE the egg only after. And I didn't add the last splash of pepper sauce. We added to taste as we ate them. I will definitely try making this again...the right way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Merrick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/966150/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-09T23:55:42.04Z",
                "reviewBody": "With the exception of using chicken tenders I followed the recipe exactly. Even though I sprayed the pan the breading stuck and when I flipped the tenders they came up naked. The chicken did not pick up the hot sauce flavoring at all. Overall this was a disappointment.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "It's A New Day",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/844886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-14T04:20:25.343Z",
                "reviewBody": "for a baked chicken this was quite good. I used about 5 lbs of chicken tenders for the 2 c up buttermilk marinade. didn't have panko just used bread crumbs cuz this was a last minute decision to make. tasted great and was easy to make",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sonya A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/270084/"
                }
            }
        ]
    }
]