[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9006/creme-fraiche-chicken/",
        "name": "Creme Fraiche Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4508228.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-05-03T22:43:58.000Z",
        "description": "When I was an exchange student in France, my French mom made this dish and it has been my favorite ever since. It is chicken breast cooked in butter, creme fraiche and mushrooms over pasta. No one can make it like her, but this is very close. Serve with French bread or French garlic bread if desired. Bon Appetite!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 to 6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves",
            "¼ cup white wine",
            "salt and pepper to taste",
            "1 (8 ounce) package pasta, your choice of shape",
            "1 large white onion, chopped",
            "1 tablespoon chopped garlic",
            "2 (8 ounce) packages sliced fresh mushrooms",
            "2 cups creme fraiche",
            "½ cup grated Parmesan cheese for topping",
            "3 tablespoons sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet, saute chicken breasts in oil over medium high heat. Once breasts are browned, add white wine and salt and pepper to taste. Let simmer for 15 to 20 minutes, or until chicken is cooked through and juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, To Cook Pasta: Bring a large pot of salted water to a boil. Add pasta to boiling water, cook for 8 to 10 minutes or until al dente. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When chicken is cooked, remove from skillet and cube. Set aside. Saute onion and garlic in remaining juices. Once onions are translucent, add mushrooms and saute until soft. Add cubed chicken, creme fraiche and sour cream (to desired thickness). Stir all together and heat through. Put hot cooked pasta on plate, top with chicken and sauce and sprinkle with grated Parmesan cheese.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kristel A. Ivy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4605263157894735,
            "ratingCount": 76,
            "itemReviewed": "Creme Fraiche Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "707.9 calories",
            "carbohydrateContent": "35.1 g",
            "cholesterolContent": "256 mg",
            "fatContent": "43.1 g",
            "fiberContent": "3.2 g",
            "proteinContent": "47.6 g",
            "saturatedFatContent": "26 g",
            "servingSize": null,
            "sodiumContent": "269.7 mg",
            "sugarContent": "6.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-17T21:28:33.877Z",
                "reviewBody": "Excellent classic French cuisine.  I just wanted to add a bit of helpful information; someone said she couldn't find creme fraische locally; I found it at Whole Foods Market marked sky high.  So, I learned how to make it myself.  I understand why it is cheap and plentiful in France.  It bloody well should be!  It's very simple to make.\n\nCreme fraiche is a thick cream used in sauces and soups and as a condiment for fresh fruits. \n\nPlan ahead as this will take some time.\n\nHere's How:\n1 cup heavy whipping cream mixed with 2 tablespoons buttermilk.\nCombine well in glass jar and cover. (I use a large Mason jar; these come in quarts and half gallons, too.  When I make it, I make a ton!)\n\nLet stand at room temperature (about 70 degrees F.) for 8 to 24 hours, or until thickened.  The longer you let it sit, the better it ages, and the thicker and richer it becomes!  I consider it a staple since I learned what it really consists of.  And shame on some of these stores for jacking up the price for a mere cup or pint of it.\n\nStir well and refrigerate.  You will probably become quite addicted to it, as we have.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katherine Urbahn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1951528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T18:51:10.577Z",
                "reviewBody": "Very very good. Since the Cream Fraiche is the true star of this recipe I changed a couple of things that I believe shave off a few calories without sacrificing taste. First I grill the chicken breast vs. browning it in oil/butter in a skillet. When the chicken is about half done I remove it from the grill and transfer it to the skillet for the simmer process in the wine. I then substitute plain yogurt for the sour cream. If you like the sauce thick use sour cream. I find that using yogurt makes for a thinner and lighter sauce and in my opinion takes nothing away from the taste of this dish. I also prefer shallots vs. the white onion but that s personal taste. For the pasta I find I get the best presentation when I use Vermicelli.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GUYCHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-23T07:51:08.28Z",
                "reviewBody": "This was so simple to make and just delicious. I agree with a previous reviewer who added more wine. I also omitted the sour cream and just used creme fraiche as I didn't think there was any need for both.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1468252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-10T15:35:14.977Z",
                "reviewBody": "Update September 2009: I'm coming back 5 years later to comment on this review because it deserves it. This dish is now in my staple of dinners. We love it. As another reviewer mentioned you can find Creme Fraiche (Vermont Farms) at Whole Foods and other upscale grocery stores. At the time I was not living in a location with a Whole Foods. I typically serve this with whole wheat or regular penne pasta. I top with fresh parsley for color. I serve with green beans or carrots. I also tend to put in a bit more wine than the recipe calls for so the chicken can really simmer and get tender. REVIEW: Spring 2004 I really had to punt with this recipe so I'm keeping that in my mind with my review. However there are some important steps missing here. Maybe it's my naivete in the kitchen. The recipe gives the impression you can buy prepared creme fraiche in the store maybe that's true. I couldn't find it and I had already planned to make this dish last night. Therefore it would be helpful to have a recipe for homemade creme fraiche which takes a couple of days to prepare included. I would have made the dish another time when I could have made the creme fraiche. So I made it using plain whipping cream and extra sour cream. With that change this was still a wonderful dish. Another point: At the beginning the recipe states that the chicken is fried in butter but the steps mention oil. I did use butter and a bit of oil to fry the chicken. One question: What specific",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GINWOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/331399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T08:59:47.967Z",
                "reviewBody": "Whenever I have a dinner party \"creme fraiche poulet\" is the order of the day! Friends and family adore this recipe and I recommend it highly. Goes great with French bread. For a light dessert after this heavy meal I like to serve vanilla ice cream with a mixed berry brandy sauce. Bon appetite!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIVODITEATRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/594897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-26T13:55:59.187Z",
                "reviewBody": "I was confused with this recipe when I saw it was made with crene fraiche and sour cream! creme fraiche is French sour cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CANNOLIEATER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1465197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T21:23:57.78Z",
                "reviewBody": "Very good! I recently moved to France where Creme Fraiche is readily available and cheap. I was looking for new ways to use it and this recipe turned out to be a winner! I added a touch more wine and it was delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NURSEARS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1007249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-04T15:11:01.793Z",
                "reviewBody": "Great French classic dish with only a few modifications. I made this for 2 people and adjusted the recipe but it probably served 3 very full-size portions. I tripled the amount of wine as the simmering time would have dried up all the wine and you need a bit of juice (2 tbsp per breast) in the end to add flavor to the sauce. I think you shouldn't skip this step since the chicken soaks up a lot of flavor from the wine. Also do not sub the creme fraiche with only sour cream as it would make this dish too sour along with your dry white wine. I also added some fresh parsley at the end. It was tres magnifique!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Myleen Sagrado Sjödin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/763833/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-02T20:24:40.373Z",
                "reviewBody": "creme fraiche is available in the grocery store in the sour cream section so don't trouble yourself making it from scratch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELAINAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/984602/"
                }
            }
        ]
    }
]