[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/36196/chile-verde-ii/",
        "name": "Chile Verde II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F691336.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-02-01T07:50:24.000Z",
        "description": "A delicious Mexican dish of pork simmered in tomatillos and chiles. Serve with white beans and rice. Garnish with grated cheddar cheese.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "6 pounds cubed pork stew meat",
            "¼ cup vegetable oil",
            "2 large yellow onions",
            "6 cloves garlic, minced",
            "1 tablespoon sea salt",
            "freshly ground pepper, to taste",
            "1 tablespoon ground cumin",
            "4 ½ quarts chicken broth",
            "8 fresh poblano chile peppers, seeded and chopped",
            "4 fresh jalapeno peppers, seeded and chopped",
            "2 yellow bell peppers, seeded and chopped",
            "3 pounds fresh tomatillos, husks removed",
            "1 bunch cilantro leaves, coarsely chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large stock pot, over high heat, sear the pork in the vegetable oil until golden brown. Remove the pork from the pot, reserve 2 tablespoons oil in the pan, and . Cook the chopped onion and garlic, seasoned with salt and pepper, in the reserved oil until onions are tender. Season with cumin, then stir in pork and chicken stock. Simmer for 1/2 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in poblanos, jalapenos and bell peppers. Puree the tomatillos and cilantro in a blender, and add them to the pot. Cook an additional 30 to 45 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Clare"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.545454545454546,
            "ratingCount": 264,
            "itemReviewed": "Chile Verde II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "357.3 calories",
            "carbohydrateContent": "7.8 g",
            "cholesterolContent": "81.5 mg",
            "fatContent": "23.8 g",
            "fiberContent": "2.5 g",
            "proteinContent": "27.5 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "325.3 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-07T02:48:33.237Z",
                "reviewBody": "This was the first time I made this.  I read through the reviews and took advantage of everyones experience. I took a little from each person.  I put the tomatillos and jalapenos in a pot with a little water (approx 1 cup) and steam/boiled them till they were soft.  I also lightly floured the pork before searing in the skillet.  After the pork was seared, I put the meat in a large crock pot.  I put the stemed tomatillos, fresh cilantro leaves and stemed jalapenos in the blender for 1-2 min. I poured the mixture over the meat in the crock pot.  I took the other peppers (yellow and poblano) and roasted them on the gas grill until they were blistered all over.  I placed them in a plastic bag to cool..then under water peeled the skin off of each.  I placed the yellow and pablano peppers in the blender and mixed for 1-2 min, then added this to the crock pot over the meat.  I cooked the onions w/spices as instructed, and once the onions were soft I added 1/2 cup chicken broth to help deglaze the skillet then added this into the crock pot.  I cut the recipe in half (service for 10), but the one IMPORTANT thing was that I added all the ingredients into the crock pot and then added the chicken stock LAST so I could control the thickness of the sauce.  I ended up using approx 3 1/2 cups of chicken broth because the tomatillos and blended chilis made up the rest of the sauce.  It was FANTASTIC....the BEST Verde ever! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3014031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-20T20:30:41.063Z",
                "reviewBody": "The closest chile verde recipe I have found outside a restaurant.  It was watery and a little sharp so I added one teaspoon of sugar to cut the tartness.  Much better - but that's a personal preference.  Would definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-08T21:54:47.403Z",
                "reviewBody": "I loved this recipe.  I am mexican and usually do my own chile verde but wanted to see how others differ.  I seared the pork then removed to sear the onions/garlic/cumin powder.  meanwhile, boiled the tomatillos/jalepenos till tender. then put in blender on hi for bout' 2-3minutes. pour mixture into onion/garlic/cumin and bring to a slight boil then return the seared pork.  Absolutely delicious. DONT FORGET to add small amts of salt and black pepper to all three steps! ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOTHEROF4BIGEATERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1349151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-17T03:27:06.84Z",
                "reviewBody": "I was begging for it when I made this--this is a family treasure at the in-laws and this is not the way they make it. First time I served it to them, I got cool looks and lukewarm comments. I heard later that the left overs where gone by morning and no one would admit to eating all of it. Next time I was Told to bring The Other Verde (as this is now known as) and everyone is quite exultant to see this come through the door (inlaw G'ma took me aside and said \"not bad for an Anglo\"), so a Big Thank You, Clara!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bob McDonald",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/302573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-16T20:23:24.83Z",
                "reviewBody": "This was a new experience for me! I have never even tasted Chile Verde before let alone make it myself. I don't know what's \"authentic\" and what's not or how it's supposed to look or taste. After a little research and after reading some of the reviews I gave this a shot. First I roasted the tomatillos jalapenos and poblanos at 400 for 12 minutes then pureed them in the food processor. I dredged the meat in flour browned it added the chopped onion yellow bell peppers and garlic. Deglazed the pan with 1/4 of the amount of chicken broth called for (given so many reviews indicating there was far too much broth in the recipe). I put everything in the slow cooker along with the cumin and Mexican oregano salt pepper and chopped fresh cilantro to taste. My plan was to serve this in tortillas with sliced avocado and queso fresco but this was still just too liquidy for that. Alternatively the thought of eating what was essentially a stew of pork and tomatillos with a bowl and spoon didn't appeal to me either. So authentic or not I added a can of cannellini beans (white kidney beans) for the recipe scaled down to 4 servings and 1-1/4# of meat. Now I had something! The beans definitely gave it substance interest and texture and appealed to my ingrained \"there's got to be beans if it's chili\" way of thinking! This was tasty enough but maybe just too different for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T19:44:08.327Z",
                "reviewBody": "Delicious recipe for Chile Verde. The tomatillos do a great job of thicking it up towards the end. I used 6 cups instead of 8 cups of chicken broth -- which was more than enough. I also added some cut-up potato pieces (cubes) towards the end to make the stew a bit more hearty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Esmee Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/esmee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-06T16:04:31.23Z",
                "reviewBody": "This recipe would be good if it had the correct amount of broth, it's suppose to be 4 1/2 cups not 4 1/2 quarts. This is suppose to be thick like a stew or gravy instead it's like soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kidnkorner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3895791/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-19T04:00:55.13Z",
                "reviewBody": "I've made many batches of chile verde over the last twenty years, each time trying slightly different ingredients (especially the varieties of chiles) and techniques. This version is very similar to how I make it these days, with a couple of important differences. First of all, the amount of broth in this recipe is way too much! The batch I just made today had three pounds of pork shoulder and only 4 cups of chicken broth- not the 9 cups that Clare uses. I used three fresh poblanos and three anaheim chiles and about 1-1/2 pound of tomatillos. I roast them under the broiler, put in a large glass bowl, cover with plastic wrap and let them steam for at least a half hour (roasted chiles and tomatillos add great depth to the sauce). When it's time to peel and seed the chile's, DO NOT rinse them under water as you are doing this! I see this technique used in recipes all the time and it's a big mistake, as rinsing the chiles in water washes much of the roasted chile taste down the drain! Instead, take a paper towel and rub off the skin and wipe off the seeds from the inside of the chiles. I also chop the tomatillos into quarters and bake in a shallow greased baking pan at 400 degrees, stirring occasionally until they're nice and soft and begin to caramelize. I have found that a dutch oven works best for this dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Grant Rohr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5993182/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-06T03:41:01.797Z",
                "reviewBody": "This was excellent.  As previous reviewers mentioned, the chicken stock called for was way too much.  I'll use about half next time.  I also cooked it in the crock pot and the meat was extremely tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Ray Madsen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/316392/"
                }
            }
        ]
    }
]