[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
                    "name": "Rice",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16244/main-dish/rice/beans-and-rice/",
                    "name": "Beans and Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/49353/lentils-and-rice-with-fried-onions-mujadarrah/",
        "name": "Lentils and Rice with Fried Onions (Mujadarrah)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F67880.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-02-01T07:50:27.000Z",
        "description": "This may sound like a plain recipe, but believe me, it's wonderful! It is an easy-to-make Middle Eastern comfort food that combines lentils, rice and delicious fried onions. The yogurt really gives it a super flavor!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 Servings",
        "recipeIngredient": [
            "6 tablespoons olive oil",
            "1 large white onion, sliced into rings",
            "1 ⅓ cups uncooked green lentils",
            "¾ cup uncooked long-grain white rice",
            "salt and pepper to taste",
            "¼ cup plain yogurt or sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large skillet over medium heat. Stir in the onions, and cook about 10 minutes, until browned. Remove from heat, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place lentils in a medium saucepan with enough lightly salted water to cover. Bring to a boil, reduce heat, and simmer about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir rice and enough water to cover into the saucepan with the lentils. Season with salt and pepper. Cover saucepan, and continue to simmer 15 to 20 minutes, until rice and lentils are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix half the onions into the lentil mixture. Top with yogurt or sour cream and remaining onions to serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rice",
            "Beans and Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Melissa Mueller"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.313375796178344,
            "ratingCount": 785,
            "itemReviewed": "Lentils and Rice with Fried Onions (Mujadarrah)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "534.8 calories",
            "carbohydrateContent": "69.1 g",
            "cholesterolContent": "0.9 mg",
            "fatContent": "22.1 g",
            "fiberContent": "10.6 g",
            "proteinContent": "17.3 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "311.9 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-06-23T01:59:44.86Z",
                "reviewBody": "Am Middle Eastern and we make this dish all the time except that we add cumin to the lentils while they are cooking and a chicken bullion cube ..that really makes the great taste of this dish and diffentely differenciate it from being bland like some have commented.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WAHIDA2002",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/793055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-24T14:58:41.147Z",
                "reviewBody": "This is a family staple. Best thing about being Arabic is the food... my god! Juddrah is one of my childhood favs!\nOne type, caramelize the onions as dark as you can without burning. The deeper you caramelize them the more delicious the end taste is.\nSour cream is a no.\nYoghurt is a yes. We eat everything with plain yoghurt and this is one of those dishes that is out of this world with yoghurt, salt, and a side of a cucumber salad.\n\nKeep in mind, your whole house will reek when you cook this, so make sure you have good ventilation!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie N",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2652991/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-11T23:36:37.663Z",
                "reviewBody": "I rated this a 4 as a compromise. I would have rated it a 5, but my husband said he would have given it a 3 (He isn't very familiar with lentils - not that there was a problem with the taste. Because it tasted great!). I made a few slight alterations: I made it with 3 onions instead of 1, and I sliced them into half-rings before getting them good and browned, and I added 1 TBS cumin and 1&1/2 tsp garam masala to the lentils. Everything else I left the same. The house smelled wonderful while cooking and the leftovers were great the next day - even my toddler enjoyed it. Don't skip the yogurt, since the yogurt's tang definitely pulls the flavors together. I'll definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VesHeill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2327447/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-19T20:23:00.343Z",
                "reviewBody": "The original seasoning for Mujadarah includes not only salt and pepper, but cinnamon too. You will be surprised how well the cinnamon flatters the taste and aroma of the fried onion. Just be gentle with it, just a touch is all it takes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MALKALEVADOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1188169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-10T13:51:09.793Z",
                "reviewBody": "This recipe is a definite \"keeper\".  Makes enough for quite a few meals if using it as a side dish.  I used 3 med. sized Vadalia onions which was good but I think next time an additional one to two onions would be worth a try.   I used brown rice and cooked with the lentils with no problems.  Cooking time was approx. 45 mins.  The amount of liquid I used was approx. 3-1/2 c.   I used chicken stock for a bit more flavor.   I added 1/2 tsp cumin to the lentil/rice mixture during cooking also added the pinch of cinnamon to the onions as suggested in another review---very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M.A.H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/384284/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-18T17:03:27.59Z",
                "reviewBody": "I have cooked this twice.  The first time I did exactly as the recipe said, but my rice was undercooked.  I ended up adding more water, and the consistency was that of risotto.  \n\nThe second time around, I used 3 cups of water + 2 chicken bouillons to cook the lentils, then I added the rice and added 2 more cups of water.  It turned out perfect and consistency was great.  \n\nAlso, to caramelize onions, it takes MORE than 10 minutes to ensure you are not just cooking them, but caramelizing them.  I cut the onions in rings and start cooking them as soon as I boil the lentils.  You have to make sure the fire is very very very low.  Your onions will caramelize beautifully and will have that perfect sweet taste.  It takes about 30 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "benanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4764219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-05T18:33:38.577Z",
                "reviewBody": "I am a die-hard foodie, Middle Eastern specialist, and in the Arabic restaurant business for 40 years. I did not try to follow the recipe, which sounds on spot, but was interested in the reviews and only wanted to point out that this is a traditional vegetarian dish that is used in much of the Arab world but is a particular staple during fasting periods among Arab Christians when no animal products are consumed (like the chicken broth that some people added). Even Muslims and Jews of the region eat this only as a vegan dish. The yoghurt (laban) on the side is a regional preference (mine too) and is often substituted by some sort of lemony salad or picked vegetables,like turnips. This is an ancient and revered dishl for its simplicity and humbleness, and I just wanted to add some authenticity to the pot. I am delighted that so many people tried it and responded favorably!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "tamam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6850327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-24T12:25:50.97Z",
                "reviewBody": "Mujadarah is my favorit food. Try using Basmati rice which is also long grain but has that wonderfull taste. For the leftovers, you can store Mujadarah in the frig for a long time but it will get dry. So, add couple table spoons of water to the dry rice, toss well, microwave on 80% power until it is steaming again. Mujadarah also best eaten with big Greek Olives and a head of raw onions on the side. You breath will smell for a while but the taste is heaven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ahmad Ghosheh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1824452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-24T16:09:14.1Z",
                "reviewBody": "The recipe didn't state how many cups of water you need to cook the rice and lentil together.  For some who are not so used to cooking or eating with rice, the recipe should indicate it clearly.  Yes, I agree with other viewers, you need to add cumin and cinnamon which in the original Egyptian mujadarrah dish calls for, the amount depending on your taste and liking, because some doesn't like the smell of the cumin.  Adding these spices would make a big difference.  And of course, yogurt and greek salad really goes well with this dish.  My husband is an Arab and he always make this dish and it's a family favorite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mayette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2749969/"
                }
            }
        ]
    }
]