[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/51827/chicken-with-tomatillos-and-poblanos/",
        "name": "Chicken with Tomatillos and Poblanos",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F10489.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2020-02-01T07:50:29.000Z",
        "description": "A spicy chicken dish with a tomatillo sauce, best served over rice and accompanied with beans (black, red, or pinto are probably best). To increase the heat of the dish, you can always add more chiles - perhaps a serrano pepper.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "3 fresh poblano chile peppers",
            "3 Anaheim chile peppers",
            "¾ pound tomatillos, diced",
            "1 onion, chopped",
            "⅔ cup red bell pepper, diced",
            "4 green onions, chopped",
            "6 cloves garlic, minced",
            "1 cup chicken broth",
            "3 tablespoons vegetable oil",
            "4 skinless, boneless chicken breast halves - cut into 2 inch pieces",
            "¼ cup all-purpose flour",
            "1 tablespoon dried oregano",
            "½ teaspoon salt",
            "1 pinch black pepper",
            "1 pinch cayenne pepper",
            "⅔ cup fresh cilantro, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C). Roast peppers for about 25 minutes, until the skins can easily be removed. Remove skins, and chop peppers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, combine chopped peppers with tomatillos, onion, red pepper, green onion, and garlic. Stir in chicken broth. Heat to a boil, reduce heat, and simmer 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium heat. Dredge chicken in flour, then saute briefly. Pour tomatillo mixture over chicken. Season with oregano, salt, black pepper, and cayenne pepper. Simmer for 25 minutes, or until chicken is no longer pink. Stir in the cilantro just before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Suzanne"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3052631578947365,
            "ratingCount": 95,
            "itemReviewed": "Chicken with Tomatillos and Poblanos",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "333.6 calories",
            "carbohydrateContent": "23.6 g",
            "cholesterolContent": "68.4 mg",
            "fatContent": "13.2 g",
            "fiberContent": "5.7 g",
            "proteinContent": "31.5 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "384.2 mg",
            "sugarContent": "8.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-05-05T00:00:45.89Z",
                "reviewBody": "My oh my was this delicious! Simply perfect dish! Smells great looks pretty and tastes so good you'll thank yourself for making this! I used a variety of peppers poblano jalapeno and yellow and orange bell peppers. I almost took a short cut and was just going to chop and saute them but I'm so glad I adhered to the recipe and roasted them first which didn't require much more effort. The skins slipped off easily and I think roasting the peppers contributed depth of flavor. I didn't bother with the green onion as I found the regular onion sufficient. Once I combined the sauteed chicken with the pepper mixture I found that simmering that mixture 10-15 minutes was enough to cook the chicken. I believe 25 minutes would have made it overcooked and quite probably dry and chewy. Half the amount of cilantro was perfect for hubs and me but that is a matter of personal taste buds. For added richness I swirled in a little butter at the end. I served this over white rice with a side of \"Black Beans with Bacon \" also from this site. I am really surprised that as I write this only 17 other people have reviewed it. I hope this review will encourage more cooks to give this recipe a try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-01T21:47:44.31Z",
                "reviewBody": "I made this when I got tomatilloes in my CSA (farm delivery) box and didn't know what to do with them.  A great, tasty supper dish!  I did add a serrano pepper as suggested, for extra kick.  It was tangy and flavorful, the flour coating helped the chicken to retain just a bit of crispness as well as giving the sauce body.  I served this with black beans and cornbread.  Yum!  A keeper.  \n\nFor the peppers: Put charred peppers into a Ziploc and close, allow to cool, and then peel off the skins.  This steams the peppers and allows the skins to come off more easily.  The oven roasting was great, though if you have a gas stove you can also char them directly on the burner.  The roasting adds nice depth to the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gina_CA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1843962/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-31T00:27:50.98Z",
                "reviewBody": "5 stars if eaten with black beans & bacon (from this site) and rice...as suggested by Naples. What a hit it is when those two are combined with this recipe!! Leftovers were fabulous - and then I added some to Cottage Cheese Chicken Enchiladas and it REALLY enhanced the yum-factor of that recipe! Overall a satisifying concoction that really complements other recipes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FNChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fnchef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-01T18:46:32.23Z",
                "reviewBody": "This was excellent and the smell of the peppers roasting was heavenly. Do not skip this step! I did have problem getting the skin off of the Anaheims even after placing them in the freezer so I gave up and ended up chopping them up skin and all but I didn't notice it in the finished dish. I served it up in corn tortillas and 5 stars all the way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Soup Loving Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/souplovingnicole/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-02T02:10:21.06Z",
                "reviewBody": "This is very good! I forgot to make the black beans I wanted - I'll have to remember them next time! My husband and kids don't like them anyway! I do think it'd give this dish the \"fill\" it needs. I used two very large poblanos and added two serrano peppers. I also seasoned the flour with white pepper and jalapeno powder. I think I may add more broth next time and serve it over rice. As it stands there wouldn't have been enough juice to flavor up the rice. I roasted the peppers and heated the sauce the night before to allow the flavors to blend better. I was cooking stuff on the stovetop anyway so keeping an eye on the peppers was easy. I think 25 minutes is too long to roast them as they were quite cooked when done. Next time I'll use my own method of oiling them up and roasting them on the proprane grill. I also added a splash of fresh-squeezed lime juice before serving also. Very good - thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JulieCC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/juliecc/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-29T16:39:45.617Z",
                "reviewBody": "I added 2 jalapenos to this dish - one was roasted and the other was sauteed. I also used more chicken broth than the recipe called for so we'd have more sauce. Loved how it tasted sweet at first and then the heat came out and rounded out the flavors - definitely add jalapenos to give this recipe some life.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Maryellen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2130799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-27T01:17:47.157Z",
                "reviewBody": "Thanks for submitting this recipe Suzanne! I made it for dinner last night and my husband loved it! He couldn't stop raving about how great it turned out. I did make a few modifications. I added some additional chicken broth it to give it enough juice to simmer in. I also added some lime to add some additional flavor. I will definitely be adding this to my recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TINAMARIE1971",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1162650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T09:43:10.14Z",
                "reviewBody": "Sorry we didn't care for the tomatillos. It was the first time I have ever used them and was very disappointed with the flavor. Don't know what I expected but will never use again. Also when I roasted the peppers some were just too thin to peel so I lost all the pepper. Luckily there were extra to add. Will never make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Flo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/744989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-15T14:08:55.28Z",
                "reviewBody": "I will definitely be making this one again! I don't know if my produce was \"larger\" than intended in the recipe but I needed almost double the chicken broth and a LARGE saucepan. Note to those who have not charred and removed skins from peppers before...allow extra time - as it's not easy (I found out the hard way) but it is definitely worth the effort to get at least SOME of the skins off. (Plus the roasted peppers add an extra dimension to the dish)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOCUSED ON FOOD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/565235/"
                }
            }
        ]
    }
]