[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/235/world-cuisine/middle-eastern/",
                    "name": "Middle Eastern",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1825/world-cuisine/middle-eastern/turkish/",
                    "name": "Turkish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69274/turkish-fish-stew/",
        "name": "Turkish Fish Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F216234.jpg",
            "width": 2348,
            "height": 2348
        },
        "datePublished": "2020-02-01T07:50:34.000Z",
        "description": "A non-traditional variant of Turkish fish stew that blends various other Mediterranean influences.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "3 cups water",
            "1 ½ cups dry couscous",
            "2 tablespoons olive oil",
            "1 small white onion, chopped",
            "1 green bell pepper, chopped",
            "2 cloves garlic, minced",
            "1 cup marinated artichoke hearts, liquid reserved",
            "2 teaspoons capers, liquid reserved",
            "12 small green olives",
            "1 (14.5 ounce) can chopped stewed tomatoes, drained",
            "2 tablespoons white wine",
            "1 tablespoon lemon juice",
            "1 cup water",
            "2 teaspoons sumac powder",
            "1 ½ teaspoons crushed red pepper flakes",
            "1 teaspoon dried basil",
            "1 teaspoon cumin",
            "1 teaspoon minced fresh ginger root",
            "ground black pepper to taste",
            "1 pound tilapia fillets, cut into chunks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, bring 3 cups water to a boil, and stir in the couscous. Remove from heat, cover, and let sit 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a skillet over medium heat, and saute the onion and green pepper about 5 minutes, until tender. Mix in the garlic, and continue to cook and stir about 2 minutes. Mix in the artichoke hearts with reserved liquid, capers with reserved liquid, and olives. Stir in the tomatoes, wine, lemon juice, and 1 cup water (or enough to attain desired thickness). Season with sumac powder, red pepper, basil, cumin, ginger, and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring the mixture to a boil, and mix in the fish chunks. Reduce heat, and simmer 10 minutes, or until the fish is easily flaked with a fork. Serve over couscous.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Middle Eastern",
            "Turkish"
        ],
        "recipeCuisine": [
            "Middle Eastern",
            "Turkish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Randall Shillman"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6125,
            "ratingCount": 80,
            "itemReviewed": "Turkish Fish Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "456.4 calories",
            "carbohydrateContent": "53.4 g",
            "cholesterolContent": "42 mg",
            "fatContent": "12.4 g",
            "fiberContent": "6.3 g",
            "proteinContent": "32.7 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "761.6 mg",
            "sugarContent": "5.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-22T18:34:22.16Z",
                "reviewBody": "This is an excellent recipe.  I unfortunately learned the hard way--the recipe calls for a LOT of couscous compared to how much sauce there is.  However, it's still pretty good this way.  Changes I made: Used more garlic, flounder instead of tilapia, diced fresh tomato, cayenne pepper (not too much) instead of red pepper, more red wine and less water.  In the future, I think I'll use even more garlic and cut out the ginger.  I like ginger, but I personally don't like it with these spices.  What I like about this is that the fish isn't the star of this dish--I think there's as much fish in here as vegetables; you could add more fish to this or cut it out completely and it would still taste good.  This seems like a good recipe to experiment with, change around, have fun with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SEKELSEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1218439/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-22T14:52:06.913Z",
                "reviewBody": "I made this last night with some substitutions for my wife and daughter. We all thought it was a great meal. My wife loved the spicy kick while my daughter thought it was too spicy.  She put some mild cheddar cheese on it to reduce the spiciness. It worked and she loved it. My wife put some \"Red Hot Chile Lime Hot Sauce\" on her serving. This added even more good flavor to the dish so I'd recommend that as well. \n\nSubstitutions:\n1) Marinated artichoke hearts with frozen artichoke hearts thawed in cold water. Chopped in food processor before adding to stew.\n2)2 tbls of wine with 1/2 cup of wine as recommended by other reviewer. Great idea!\n3)1 tsp of cumin with 1/2 tsp chili powder. We had no cumin but websites noted that chili powder has cumin as an ingredient and advised that we use half of the requested amount. \n\nOmitted:\n1) Green Olives - Didn't have any available but would have been omitted anyway due to high sodium content.\n2) Sumac Powder - This will be added to my grocery list so that I can experience how this powder actually impacts the dish.\n\nIf you have kids, I would recommend reducing the red pepper flakes to 1/2 tsp instead of the 1 1/2 requested or just omit. You would then be able to put the amount of flakes you desire on your own serving without having to worry about the spiciness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Samuel Morgan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1313790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-26T16:53:49.173Z",
                "reviewBody": "Wonderful, tasty dish that's easy and quick to make.And it's great as leftovers! I followed others' recommendations and made just a few changes.  First, unless you can handle a whole lot of heat, I would strongly advise cutting the crushed red pepper down significantly.  I cut it from 1 1/2 tsp to 1/2 tsp, and it was still pretty intense so I now reduce to 1/4 tsp and leave crushed red pepper on the table for others to use if they'd like more heat.  Usually no one adds any.  Second, add more wine, if it's available.  Third, throw in a handful of golden raisins at the end. Fourth, reduce the couscous by half to keep a reasonable ratio of couscous to stew. Fifth, use veggie stock instead of water in both the couscous and the stew.  Sixth, for fish, I have had success with various flaky white fish: tilapia, perch, cod, haddock, and flounder.   I have no preference; I simply choose what is fresh and wild caught.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AlliePeacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alliepeacock/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-21T12:19:15.2Z",
                "reviewBody": "Wanted to make it again the next day. Can't get tilapia in Japan so had to substitute cod. 2 tbsp of wine?! No point in opening a bottle for that so I probably put in a good 1/2 cup plus! Made excellent lunch the next day too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "concretejungleprincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/347271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-19T13:08:44.49Z",
                "reviewBody": "I was surprised at how much I liked this. I only added 1 t. of pepper flakes which made the heat tolerable. I didn't have stewed tomatoes so I just used diced and they were fine. Also I had a bag of pollock in my freezer and it was really good so I figured I saved myself about five dollars on this dish. I would probably halve the amount of couscous next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Meece",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1077147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-28T23:54:26.84Z",
                "reviewBody": "This recipe is a definite keeper! My husband always cooks on Sunday and found this recipe. It is two thumbs up. Could not find sumac powder so it was ommited. Will definitely make this again. Great taste and just the right seasonings to give it a zip",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURA K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/889916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-28T18:42:42.97Z",
                "reviewBody": "I didn't have sumac and substituted the following: rice for the couscous and chicken broth for the water. It was a delightful dish and I'm sure had I had the proper ingredients on hand it would have been absolutely outstanding. It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Polly Rinas Janos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1345576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-07T18:04:56.413Z",
                "reviewBody": "Excellent. As a Northwest native I'm not overly fond of tilapia and other freshwater fish (though it does hold up beautifully to this tpe of cooking) but I bought a whole bunch of it on sale so I was looking for a recipe to use it in that might make it more appealing to me. This one works. I had a hard time finding sumac so I gave up looking. I read on the internet that while there is no really good sub for sumac lemon pepper would be an acceptable exchange with paprika for color so that's what I did. I followed the rest of the stew instructions except I doubled the artichokes and used red bell pepper along with the green. When finished the broth was delicious but a little too sharp for me so I smoothed it out with some chicken broth. I made boxed garlic and olive oil couscous as the accompaniment. Thanks for the recipe - I'd also like to try it using cod or halibut.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-18T16:14:04.643Z",
                "reviewBody": "This was fantastic. The taste is completely unique. It needs to be recipe of the day so more people can try it. I didn't have ginger or sumac on hand so I'm not sure what those add. Personally I would cut down on the lemon juice or not include it at all. Otherwise excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2970430/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-01T17:38:16.967Z",
                "reviewBody": "The capers and the artichoke hearts are what made this not to my liking. Mainly the taste of the capers though. I wasted so much time on this for a meal that was not to my liking. My dad thought it was ok so did my mother they said that but nobody was begging for more either. Also they thought it was too much heat with the red pepper flakes but I didn't mind it. When you're dealing with fish and making stews and things out of it the balance of the taste has to be perfect and I the funny thing is I actually thought the strong flavors balanced one another I just didn't like them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sammi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5373469/"
                }
            }
        ]
    }
]