[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
                    "name": "Beans and Peas",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/75633/kikis-borracho-drunken-beans/",
        "name": "Kiki's Borracho (Drunken) Beans",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F522333.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2020-02-01T07:50:37.000Z",
        "description": "Growing up, my Mexican grandmother always had a pot of beans cooking on the stove.  I often cook these beans (a 'drunken' version) for my family, and the aroma keeps her close to my soul, even years after she has past. I hope your family enjoys them as much as mine.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound dried pinto beans, washed",
            "2 quarts chicken stock",
            "1 tablespoon salt",
            "½ tablespoon ground black pepper",
            "1 (12 fluid ounce) can or bottle dark beer",
            "2 (14.5 ounce) cans chopped stewed tomatoes",
            "1 white onion, diced",
            "¼ cup pickled jalapeno peppers",
            "6 cloves garlic, chopped",
            "3 bay leaves",
            "1 ½ tablespoons dried oregano",
            "1 ½ cups chopped fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak beans in a large pot of water overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain beans, and refill the pot with chicken stock and enough water to cover the beans with 2 inches of liquid. Season with salt and pepper. Cover, and bring to a boil. Reduce heat to medium-low, cover, and cook for 1 1/2 hours. Stir the beans occasionally through out the entire cooking process to make sure they do not burn or stick to the bottom of the pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir beer, tomatoes, onion, jalapeno peppers, garlic, bay leaves, oregano, and cilantro into the beans. Continue to cook uncovered for 1 hour, or until beans are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a potato masher, crush the beans slightly to thicken the bean liquid. Adjust the seasonings with salt and pepper to taste.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Beans and Peas"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KIKI810"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.568075117370892,
            "ratingCount": 213,
            "itemReviewed": "Kiki's Borracho (Drunken) Beans",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "181 calories",
            "carbohydrateContent": "31.8 g",
            "cholesterolContent": "0.5 mg",
            "fatContent": "1 g",
            "fiberContent": "7.7 g",
            "proteinContent": "9.6 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "1073.5 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-05T20:23:03.137Z",
                "reviewBody": "Wowzer!! This recipe will knock your socks off! \n\nI've been looking for a recipe that re-creates the delicious Tex-Mex borracho beans I find in South Tx restaurants. Eureka! I've found it.\n\nThe only changes I made to this recipe were cooking in a crockpot all day, and using one minced fresh jalapeno instead of pickled jalapeno. I soaked the beans overnight, then placed all ingredients in crockpot early in the morning and cooked all day. Fabulous! Mouth-watering aroma and rich, full flavor. Oh, and I also used a little fresh oregano from my garden instead of dried.\n\nThis recipe was very hot and spicy using one jalapeno. My family likes spicy food so it was great for us, but if you prefer milder flavors you might want to leave out or reduce the jalapeno.\n\nAbsolutely wonderful. Thanks, Kiki!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1575547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-16T01:11:50.53Z",
                "reviewBody": "Fabulous flavor! I did not soak my beans and they cooked in approx. the given time. Beans that are old will take much longer to cook. If you don't live in a \"bean eat'n state\" like Texas, try to get your beans at a local Mexican grocery where you KNOW the stock will be freshest. Also, if you need to add water while the beans are cooking, make sure to add BOILING water. It's not going to help the cooking time to add cold water and drop the cooking temperature!  I always have a tea kettle of hot water going on the range when I cook ANY beans. I used Pacifico beer (a beer similar to Corona) because that's what was in the fridge. In fact, that's what's ALWAYS in the fridge! hahaha. (Make sure to bring the beans back up to a boil quickly when you add the beer, tomatoes, etc. and then drop the pot back down to a simmer.) My only modification was a large jalepeno, diced and a about 4 tablespoons of Goya Liquid Sazon (If you read most of my reviews you'll find that Sazon finds it's way into most everything!)If you can't find the liquid Sazon, most large grocery chains sell the packets... try it out! (I usually use one packet per cup of dry beans in a recipe.) I'm going to serve it over cooked, crumbled chorizo and top it with queso asadero and put it under the broiler until the cheese is melted.  Just scoop it up with some tostaditas and you have a meal..or an appetizer! Thanks, Kiki for a great recipe.... your abuela is smiling!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Hintz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1827547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-01T22:35:04.717Z",
                "reviewBody": "WOW. IF I COULD RATE THIS A 10 I WOULD. I AGREE WITH ALL THE OTHER RATERS. THIS IS A GREAT DISH.I LIVE IN THE SOUTH (BIRMINGHAM) AND NEEDED SOMETHING THAT WAS NOT MADE WITH SALT PORK OR HAM FEET OR WHATEVER. DID NOT HAVE BEER TOO. BUT I DON'T THINK YOU WOULD KNOW THE DIFFERENCE. I DID HALF THE AMOUNT OF PEPPERS. AND ONLY HAD HALF OF THE CILENTRO. BUT TURNED OUT WONDERFUL. AND PUT A GREAT SMELL THRU THE HOUSE ALL DAY. WILL MAKE THESE BEANS AGAIN AND AGAIN. THANKS FOR THE RECIPE. I HOPE YOU HAVE MORE RECIPES LIKE THIS TO OFFER.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NINA L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/690777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-04T18:34:31.513Z",
                "reviewBody": "I've made this twice and I have made 2 changes to suit my tastes. I used 2 fresh jalapenos seeded and chopped and I didn't care for the flavor of the dark beer last time so this time I used a Corona. Served with smoked beef brisket oven fried red potatoes rolls & fruit salad. A Labor Day feast. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/290358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-27T12:16:25.937Z",
                "reviewBody": "Delicious!! Had no beer, but was still great without it. I fixed this the day after Christmas and added a leftover ham bone. The red and green from the tomatoes and fresh cilantro gave this dish a festive look. Don't cut back on the garlic. Six cloves seems extreme but this dish can handle it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CWENGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/878227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-06T18:42:17.09Z",
                "reviewBody": "I'm sorry but I really was disappointed in this. It wasn't as flavorful as I had hoped it would be and even though I cooked the recommended time (and then longer) it still had a strong beer taste. I'm sure the alcohol cooked out but I did not like the flavor it left. Not the worst but really just not that good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. T.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/997736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-29T16:03:10.607Z",
                "reviewBody": "I've just moved to Texas, and all my neighbors make great pinto beans.  This was a good starting place.  I added a hambone to the dried beans.  When they were almost done, I added some sauted kielbasa with the vegies and seasonings. I added the cilantro closer to the end.  The cilantro is essential!  These were almost up to my neighbor's standards!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SweetBasil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-21T16:38:38.653Z",
                "reviewBody": "I needed a crockpot full of beans for a last minute family gathering so I made the following modifications which turned out excellent. I look forward to trying the recipe as is and anticipate a similarly wonderful result! I used a 6-lb can of pinto beans, drained and rinsed (this about filled my crockpot). I added one can condensed chicken broth plus 1 can water in place of the 2 quarts chicken stock and half of a 24-oz Dos Equis beer. I added the remaining ingredients as listed and let the whole thing cook on low for about 5 hours. I pureed about 2 cups of the beans in the blender and added them back to the crockpot to thicken the mixture. They were excellent served over brown rice or with cornbread. Nobody missed the meat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "passion8chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5548525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-11T04:34:03.687Z",
                "reviewBody": "These were awesome and easy to make. I used canned beans and added green onions (in addition to the white onions). YUM!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Terry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1603216/"
                }
            }
        ]
    }
]