[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/172627/spicy-southwest-chopped-salad-with-salsa-verde/",
        "name": "Spicy Southwest Chopped Salad with Salsa Verde",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F633549.jpg",
            "width": 1524,
            "height": 1524
        },
        "datePublished": "2020-02-01T07:50:58.000Z",
        "description": "This is by far the best summer salad I have ever made! You can adjust the amount of spice, depending on your preference by adding more or less jalapeno and Cajun seasoning. The salsa verde makes a big enough batch that you can have more for dipping chips later. It is a great low-fat, all-in-one meal. This dish can also be topped with crushed tortilla chips, if desired.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "4 salads",
        "recipeIngredient": [
            "2 ears corn",
            "1 pound tomatillos, husked",
            "½ bunch fresh cilantro leaves",
            "½ jalapeno chile pepper, chopped",
            "¼ large white onion, chopped",
            "1 clove garlic, chopped",
            "salt, to taste",
            "4 teaspoons lime juice",
            "1 avocado - peeled, pitted and diced",
            "1 teaspoon lime juice",
            "¼ medium head red cabbage, chopped",
            "1 (14.5 ounce) can black beans, rinsed and drained",
            "1 red bell pepper, chopped",
            "1 pound skinless, boneless chicken breast halves",
            "2 teaspoons Cajun seasoning, or to taste",
            "1 head green leaf lettuce",
            "1 cup crumbled cotija cheese",
            "1 lime, cut into wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with water and bring to a rolling boil; add the corn and boil 15 to 20 minutes. Remove the corn and allow to cool until cool enough to handle. Cut the corn off of the cob and place into a large mixing bowl; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the tomatillos, cilantro, jalapeno, onion, garlic, salt, and 4 teaspoons of lime juice into a blender. Pulse until the vegetables have been finely chopped; set aside. Toss the avocado with 1 teaspoon of lime juice and mix with the corn, cabbage, black beans, and bell pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for medium-high heat and lightly oil the grate. Season the chicken breasts with Cajun seasoning.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the chicken breasts on the preheated grill until no longer pink in the center and the juices run clear, about 6 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Set the breasts aside until cool enough to handle; cut into bite sized pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the lettuce leaves onto 4 plates. Mound the avocado mixture on top of the lettuce, followed by the chicken. Sprinkle with cotija cheese and garnish with lime wedges to serve.\n"
            }
        ],
        "recipeCategory": [
            "Salad"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jenny from WA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.478260869565218,
            "ratingCount": 23,
            "itemReviewed": "Spicy Southwest Chopped Salad with Salsa Verde",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "550.4 calories",
            "carbohydrateContent": "50 g",
            "cholesterolContent": "99.3 mg",
            "fatContent": "22.4 g",
            "fiberContent": "17.5 g",
            "proteinContent": "43 g",
            "saturatedFatContent": "8.5 g",
            "servingSize": null,
            "sodiumContent": "1112.4 mg",
            "sugarContent": "10.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-08-24T22:14:17.037Z",
                "reviewBody": "LOVED this salad! Made it just as described. The flavors are perfect. Left out the cotija couldn't find it at my store. My husband wants me to make the salsa all of the time now!! 2nd Review..just made this salad with ground beef...wow! So yummy this time added the cotija cheese and went to heaven. Can't wait for the lefties....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIADAMIANI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1160216/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-10T19:15:37.43Z",
                "reviewBody": "This is delicious and I could tell just by looking at it that it's a nutritionist's dream. For my comments/suggestions: I used Queso Fresco instead of Cotija because it's much cheaper (less than half the cost). Also I seasoned the chicken with salt pepper and chile powder and I was quite happy with that in place of the cajun seasoning. I had one serving without avocado and I would say that is a must for the recipe. And lastly I would actually suggest skipping the lettuce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cheeziekt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2732845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-27T19:25:06.617Z",
                "reviewBody": "This salad was delicious! I used raw corn omitted the chicken and the beans and tossed the veggies with the salsa verde (which is what I'm assuming you're supposed to do but the directions leave you hanging). Great flavor nice texture and very pretty--good for a party. If you've never had cotija it's a very dry mild salty cheese; it reminds me of cheese curd. If you can find it use it (but I wouldn't sub anything else)--it really adds to this salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kym Cox Surridge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T17:09:50.233Z",
                "reviewBody": "Yum! Loved it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dabergmans",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2475706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-24T19:28:55.527Z",
                "reviewBody": "Excellent flavor although labor intensive. Worth it though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/156569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-09T02:26:33.59Z",
                "reviewBody": "Made this for Recipe Group: 30 April '11. My family really enjoyed this salad. It is a little time consuming to put together but worth it. I realized as I'm typing this review that we forgot to put the cheese on it. The dressing on this salad is the best part in my opinion. I will most certainly make the dressing again. The lime flavor is a very nice compliment to this salad. Thanks Jenny for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-01T11:50:28.547Z",
                "reviewBody": "Overall a good salad that I will make again for sure but lacked the wow factor that would have made it 5 star. This only took me an hour to prepare. I made the corn in the microwave and wish I had actually grilled it. I also didn't have red peppers so used green and added a little tomato garnish for color. The salsa was very good and had a different texture(which we liked) than most other verde recipes I've tried. The instructions didn't really say what to do with the salsa so I used it as dressing. I think I would prefer mixing some with the avocado mixture to \"disperse\" it better as it's rather thick and doesn't really pour. I like a little taste in every bite and the overall dish was a little \"dry\" served as it was. Without the lettuce it would make a pretty good summer side dish that would hold up well. Thanks Jenny (and the Recipe Group)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "linda2d",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3733363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-03T20:02:09.137Z",
                "reviewBody": "Made this for Recipe Group. I prepped everything and then put the avocado mix on some Boston lettuce leaves adding the salsa verde on top (as stated it doesn t say what you are supposed to do with it) Queso Fresco on top of that chicken on the sides and garnished with lime wedges. The cilantro overpowered the salsa for me I don t care much for it anyway. The salad as a whole seemed to be just dry raw veggies with chicken. If the salsa is supposed to be mixed in with the avocado mix that may account for the dryness part. Although I did mix it all together before eating. I didn t care too much for it and added in some Catalina dressing. A nice southwest dressing would go wonderful here. Hubby liked it and added more of the salsa to his. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-04T15:00:51.297Z",
                "reviewBody": "This was an interesting salad. It was chosen by the \"recipe group\" on AR for the Cinco De Mayo theme. It had a lot of ingredients! And it also made it a little pricey to buy them all. I decided to make the dressing one day and the rest of the salad another day. I followed the recipe exactly except I broiled the chicken breast used queso fresco and 3/4 cup of cooked frozen corn to save a little time. I also had to use iceburg lettuce because the leaf lettuce I bought seemed like it had turned even though I had just purchased it. I loved the salsa verde and will use that again in other recipes or as a chip dip. Now that I have the cajun spice I might make more broiled chicken with it for an alfredo or other recipe. But making all these components for one salad was a bit much to me. It was tasty it just seemed like a few separate recipes combined to make one that are great on their own. I would also not consider this to be a good representation of Cinco de May though as it is not a classic dish although that has nothing to do with the recipe. I do think this salad would be perfect for a January diet resolution though as it is loaded with nutrients and fiber!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-03-27T07:07:15.23Z",
                "reviewBody": "It was good (but not awesome) and healthy but it was just... meh.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9651830/"
                }
            }
        ]
    }
]