[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/180/soups-stews-and-chili/soup/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215828/annies-lobster-bisque/",
        "name": "Annie's Lobster Bisque",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F483724.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-02-01T07:51:08.000Z",
        "description": "I've been trying for over a year to recreate a lobster bisque my son loved at a restaurant we went to in Maine, and I believe this is it!  Creamy texture with kind of a tanginess and a bit of a bite and lots of tender lobster bits.  And the nice thing about this recipe is that is actually quite nutrition-friendly.  High protein, but low fat using lower fat options for the ingredients (1 or 2% milk, fat free broth) and still tastes like you should feel guilty. Don't let the number of ingredients deter you, it's actually very easy to throw together.  Note about the cayenne pepper, a small increase or decrease makes a big difference in the amount of bite!  Start with the 1/4 teaspoon and go up to taste.  Serve with a salad and/or a crusty Italian or French bread.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 tablespoons olive oil",
            "1 white onion, chopped",
            "½ cup dry white wine",
            "½ cup cooking sherry",
            "5 tablespoons all-purpose flour",
            "½ (6 ounce) can tomato paste",
            "1 ½ cups chicken broth",
            "5 cups milk",
            "¼ teaspoon cayenne pepper, or to taste",
            "⅛ teaspoon ground black pepper",
            "½ teaspoon seafood seasoning (such as Old Bay®)",
            "2 tablespoons Worcestershire sauce",
            "1 green onion, finely chopped",
            "1 ½ cups cooked lobster claw, cut into bite-sized pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large saucepan over medium heat. Stir in the chopped onion, and cook until the onion has softened and turned translucent, about 5 minutes. Stir in the white wine and sherry. Cook and stir until the liquid has reduced by half. Sprinkle in the flour while stirring to ensure there are no lumps. Once a thick paste has formed, stir in the tomato paste, then pour in the chicken broth and milk. Season with cayenne pepper, black pepper, seafood seasoning, Worcestershire sauce, and green onion.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook and stir over medium heat until the bisque begins to simmer, about 15 minutes. Stir in the lobster meat, and reheat before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Seafood"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Annie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.333333333333333,
            "ratingCount": 51,
            "itemReviewed": "Annie's Lobster Bisque",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "281.1 calories",
            "carbohydrateContent": "24.3 g",
            "cholesterolContent": "42.4 mg",
            "fatContent": "11.1 g",
            "fiberContent": "1.2 g",
            "proteinContent": "15.7 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "552.6 mg",
            "sugarContent": "13 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-11T20:24:48.073Z",
                "reviewBody": "This was awesome!  Not difficult to make and absolutely delicious.  Honestly, I have never had better seafood bisque than this one.  I made a few very slight changes, but I seriously doubt they made much difference.  Instead of all lobster, I used one lobster tail, several very large scallops cut into fourths, and about 4 very large shrimp, chopped.  I used 2 ½ cups fat free milk and 2 ½ cups half and half, and I used a nice drinking sherry, not cooking sherry.  The seafood and milk changes were simply because that is what I had on hand.  But, I never use cooking sherry, as it is so salty.  As it turned out, I did have to add some salt to the bisque, but at least I was able to control it.  So after all, the cooking sherry might work fine.  I served the bisque with a simple green salad and crusty bread.  My husband commented that it was wonderful, and wants me to make it for company soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KerryElizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/888986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-07T19:11:24.71Z",
                "reviewBody": "Fate was against me as I made this recipe - my grocery had no lobster I got crab legs instead and they were bad! So I ended up with two cans of chunk crab meat - and it was still great! A lovely heart-warming recipe...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "frostys_mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3155107/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-15T18:18:33.503Z",
                "reviewBody": "This soup is delicious. I had scallops I had to use - so I guess I would call my version \"Scallops Bisgue\". The scallops were very large so I cut them in quarters. I used 2% milk - and it was fine. I also added 4 cloves of minced garlic. I didn't pay attention to the comment about the cayenne pepper - \"add to taste\". I just put it all in and wow - yes gives it a lot of kick - so be careful! It was actually very good though! I didn't have scallions - so I just did without but I think the scallions would have made it that much better. SO I will be making again and again and next will try with Lobster. BUT any seafood would be delicious. Its such a great base for a seafood bisque. Thanks for such wonderful recipe! UPDATE: made this again and this time used scallops and canned crabmeat. Forgot about the kick of the cayenne pepper and added it all. Next time I think I will leave the pepper out as 2 family members wouldn't eat it because of the spice. I figure you can add cayenne to your own taste but once its in there - its in there - so better off leaving out. This time I also tried with 4 Cups of Fat Free Milk and 1 Cup of half and half and didn't even notice that it was lower in fat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gobbledog",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2451421/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-07T20:54:04.18Z",
                "reviewBody": "I read all the recipes available here and this one sounded the best. Needless to say it did not disappoint!!! I actually was going to make it with just lobster shells (add to the simmering onions and let sit with the reduction until bright red) but tails were so cheap at 5.99 a piece I bought two and got more than enough for serious lobster flavor. First of all I sauteed with butter instead of olive oil I love butter and use it whenever I can. I used shallots instead of green onion and added minced garlic and white pepper in addition to the suggested spices. It turned out wonderfully and I served it to my family first; my father who doesn't care for lobster ate 3 bowls. I served the bisque in toasted sourdough rounds (breadbowls). I will absolutely make this again next time with crab I think!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jujubeezbaking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4246817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T18:18:28.763Z",
                "reviewBody": "This recipe is amazing! I did alter it a bit...added carrots and celery...and instead of all milk I used equal parts heavy cream and milk. I made this recipe for 20. We used 5 large broiled lobster tails instead of claws....asparagus and cheddar garlic drop biscuits to complete our Christmas Eve brunch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thekirkendalls0804",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5735232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-08T14:38:50.303Z",
                "reviewBody": "Wonderful Bisque! I have made this recipe several times. Followed directions exactly came out perfect and have varied a little and came out perfect. Some of my variations: I used fish stock once instead of Chicken both butter instead of olive oil and used shrimp and crab meat instead of lobster. I have a pot of this on my stove as I type:) Thank you so much for the wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2093065/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-09T15:28:01.98Z",
                "reviewBody": "i had to tweak this recipe a lot but i still found that i didn't achieve the taste i was going for. i used lobster broth instead of chicken stock but still found it to be slightly bland and a little too milky. i'm still searching for the perfect lobster bisque after trying this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "aspiringepicurista",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7095857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T22:42:42.123Z",
                "reviewBody": "this is a great recipe I used shallots instead of the onions and added half and half instead of the milk. I had lobster and wanted to try a good recipe. This was very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Hamilton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3313038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-29T00:06:16.473Z",
                "reviewBody": "We liked this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "korich1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4830976/"
                }
            }
        ]
    }
]