[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
                    "name": "Rice Side Dish Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229602/authentic-new-orleans-red-beans-and-rice/",
        "name": "Authentic New Orleans Red Beans and Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2397374.jpg",
            "width": 1802,
            "height": 2775
        },
        "datePublished": "2020-02-01T07:51:20.000Z",
        "description": "Just like mom makes. I recommend cooking the day before you want to eat it. It is a time-consuming recipe and the taste gets even better after 24 hours in the refrigerator. For extra spice, add a splash of hot sauce.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT5H10M",
        "totalTime": "P0DT5H30M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 tablespoon shortening, or as needed",
            "1 white onion, chopped",
            "3 cloves garlic, chopped",
            "1 green bell pepper, chopped",
            "8 cups water",
            "1 pound dried red beans",
            "1 smoked ham hock",
            "1 pound smoked sausage, cut into bite-sized pieces",
            "2 stalks celery, chopped",
            "2 bay leaves",
            "1 tablespoon Creole seasoning (such as Tony Chachere's®)",
            "½ teaspoon dried thyme",
            "½ teaspoon dried sage",
            "1 dash hot pepper sauce (such as Tabasco®), or to taste",
            "3 cups cooked white rice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt shortening in a skillet over medium heat. Cook and stir onion, garlic, and bell pepper in hot shortening until tender, 5 to 7 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine water, red beans, and ham hock in a large pot; bring to a boil. Stir onion mixture into the water; add smoked sausage and celery to the boiling water; return to a boil. Stir bay leaves, Creole seasoning, thyme, and sage into the boiling water. Reduce heat to low, place a cover on the pot, and simmer until the beans are tender, about 5 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove and discard ham hock and bay leaves; stir in hot pepper sauce and serve over white rice.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Rice Side Dish Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Matt"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8023255813953485,
            "ratingCount": 172,
            "itemReviewed": "Authentic New Orleans Red Beans and Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "465.1 calories",
            "carbohydrateContent": "44.1 g",
            "cholesterolContent": "44.5 mg",
            "fatContent": "20.5 g",
            "fiberContent": "12.1 g",
            "proteinContent": "25.9 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "861.3 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-08-08T15:16:22.753Z",
                "reviewBody": "Not sure if I can review my own recipe....it is OK to cut the cooking time to 3.5 or 4 hours as someone else suggested.  Also, if you can find authentic tasso (can be ordered on the internet if you search for it), it makes a great substitution for the ham hock.  If you use tasso, you need to cut back or eliminate the creole seasoning since tasso provides a lot of heat along with flavor.  Andouille is a good substitute for smoked sausage as someone suggested, but again you may need to cut back on the creole seasoning depending on how much spice is in the sausage.  Celery is really optional, I often don't use it.\n\nFinally, someone commented on it being too soupy.  Cutting the water back by a cup is OK, but if you cook it the full 5 hours it gets a little thicker.  In addition, I recommend using high quality medium grain sticky rice (the Japanese rice often used for sushi).  New Orleanians typically use long grain rice, but the sticky rice is delicious and gives it a much thicker, non soupy, texture.  Sticky rice gives it a delectable porridge-like consistency.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Matt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8250813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-06T23:48:57.62Z",
                "reviewBody": "I liked seasoning mix -- extremely close to what I currently use -- but I put the hot sauce on the table.  Three suggestions:\n1)The beans need to be soaked overnight to be thoroughly hydrated and cleaned - drain and refill the water after soaking.\n2)Add the ham hock and cook for about 3 hours before adding the veggies and prefried/drained sausage. \n3)While sauteing the veggies add a couple of large spoons of beans and mash into the veggie mixture. This flavors and slightly thickens the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Poirot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3698043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-27T19:20:40.323Z",
                "reviewBody": "I loved this dish! Made as written except for the ham hock and sausage. I had a very meaty smoked ham bone in the freezer so I threw that in the bean pot. A bowl of coleslaw and a skillet of cornbread and, ah, my. A supper fit for a king!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4181033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-27T15:23:03.247Z",
                "reviewBody": "Delicious!\nI've made this recipe a handful of times now and it keeps on tasting better.  \nI used bacon fat for the shortening and cooked the red beans using the slow cooker after soaking overnight.  This last time, I cut back on the liquid to about seven cups.  Instead of water, I used chicken stock.\nWhen the beans are tender, I take about two cups of the beans, veggies, liquid (no meat) and run it through the food processor for a heartier, thickened texture.  I return the processed beans back to the crock pot until fully cooked.\nI serve the red beans with medium grain Calrose or short-grain Nishiki rice and cornbread on the side.\nPut a bottle of Tabasco on the table and hmmmmm!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lourdes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lourdes/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-14T04:12:40.4Z",
                "reviewBody": "This was easy to prep and throw in the crock pot.  I do recommend soaking the beans overnight:  I cooked in the slow cooker on high for about 4 hours.  I didn't have a ham hock but had andouille and used that.  I cut the Tony's to 1/2 tablespoon with the andouille.  My 4 yo and 3 yo old asked for seconds but all they could talk about was how spicy it was and I had to refill their waters about 3 times.  It was exactly the right amount of spicy for my husband and I.  If you are going to cook in the crock pot a good rule of thumb is to just cover the beans by about 1/4 inch because the amount of liquid you start with will generally be about what you end with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MaBarry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3714946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-24T21:34:08.4Z",
                "reviewBody": "Very tasty! I used the Creole Seasoning Blend for the spices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kateo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4111955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-10T23:17:30.937Z",
                "reviewBody": "This is a very tasty recipe. However I did make a couple of changes. I used chicken broth in the place of the water and after bringing everything to a boil on the stove I placed it all in the crock pot on the low setting. After 3 hours I did mash a good amount of the beans against the side of the pot to thicken it a bit. Next time I will reduce the broth to 6 cups because it was a little more soupy than I like. This is a keeper! Thanks Matt for a wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Damia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10116547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-17T23:16:04.41Z",
                "reviewBody": "IMHO, Good. The sausage needs to be added later in the process, because its a bit mushy after simmering for 5 hours. Also if you're going to bother adding a ham-hock for flavor and meat then I recommend 2 because there's not much meat on them. The recipe is a little soupy for my taste, recommend 7 cups of water. Had scratch cornbread as a side..perfect combo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Charles Stewart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12894654/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-02T17:47:28.247Z",
                "reviewBody": "I love this recipe. Very tasty. I made a few small changes. I used Andouille sausage, and per some reviewers, I added it at the end so it wouldn't get mushy. I cut it in 1/4 inch rounds and sauteed them until slightly browned. I used Johnsonville brand, which has only a slight spicy taste. I soaked beans overnight, and then cooked it in a slow cooker. I didn't want soupy beans, so I added only enough water to cover beans, 3 cups. I slow cooked 10 hours, and the consistency was perfect, slightly thick red juice. I really like the spices in this, but I tasted after 8 hours and I thought it needed more salt and spice, so I added a second dash of hot sauce and an extra 1/2 T Tony Chachere's seasoning - perfect. Great over white rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John Bills",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11659572/"
                }
            }
        ]
    }
]