[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16700/salsa-chicken/",
        "name": "Salsa Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4487510.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2000-01-04T19:11:12.000Z",
        "description": "Someone gave me this recipe a few years back and it's become a household favorite. You can use mild, medium or hot salsa depending on your taste. I usually serve it with Spanish rice and Mexican-style canned corn. Very easy and quick!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "4 teaspoons taco seasoning mix",
            "1 cup salsa",
            "1 cup shredded Cheddar cheese",
            "2 tablespoons sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken breasts in a lightly greased 9x13 inch baking dish. Sprinkle taco seasoning on both sides of chicken breasts, and pour salsa over all.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 375 degrees F (190 degrees C) for 25 to 35 minutes, or until chicken is tender and juicy and its juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle chicken evenly with cheese, and continue baking for an additional 3 to 5 minutes, or until cheese is melted and bubbly. Top with sour cream if desired, and serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Faye"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.627546689303905,
            "ratingCount": 4712,
            "itemReviewed": "Salsa Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "286.7 calories",
            "carbohydrateContent": "6.8 g",
            "cholesterolContent": "101.3 mg",
            "fatContent": "12.4 g",
            "fiberContent": "1 g",
            "proteinContent": "35.5 g",
            "saturatedFatContent": "7.3 g",
            "servingSize": null,
            "sodiumContent": "863.1 mg",
            "sugarContent": "2.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-07T00:38:10.967Z",
                "reviewBody": "Re-write of old review (again) - \nI've been making this dish since spring of 2002.  Instead of using salsa, I used 1 can of diced tomatoes with green chili (first time I made this, I was out of salsa so I substituted a can of RoTel..have been making it without the salsa ever since!).  I put the entire package of taco seasoning (low sodium variety) in a ziploc bag, and dredge the chicken breasts.  Next, I poured some of the liquid off the tomatoes into the bottom of an 8x8 glass baking dish (I did this instead of greasing). I then placed the chicken breasts in the dish, and added a little fresh cracked pepper, and topped them with the tomatoes, and a dash or two of chipotle tobasco sauce.  Bake in a 400f oven for 30-35 mins- or if you cook with Science...temp to 140...carryover heat will finish it off)  Remove from oven.  Sprinkle with cheese and place back in oven for 3 mins or till cheese has melted.  (here's where carryover comes into play...) After your cheese is melted, take it out of the oven and remove it from the baking dish.  Cover with foil and let it rest for about 10 minutes.  This lets all the juices reabsorb.  Top with a dab sour cream. I serve this usually with spanish rice, mexican style corn (for this type of corn in a jiff...add some red/black pepper flakes, a little mrs dash,and 2-3 dashes of tobasco sauce..the man will even sometimes top the corn with a dab of shredded cheese), and a salad. Thanks for a great recipe!! Definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill C ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/79shale97/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-05T09:18:31.407Z",
                "reviewBody": "ORIGINAL REVIEW: May 17, 2005. I was surprized to see this recipe roaming around on this site. I've been making this for years, ever since my husband and I first got together.\n\nSometimes, I will dredge the chicken in melted margerine/butter, then tortilla chips I've ground in the blender\nthat have been mixed with the taco seasoning. Then I'll use the sour cream/salsa as a dipping sauce, just to change things up.\n\nEither way, it's a favorite in this house. If you don't have time to make a side to go with this, serve it with Zatarains Spanish Rice with a can of drained black beans stirred in.\n\nEDITED: I make this now at least once a month. I now use my own homemade taco seasoning, green salsa sometimes, mexican cheese and reduced fat sour cream. It's good with pretty much anything, either wrapped up in tortillas or served with a side of steamed brown rice and sauteed onions and peppers. We love this dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-05T20:49:25.09Z",
                "reviewBody": "Very tasty and easy meal to make. I marinated the chicken with the package of taco seasoning and 2/3 cup of water so it would not come out so spicy. Worked great! Chicken did not dry out and the seasoning was just right!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joe Pluta",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/434997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-18T03:28:31.67Z",
                "reviewBody": "Excellent! I cooked this in the crockpot today. I put a very thin layer of salsa in the bottom of the crockpot. Then I took a package of \"Taco Time\" (the best) taco seasoning mix and put it into a plastic bag...put the chicken inside the bag to complete cover. I then took the chicken and put it on top of the salsa...covered the top of the chicken with a thin layer of salsa. Put the setting on low for about 6 hours...amazing. I didn't have time to melt the cheese on top but I'll be sure to do that next time. This turned out to be very moist...very kid friendly!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "itzjust_me",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/869537/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-03T21:40:13.583Z",
                "reviewBody": "Ok, I swear this is the last time I edit this review!!  I give this recipe 2-3 stars as written, & 5 stars made the way I prepare it.  I have made this many many times - the first time we did not care for it as I followed the recipe to a t - The chicken came out very bland.  With a few alterations on the recipe, I have come up with my husband's very favorite dish!  I toss the chicken in a ziploc bag with a packet of taco seasoning.  Then I pour a little salsa in the bottom of the casserole, add the coated chicken breasts, then pour over the rest of the salsa.  I cook it for about 35 minutes.  Then I remove it, and add some Mexican melting cheese & fresh chopped jalepenos, and cook for another 5 minutes.  It is sooooo good!  I have also found that a slice of pepperjack cheese tastes really good too, but there is something about that Mexican melting cheese & fresh diced jalapenos that leaves my hubby & I salivating!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsHappyHomemaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1227866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-12T23:24:39.6Z",
                "reviewBody": "Very easy and very quick, yet it tastes so good people will think you slaved for hours over this dish! I used \"Taco Seasoning I\" from this site for the taco seasoning and used Ortega's Medium chunky style salsa (a bit more than called for) and light Mexican blend cheese. After it comes out of the oven I pretty it up a bit by topping it off with some sliced black olives and thin sliced green onions.The chicken is tender, juicy and oh so good! It's perfect topped off with dollup of light sour cream and a side of Spanish rice - YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-07T18:22:00.96Z",
                "reviewBody": "Very Tasty!  I too used the mild taco seasoning and instead of shaking it in a bag I just eyeballed it and shook some on each side.  Used a slow cooker.  Put down a layer of El Pato Sauce then placed the chicken and topped it with a jar of mild Old El Paso Thick & Chunky.  Cooked it on low while I was at work (use the crock pot liners - they ROCK) and the house smelled wonderful when I came home.  The chicken breasts literally fell apart like a fine roast.  Served it with white rice and steamed \"Mexican veggie blend\" (white corn, black beans, peppers and onions).  The broth from the pot made a yummy topping for the rice.  Almost like a Taco Soup.  Very nice - husband requested it to be a regular at our house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMASPICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/704352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-08T04:19:45.557Z",
                "reviewBody": "The beauty of this dish is that it is so ridiculously simple, with such few ingredients, that I really don't see the point in messing with it. This is good, simple, quick, and easy. Tastes like enchiladas without the tortilla!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-19T20:49:34.75Z",
                "reviewBody": "My boys have loved this recipe for years, but I have done a slight variation, which they seem to enjoy even more.  Place 4 - 6 boneless chicken breasts in the crockpot, season with 1 pkt taco seasoning, cover with 8 oz salsa mixed with 1 can of crm. of chicken soup.  Cook 4 hours on high or 8 hours on low.  Take chicken out and shred with fork.  Place back in salsa mixture.  Serve over rice with shredded cheese & sour cream or even in tortillas... Yum!!  Update:  add can of drained black beans & corn.  Double Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pghalberts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7363019/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Salsa Chicken",
            "description": "Simple, savory baked chicken flavored with taco seasoning and salsa.",
            "uploadDate": "2013-12-26T19:11:25.915Z",
            "duration": "PT1M24.384S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F31cf016f-b6e0-4246-9cd9-187db8f864cd%2Fed48acd2-03d1-4366-ac22-b8ef4f5e3240%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2976482739001"
        }
    }
]