[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17874/main-dish/tacos/",
                    "name": "Taco Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17876/main-dish/tacos/fry-bread-tacos/",
                    "name": "Fry Bread Taco Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/50435/fry-bread-tacos-ii/",
        "name": "Fry Bread Tacos II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F194843.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-02-26T05:50:28.000Z",
        "description": "A yummy twist to an old favorite. The fry bread makes the difference. It's a popular request at my house. I do up everything but the fry bread in advance, and just heat up before serving. You can also top with other of your favorite taco toppings, such as onion, sour cream, or guacamole. Leftover fry bread can be used as dessert - coat it with cinnamon and sugar, and drizzle with honey.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H22M",
        "totalTime": "P0DT0H47M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (15.5 ounce) can pinto beans, with liquid",
            "½ cup picante sauce, divided",
            "1 pound ground beef",
            "1 (1.25 ounce) package taco seasoning mix",
            "2 cups all-purpose flour, or more as needed",
            "1 tablespoon baking powder",
            "1 teaspoon salt",
            "1 cup milk",
            "oil for frying",
            "2 cups shredded iceberg lettuce",
            "1 cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine beans and 2 tablespoons of picante sauce in a small saucepan over low heat. Cook until heated through, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine ground beef and taco seasoning mix in a large skillet over medium-high heat; cook until browned, 5 to 8 minutes. Cover, and keep warm while you prepare the fry bread.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the flour, baking powder, and salt. Stir in milk and mix until the dough comes together. Add more flour if necessary to be able to handle the dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a floured surface, knead the dough until smooth, at least 5 minutes. Let the dough rest for 5 minutes. Break off 3/4 cup sized pieces of dough, and shape into round discs 1/4 inch in thickness, making a thinner depressed area in the center.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 1/2 inches oil in a large, deep heavy skillet to 365 degrees F (180 degrees C). Fry dough in the hot oil until golden on both sides, about 3 minutes per side. Drain on paper towels.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Top fry bread with beans, ground beef, lettuce, and Cheddar cheese. Spoon picante sauce on top.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Taco Recipes",
            "Fry Bread Taco Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Robyn Bloomquist"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.596396396396396,
            "ratingCount": 555,
            "itemReviewed": "Fry Bread Tacos II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "808.1 calories",
            "carbohydrateContent": "76.7 g",
            "cholesterolContent": "103.4 mg",
            "fatContent": "36.5 g",
            "fiberContent": "7.2 g",
            "proteinContent": "40.4 g",
            "saturatedFatContent": "13.6 g",
            "servingSize": null,
            "sodiumContent": "2254.8 mg",
            "sugarContent": "6.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-12T19:56:22.377Z",
                "reviewBody": "Five stars for the actual fry bread.  I did make a few small changes.  My mom learned how to make fry bread from a Navajo woman and she gave me a few suggestions.  Add a little bit of fat to the actual dough to make the fry bread tender- I used about 1-2 tsp. olive oil (not authentic, but oh well).  Also, instead of just a depression in the center, she always makes a small hole.  This allows it to cook evenly.  I fried in a mix of canola, olive, and coconut oil (ran out of canola).  I made 6 fry breads out of this recipe (some smaller than others).  I used my instant-read thermometer to measure the the temp of the oil.  These turned out perfect, and so yummy!  The topping was only 3 stars, at best- it's a little bit bland.  Next time I would just make my own thick chili to top these with.  I thought kneading the dough would be difficult, but it really wasn't.  It was a little sticky, but I only added a couple pinches of extra flour and it handled just fine- turned into a nice, silky dough.  I enjoyed making these!  I ate too many, and I don't make fried foods often (harldy at all) so I'll probably wait a little until I make them again, but I really enjoyed them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-04T23:59:10.5Z",
                "reviewBody": "These are awesome for just the Fry Bread alone!  Best Bonus:  I found that they make up quite large and only 1 taco filled fry bread can easily satisfy my teenage sons! Everyone like the taco's that way for a change.  Yummy too for doing a dessert with the cinn/sugar/honey & also try it with ice cream.  **Update** I have made these several times per the resquest of my teens--the first few times I struggled a bit with the dough.  Hints to help make the dough easier to handle:  1) I scalded my milk before adding to flour mixture.  2) Make sure you knead it at least the 5 min. 3) Make sure your oil is a 365.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tizzylizz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1150935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-26T02:28:10.613Z",
                "reviewBody": "Oh what an ordeal to make...but boy were they worth it. I think I must have done something wrong in the frying process (I've never really fried anything before). I used a big sauce pot, filled it with oil and heated the oil to the temp the directions told. Only thing is when I fried my bread the whole house filled with smoke. By the time I fried my last piece my fire alarm was going off, then my security system went off, then the fire department came, then all the neighbors came out to see what was going on...and I'm just like 'what...I'm just making fry bread...'. After the smoke cleared we sat down at the dinner table and enjoyed a wonderful and yummy meal of fry bread tacos. Everyone LOVED them. I will for sure make it again, though, next time I will have to figure out a way of doing it without involving the fire department.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyInBliss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1538369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-02T17:19:27.03Z",
                "reviewBody": "This review is for the fry bread portion:\r\nOh my this recipe is soooo good! This tastes like the \"chalupa bread\" from Taco Bell only BETTER!! \r\nTaco's never tasted so good! No more hard shell or flour tortillas for our family. Once you try these you will never go back. They are easy, tasty and so chewy (I could go on & on!). I made these 2 days ago and used the bread like regular tacos(they fold in half nicely after they cool)and filled with regular taco meat and toppings. Well, my husband already asked me when I was going to make them again! So we are having then again tomorrow! \r\nP.S. If you have any fry bread leftover try them with ice cream (unbelievable).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SGORDON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/147833/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T18:33:04.123Z",
                "reviewBody": "HELPFUL TIPS: This makes 3 (using the suggested 3/4C dough) & I can't imagine ANY adult eating more than 1 since they take up the entire plate (as my pic shows). It's necessary to make this as PAPER THIN as possible as they thicken up a lot.  I like to make this for company & use a little less than 1/2C so they're the perfect portion size.  I fry these about 2-3 min. on each side.  By the time you flip it, it shouldn't sink into the oil.  I also used a knife to pop any bubbles that formed so there would be a nice flat surface. You can make these ahead, and heat up in oven (temp 200) for guests or even microwave! I layer mine w/refried beans, then the ground beef, lettuce, tomatoes, green/red/AND white onions diced, followed by cheese, salsa, sour cream.  This is truly the best and as mentioned, wonderful w/ice cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-29T01:05:10.567Z",
                "reviewBody": "AMAZING!!! I was so nervous about making this, as I've never made any sort of bread or tortilla, and I have only fried like 3 things in my entire life. Very easy and so delicious. I made the entire taco, per the recipe and it was just awesome. I served my boyfriend first while I finished frying the bread and I peeked out of the kitchen at him to get his reaction to them (I'm an insecure cook... and a dork). I was thrilled when I saw his eyes widen and he got the 'wow' look on his face. :) Thank you so much, I'll be making these often. They were fun to make and SO good. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinBug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookinbug/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-28T20:36:35.357Z",
                "reviewBody": "You really do have to be certain the oil is hot enough before dropping in the flattened dough or it won't cook through before turning golden brown; once you drop it in though the fry bread is done in a flash and it really is wonderful. If you aren't a big salsa fan (like my husband) try substituting a can of diced tomatoes and some fresh chopped onion garlic parsley and cilantro. I've also noticed several people noting that taco seasoning is too strong; I would suggest seasoning your beef (or ground bison if you can get it!) with salt pepper garlic and onion powder chili powder and paprika to taste. A great recipe and versatile; it reminds me strongly of the Indian Tacos I used to get at the great State Fair of Oklahoma as a child!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K.Fortune",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1834499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T18:44:31.877Z",
                "reviewBody": "I have so enjoyed reading the reviews of this recipe, especially the lady whose smoke alarm went off, then her security alarm, then the fire department came...  At Native American gatherings, here on the West Coast, there will always be an \"Indian Taco\" booth, and one Indian Taco will fill you up, and then some!  Indian tacos usually start with a layer of refried beans on top of the fry bread, then a layer of crumbled ground beef, followed by the shredded lettuce, diced tomatoes, shredded cheese, diced onions, and then any topping of diced black olives, sour cream, guacamole, and picante sauce.  Just set out a table with all the fixings, and let your family/guests make their own, according to their likes/dislikes.  I add a hint of sugar to my frybread dough, and while I'm waiting for the oil to heat (seems to take forever!), I'm testing it every so often by dropping a tiny ball of dough into the oil.  If it sinks to the bottom and just lays there, your oil isn't hot enough.  Once it gets hot enough, you will probably need to turn it down a bit, or eventually your oil will turn black because it can be too hot as well.  I dedicate one large, cast-iron skillet as my frybread skillet, because it will get messy and is really hard to clean.  I cover and save the oil between batches, saving and reusing the oil as long as possible, even draining the oil and filtering it through coffee filters to re-use. Finally, frybread is terrific just as the bread for any soup or chili dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Redwood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4200785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T17:22:57.577Z",
                "reviewBody": "I only made the fry bread and it was easy and delicious. I will be making this again except I will double the recipe.Thanks Robyn for a recipe I will enjoy for years to come.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MYRA25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/810016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-19T23:11:59.950Z",
                "reviewBody": "This was good,but i prefer to buy authentic Indian fry bread mix.\nNamed\"ha-pah-shu-TSE\"...can be found at most large grocers.It's already mixed,i just add a bit of warm water to the mix in a glass bowl,cover with a damp towel and place in a warm over or a warm spot for 2 or 3 hours. (makes the bread lighter and fluffy).Tear the dough into 4 seperate pieces and roll them out pencil thin before deep frying. YUM!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Pyewacket",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1410740/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Fry Bread Tacos II",
            "description": "Fry bread is easy and fun to fry!",
            "uploadDate": "2018-12-13T22:25:51.026Z",
            "duration": "PT1M35.445S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc82b286e-3019-4278-9e8b-a2e0d0e91910%2Fef3853cc-86b3-41cd-ab02-f1a449d47fb8%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5858878469001"
        }
    }
]