[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/227993/creamy-cheddar-beef-enchiladas/",
        "name": "Creamy Cheddar Beef Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4103863.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2020-02-26T05:51:17.000Z",
        "description": "This is an easy and delicious dinner. Add a tossed green salad and you've got a well-rounded meal!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 cup white rice",
            "1 ½ cups water",
            "1 pound ground beef",
            "1 onion, chopped",
            "2 cloves garlic, minced",
            "1 (1.25 ounce) package taco seasoning",
            "1 cup water",
            "1 (16 ounce) can refried beans",
            "1 cup cottage cheese",
            "1 cup shredded Cheddar cheese",
            "10 (8 inch) flour tortillas",
            "1 (7.75 ounce) can red enchilada sauce",
            "1 cup sour cream",
            "1 cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring rice and 1 1/2 cup water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is almost tender and the liquid has been absorbed, 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 9x13-inch baking dishes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook beef in a large skillet over medium heat, breaking it up as it cooks, until crumbly and browned, about 10 minutes. Drain excess grease and stir in onion and garlic until thoroughly combined. Stir taco seasoning and 1 cup water into the mixture, bring to a boil, and reduce heat to low; simmer 5 minutes to thicken. Gently stir in rice. Cook, stirring often, until liquid is absorbed. Mix refried beans, cottage cheese, and 1 cup Cheddar cheese into the filling and stir until fully combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread about 1/2 cup of filling in a line down the center of each tortilla and roll tortillas; place 5 tortillas with seam sides down into bottom of each prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix enchilada sauce with sour cream in a bowl and pour half the sauce down the center of each pan of enchiladas; sprinkle tops with 1 cup Cheddar cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cheese topping is melted and the filling is hot, 20 to 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "awhita11"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.464285714285714,
            "ratingCount": 56,
            "itemReviewed": "Creamy Cheddar Beef Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "550.4 calories",
            "carbohydrateContent": "57.9 g",
            "cholesterolContent": "68.3 mg",
            "fatContent": "23.3 g",
            "fiberContent": "4.8 g",
            "proteinContent": "25.6 g",
            "saturatedFatContent": "11.7 g",
            "servingSize": null,
            "sodiumContent": "956.8 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-07-25T06:59:54.313Z",
                "reviewBody": "I really didn't know what to expect with this recipe, but it was good! The only thing I did different was add a little cream cheese to the filling for the kiddo. We tasted it before that and it is great as-is. My three-year-old ate an entire serving which makes this 5 stars based on that alone. May not be a favorite for those who aren't fans of sour cream, but we really enjoyed it!! I will experiment with it a little going forward. We suspect chicken would be great in place of the ground beef, and we will top with chopped veggies next time. \n----> Edit to add: This recipe does make enough filling to create another pan for the freezer. I didn't assemble the second pan the first night. Instead, I froze the filling alone. My family requested these enchiladas again, the very next night. I defrosted the filling partially in the microwave, then put it in a large pot and heated on low until it was totally thawed. I added whole kernal corn to really bulk it up and about half cup additional cheese. I filled each tortilla with a generous half-cup of filling each and was able to get 6 enchiladas in a pan both nights I made this. I swapped out the cheddar for a blend: Monterey Jack, Cheddar, Queso Quesadilla & Asadero cheeses. The last five minutes of cook time, I topped with fresh onion, olives, and tomato. Yummy! This was great!! It really is VERY versatile, and I maintain that chicken would be a fantastic alternative to beef. I would consider fajita beans in place of refries also!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/383532/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-19T22:41:25.03Z",
                "reviewBody": "(This is my first time reviewing/commenting!) We LOVE this recipe and I love Allrecipes because I can read peoples feedback and suggestions/changes that they like to do. That being the case, I wanted to share what I like to do with this recipe! I make it slightly different each time with one or all of these changes. First, I always do this recipe casserole style because I can't stand rolling enchiladas(personal problem!), and always I use corn tortillas. I find flour gets a little soggy and if you are trying to go gluten-free, this will solve the tortilla problem. Here are the other things I do: I usually use ground turkey instead of beef. Only because I have it on hand more than beef. Sometimes I use quinoa instead of rice. I double the beans and use whole beans, using either pinto, black, or a mix. Sometimes I add a can of chilies and sometimes I use \"hot\" taco seasoning. After my first time making it I found the onions to be a bit crunchy so I either cook them with the meat or pre-cook them on the side in the microwave or in a pan. To bake, I spray the bottom of a 9x11 pan then put a layer of corn tortillas (takes 5, 3 of which I cut in half to put the straight side on the edges), 1/2 the meat mix, 2/3 of the sauce/sour cream mix, another layer of tortillas, remaining meat mix, remaining sauce mix, all shredded cheese. Baking time is just a little longer. Then top how you like (olives, green onions, tomatoes, cilantro, etc.). Enjoy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShannonD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6873299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-26T02:45:00.027Z",
                "reviewBody": "My husband just LOVED this recipe! I made exactly as is!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wickie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3_collies_and_a_cat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-05T23:45:48.763Z",
                "reviewBody": "Made this for dinner when we had company the other night. The feedback was \"this is better than any enchiladas I've had at the top Mexican restaurants.\" I think that says it all. Yum!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annabel Eyrick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3742856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-26T03:25:58.01Z",
                "reviewBody": "I made these tonight because I happened to have all the ingredients in my refrigerator and since we are leaving soon to go on a vacation I wanted to try and \"clean out\" the fridge. I had a small container of left-over flavored rice so I used it instead of white rice. When I read the other review I saw that she mentioned corn and I had a small container of left-over corn so in it went with the rice and meat. Instead of the sour cream I had a container of Ranch sour cream dip which I substituted. Don't be afraid of the cottage cheese--no one in my family tasted it and I couldn't tell it was there either. Everything else I followed by the recipe. It did make a lot of enchiladas--I think I actually used 15 tortillas. Mine were more like burritos with the rice corn beans meat and cheese. Next time I will not put in the refried beans but serve them as a side dish. I will make these again. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "txmom95",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7424202/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-06T17:23:08.57Z",
                "reviewBody": "My husband loved them! It definitely needs fresh toppings before serving though such as diced tomato some black olives lettuce and/or fresh diced onion",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs.Amero",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10664317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-18T02:57:56.89Z",
                "reviewBody": "Thank you for sharing your recipe. I'm rating this a 4 because my daughter thought it was absolutely delicious and I thought it was okay. In fact my daughter said she'd rate it a 10 on a scale of 1 to 10. I made it almost exactly as specified except I made my own enchilada sauce. I think that for my taste the filling was too busy (too much going on between the tastes of the rice beans meat and cottage cheese). Next time I make enchiladas I will focus on the taste of the sauce and make simple bean and cheese or cheese enchiladas. That said I can see why many people enjoy this--it's a hearty meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicki Stein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2418413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-04-25T01:00:51.737Z",
                "reviewBody": "Made a couple of changes because I have some picky eaters.  The only big change was black beans instead of refried beans.  I am not a cook nor do I normally do the cooking but with the wife out of town for a week I am feeding the small army.  It was said my enchiladas are better then mom's though.??",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandon Anderson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21562116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-17T23:55:46.807Z",
                "reviewBody": "Quick and tasty! The filling is awesome. We had a bit extra and used it for burritos the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Elisabeth Thomas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3683861/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-21T19:16:06.277Z",
                "reviewBody": "I made this except I used cream cheese rather than cottage cheese. I found the end result to be quit bland and the filling resembled vomit. Good thing its wrapped in tortillas. The canned beans overwhelmed the flavor of the meat. Luckily I had green chili on hand to spice it up. Wont make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "wanna be a baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10659713/"
                }
            }
        ]
    }
]