[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16220/bread/yeast-bread/pretzels/",
                    "name": "Pretzel Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6737/mall-pretzels/",
        "name": "Mall Pretzels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5809424.jpg",
            "width": 2257,
            "height": 2257
        },
        "datePublished": "1998-05-31T21:45:40.000Z",
        "description": "Big chewy pretzels like those sold in the mall! You may substitute garlic salt or cinnamon sugar for the coarse salt if you wish.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 dozen pretzels",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "2 tablespoons brown sugar",
            "1 ⅛ teaspoons salt",
            "1 ½ cups warm water (110 degrees F/45 degrees C)",
            "3 cups all-purpose flour",
            "1 cup bread flour",
            "2 cups warm water (110 degrees F/45 degrees C)",
            "2 tablespoons baking soda",
            "2 tablespoons butter, melted",
            "2 tablespoons coarse kosher salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, dissolve the yeast, brown sugar and salt in 1 1/2 cups warm water. Stir in flour, and knead dough on a floured surface until smooth and elastic, about 8 minutes. Place in a greased bowl, and turn to coat the surface.  Cover, and let rise for one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 2 cups warm water and baking soda in an 8 inch square pan. Line 6 baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After dough has risen, cut into 12 pieces. Roll each piece into a 3 foot rope, pencil thin or thinner. Twist into a pretzel shape, and dip into the baking soda solution.  Place onto parchment covered baking sheets, and let rise 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 8 to 10 minutes, or until golden brown. Brush with melted butter, and sprinkle with coarse salt, garlic salt or cinnamon sugar.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Pretzel Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jeannie Yee"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.63019833653231,
            "ratingCount": 1563,
            "itemReviewed": "Mall Pretzels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "182.2 calories",
            "carbohydrateContent": "34.6 g",
            "cholesterolContent": "5.1 mg",
            "fatContent": "2.4 g",
            "fiberContent": "1.2 g",
            "proteinContent": "4.8 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "1782.8 mg",
            "sugarContent": "2.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-07T02:57:41.733Z",
                "reviewBody": "I've been baking for many years now and one thing I've learned is~ There is a way to get around any problem. After reading everyone's reviews I made some changes in the actual baking. Not the recipe, that was perfect. For the people that had trouble rolling: It's a must to kneed long enough for a light, smooth dough (I have a Kitchen Aid that is worth it's weight in gold!) and let it rise until double in an oiled bowl. If the dough doesn't rise long enough you end up with a tough, rubbery dough that will not stay put. After I rolled out the dough, made the pretzel and dunked it in the water/soda, I laid it on a paper towel just long enough to turn it back on my hand and then on my cookie sheet. This way they didn't puddle in the excess water and it's easy to reshape them. I use ordinary baking sheets, sprayed with Pam, and I baked them in the middle of my oven. They literally slipped off the baking sheet and were a golden brown top and bottom. I see no need for Parchment paper. Do they taste exactly like Mall Pretzles? Who cares? They are so good I've already eaten two! Oink! I know the remainder will be gone as soon as the rest of the family gets home and then they'll be clamoring for MORE. Thanks Jeannie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Flashsmith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/692837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-24T17:56:18.437Z",
                "reviewBody": "I rate this recipe 5 stars because the dough is perfect, but it still has some room for improvement in the baking process. Here's what I did: I boiled the pretzels in 4 cups of water and 4 tbsp of baking soda until they floated, one at a time, as some German recipes advise. Then I let them rise for 20 other minutes uncovered, basted them with egg and sprinkled the coarse salt afterwards. Then I baked them for 20 minutes at 225ºC, and they came out golden and beautiful, and tasted as real pretzels. A definite keeper. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LANINACALAMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/355683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:31:05.64Z",
                "reviewBody": "I am the biggest fan of the \"Pretzelmaker\" but have been unsuccessful store-bought version.  THIS IS IT!! Now I can enjoy the same pretzels at home!! We topped the pretzels with pizza spices, garlic salt or parmesean cheese and dipped in a variety of sauces. My only advice, DO NOT BAKE on the bottom rack in your oven...the bottoms will burn.  Maybe all you bread experts may already know that but to novices like myself, this advice will save you 6 pretzels you would have lost due to burned bottoms.  THANK YOU JEANNIE!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22503515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-24T15:26:35.327Z",
                "reviewBody": "Amazing pretzels!  I was a bit afraid of making them because although a lot of people said they were great, some said they were too bready and difficult to work with.  Not so.  And this recipe is SO forgiving.  First, I found that I didn't have any brown sugar so I ended up using regular granulated sugar.  Then, I didn't have bread flour, so I only used all-purpose.  Rolling them did prove to be a bit time consuming because they tend to spring back, but I found that a combination of rolling and picking them up to let gravity stretch them worked well.  Also, because I was working on a short surface, I didn't have room for the entire 3 feet, but I did find that as I got each part to the desired thickness, I could wrap it around one hand  to get it out of the way and continue rolling the rest with the other hand.   I salted them before putting them in the oven, and rather than baking on parchment, I used well-buttered foil.  The bottoms came out nice and crunchy and buttery, and the rest was chewy and soft.  I made a garlic butter by just putting some minced garlic and butter in a pan and heating until the rawness was gone and dipped the hot pretzels in that rather than putting the topping directly on the pretzel.  So yum and so easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deborah Chow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/399471/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-27T22:16:01.31Z",
                "reviewBody": "I used only whole wheat flour as that was all I had so maybe that made a difference, but I have no idea what the reviewers who had problems with sticky dough did - my dough was actually a bit on the dry side!  No problems with the water bath either, although I did blot the bottoms with a papertowel before putting them on a greased cookiesheet to reduce sticking (and had no problems with that either). I cut the recipe in half since so many people said the pretzels didn't keep well... I didn't have any problems here either?  Then again, I didn't put any topping on them until just before eating (so the stored ones are 'naked') - at the mall they don't put the topping on until you request it and if it IS done beforehand, well, those pretzels have only been sitting there for a half hour or so!  Oh, and just like I request at the mall, I use water to make my topping stick (spray bottle) instead of butter - trying to be healthy and all.  :)  Both me and my bf thought these made a great snack!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pointpixie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1788664/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-05T04:36:17.983Z",
                "reviewBody": "Good pretzel's. The best with cinnamon. I didn't use parchment paper and my pans were completely sticky. USE PARCHMENT PAPER. The pretzel barely came off after lots of shoveling them off the pan",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELSTAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/angelstar/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-24T22:09:46.81Z",
                "reviewBody": "For everyone having problems with the pretzels tasting stale the next day, just put them in ziplock bags, freeze them, and whenever you get the craving, pop them in the microwave for 45 sec.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1531841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-09T21:03:30.89Z",
                "reviewBody": "Oh my golly these are amazing. I crave these things all the time...not exactly sure that it is a good thing that I can make them on my own now...LOL.  I did have to add more flour to my dough because it was just too sticky...and the cook time was a little bit longer too.  Didn't change anything else.  Hubby ate this with a Garlic Parmesan butter and I had mine plain.  Thanks for the post.  One of my favorites.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T02:06:33.78Z",
                "reviewBody": "pretty good for my first attempt at making pretzels.  i converted the recipe for use with my sourdough starter: 2 cups active starter, 3 cups bread flour, 3 tblsp sugar (a little extra to make up for the sour flavor of the starter) and 2 tsp salt - everything else i left the same.  the rise is longer, as expected for a sourdough starter.  also, greased cookie sheets seem to work fine.  underbake them slightly if you want them chewy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KEG18",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/227721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-02T15:32:41.560Z",
                "reviewBody": "My family thought the pretzels were ok, definitely not as good as the pretzels at the mall.  They taste better if they are eaten right away.  By the next day they do not taste very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "TJMALLETT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/725079/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Mall Pretzels",
            "description": "Make these yeasty, chewy pretzels at home. Your family will love them.",
            "uploadDate": "2013-01-04T21:52:35.807Z",
            "duration": "PT5M0.759S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb3238872-758d-4eb7-ae89-35cb9832acb6%2Fffda4fc6-064d-4e5f-bccf-ae467cdf4ef7%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2073395100001"
        }
    }
]