[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1997/bread/quick-bread/scones/",
                    "name": "Scone Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6946/blueberry-scones/",
        "name": "Blueberry Scones",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F653563.jpg",
            "width": 2304,
            "height": 1536
        },
        "datePublished": "1998-09-09T22:19:26.000Z",
        "description": "A good basic scone recipe with blueberries added . . . yummy!!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "12 scones",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "¼ cup packed brown sugar",
            "1 tablespoon baking powder",
            "¼ teaspoon salt",
            "¼ cup butter, chilled",
            "1 cup fresh blueberries",
            "¾ cup half-and-half cream",
            "1 egg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut butter into mixture of flour, sugar, baking powder, and salt. Add blueberries and toss to mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In separate bowl beat together cream and egg, and slowly pour into dry ingredients, stirring with rubber scraper until dough forms. Knead just until it comes together, 3 or 4 times. Don't overhandle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough in half. On lightly floured board, shape each half into a 6-inch round. Cut into 6 wedges.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake on ungreased sheet about 20 minutes at 375 degrees F (190 degrees C). Serve warm!!\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Scone Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LindaPinda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.227564102564102,
            "ratingCount": 624,
            "itemReviewed": "Blueberry Scones",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "160.3 calories",
            "carbohydrateContent": "23.1 g",
            "cholesterolContent": "31.3 mg",
            "fatContent": "6.2 g",
            "fiberContent": "0.9 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "211.4 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-02T15:41:05.89Z",
                "reviewBody": "I don't understand why there are so many people giving this recipe a bad rating. True, the batter mix was wet, but what really matters is the end product, and my gosh, it was good! I discovered this recipe a few months ago, when I decided to venture into the world of baking. This was literally the third recipe I tried, and so I thought I'd follow it to the letter. I've since tried this at least half a dozen times, and only stopped cause blueberries are no longer in season here! I plop spoon sized clumps of these onto a baking sheet, and when they cook, it turns into this really soft and delicious. I happen to like my breads/pastries not too sweet, and with these, I actually taste the blueberries, not the sugar in the dough. Very highly recommended. As with other reviewers, I've successfully tried this recipe with other ingredients - choc chip, cheese bits, corn, raisins... but blueberry still rules!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrew L",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/581657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:26:35.187Z",
                "reviewBody": "Excellent recipe! I did substitute 1/2 c. plain yogurt for the 3/4 cream to lower fat and make the dough more managable. Tip: USE FROZEN BLUEBERRIES! When kneading, it will make it much easier and they aren't as prone to pop as fresh. Instead of shaping it into a round, I shaped it into a 16L x 4W x 3/4H rectangle, squared up the edges, cut it into 4 squares, and cut each square diagonally to get a more traditional scone shape. I sprinkled coarse sugar on top before putting them in the oven. They're best eaten within 24 hours of baking. I made them one night to take into the office the following morning. Rave reviews!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "N0NNYM0USE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/676910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T15:41:40.653Z",
                "reviewBody": "These scones are very delicious. The only problem with the recipe is that the amount of flour should be increased until the dough is comfortable to work with, but not dry. The dough does not really need to be kneaded, just mixed well with the rubber spatula then shaped and cut.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TKEARNEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-04T21:01:35.733Z",
                "reviewBody": "These were easy to make and so delicious!  I made the following changes based on other reviews:  added an extra 1/4 cup flour and also rolled the blueberries in flour.  Added 1/4 c white sugar , 1 tsp vanilla, and sprinkled sugar on top of the scones.  I also used cream instead of half & half.  I shaped them into 4\" squares and cut diagonally for triangles.  I baked some right away and froze half to bake later (thawed for only a few minutes, then baked as per recipe).  Delicious both ways!!  This recipe is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1926923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-11T23:30:57.587Z",
                "reviewBody": "I have not made this recipe, but it is somewhat similar to a Blueberry Scone recipe I already make.  Some reviewers have complained about the dough being too soft.  I think the problem is the amount of liquid, the recipe I have and most others usually call for 1/3 cup to 1/2 cup liquid with similar amount of dry ingredients.  It is never a good idea to tinker with the amount of flour as that messes up the ratio of flour to baking powder (leavening ingredient), so it is better to cut back on the amount of liquid.  I also add a dash or two of cream of tartar to the dry ingredients and about 3/4 tsp. vanilla extract to the egg mixture.  Also, it is easier to scoop out half of the dough on a floured surface and knead it, then do the other half of the dough.  Then you can blend both doughs together.  I usually pat the dough to about 1-1/4 inch thickness.  Before baking scones I brush some cream or milk on top and then lightly sprinkle with some white sugar.  Scones are a Scottish/English biscuit.  It is a cross between a muffin and a biscuit in texture, moist but crumbly.  It is unfortunate that a couple of the reviews the reviewers came across as mean spirited, I've found over the years, that the people that complain about recipes are usually the ones that are not very good cooks to begin with.  :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Marilyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4955513/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-11T02:14:32.45Z",
                "reviewBody": "Yippee Yahooie!  Loved this recipe - goes together quickly, and produces great results.  I added a little lemon zest, and sprinkled them with sugar before baking, came out great.  Scones are by nature a goopy batter, if you look at the ratio of dry ingredients to wet.  Instead of dividing onto 2 balls (impossible) and then cutting into wedges (as most scone recipes call for) I always make \"drop-scones\", like drop biscuits, and plop heaping spoonfulls onto a greased & floured regular cookie sheet.  They bake in the same amount of time, you don't have to worry about the centers of the bog rounds still being raw while the edges overcook, and you don't have to get your hands into the goopy batter.  This recipe worked great even at 6000' altitude here in New Mexico.  I intend to try this recipe with other fillings, too - cinnamon walnut(ooh, with a streusel topping maybe!), cranberry lemon, rosemary parmesan, and whatever other berries i can get my hands on.  Highly recommended recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZUFHAUS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-11T02:11:19.123Z",
                "reviewBody": "These are not scones in any sense of the word. Obviously those who gave it positive reviews have never seen nor tasted a scone before. First off as another reviewer pointed out you cannot cut the dough for it's too mushy and sloppy to cut. I even added a cup more of flour and still it was un-cuttable! I needed to add a half cup more sugar to taste any sweetness at all and I don't even have a sweet tooth! Because of the sloppy mushy dough all I could do was plop the batter in splumks on the baking sheet which needs to be greasewd by the way contrary to what the recipe submitter states. They came out looking like extremely puffed cookies and tasted below ok. This is a recipe for bread not scones. Very poor recipe indeed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "veggigoddess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/195519/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-11T23:25:40.343Z",
                "reviewBody": "I did not care for this. The dough (I use that term lightly) was a sticky, mess with little to no flavor. I had to add almost twice the flour in order to form an actual dough. I added sugar, too, to make up for the lack of flavor. This recipe is great if you enjoy making messes, but if you enjoy cooking (or scones) I'd look for a different recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNI0329",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/178754/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:26:36.42Z",
                "reviewBody": "These scones are very delicious my son really loved them and so did I. I think this is a excellent recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROB456",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666231/"
                }
            }
        ]
    }
]