[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15490/desserts/cakes/cake-mix-cakes/yellow-cake/",
                    "name": "Yellow Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7547/honey-bun-cake-i/",
        "name": "Honey Bun Cake I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F363088.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1998-05-10T16:26:20.000Z",
        "description": "This cake tastes just like the name suggests - like a honey bun. It has been served to hundreds of people and everyone has said how much they liked it. It is a sweet cake and not for those that are watching their weight. Tastes wonderful if served with a small scoop of vanilla ice cream.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "1 - 9x13 inch cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package yellow cake mix",
            "¾ cup vegetable oil",
            "4 eggs",
            "1 (8 ounce) container sour cream",
            "1 cup brown sugar",
            "1 tablespoon ground cinnamon",
            "2 cups confectioners' sugar",
            "4 tablespoons milk",
            "1 tablespoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, combine cake mix, oil, eggs and sour cream. Stir by hand approximately 50 strokes, or until most large lumps are gone. Pour half of the batter into an ungreased 9x13 inch glass baking dish. Combine the brown sugar and cinnamon, and sprinkle over the batter in the cake pan. Spoon the other half of the batter into the cake pan, covering the brown sugar and cinnamon. Twirl the cake with a butter knife or icing knife until it looks like a honey bun (or whatever design you want to make).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Frost cake while it is still fairly hot. Serve warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make the frosting:  In a small bowl, whisk together the confectioner's sugar, milk and vanilla until smooth.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Yellow Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jennifer Walker"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.600975609756097,
            "ratingCount": 1025,
            "itemReviewed": "Honey Bun Cake I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "251.4 calories",
            "carbohydrateContent": "33.6 g",
            "cholesterolContent": "35.8 mg",
            "fatContent": "12.3 g",
            "fiberContent": "0.4 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "161.1 mg",
            "sugarContent": "25.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-26T22:40:52.107Z",
                "reviewBody": "Everytime I make this cake for a morning meeting at work, it gets rave reviews.  I make a few changes though.  I make mine in a bundt pan.  I sprinkle some of the topping on the bottom of the pan and then put in some of the batter and then sprinkle some more topping and then more batter and then top with the rest of the topping.  It makes a beautiful presentation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dusty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/616756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-23T04:31:23.63Z",
                "reviewBody": "I've made this recipe before, with some substitutions.  I am only rating it 2 stars, hoping to draw attention to my review, because at the risk of sounding presumptuous, I think it may help lessen some of the negative reviews, following this one, in the long run .  I have made this cake once and, somehow, despite several substitutions, it turned out beautifully.  It is a very good recipe.  HOWEVER, here is a BIG ISSUE:  Presumably, due to our current economic woes, manufacturers of cake mixes have begun cutting back on the amount of mix that was standard for most cake mixes, the 18.25 oz., such as this recipe and many other recipes call for.  And they have instead reduced the actual amount in their boxes to 15.25 ounces.  Word has it they are adding in just enough leavening ingredients to make the cakes manifest to the same size, but which produces a cake much different than the way it would have turned out, had consumers been aware of the changes.  And the boxes themselves aren't that much smaller, thus fooling the average consumer into thinking they are still getting the same amount of cake mix for the same price.  Since this recipe calls for an 18.25 oz. box of mix, double-check that the mix you get is the same amount.  Otherwise, recipes that would normally work, won't, unless adjusted.  Some premium brand mixes still make mixes in the 18.25 oz. size, as well as some generic brands, or so I've heard.  But just thought I'd interject this info, if it helps. Anyway, 5 stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Meleah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3368979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-01T01:08:06.42Z",
                "reviewBody": "This is a wonderful cake!!! I thought it tasted very similar to a honey bun, my husband thought it tasted like a coffee cake but we both thought it was awesome!  Extremely moist and tasted great.  I did make a few substitutions.  I made the cake batter from scratch (2 1/3 c. flour, 1 tbl. baking powder, 3/4 tsp. salt, 1 1/2 c. white sugar & 1/2 c. shortening.  Sift together dry ing. & add shortening until crumbly in nature.  Then follow the recipe as is).  Added 1 tsp of vanilla & 1/2 tsp of brandy extract to the batter.  Reduced the brown sugar to 3/4 cups.  Halved the icing & added 1/4 tsp of brandy extract to that, as well.  I'm not big on glaze & only ended up using about 3/4 of what I made.  I served it warm & ended up eating seconds which I never do.  It was easy to make & I loved the taste.  This is the cake to make when you're craving something sweet & satisfying.  Thanks for this wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CaleyCat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/298247/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T05:52:02.403Z",
                "reviewBody": "This cake tastes like one giant cinnamon roll. It is REALLY good. The presentation is also beautiful (I also made mine in a greased and floured bundt pan -- which I highly recommend). The baking time is the same for both pans. However you will have about twice as much glaze as you need if you use a bundt pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "METROPHOBIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460762/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-10T19:16:05.063Z",
                "reviewBody": "Perfectly delicious, however, not very pretty. I'm a teacher who LOVES to bake, and I'm known around my school for being a great baker.:-)  I made this cake for my administrator who just had a baby...you know, my boss who I really want to impress.:-) It wasn't quite done at 40 minutes, so it needs longer to cook. I baked it in a 9x13 glass dish.  This cake would likely be much prettier in a bundt pan, so I will try that next time.  Its taste is to DIE for, even with the full cup of brown sugar.  Wow!  Serve it warm with ice cream and oh my, you have yourself an exquisite dessert.  Pretty, no, so probably not a cake you'd want to take to someone you were trying to really impress.  Delicious, heck yes, so I guess it depends on your audience.  Good luck! Ally",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allyson Hester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-07T22:54:06.09Z",
                "reviewBody": "everyone at my family BBQ love it! the only thing i did different is i made them into cupcakes to make it easy to pick up and go.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CoOkInGnUt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookingnut/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T20:11:35.617Z",
                "reviewBody": "I made this cake the other day.. my husband and i LOVED it. i made it a bit more low fat by playing around with the ingedients. i used 4 ounces sour cream a little motts container of applesauce and a low fat vanilla pudding cup to make up for the 4 ounces of missing sour cream. i also left out the vegetable oil. (i like to experiment when i cook:) ) it turned out wonderful.. its a moist wet cake.. the brown sugar in the middle was definatly what made it yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Stephens",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/carries/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-29T16:22:36Z",
                "reviewBody": "This is a classic cake recipe that has been around for many years. It has stood the test of time simply because it's that good, that easy, and makes your kitchen smell wonderful too. A tried and true cake that I know good cooks will still be making for years to come.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-02T20:51:05.59Z",
                "reviewBody": "Where I come from in Mississippi, this is called a \"Sock It to Me\" cake.  It is divine, and so unbelievably easy!  My husband asks for it every year on his birthday (and several times a year between birthdays!)  You WILL NOT regret making this cake!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "allison125",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/351270/"
                }
            }
        ]
    }
]