[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15012/desserts/specialty-desserts/liqueur-desserts/brandy/",
                    "name": "Brandy",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9265/christmas-cake/",
        "name": "Christmas Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2994329.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This cake is a rich, dark, moist fruit cake, very flavorful at Christmas. Try icing with almond paste for a more festive touch. This recipe is started in October or November so as to let it mellow before the holidays. I remember very well my mother storing her fruit cake in an old butter churn that belonged to my grandmother and great grandmother. I wish that I had that old crock.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H30M",
        "totalTime": "P0DT6H0M",
        "recipeYield": "1 - 8 inch square fruit cake",
        "recipeIngredient": [
            "2 (8 ounce) containers candied cherries",
            "1 (8 ounce) container candied mixed citrus peel",
            "2 cups raisins",
            "1 cup dried currants",
            "1 cup dates, pitted and chopped",
            "2 (2.25 ounce) packages blanched slivered almonds",
            "½ cup brandy",
            "½ cup all-purpose flour",
            "2 cups all-purpose flour",
            "½ teaspoon baking soda",
            "1 teaspoon ground cloves",
            "1 teaspoon ground allspice",
            "1 teaspoon ground cinnamon",
            "½ teaspoon salt",
            "1 cup butter",
            "2 cups packed brown sugar",
            "6 eggs",
            "¾ cup molasses",
            "¾ cup apple juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine cherries, citrus peel, raisins, currants, dates, and almonds. Stir in brandy; let stand 2 hours, or overnight. Dredge soaked fruit with 1/2 cup flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 275 degrees F (135 degrees C). Grease an 8x8x3 inch fruit cake pan, line with parchment paper, and grease again. In a small bowl, mix  together 2 cups flour, baking soda, cloves, allspice, cinnamon, and salt; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream butter until light. Gradually blend in brown sugar and eggs.  Mix together molasses and apple juice. Beat into butter mixture alternately with flour mixture, making 4 dry and 3 liquid additions. Fold in floured fruit. Turn batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 3 to 3 1/2 hours, or until a toothpick inserted into the center of cake comes out clean. Remove from pan, and lift off paper. Cool cake completely, then wrap loosely in waxed paper. Store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Brandy"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.655737704918033,
            "ratingCount": 122,
            "itemReviewed": "Christmas Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "644.7 calories",
            "carbohydrateContent": "113.4 g",
            "cholesterolContent": "100.3 mg",
            "fatContent": "17.8 g",
            "fiberContent": "3.9 g",
            "proteinContent": "7.4 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "255.9 mg",
            "sugarContent": "73.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-05T16:08:31.287Z",
                "reviewBody": "LOVE this cake! I suggest only a couple of modifications but if you can't make the changes make this cake anyway because it is a real crowd pleaser. First use Demerara sugar instead of brown sugar if you can. It's usually found in regular grocery stores next to the other sugars and it doesn't cost much more. It's is a light brown sugar that provides a stickier texture and a really rich aroma-- perfect for this cake. Second marinate the candied fruit in the brandy for as long as you can. You really want the fruit to be plump. Third follow the directions for a long baking time in low heat. Don't try to speed things up by increasing the temperature (like I once did...)! Fourth top with Royal Icing-- there are some very good recipes for it on this website. Royal Icing is a bit tricky to work with but it's worth the effort!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlliePeacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alliepeacock/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-03T17:07:30.253Z",
                "reviewBody": "I've been making fruitcakes for several years dutifully wrapping them in liquor-soaked cheesecloth which I refreshed on a regular basis. Well all I can say is 'Thank you Carol! I'll never soak a fruitcake again!' This is the most moist delicious fruitcake I've ever eaten. No need to wrap in cheesecloth. I do recommend letting it 'mellow'. I soaked my fruit for a full 24 hrs. rather than overnight. I also mixed some dark rum in with the brandy. Being allergic to nuts I omitted them and slightly increased my fruits. I baked in a tube pan too. Anyway the yummiest fruitcake around and it will make a believer out of the most vocal critic. December 2010 update: Used Grand Marnier to soak the fruit this year and Muscovado sugar. Increased my dates to abt. 1.5 cups. Didn't think it was possible but even yummier this year!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MACLEOD26",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/965171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-03T22:32:00.39Z",
                "reviewBody": "I made this recipe about 6 weeks before christmas and then resisted eating it until then. This is truly the best Christmas cake ever! It is really rich and moist. It did make a lot and I had to put it in a 26cm or 10inch square tin which fit perfectly. We thought we would never get through it it was so huge but it was gone within a week or so. It was so delicious. As my husband is allergic to almonds I substituted brazil nuts which worked just as well. I let the cake cool in the tin with a teatowel over the top to keep the moisture in then when it was cool I basted it in brandy and wrapped up in greaseproof paper and tin foil. Also for all you Aussies after hunting around shops looking for Molasses with no luck I did some research on the net and found out that what they call molasses in the US is what we call treacle over here - if they ask for blackstrap molasses then that is what we call molasses. Hope that helps when you find it hard to find molasses on the shelf in Aus. Will definately be making it again this year (and also planning on making smaller ones for gifts keeping the big for myself of course)- can't wait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1784177/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T03:29:50.263Z",
                "reviewBody": "Made this dark fruit cake last Christmas also made a light fruit cake. The dark cake was eaten before Christmas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "northernsunshine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-28T14:27:55.11Z",
                "reviewBody": "I made this cake a couple weeks ago I won't be trying it till xmas so I will update my review then. I left out the cinnamon and cloves and just used the allspice/mixed spice my house smelt of mollases/treacle for days!!due to the 3/4 cup of it that went in I have a funny feeling this will be way too strong a flavour and smell for me as all of the other recipes I have seen only call for a couple tablespoons of mollases!! but I will let you know I will obviously marzipan(almond paste/icing) and ice/frost the cake and decorate it couple weeks before exmas I will skewer the cake in several places and poor over brandy and whisky (more for the flavour and kick rather than moistness) as I think this may be a moist cake anyway. I will report back after exmas or just after the first few comments on the cake. Hope it's good it took 3hrs 35 mins to cook. UPDATE after 2.5 weeks I took it out of the air tight container and unwraped it from the double layer of tin foil and layer of greaseproof and it smells gorgeous no more mollases smell just a lovely traditional english christmas cake smell almost like christmas pudding!! I skewered 5o times and poured over a tbls of each whisky and brandy.Update: Very moist but may add double the mixed spice next year. NOTE: this is for an 8\" square cake if you use a round pan you must use a 9\" one!! an 8\" round fits exactly onto an 8\" square one so you must allow for the corners (thats why a 9\" round is needed)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CANNOLIEATER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1465197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-10T14:21:52.413Z",
                "reviewBody": "Did not rise properly stayed raw in the middle maybe my mistake?? Help",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Martin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1690215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T05:24:36.91Z",
                "reviewBody": "I tried this cake last Christmas. It was the best ever. I used apricot brandy. I did not feel icing was necessary. I will most definitely make this cake again. Thanks so much for sharing it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Corky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/918492/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-01T00:19:58.623Z",
                "reviewBody": "This recipe is awesome! The first year I've used it I got several compliments from family and friends. The second year I gave cakes away as gifts. Now people wait for it every Christmas. I have my great aunts - who are great cooks and bakers themselves and who are very critical about other people's cooking who actually want this recipe for themselves. Thank you for having shared it. I never thought making fruitcakes could be so fun and rewarding!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jwlhansen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1539617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T03:29:48.297Z",
                "reviewBody": "Thank you Carol for sharing a great recipe. I have been on the look out for a simple and good recipe for quite some time now. This cake turned out perfect just the way I like it. Since I have a convection oven I reduced the temperature by 25 degrees and my cake was done is 2 hours and 45 minutes. Thanks for sharing the recipe with so many readers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PREMA CONCESSAO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/749146/"
                }
            }
        ]
    }
]