[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/836/desserts/cookies/bar-cookies/",
                    "name": "Bar Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10969/popularity-cookies/",
        "name": "Popularity Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F45647.jpg",
            "width": 2304,
            "height": 1728
        },
        "datePublished": "1998-06-12T16:39:31.000Z",
        "description": "I call these popularity cookies because when I make them and take them to work, they make me popular!  You can make these with club crackers, too.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "35 soda crackers",
            "1 cup butter",
            "1 cup packed light brown sugar",
            "1 cup semisweet chocolate chips",
            "1 cup milk chocolate chips",
            "1 cup blanched slivered almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (205 degrees C).  Cover a sided cookie sheet with aluminum foil and line crackers on foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine butter and brown sugar in a saucepan.  Stirring constantly, bring to a boil and boil for 3 minutes.  Pour over crackers completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 5-6 minutes, watch carefully.  Remove cookie sheet from oven, place it on oven door and sprinkle chips over baked crackers.  When chocolate gets soft, spread over crackers with back of a spoon.  Sprinkle slivered almonds on melted chocolate.  Place in refrigerator for at least 8 hours.  Break into cookie-size pieces.  This recipe freezes well.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Bar Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Alice"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.640167364016737,
            "ratingCount": 239,
            "itemReviewed": "Popularity Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "435.2 calories",
            "carbohydrateContent": "43.9 g",
            "cholesterolContent": "43.7 mg",
            "fatContent": "29.2 g",
            "fiberContent": "1.9 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "15.2 g",
            "servingSize": null,
            "sodiumContent": "210.4 mg",
            "sugarContent": "33.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-15T13:18:42.407Z",
                "reviewBody": "I made these last night to test before taking them to a cookie exchange. Husband and Son went crazy and can't believe how much they taste like Almond Roca Candy. I wanted something quick easy and different. These are it! Here is what I did and it made 3 dozen cookies. I lined a cookie sheet with tinfoil and sprayed a little bit of Pam on foil used Club Crackers light brown sugar Land of Lakes butter Nestle Tollhouse semi-sweet morsels (chopped-melts quicker)and slivered almonds(chopped). When brown sugar and butter were cooking I stirred mixture constantly for 3 minutes at a low boil. I then put sugar mixture in a measuring cup so it would be easier to pour on crackers. Put them in the oven for about 5 minutes if you see the sugar mixture bubble on the crackers don't worry it is ok. I take them out of the oven once or twice to push the crackers back in a square with a spatula. I pull them out of the oven and add the chopped morsels put them back in the oven turn off the oven and wait 4-5 min for chocolate to melt. I spread chocolate with spoon add chopped nuts and refrigerate about 4-5 hours or freeze for 1 hour. I then cut them into 36 squares with a pizza cutter and it works perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMY KEENE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/740622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-21T14:59:22.68Z",
                "reviewBody": "YUMMY!  I made these to include in the cookie trays I put together to give out as gifts.  I had to HIDE them from my husband so that I would have enough for the trays!  I used club crackers rather than saltines but otherwise followed the directions exactly.  The first batch I made turned out perfectly.  I must not have boiled the toffee long enough for the second batch because I ended up with a very sticky mess the second time. It's very important to start timing the 3 minutes when the mixture comes to a good boil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TxAggie95",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2693813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-18T21:44:07.767Z",
                "reviewBody": "Yummy! So easy. Instead of waiting 8 hours to eat (who could do that?) I popped the tray in the freezer for about a half hour and it did the trick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leigh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2136165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-06T05:49:16.86Z",
                "reviewBody": "I had a TON of crackers leftover from a party so when I found this recipe I decided \"why not go for 100?!\"   Imagine toffee except not as hard, a cookie but not as sweet, and cooled hardened chocolate with your choice of topping, my favorite was coconut. Beware of over-indulgance & be sure to get all the foil off!!!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CrystalGayle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/858605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-23T17:08:39.327Z",
                "reviewBody": "I was a bit worried because I've had this cookie before where the soda cracker really stood out and was soggy and tasted stale. But this one was great! I would even say to let it stay in the ref. overnight. My husband took a bite at exactly the 8 hrs. mark and he felt that the cracker stood out. Today it tastes like toffee and you can barely taste the cracker. Thanks! Great gifts for the teachers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATEFOODFUN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1466506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T16:03:58.13Z",
                "reviewBody": "oh my how easy! I always make homemade toffee almond crunch for the holiday trays but d/t time constraints and the interest of the cracker I decided to try these. I have to say that these are the closest thing to the homemade toffee crunch that one can get and much faster to make. Followed recipe exactly with no changes. I did grind the chips up in my food processor a bit d/t the extra time needed for melting and this was perfectly spreadable after 1 minute in the oven with the oven turned off. I was concerned about the crackers/toffee mixture shifting but this was so easily repaired by just putting everything back in place with a spatula. take care not to lift the utensil when spreading the chocolate. I found that when I lifted the spatula while spreading the toffee would also lift up off the cracker. Thank you for this super easy recipe with an excellent taste just like homemade toffee. I too agree that salted saltines add to the whole toffee experience.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T01:10:23.373Z",
                "reviewBody": "UNBELIEVABLE!!!! I took these to a finger-food dinner at church last night and they cleaned the plate! As a matter of fact when I got my empty plate back someone had written me a note on a paper napkin: \"These were wonderful! I would love the recipe\" - then they signed it and put their phone number on it! I have never had such a reaction. My husband said he heard several people asking who made them! I will definitely be making these again! The only thing I did different than the recipe was I used sliced almonds which I chopped and then sauteed in butter. If I could give this recipe more stars I would...GREAT GREAT GREAT!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENBON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/604951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-07T00:13:22.123Z",
                "reviewBody": "Good toffee. The only problem I ran into was that my cookie sheet's sides weren't high enough: the sugar layer made the crackers spread out while cooking and they almost bubbled over the sides. Next time I'll make them in a 9x13 pan to trap the crackers in better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mommymeggy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2022907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-19T16:31:40.853Z",
                "reviewBody": "Perfectly delicious cookie/bar. I just wish the recipe could have been more descriptive on the cooking of hte bars--After mine had come out of the oven and I'd had some time to think on it I could have left them in the oven a tiny bit longer to get closer to the Heath bar-esque taste other reviewers have mentioned. When the crackers have been covered in the caramel and are baking in the oven what you need to look for is when all the bars are bubbly and puffed up. Go a few seconds longer so that they can carmelize and that's when you know they're done. Regarding the chocolate chips I took the hint of others and slid the whole pan back in the oven--worked well. Also only used semi-sweet chips as I think the milk chocolate would have been too sweet. Really really interesting cookie to take to a potluck no one else wil have brought a better sweet treat than you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "McCrearyacres",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2169998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-17T18:38:37.29Z",
                "reviewBody": "I did not care for this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Leonard Rabenhorst",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5813763/"
                }
            }
        ]
    }
]