[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/749/desserts/candy/chocolate-candy/",
                    "name": "Chocolate Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11376/saltine-toffee-cookies/",
        "name": "Saltine Toffee Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6058024.jpg",
            "width": 3547,
            "height": 2356
        },
        "datePublished": "1999-04-29T18:43:48.000Z",
        "description": "This is an easy to make but wonderfully delicious treat.  We pack them in tins and give as gifts during the holidays.  Use your favorite nuts to top the cookies.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 cookie sheetful",
        "recipeIngredient": [
            "4 ounces saltine crackers",
            "1 cup butter",
            "1 cup dark brown sugar",
            "2 cups semisweet chocolate chips",
            "¾ cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (205 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line cookie sheet with saltine crackers in single layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan combine the sugar and the butter. Bring to a boil and boil for 3 minutes. Immediately pour over saltines and spread t cover crackers completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F (205 degrees C) for 5 to 6 minutes. Remove from oven and sprinkle chocolate chips over the top.  Let sit for 5 minutes. Spread melted chocolate and top with chopped nuts. Cool completely and break into pieces.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Chocolate Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tracy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.68254990341275,
            "ratingCount": 1553,
            "itemReviewed": "Saltine Toffee Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "150.2 calories",
            "carbohydrateContent": "15 g",
            "cholesterolContent": "13.9 mg",
            "fatContent": "10.2 g",
            "fiberContent": "1 g",
            "proteinContent": "1.3 g",
            "saturatedFatContent": "5.3 g",
            "servingSize": null,
            "sodiumContent": "73.4 mg",
            "sugarContent": "11.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-23T05:48:17.887Z",
                "reviewBody": "Wow! I was surprised at how good these are! Some tips: I used an 11x17\" jelly pan. Line the bottom & sides with foil & lightly spray the foil with non-stick spray. Generally, sticking is not a problem but I did have a problem with the foil stuck in the toffee where I had a seam in the foil. (I probably should have folded the two pieces of foil together instead of just overlapping them.) DO NOT use a pan with no sides. You don't want this stuff boiling all over in your oven. Feel free to cover the entire bottom with saltines. (If you use only the 4oz package, they will spread throughout the whole pan anyway as they boil in the oven.) Also, before you start timing the 3 minute boil, make sure it's truly boiling. Start timing once you see bubbling foam all around the edges. When you pour the boiled sugar mixture, don't worry about getting every section of the salines covered. Once you put it in the oven, it boils like crazy so the entire cracker gets covered. Finally, I think the milk chocolate chips would have been better than semi-sweet. (I love Swiss Colony toffee!) This is almost as good except I get to take credit for it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2217798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-29T00:58:02.673Z",
                "reviewBody": "Pretty good!! Here's my suggestions:  Bring to a boil on medium high and then allow to boil for the full 3 minutes without stirring.  Space the crackers so they have some gaps between them.  When the chocolate is put on, spread it with a spatula as if you were frosting each, then place in the oven for another minute to melt more, then add nuts.  Let the cookies sit for about 20 minutes at room temperature and then break apart (they will not be set up all the way) into the individual crackers.  Trim the edges with a knife and save the crumbs for ice cream or next time.  Finally, let them chill for awhile in the freezer before storing.  This way they come out looking nice enough to present--but they taste great no matter how you do it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TALK2TRAVIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1227196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T01:34:33.53Z",
                "reviewBody": "Very good! I used the saltines with the unsalted tops (not unsalted saltines, just no salt on the tops). You probably need a little salt to give the flavor contrast. Crisp, buttery, toffee-y (not a word) flavor. The chocolate and pecans put it over the top. To the cooks that had gooey results, you may not have boiled the mixture long enough, or, baked it long enough for that matter. Also, DO NOT STIR when it's boiling. I really think you do need to use DARK brown sugar for that true toffee taste. Piece-o-cake recipe, makes a lot for a little $$$, and people will be surprised when you tell them (if you do ;-) that you made it with saltines. Be sure to line a cookie pan with sides (jelly roll pan) with foil, and spray with a non-stick (I used butter flavor) spray prior to laying the saltines down. Easy clean up, and great for gift giving. You could also use almonds for that true toffee experience. I toated the pecans lightly beforehand. A treat to satisfy that simultaneous cookie/candy craving (read: Twix bar). Thanks, Tracy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jw81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/433659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-30T01:30:57.06Z",
                "reviewBody": "I needed to take cookies to a COOKIE EXCHANGE that we were having with our office staff today.  I saw these cookies, the reviews were great and they seemed novel and very fun to try.  Well, to make a long story short, I made them WITHOUT the saltines.  FIRST, I mixed 5 cups of miscellaneous ingredients -- Cherrios, Rice Chex, Pretzels, Raisins, Mixed Nuts, and Coconut spread out in a shallow layer on my cookie sheet.  Then I proceeded exactly the way the rest of the recipe said.  They were absolutely fantastic and everyone gobbled them down.  A little salty and a little sweet.  This would be a perfect basic recipe to use up all the bits and pieces of ingredients that you have in the cupboard.  Tastes different each time!  So all in all this recipe is a keeper.  It is yummy and versatile at the same time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANORBOOKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1409595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T17:49:52.92Z",
                "reviewBody": "This has just been the hugest hit in our family.  My daughter stole it from me, and now her husbands family is crazy over it.  We played around a bit too.. we did two batches of the carmel sauce - made a layer of saltines, poured it over, sprinkled toffee chips, layered another saltine, poured the rest of the carmel, baked it 5 minutes, then sprinkled ghhiradelli's semi-sweets and cashews.  When the chocolate was warmed, started in one corner and swiped back and forth in zigzags.  It made the most beautiful presentation.  At our get-together with friends, my two batches were the only empty dish at the buffet. ;)  *Just wanted to add that we used Reynolds Release foil, worked a charm.  Awesome Tracy, thank you so much for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATJENKINS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/90129/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-27T20:29:15.13Z",
                "reviewBody": "DO NOT STIR THE BUTTER AND BROWN SUGAR WHILE IT BOILS!!!!!!  I have never made toffee before and I didn't know this.  It really should say this in the recipe because they don't turn out like toffee skor bars...more like carmel.  They are chewy.  I was so disappointed that after I read reviews and realized not to stir the butter and brown sugar (I stirred it a lot, afraid it would burn) I decided to make another half batch just to make sure that was the problem.  I also baked them for 7-8 minutes compared with my 4-5 on the first batch.  THEY ARE INCREDIBLE, AS LONG AS YOU DON'T STIR!!!!  I wish I had known.  These taste like Skor candy bars.  I sprinkled just a tiny bit of finely crushed pecans on top and they are delish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KISSTHECOOKAGAIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1010955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-03T01:23:26.2Z",
                "reviewBody": "These were excellent!!  No joke.  My son and his friend thought they were from See's.  I used light brown sugar and no nuts.  I used an entire sleeve of saltine crackers; I lined the baking pan with half the crackers and crushed the remainder in my hands and sprinkled them over the whole crackers.  I did this because of some of the reviews I had read about these being a little greasy.  The additional thickness of the crackers soaked up the butter perfectly.  Next time I will probably crush all the crackers, so they are easier to cut into a variety of shapes.  I will absolutely make these again and again.  They were AWESOME!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sunny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/624114/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-25T01:15:39.45Z",
                "reviewBody": "So easy and addictive!  I used a 9x13\" non-stick pan and used only 3/4 cup light brown sugar and 3/4 cup butter.  I tried 1/2 cup each, but it didn't create enough of the toffee layer.  After spreading the chocolate chips I let it harden at room temperature.  It takes about 2 hours and then I use a metal spatula to cut the bars.  I tried putting them in the fridge the first time I made them, but when I started cutting them, the chocolate layer separated from the toffee layer.   Then when I'm done cutting them, then I put them in the fridge.  Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-23T04:56:19.133Z",
                "reviewBody": "I am begged to make these every year! Kids, neighbors, coworkers etc. I have read the reviews and have picked up some helpful tips. Here are my 2 cents.I use Heath Bar chips (instead of pecans) on mine and it takes it to another level. I make about 10 pans of this every Holiday.\n\n!. Must have non stick foil wrap. YES NON STICK KIND.\n\n2. Use your timers!\n\n3. Don't touch the butter and brown sugar mixture once it starts boiling. Boil for three minutes.\n\n4. I use heath bar chips (located in baking aisle)Once the mixture comes out of the oven I sprinkle them over the bubbling mixture and then put back into the oven for 2 mins. \n\n5. Then I take it out and sprinkle the semi sweet chocolate chips on it aprox. 1 cup. Let it sit on there for two minutes or so and when soft I spread it around. I used to put the chocolate chips on then put back into the oven and for some reason it makes them hard to spread. Just let the heat of mixture soften them.\n\n6. Buy a silicone spatula. It does make a difference\n\n7. Let it sit out for at least 30 mins before putting in fridge. This lets it absorb into the cracker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "youshigal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4173109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T22:52:04.373Z",
                "reviewBody": "I must have done something very wrong.  I was so disappointed with the way these turned out after reading all the five star reviews.  It tasted and looked just like a saltine cracker with chocolate and nuts on top.  If they are done right, are you supposed to recognize the cracker on the bottom?  Mine looked like a saltine cracker with all its little holes and ridgey edges.  What did I do wrong?  I don't think I'll waste the butter, chocolate and especially the nuts on these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DONNA36",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/973580/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Saltine Toffee Cookies",
            "description": "These easy cookies make a great snack or holiday gift.",
            "uploadDate": "2014-12-04T18:33:23.030Z",
            "duration": "PT2M1.755S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff60e7726-d054-43e5-9a86-131874e0b75e%2Fd5b74eda-8a76-435e-a649-d3753ac29a2e%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3923935866001"
        }
    }
]