[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11964/veggie-lasagna-florentine/",
        "name": "Veggie Lasagna Florentine",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F939621.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-03-10T05:15:19.000Z",
        "description": "This is a recipe I created for my vegetarian sister-in-law after she ran the Marine Corp Marathon in Washington, DC. I was not able to be there to cheer her on so I sent this dish. It is actually better the next day but I have never been able to keep my family out of it once they smell the aroma!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H25M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (16 ounce) package lasagna noodles",
            "2 tablespoons olive oil",
            "1 onion, chopped",
            "1 (8 ounce) can sliced mushrooms",
            "2 tablespoons minced garlic",
            "1 zucchini, finely chopped",
            "2 (28 ounce) cans crushed tomatoes",
            "1 (6 ounce) can tomato paste",
            "1 tablespoon dried oregano",
            "1 pinch brown sugar",
            "salt to taste",
            "1 (10 ounce) package frozen chopped spinach, thawed ",
            "1 (16 ounce) container nonfat cottage cheese",
            "2 eggs",
            "3 tablespoons dried basil, divided",
            "¼ cup grated Parmesan cheese",
            "1 pound shredded mozzarella cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook lasagna noodles in a large pot of lightly salted, boiling water for 10 minutes, or until al dente. Rinse with cool water, drain, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium heat. Cook the chopped onions, mushrooms, garlic, and zucchini in the oil until soft. Stir in both cans of crushed tomatoes, tomato paste, oregano, brown sugar, and salt to taste. Reduce heat to low, and simmer for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, microwave frozen spinach until cooked. Cool, and then squeeze out excess water. Drain cottage cheese. Using a mixer, blend spinach, cottage cheese, eggs, and 2 tablespoons basil until smooth. In a separate bowl, combine shredded  mozzarella cheese and grated Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Spread 1 cup sauce in the bottom of a 9x13 inch baking dish. Layer 1/3 of the noodles, 1/3 cottage cheese/spinach mixture, 1/3 of remaining sauce, and 1/3 cheese mixture. Repeat layers with remaining ingredients. Sprinkle top with remaining 1 tablespoon of dried basil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 60 minutes. Let stand for 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Denise Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5514018691588785,
            "ratingCount": 214,
            "itemReviewed": "Veggie Lasagna Florentine",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "374.8 calories",
            "carbohydrateContent": "47.3 g",
            "cholesterolContent": "58.3 mg",
            "fatContent": "11.2 g",
            "fiberContent": "6.4 g",
            "proteinContent": "25.1 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "802 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-28T02:12:52.56Z",
                "reviewBody": "Oh yes!  This one tasted great and we just loved all the veggies!  Do be aware, though, that it will take MUCH longer than 20 minutes for the prep time.  I made the sauce one evening and then refrigerated it.  The next evening, I assembled the lasagna and refrigerated that.  The third day I finally baked the lasagna.  I simply didn't have all of that time in one block to do the whole thing.  The homemade sauce was great and fully worth that amount of chopping and cooking time.  I made these changes: 1) just spray a little olive oil on the pan instead of using a whole 2 Tbsp. 2) used 8 ounces of fresh mushrooms instead of the canned. 3) omitted the brown sugar. 4) added about 1/2 tsp of red pepper flakes to the sauce. 5) used 16 oz of ricotta instead of cottage cheese. 6) DIDN'T BOIL THE LASAGNA NOODLES!  This was definitely a hit!  By the way, if you've never made lasagna using the no-boil method, you really should give it a try.  Such a time saver and then you don't end up with wiggly, slippery, tearing wet noodles to handle.  Just make sure they are layered next to one of the wet ingredients (mine were right on top of the sauce layer) and they are perfect when the baking is done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JMLANGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16002/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T22:31:44.443Z",
                "reviewBody": "I really found all the other reviews of this fantastic recipe really helpful in adapting it to the way we like to eat. Some advice... 1) Triple the amount of garlic. Come on let's live a little. My guests loved that this was so flavorful. 2) Use fresh spinach and fresh mushrooms. I steamed the spinach with a little salt and it worked out fabulous 3) I used a can and a half of crushed tomatoes. Several of the other reviews advised using only one which is up to you. 4) I used lowfat ricotta instead of cottage cheese - much better Finally I sprinkled a little olive oil on the top of the lasagne and I got this wonderful crust. Thanks to everyone who shared their thoughts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LHSZABO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/859252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-06T06:32:26.937Z",
                "reviewBody": "I have been looking for a good vegetable lazagna recipe for a long time and this one was great. The homemade red sauce is a little time consuming but definately worth it. I added an additional 2T of garlic 2T of itilian seasoning and 1T of onion powder to give it more flavor. I also used low fat cottage cheese and whole wheat noodles to make it even healthier. In order to prevent it from being runny I only partially cooked the noodles so they absorbed the additional fluid while cooking. My husband and his friends loved it they didn't mind that it was meatless.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEENA HALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-24T21:28:30.967Z",
                "reviewBody": "This is a great recepie if you are not afriad to tailor it to your tastes- I did away with the \"Sweet\" in the sauce and replaced the sugar with red pepper flakes and I used yellow squash as well as zucchini in the sauce. I agree with the other reviewer who has used the sauce recepie again- I had too much sauce left over the last time I made this recipe and so I saved it and used it like a primavera sauce later in the week with all those extra lasagna noodles (only make half a box!!)! All in all a great healthy alternative to typical lasagna!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARBARA A.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/582972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T22:30:38.18Z",
                "reviewBody": "This proved to be a very tasty recipe. However it only makes 12 servings at best not anywhere near 24 servings as the recipe states. I substituted 15 oz of ricotta cheese instead of cottage cheese. I also used fresh spinach leaves instead of frozen and just placed them on top of the ricotta cheese mixture. I served this at a pot-luck last night and it got very good review. I definitely recommend it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WAXRTIST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26604/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T07:25:18.343Z",
                "reviewBody": "My first attempt at a meatless lasagna and it was delicious. I made a few small changes - like others I did not cook the noodles I used pre-cooked no boiling required (the only way to go). I halved the recipe as cooking for two. I used Fresh mushrooms added a carrot and chopped all vege's very finely using the chopping attachment of my blender. The sauce came out looking like meat sauce as the veges were cut up fine and cooked quicker. DH raved about it and we are looking forward to the leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathietay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/214767/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-13T18:42:02.747Z",
                "reviewBody": "Made this recipe for a vegetarian friend of mine right after she had a baby. Her family loved it and asked for the recipe. I made it in two 8x8 pans and then froze them. Once frozen I put them in foodsaver bags so they could store them and eat them when they were ready. She said the one she ate the night she came home was delicious and two weeks later the second was just as good. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeannette H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jeannetteh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-20T15:31:10.59Z",
                "reviewBody": "Excellent! I was looking for a healthier alternative to my 1000 calorie original lasagna recipe and this one was no disappointment. I was afraid that the spinach or zuchini might over power the dish but the flavors blended together nicely. The only change I made is that I didn't have enough tomatoes (or enough room in my pan) for the 2- 28 oz cans so I ended up using 1- 28 oz can and 1- 14 oz. It wasn't dry at all. That and I saved some mozzarella to top it off and covered it with foil while baking. My kids were a little hesitant because they could see the spinach (I told them it was parsley;) but they ended up finishing it without complaints. It has 8 WW points if you're counting. Delish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JCHESLEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/878049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-29T20:10:40.653Z",
                "reviewBody": "Very tasty recipe. I used at least double the garlic and substituted green pepper for the zucchini as that is what I had on hand. You may want to drain some of the juice off one of the cans of tomatoes. I did and it still boiled over my pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pamjlee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/42276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-20T18:34:24.393Z",
                "reviewBody": "I'm sorry I don't like to give negative reviews but I didn't care for this recipe. The spinach filling was too sparse and the tomato sauce was overpowering. Maybe cooking it longer than 15 minutes and increasing the spinach filling would have helped. Also the veggies in the sauce almost disappeared. I might make it again with these changes. Thanks anyway.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Phyllis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1648726/"
                }
            }
        ]
    }
]