[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/213/salad/green-salads/",
                    "name": "Green Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14252/asian-chicken-salad/",
        "name": "Asian Chicken Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4005100.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "1999-08-24T09:58:44.000Z",
        "description": "A perfect salad for leftover BBQ, boiled, broiled or baked chicken. A very crunchy salad with a tasty sweet Asian-style dressing.  The kids love it too! The Chinese rice noodles are of the cellophane type and can be found in the Asian section of most grocery stores. They are often in rectangle form and in clear packaging.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons brown sugar",
            "2 teaspoons soy sauce",
            "1 tablespoon sesame oil",
            "¼ cup vegetable oil",
            "3 tablespoons rice vinegar",
            "1 (8 ounce) package dried rice noodles",
            "1 head iceberg lettuce - rinsed, dried, and chopped",
            "4 boneless chicken breast halves, cooked and shredded",
            "3 green onions, chopped",
            "1 tablespoon sesame seeds, toasted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare the dressing 30 minutes ahead of time by combining the brown sugar, soy sauce, sesame oil, salad oil, and rice vinegar in a salad dressing carafe.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To prepare the Chinese rice noodles, heat a skillet with a few tablespoons of oil and break off a little bit of the noodles and add them to the skillet and fry them. They will puff up in the skillet, so only add a few at a time. As they begin to puff up, remove and drain them on paper towels. Be sure to cook long enough as the under cooked noodles will be like eating needles. Once cooked, add them to the salad mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl combine the iceberg lettuce, cooked and shredded chicken, green onions and  toasted sesame seeds. Let chill about 10 minutes,  and just before serving add the cooked rice noodles. Serve in salad bowls and offer the dressing in a pourable container so your family can add as much dressing as they want. You can also pour the dressing over the top of the salad, toss, and serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Green Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "D"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.638126009693053,
            "ratingCount": 619,
            "itemReviewed": "Asian Chicken Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "413.6 calories",
            "carbohydrateContent": "39.2 g",
            "cholesterolContent": "55 mg",
            "fatContent": "18 g",
            "fiberContent": "2 g",
            "proteinContent": "22.7 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "224.6 mg",
            "sugarContent": "6.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-10-28T04:48:12.853Z",
                "reviewBody": "This is absolutely one of my favorite salad recipes! I have made this many times and tweek this depending on what I have on hand. I usually shred one carrot, add some celery, cucumber, cilantro, bean sprouts, mandarin oranges, and fresh button mushrooms. The fried noodles found in a can are easier than frying your own... or sometimes I add some slivered almonds to add a bit of crunch. Also, instead of using iceberg, I prefer to use romaine/spinach or a spring green mix. The dressing is absolutely delicious but I usually halve the amount of oil used in the recipe to make it healthier; doesn't make a difference!  I've made this both with seasoned and unseasoned rice vinegar and I prefer the seasoned one in this recipe. Definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rosanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2046822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-14T15:26:51.653Z",
                "reviewBody": "Great!  Here is what I did differently.  For my greens I used a head of Napa cabbage and a head of romaine chopped well.  I added in a lot of thickly shredded carrot, some chopped red bell pepper, chopped sugar snap peas, and cilantro.  I toasted some slivered almonds and used instead of sesame seeds.  I prepared the rice noodles as written because I couldn't find the prepared ones other reviewers had mentioned and don't care much for the canned chow mein noodles.  I'm not sure it is worth the effort and the salad would be fine without them as long as you put almonds in for the crunch.  Here is the real time saver.  I bought a rotisserie chicken from Safeway and pulled the meat off the bone and shredded it up into a bowl.  I doubled the recipe for the dressing, adding a bit less vegetable oil than called for, and used half of it to mix into the shredded chicken and let it sit in the fridge for a couple of hours marinating until I prepared the salad.  This made the chicken taste incredible!  I mixed everything together in a big bowl except the rice noodles and dressing and when we got to the pot luck I mixed it all together. Fantastic dressing recipe and you can make the salad to suit your taste.  I recommend chopping everything into small pieces so you can get a little of everything in every bite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-28T16:21:44.06Z",
                "reviewBody": "Yum!  The dressing is a dead-ringer for the ones used on Wendy's Mandarin Chicken Salad and also the asian chicken salads served at Chili's, Houston's and Panera Bread.  It seriously should be printed in one of those \"secret restaurant recipes revealed\" cookbooks.  Follow the exact recipe and you will not be disappointed.  The only change I would make is...do not fry your own noodles, as suggested.  It's a mess and not worth the effort.  Look for pre-made fried, rice noodles (La Choy brand) in your asian food section at the grocery store.  Pre-made crispy, wonton strips also work well.  Also, though it's listed as \"optional,\" you should include the sesame oil.  It gives the dressing a rich, but subtle, nutty flavor. Sliced water chestnuts, a little cilantro and mandarin orange segments also add more interest to the plain salad greens.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dino II",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/837568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T00:29:14.02Z",
                "reviewBody": "Delicious dressing!  For convenience, I substituted a small can of chow mein noodles for the rice noodles, which eliminated Step 2 of the recipe.  Instead of the toasted sesame seeds, I used slivered almonds. I added mandarin oranges.  This is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-26T01:15:32.78Z",
                "reviewBody": "Thank you, Jill! I have searched for the perfect Asian dressing for my variation of this salad, and I will forever use your recipe! This is my all-time favorite salad! This recipe is GREAT as is, but here's what I do differently: For my greens, I use a combination of Napa cabbage, romaine lettuce, and iceberg lettuce. I use broken up Ramen noodles instead of the rice noodles, and I don't saute' them or anything - just straight out of the wrapper and break them up. I usually marinate my chicken in soy sauce or a bought Asian marinade. I also add toasted almonds, which is my favorite part! I mix the greens, green onions, and chicken together and store separately from the ramen noodles, sesame seeds, and almonds to keep them crunchy the next day, if there are leftovers that is! Awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIEANN3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1081968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-28T20:32:13.39Z",
                "reviewBody": "This is a 5 with a few changes. Must add a good shake of Garlic powder and ground ginger. Also, I added a bit of white wine vinegar in addition to the rice vinegar, cut back a little on the super sweetness. I made mine with napa cabage and spinach leaves, grated up  carrots, cucumber, chow mein noodles, and added cashews as I didn't have almonds, also added the seeds. My chicken I had already boiled the night before, so it was cold, I tore it in chunks and soaked it in some of the dressing before adding it to the salad. FANTASTIC!! Tip: when mixing dressings add all the ingrediants together before adding the oil, allows the flavors to meld better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariah Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1488109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-07T02:19:42.74Z",
                "reviewBody": "This recipe has great flavor but the 1/4 cup of vegetable oil is too much. Cut back the oil to 3 tbsp and you will still retain the great flavor. I love the multiple variations that you can build on to make it unique to one's family. Thanks for the submission!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-07T09:32:40.53Z",
                "reviewBody": "Amazing Taste!  Restaurant quality.  Will make again and again.  Be sure to make extra dressing.  It's delicious.  Be sure to let dressing stand for 30 minutes.  The dressing doesn't taste as good, any sooner than 30.  I bought chow mein noodles (instead of rice noodles) and added mandarin oranges in the can.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UCOOLPSYCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/591067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-17T22:40:07.73Z",
                "reviewBody": "DISASTER! How are you supposed to cook an entire package of rice noodles \"a little bit at a time\" with 2 TBS of oil?? I kept adding oil but the noodles never \"puffed up\" and I had noodle twigs all over the kitchen even in my hair. My dear husband came in and opened the doors and windows to let out all the smoke but they were still the needles that you get when you don't cook them \"long enough.\" Is 5 minutes long enough? 20 minutes? \"A bit at a time\" and I would have been cooking those stupid rice noodles for 2 hours. We aren't picky eaters; my husband is game for anything but we picked out the chicken chunks and the rest went in the compost. Later a friend pointed me to the eHow article on How to Fry Rice Noodles which would have been very helpful. For instance put an INCH of oil in the pan not two tablespoons! http://www.ehow.com/how_2150226_fry-rice-noodles.html",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen Etc.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6022168/"
                }
            }
        ]
    }
]