[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14692/caramel-apple-pork-chops/",
        "name": "Caramel Apple Pork Chops",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3787920.jpg",
            "width": 3404,
            "height": 4500
        },
        "datePublished": "1999-09-23T02:19:31.000Z",
        "description": "Warm, spicy, and sweet, this wonderful Fall recipe is a guaranteed favorite for kids, and is great with smashed potatoes and buttered green beans.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 (3/4 inch) thick pork chops",
            "1 teaspoon vegetable oil",
            "2 tablespoons brown sugar",
            "salt and pepper to taste",
            "⅛ teaspoon ground cinnamon",
            "⅛ teaspoon ground nutmeg",
            "2 tablespoons unsalted butter",
            "2 tart apples - peeled, cored and sliced",
            "3 tablespoons pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 175 degrees F (80 degrees C). Place a medium dish in the oven to warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat. Brush chops lightly with oil and place in hot pan. Cook for 5 to 6 minutes, turning occasionally, or until done. Transfer to the warm dish, and keep warm in the preheated oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine brown sugar, salt and pepper, cinnamon and nutmeg. Add butter to skillet, and stir in brown sugar mixture and apples. Cover and cook until apples are just tender. Remove apples with a slotted spoon and arrange on top of chops. Keep warm in the preheated oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Continue cooking sauce uncovered in skillet, until thickened slightly. Spoon sauce over apples and chops. Sprinkle with pecans.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.455291222313372,
            "ratingCount": 2438,
            "itemReviewed": "Caramel Apple Pork Chops",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "262.2 calories",
            "carbohydrateContent": "17.1 g",
            "cholesterolContent": "47.6 mg",
            "fatContent": "16 g",
            "fiberContent": "2.2 g",
            "proteinContent": "13.8 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "27.4 mg",
            "sugarContent": "14 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-27T02:38:01.577Z",
                "reviewBody": "I first grabbed this recipe in 2003 and have been making it ever since. I have made a few alterations/shortcuts I thought others might like to know. 1) I throw the chops in a marinade overnight of 2x apple juice to soy. The sweet and salt help make the chops even juicer. 2) I always make at least double if not 4 times the sauce or there is arguing... :) so when time is short or I just don't feel like peeling all those apples, I buy 2 cans of the higher priced pie filling and put that in the frying pan used for browning with a stick of butter.(scrape up the good bits.) It usually has the right amount of spices built right in so I just heat through. Arrange over top the chops in a baking pan. Bake covered in foil at 350 for 20-25 minutes. Remove foil - sprinkle with brown sugar and chopped pecans - bake 15 mins more for carmelize and crunch. DELICIOUS! Pairs great with butternut squash or sweet potatoes and corn or green beans. Homemade honey wheat bread is sure to disappear. I pour all pan juices over the servings for mopping. Every year when the weather turns cold here, the family starts asking \"Is it time for apple pork chops??\" :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Terri Walton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/262947/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T23:05:08.303Z",
                "reviewBody": "I was nervous after reading some of the reviews, whether or not to bake the chops in the oven or cook them in a pan as the recipe states. After talking to my butcher, I decided to bake them. I first tripled the sauce, and left it to simmer on the stove, covered, for about 30 minutes...I also added about 1 tbsp of cornstarch to the sauce to thicken it. I then poured the sauce over the pork chops in a covered casserole dish and baked it all at 350 degrees for about 30-45 min. It came out wonderful! It was so tender; everyone loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KJFABER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/438689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-18T17:23:23.373Z",
                "reviewBody": "This is one of my husband's & kids' favourites.  I broil the chops in the oven instead (usually 5-6 minutes per side) and cook up the apples on the stovetop so that everything is ready at the same time. Granny Smiths seem to work best.  I don't use the oil, salt, pepper, or pecans. I just throw the sauce ingredients into the pan instead of premixing them in a bowl and slice the apples right into the pan. I don't waste time coring them.  I just take thin slices off all around the sides till I get to the core. I let it all thicken together instead of separating the apples from the sauce. Less steps& less dirty dishes with these shortcuts! We have it with steamed rice. Quick & Easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MRS.SWEET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/682940/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-18T17:26:09.843Z",
                "reviewBody": "This was the tastiest and an easy way to make pork chops! I made some changes after reading some of the reviews. I sauteed a sliced onion in the butter then added the sauce ingredients (doubled) & the apple. I added salt pepper and garlic to the raw chops placed them in a 9x13 pan topped them with the sauce and baked at 350 for an hour. I made 2 batches of this since we were having dinner guests...they cancelled so 8 pork chops disappeared amongst 3 of us! Hey 1 is a teenage boy that usually won't eat pork chops. That's how good they are!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBBLES100",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-18T17:24:42.03Z",
                "reviewBody": "Per previous reviews I doubled the sauce but not the apples. I also followed another recommendation and put the cooked pork chops in a 13x9 pan and then poured the sauce and apples over top and baked them for 1/2 hr. This allowed me time to make the side dishes and have everything ready at the same time for dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T23:35:32.92Z",
                "reviewBody": "FABULOUS! Of course with the alterations I made I might as well submit a new recipe but here is what I did. Forget the whole \"oven thing\" and use 2 skillets one for the chops and one for the apples. For the chops I marinated them in salt pepper 1 TBL minced garlic and about 1/4 c. sauterne (white) cooking wine for only about 15 minutes. I then sauteed them while making the sauce. For the sauce I sauteed 2 small onions in butter until carmelized. Then added the other sauce ingredients -doubled (except apples). I just cooked that till tender and thought it needed some more \"juice\" so I added about 1/4 c. of apple cider then a pinch of cornstarch to thicken. Served chops over brown rice and sauce over chops died and went to heaven. Also picky boyfriend loved it;-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSREDKITTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/581831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-04T15:43:56.687Z",
                "reviewBody": "Just okay. Not crazy about apples and pork but definitely had to try it as it looked interesting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-05T16:58:39.543Z",
                "reviewBody": "These were fabulous. My husband said they have usurped his old favorite for the best pork chops dish EVER! I made 6 chops but made enough sauce for 20. I sprinkled the chops w/ Paula Deen's house seasoning & sauteed them in butter & olive oil. Then I pretty much followed LadyJayPee's lead & sauteed an onion in the butter first addng the apples ( I used 4 granny smiths) but only cooking them for a couple of minutes. I also added a couple of tbp. of apple cider vinegar to add a little more depth to the sauce. Then I poured everything over the chops covered them & baked @ 350 degrees for about 30 minutes. Removed the foil & baked for another 10. Remembered just now that I never added the pecans to the dish so if you don't have any...never fear this dish is great w/out them. Srved them as suggested by the submitter w/ smashed potatoes & green beans w/ Raspberry White Chocolate Mousse in chocolate cups for dessert. Thansk for a wonderful recipe Karena...will have again many times!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-29T22:44:03.873Z",
                "reviewBody": "My husband said This is worth 10 stars and how many times have you heard me say that? The answer is Never. My picky 16 y.o. took one bite and said This is the best thing I have ever eaten. Her friend said she didn t like pork but would eat the rest of my meal. I told her she had to have one bite. She ended up eating a whole chop and said My mom s pork chops never taste like this. I did Brine my chops for 12 hours in 1qt apple juice cup kosher salt and cup brown sugar. I always do this - it truly makes all the difference if you want moist chops. Followed other reviewers - tripled the sauce and added a shot of Bourbon (YumO!!!). I used an apple slicer (8 pieces per apple) and I used 4 apples for 4 1 1/2 thick chops. I browned the seasoned chops on both sides placed them in a casserole dish poured the apple/sauce mixture on top and baked them at 425 for 20 minutes (internal temp 160). I served these with a brown rice pilaf and roasted broccoli.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1898736/"
                }
            }
        ]
    }
]