[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14730/herbed-pork-and-apples/",
        "name": "Herbed Pork and Apples",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7778266.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-10-04T00:38:41.000Z",
        "description": "Whenever I make this roast for company they always ask for the recipe. I have also made this with a pork tenderloin and it comes out great!",
        "prepTime": "P0DT1H20M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT10H50M",
        "recipeYield": "14 servings",
        "recipeIngredient": [
            "1 teaspoon dried sage",
            "1 teaspoon dried thyme",
            "1 teaspoon dried rosemary",
            "1 teaspoon dried marjoram",
            "salt and pepper to taste",
            "6 pounds pork loin roast",
            "4 tart apples - peeled, cored, cut into 1 inch chunks",
            "1 red onion, chopped",
            "3 tablespoons brown sugar",
            "1 cup apple juice",
            "⅔ cup real maple syrup"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine the sage, thyme, rosemary, marjoram, salt and pepper. Rub over roast. Cover, and refrigerate roast for 6 to 8 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place roast in a shallow roasting pan, and bake in the preheated oven for 1 to 1 1/2 hours. Drain fat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix apples and onion with brown sugar. Spoon around roast, and continue to cook for 1 hour more, or until the internal temperature of the roast is 145 degrees F (63 degrees C). Transfer the roast, apples and onion to a serving platter, and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the gravy, skim excess fat from meat juices. Pour drippings into a medium heavy skillet. Stir in apple juice and syrup. Cook and stir over medium-high heat until liquid has been reduced by half, about 1 cup. Slice the roast, and serve with gravy.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PMCHAPMAN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.618473895582329,
            "ratingCount": 249,
            "itemReviewed": "Herbed Pork and Apples",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "357.8 calories",
            "carbohydrateContent": "21.3 g",
            "cholesterolContent": "79.1 mg",
            "fatContent": "21.1 g",
            "fiberContent": "1.2 g",
            "proteinContent": "20.4 g",
            "saturatedFatContent": "7.8 g",
            "servingSize": null,
            "sodiumContent": "29.1 mg",
            "sugarContent": "18.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-30T12:58:52.537Z",
                "reviewBody": "I have made this 4 times now and it always gets rave reviews. I use a pork tenderloin roast and prepare it the day before. I rub it with all of the herbs and spices (salt pepper fresh garlic) and then wrap it up tightly in plastic wrap and keep it in the frig for about 24 hours. I let the roast cook for about 45 minutes then add the apples and onions and let it cook for another hour to an hour and a half. I do use a meat thermometer. I spoon the apples and onions into a serving dish put the roast on a platter and then put the roasting pan on the stove and make the gravy right in that so that I get all of the drippings/flavor. In addition to the listed ingredients I add a package of brown gravy mix and it works just great. I always think I will have left overs but there is rarely enough left for a second meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARMALA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/198667/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T12:51:37.147Z",
                "reviewBody": "Michelle this recipe is FABULOUS!! I cooked it today for 8 guests and they were so impressed!! The flavors were wonderful I did marinate it overnight and the only change I made was to the gravy...I too added a pork based gravy mix to the drippings Juice and syrup this thickened and extended it. I also doubled the gravy portion knowing that my guest were big on gravy...so glad I did they loved it!!! Contrary to what some people said no one thought the gravy was too sweet might have something to do with the brand of juice and syrup one uses. Anyway I could go on but just wanted to thank you for helping me out with a very successful dinner party. Jan",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANBUZZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/148301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-23T22:13:00.59Z",
                "reviewBody": "My family loved this! I did have to change it a little. I didn't want to cook it in the oven I wanted to do it in a slow cooker so I got out the frozen roast ( I used a Boston Pork Roast) and rubbed the seasonings all over it then put it in the slow cooker. Then let it cook for about 5 hours on low. Then added the apples onion and sugar and cooked 1 more hour. I made the gravy as directed. My family absolutly LOVED it! I will make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M_WHITE25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/747134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T12:59:30.6Z",
                "reviewBody": "Although the meat was very tender and tasted good this didn't live up to my expectations based upon prior reviews. I had no meat drippings left with which to make the gravy and my apples were so overcooked that they were practically mush.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T23:53:22.897Z",
                "reviewBody": "I used Pork tenderloin -I sprinkled the brown sugar apple juice and maple syrup over it when I added the apples and onion. It is more of a Juice/sauce then gravy but Ohhh sooo GOOD!!! Do Not change a thing - This recipe is Very YUMMY. DELISH!!!!!!!!! Thank you for the recipe PMCHAPMAN:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-15T02:07:50.28Z",
                "reviewBody": "This recipe makes a delicious savory roast; my family enjoyed this very much. Because we were pressed for time today and this evening I decided to omit the gravy/sauce entirely. I did rub the roast with the herbs salt and pepper and then let it sit overnight in the fridge. When I was ready to put the roast into the oven I chopped up the red onion and a big bunch of celery hearts put this on the bottom of the roasting pan and set the roast on top and then let this bake for one hour. Then I chopped up the apples thickly sliced three large yams and after stirring this mixture up with the brown sugar I arranged the apples and yams around the roast and then poured one cup of apple juice over all. The addition of the apple juice loosened all of the baked bits of carmelized onion and mixed with the drippings from the roast to make a wonderful sauce that I used for basting. I put the pan back in the oven for another two hours (only used a 4-pound pork loin roast) and afterwards enjoyed a terrific one-dish meal. Next time I'll make sure that I have enough time to make the sauce with the maple syrup as I am certain that must be quite delicious as well. Thank you for this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LEXI, JACK and COOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1361959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T12:52:50.193Z",
                "reviewBody": "I made this recently and like most everyone else says we found it exceptional. I didn't have the time (or patience) to marinate it overnight so just had the herbs on for a few hours...still tasted great. I used a bone-in pork loin roast and found that the second roasting only took about 40-45 minutes to get to 160º. Also mine didn't make much drippings so I didn't drain it or I wouldn't have had anything! Used sparkling apple cider rather than juice and as suggested added a packet of brown gravy mix. Made the gravy a bit thick so you may wish to consider adding more liquid. We all loved it...great for family and company alike.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin Seidel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/636468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-09T07:02:38.823Z",
                "reviewBody": "My family thought this meat was the bomb. I used a five pound hunk of meat and it was done in an 1 1/2 hours. I just covered the meat with foil. It kept the meat warm and allowed the inside juices to flavor the meat even more while the onion/apple mixture baked in the oven. My wife and son didn't care for the onion/apple mixture but they have very pedestrian pallets (don't tell them I said that). Their MAJOR loss. I thought it was insanely declicious. I also served Bavarian sauerkraut \"Garlic Mashed Potatoes Secret Recipe \" and some brown and serve rolls with brushed on melted butter and dried parsley (in the oven for a few minutes) on the allrecipes website--for wonderful compliments to this dish. The herb mixture was dead-on perfect! Nice one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-19T00:06:03.327Z",
                "reviewBody": "I love love love love love this recipe. It is AMAZING. It is GREAT reheated (as long as you pour some of the gravy over). I improvised and put all the liquids in with the loin while it was cooking. I drizzled all the maple syrup and juice over the pork stuck the onions and apples in with it as well and cooked it. The pork came out EXTREMELY tender it was a HIT. I can't rave about this recipe enough!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NAMVS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T12:50:11.25Z",
                "reviewBody": "I'm sorry but I have to say I was disappointed with this recipe. The familly all liked the herb rub on the pork roast but the gravy left a lot to be desired. The gravy was just too sweet and didn't seem to go well with the onions and apples. I was also disappointed in the way the onions and apples turned out. I had expected something a little more like the flavour of applesauce with the bite of onion for a twist. I will probably use the rub again but next time I will skip the onions apples and the gravy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LORNA MB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/772518/"
                }
            }
        ]
    }
]