[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/283/desserts/pies/vintage-pies/",
                    "name": "Vintage Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15853/my-grandmas-shoo-fly-pie/",
        "name": "My Grandma's Shoo-Fly Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1011446.jpg",
            "width": 1926,
            "height": 1930
        },
        "datePublished": "1999-05-15T14:44:11.000Z",
        "description": "Classic Pennsylvania Dutch recipe. Grandma's loving attention not included!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "1 (9 inch) pie shell",
            "1 cup molasses",
            "¾ cup hot water",
            "¾ teaspoon baking soda",
            "1 egg, beaten",
            "1 ½ cups all-purpose flour",
            "1 cup packed brown sugar",
            "¼ cup shortening"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Bottom Layer: In a medium bowl combine molasses, hot water, and baking soda. Stir well. Whisk in beaten egg. Pour mixture into pie shell.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Crumb Topping: In a medium bowl combine flour and brown sugar. Mix well, then cut in shortening until mixture resembles coarse crumbs. Sprinkle on top of molasses layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 minutes. Lower temperature to 350 degrees F (175 degrees C). Bake an additional 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Vintage Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "D. Stultz"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.907563025210084,
            "ratingCount": 119,
            "itemReviewed": "My Grandma's Shoo-Fly Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "455.4 calories",
            "carbohydrateContent": "83.4 g",
            "cholesterolContent": "23.3 mg",
            "fatContent": "12.5 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "2.6 g",
            "servingSize": null,
            "sodiumContent": "253 mg",
            "sugarContent": "50.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2002-12-29T19:06:09.247Z",
                "reviewBody": "Something in the instructions is missing, I followed all the instructions and had a mess. Other recipes I've come across say to add most of the crumb mixture into the mixture of molasses and then sprinkle the remaining crumbs on top of the pie.  When I put the crumb mixture on top of the molasses layer, it then all ran out of the pie shell. Please check to see if something is missing in the instructions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "BETTY CLUKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/562810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-18T17:49:34.457Z",
                "reviewBody": "I loved this recipe!  I was looking for a shoo fly pie recipe like the ones I grew up with in Pennsylvania, and this is authentic!  I used a 9 inch deep dish shell, and I still did not use all of the filling and crumbs.  If you do, it WILL spill over, and believe me, it's a mess.  I also think to get the right consistency, you need to alternate layering the crumbs with the filling, with crumbs on the bottom and the top.  Bake time was just right, even with the deep dish crust.  I let it cool 30 min. before digging in.  This pie is best served warm, but don't microwave it to reheat it.  Thanks for a recipe that I will make when I want some true comfort food!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kiliki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2290208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-21T21:15:15.463Z",
                "reviewBody": "My family is from PA, and my mother/granmother use to make this on ocassion.  I like to cook/bake, and have made it now several times.  Always trying to perfect it.  And, this is almost a perfect recipe too.  Those trying it for the first time.. you can vary the ingredients some.  The liquid part. So it doesn't overflow.  Use 3/4 cup molassas and 3/4 cup of water. Strength/bitterness will depend on the molassas (robustness).  The pie wont' taste so bitter if you use the lighter types. If you only have the robust, try using only 1/2 cup molassas and more water, or swap with 1/4 karo.  Some only use karo, but, you won't get the traditional flavor of a true shoefly pie.  You can also just do 1/2 cup M.. and 1 cup of water.  This will make it less robust, and prevent it from spilling over.  You will also get the the wet bottom if you sprinkle a little of the dry topping in first, then liquid, then more dry, etc.  I prefer this way, as it won't be too liquid on the bottom.  I also add a couple drops of cider vinegar to the liquid mix to give it a little more umph. But, only a few drops.  Again, if you are making/following this recipe, best if you use a slightly larger pie shell, or cut back some on the liquid...  Otherwise, it may overflow.  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shawn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4341440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-07T14:18:51.663Z",
                "reviewBody": "Alright, giving this recipe 1 star is really unfair.  I grew up in Lancaster County, and had many a shoo fly pie during my years of living there.  I can tell you this is exactly the way shoo fly pie should taste.  I did not alter anything, except I added a dash of nutmeg and of allspice into the crumb mixture.  I would maybe ad a little more butter to the crumbs next time.\n\nI guess I used what is considered a deep dish stoneware pie plate, because the amount was correct.  I had to be extremely careful putting the pie into the oven because it was sloshing around, but when it was baked it was firm but gooey, like it's supposed to be!\n\nThis is really a fail-proof recipe in my opinion, any beginning baker should be able to make it, especially if you don't make your own crust.  You have your layer of goo, then the crumbs you put on top sink into the goo, and stay on top as well.  The crumbs should cover the entire surface.  My pie came out perfect, with a gooey filling and a crunchy top!\nSo make sure you use a deep dish pie plate, and other than that you should have a real Pennsylvania Dutch shoo fly pie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John Stine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1318039/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-12T13:58:02.903Z",
                "reviewBody": "I have tried many recipes for Shoofly pie and have been disappointed.  This is the BEST Shoofly pie I have ever made or eaten.  The recipe works best w/ a 9\" deep dish pie crust. I would recommend to anyone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Richard Stiles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819872/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:57:37.013Z",
                "reviewBody": "The perfect Shoo Fly Pie!  I have searched high and low for a recipe that had just the right amount of \"goo\"!  This is it!  My family loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTINE HARRIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/266331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-16T13:54:59.613Z",
                "reviewBody": "I live smack in the middle of Amish country.  I followed the recipe and had no problems at all with over flow.  Crumbs do not need to be mixed in.  If you want a truly \"wet bottom\" shoo fly pie this is it. This recipe is comparable to the pies that are sold at the Farmer's markets in this area by the Amish and Mennonites.  Great recipe!!! Thanks.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mason & Tanner's Mimi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2490527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-17T04:41:14.46Z",
                "reviewBody": "I haven't had shoofly pie since I was a kid. And every year at Christmas time I crave it, but, haven't ever been able to get a recipe for it until now. Of course I looked for the easiest recipe, and came across this one. \nAs it was baking, the wonderful aroma swept me back to Grandma's kitchen. I could almost picture her tending the oven, making sure us girls didn't peak.\nThank you so much for posting this simple and so totally delicious recipe. I let it rest for about 10 minutes. That's all I could wait. I just had to dig in. My son and I have eaten half the pie already. And I made a 12in. deep dish pie. This is definately one of those comfort dishes and I will treasure this one always. Thanks again for the wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TEZERACT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/996341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-03T18:40:48.273Z",
                "reviewBody": "Perfect recipe!! there is nothing missing, it came out perfect and I am NOT a very good baker.  This recipe is slightly different from my old one but MUCH better, cakey and delicious.  I did exactly what the recipe said, you do NOT need to add the crumbs in with the liquid ingredients,or reduce the liquid at all!  just press the crumbs into the mixture when it's in the shell, and then I baked mine for the first fifteen...then before lowering the temp to 350, added the rest of the crumb on top. Perfect!!! For those who had a runny mess, just try that first before giving up, it is wonderful!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4306732/"
                }
            }
        ]
    }
]