[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17929/roccos-olive-bread/",
        "name": "Rocco's Olive Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5438660.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2000-01-28T22:30:54.000Z",
        "description": "Rocco's olive bread is a white, fluffy bread with a hint of garlic. Ooo la la!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT2H55M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 - 1 1/2 pound loaf",
        "recipeIngredient": [
            "8 ounces black olives, drained",
            "1 ¼ cups water",
            "1 ½ tablespoons butter, softened",
            "1 ½ tablespoons brown sugar",
            "¾ teaspoon garlic salt",
            "3 ¼ cups bread flour",
            "2 ¼ teaspoons active dry yeast"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select White Bread Setting; press Start.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rocco"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1923076923076925,
            "ratingCount": 26,
            "itemReviewed": "Rocco's Olive Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "141.6 calories",
            "carbohydrateContent": "24.1 g",
            "cholesterolContent": "3.1 mg",
            "fatContent": "3.3 g",
            "fiberContent": "1.3 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "230.3 mg",
            "sugarContent": "1.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-01T20:51:10.347Z",
                "reviewBody": "Skyere, don't let the lack of a bread machine deter you from making bread the old fashioned way. I don't own a bread machine, nor do I have any desire to. I do, however, have a KitchenAid stand mixer which helps with the kneading process. This is how I start out all of my breads no matter what the directions say.  I pour the warm water into the mixing bowl and then add the yeast and sugar and then stir. This particular recipe calls for brown sugar so I would go with that, but normally when a bread recipe calls for regular white sugar, I use honey instead. The sugar by itself or in the honey will help the yeast to proof. From there you can then add your butter, garlic, flour, garlic and olives. If you don't have a heavy duty stand mixer, you'll have to knead the dough for about eight minutes until it's smooth and elastic. Place the dough into a bowl with a bit of olive oil and coat. Cover the bowl with a clean kitchen towel and let it sit in a warm place until it doubles in size. (about an hour) Punch the dough down, knead for a few minutes and if you have the time, you can give it a second rise. Punch down again and shape dough into a loaf and place on a cookie sheet. Cover loaf and let rise again; about thirty minutes. I know it sounds like a lot of work, but it really isn't as bad as it seems. Plus I think it's so much more satisfying than throwing a bunch ingredients into a machine. Have fun!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-24T23:27:07.593Z",
                "reviewBody": "My 6 and 8 yr olds are clamoring for more of this bread. I used two small cans of sliced olives drained and I upped the butter to 2 tbsp and increased the garlic salt to 1 tsp. This bread was so good we were going back for seconds and our dog snatched it off the counter! That's the first time he's ever done that so I guess he'd give it a 5-star rating too. Am going to make this again tonight for our church small group. Thanks for the recipe; my only advice to the person who had their olives macerated would be to use whole pitted olives instead of the sliced ones. Or else make the bread by hand without the machine. This is an easy tasty recipe wonderful with melted butter. Updated 1/23/08 Used a cup of whole olives (pitted kalamatas and green olives) plus a can of drained sliced black olives for variety. Love this bread! Great warm with melted butter! Kids now ages 7&9 love it too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Johanna WISHES she were a",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1041860/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-01T16:28:37.67Z",
                "reviewBody": "when my machine said to addd the olives i needed to add more flour the olives made the dough very mushy. Turned out wonderful tho.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATHYANNH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/230096/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-18T15:23:41.807Z",
                "reviewBody": "So I made this bread today, & it was Awesome!! I made a couple of changes,but do not know if they made much of an impact.  I cut the butter down to a little less than a Tblespoon, melted it, and combined it w/extra virgin Olive oil to total 1.5 Tblsp. Then I sauteed 4 small cloves of fresh finely minced garlic in it. I combined that with 8 ozs. chopped, pitted Calamata olives. I let the olive/garlic cool before adding it to the flour and yeast mixture. I did not have a bread machine so I took the other reviewer's advice and used my dough hook and my Kitchenaid mixer. First I added 1 envelope of rapid rise yeast to the slightly warm water in the bowl along with the brown sugar. I let the yeast mixture get frothy before I added the flour. Also, since I did not use garlic salt, I added only 1/4 tsp of garlic powder to the flour and then added 1/4 tsp of salt, because I felt the olives added enough salt flavor. I have also had problems in the past with doughs not rising, I suspect due to the salt in the dough killing the yeast. I let it rise twice, and finally shaped it into a round loaf and baked it in a 375 degree F preheated oven for 30 min. I also threw 1.5 cups of ice cubes onto the floor of the hot oven at the same time I put the dough into the oven to create some steam while it baked. IT WAS DELICIOUS! Crusty on the outside, tender and wonderful on the inside. I highly recommend it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen Bancroft Ziegler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2763036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-24T18:11:43.853Z",
                "reviewBody": "Very good olive bread. For those who want directions on making bread by hand check out the Allrecipes article Bread Machine Baking: Tips for Experimenting. That should help you figure it out. I use my bread maker mainly for dough mixing and after making what seems like hundreds of loaves of bread I've learned a few things about breadmakers. 1: you can let it do it's thing but check periodically to make sure you have the correct ratio of liquids--sometimes you have to add flour sometimes more water. It all depends on the moisture content of the air at the time you are making the bread and 2: ingredients like cheese olives etc tend to get mangled to tiny bits by the beaters in the bread maker so add them at the fruit and nut beep (if your machine has one) to keep them from getting too eviscerated. I did that with this recipe but actually missed the beep (put it in a while after) so some of the olives actually remained whole. I baked at 375 for 50 minutes and it was great. This bread however rises like crazy so keep an eye on it if you let it rise again and bake in the oven. It overflowed my pan so I had to punch it down and start all over. I love the flavor of this and next time I'll try half wheat flour and maybe fresh garlic to make the garlic pop as well. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-04T21:20:39.02Z",
                "reviewBody": "This cooked up perfect in my bread machine. Nice size med loaf. I did have to add a bit more flour to the mixing cycle. I also added 3 small choped chili peppers. Makes great sandwhich bread try it with a chicken BLT.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ninie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3304860/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-27T20:33:19.427Z",
                "reviewBody": "This bread was rather taste-less. The flavor of the garlic did not come through. I used 1 large can of black olives drained & cut in half which was 6 ounces. They did not incorporate in my Zo bread machine but remained on the bottom and outside. The dough was very sticky but rose well and was very fluffy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ZAKKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/756407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-21T19:31:55.457Z",
                "reviewBody": "I rated this 4 stars and not 5 because I changed 3 things. I buy jarred marinated green olives by Mezzetta and it has pepperoncini in the mix. I used 6oz of chopped green olives 2oz chopped pepperoncini and instead of 1 and 1/4 c water i use 3/4 cup water and 1/2 c of the liquid from the marinated olives. Absolutely DELICIOUS! Thank you for this recipe Rocco.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "smb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1943754/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-23T01:33:14.73Z",
                "reviewBody": "Subbed olive oil for butter; minced garlic and salt for garlic salt; used scant 2 teas yeast. Excellent! Even people who told me they don't eat ripe olives had seconds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBIVEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/376947/"
                }
            }
        ]
    }
]