[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16543/main-dish/pork/pulled-pork/",
                    "name": "Pulled Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17932/smoked-pork-butt/",
        "name": "Smoked Pork Butt",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F417773.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2000-05-19T19:02:13.000Z",
        "description": "We love pulled BBQ pork sandwiches at our house, so we make this every few weeks. The pork just shreds apart after it's done, and the smoky flavor is incredible. It's best to brine the meat overnight to help it retain moisture during smoking, but it's not necessary. There's a basic brine recipe on this site titled 'Basic Brine for Smoking' if you want to brine the pork. I like to rub the pork before I smoke it with a very spicy dry rub that I usually make up each time, so that it's always different. Also, I use apple wood chips because we like the sweet, fruity flavor they yield. When it's done, shred it apart, heat up your favorite sauce, and slather some on a bun. Authentic pit barbecue right in your own house!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT18H0M",
        "totalTime": "P0DT36H20M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "7 pounds fresh pork butt roast ",
            "2 tablespoons ground New Mexico chile powder",
            "4 tablespoons packed brown sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "If desired, soak the pork butt in a brine solution for at least 4 hours or overnight. There's a recipe for a brine on this site titled 'Basic Brine for Smoking Meat'.  You should do this covered and in the refrigerator.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor smoker for 200 to 225 degrees F (95 to 110 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine the brown sugar, chili powder and any additional seasonings to your taste. Apply this liberally to the meat and rub it in with your fingers. Place a roasting rack in a drip pan and lay the meat on the rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Smoke at 200 to 225 degrees F (95 to 110 degrees C) for 6 to 18 hours, or until internal pork temperature reaches 145 degrees F (63 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pulled Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Smokin' Ron"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.444444444444445,
            "ratingCount": 54,
            "itemReviewed": "Smoked Pork Butt",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "321.2 calories",
            "carbohydrateContent": "3.3 g",
            "cholesterolContent": "98.6 mg",
            "fatContent": "21.6 g",
            "fiberContent": null,
            "proteinContent": "26.5 g",
            "saturatedFatContent": "8 g",
            "servingSize": null,
            "sodiumContent": "77.7 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-06T03:10:14.56Z",
                "reviewBody": "I have used this recipe 5 or 6 times.  I always soak in the brine overnight.  Make sure you smoke    it long enough. I use about 7-8 lb pork butt and smoke atleast 10 hrs. The first few times the pork was done but didn't pull apart.  I started going 10 hours or longer and it just pulls apart.  Very tender and flavorful.  I use a variation of the rub.  Don't forget to rinse the brine off before you put your rub on.  Let it sit(rest) 20 minutes once you take it off the smoker. I use mostly hickory to smoke it on a weber grill using the indirect heat method.Put a small pan of water directly over the coals and keep it full. Cook the fat side up,to keep the pork tender.  Try this recipe and you will be hooked on pulled pork.  A great and inexpensive way to feed a small group for your backyard party.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eric Jones",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1902946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:16:12.093Z",
                "reviewBody": "I agree with EVERYTHING ALMOST...  But instead of 160 degrees I raise temperature to 185 degrees so that the meat releases the bones and fat can be pushed off the meat.  I also wrap in a HEAVY DUTY aluminium foil envelope after 4 hours of smokeing to trap all the flavor and moistness inside to be cooked all the way down to the bone. you can insert the thermometer into the meat thru the wrap as long as you don't poke a hole in the bottom of wrap as the meat is cooking in it's juices after wrapped.  Slices of onion and pieces of crushed garlic and pepper can be mixed with applesauce and stuffed into little slits in the shoulder to taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BUSCHMAN57",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/84080/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-18T16:23:58.437Z",
                "reviewBody": "Dude!! This is without a doubt the best pulled pork I have ever had and I have had a lot of good pork but nothing like this. Today 12/18/2005 and 9 outside I am smokin' my second 8 pound Boston Butt using Smokin' Ron's Basic Brine for Smoking Meat. I poke several holes with a meat fork and soak the butt over night. The next morning I pat dry the butt and rub a generous amount of Grill Mates Pork Rub light brown sugar onion and garlic powder. I start off with Hickory wood chunks mixed with Cherry chips. For the second round of smoke I use Pecan wood chunks mixed with Applewood chips. I go through about 5 cans of wood with two of them using the Hickory/Cherry mix and the remaining three using the Pecan/Apple Mix. I smoke at temps of 210-220 for about 24-26 hours or until the internal temp is 170. BTW I use a Brinkmann Smoke N Pitt and converted the firebox to use gas using the Afterburner system. http://www.gassmoker.com/Afterburner_H.htm",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MidwestSmokin'",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-18T15:19:29.5Z",
                "reviewBody": "I would smoke the pork until it reaches an internal temp. of at least 190. 200-210 is optimal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rusty Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1152681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-29T15:45:58.483Z",
                "reviewBody": "ABSOLUTELY UNBELIEVEABLE SMOKED BUTT! I USED THE BUTT ROAST WITHOUT THE BONE. USE THE RUB THAT IS RECOMMENDED FOR THIS RECIPE. TALK ABOUT AN EASY AND EXCELLENT RUB! IT ADDED AWESOME FLAVOR TO THE BUTT! YOU GUYS NAILED IT! I HAVE AN ELECTRIC SMOKER AND USED HICKORY CHUNKS AND APPLE WOOD TWIGS FOR A GREAT SMOKE. SMOKE PERMEATES THE MEAT IN THE FIRST 3 HOURS SO STOKE THE FIRE UP GOOD! I ADDED MORE WOOD AFTER 1/2 HOUR AND THEN AGAIN AFTER AN HOUR THEN AGAIN AFTER AN HOUR. I SMOKED THESE BUTTS FOR 6 HOURS AND FINISHED THEM OFF OF MY WEBER GRILL TO REALLY GET THE BARK FINISHED OFF MORE THAN ANYTHING. TEMPERATURE WAS 175 AFTER THIS 6 HOURS. PULLED APART VERY EASY. IF YOU HAVE NOT TRIED THIS RECIPE DO YOURSELF A FAVOR AND DO SO! IT IS AWESOME PULLED PORK. I FINISHED MINE OFF WITH SOME BBQ SAUCE I PICKED UP AT THE GROCERY STORE THAT I LIKE \"SILVER DOLLAR CITY\" OZARK RECIPE. MADE BY \"OTTS\" IN BRANSON MISSOURI. ITS GOOD AND THICK AND HAS GREAT FLAVOR!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BIGBOBSBBQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:16:11.953Z",
                "reviewBody": "This was amazing! I would recommend getting the internal temperature to about 180F for maximum flavor and tenderness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steve",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:16:11.453Z",
                "reviewBody": "judibuggs old man here. soaked meat in a carolina vinegar sauce first for about four hours. needed more time in the soak, probably over night. did wrap in foil the last hour. used a combo of hickory and jack daniels chips for smoking. this was very good. was rushed when made. will take more time with it next time.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZIPPYTHEPINHEAD58",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/118559/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-20T02:25:02.757Z",
                "reviewBody": "I make pulled pork all the time. I'd put the dry rub on for at least 6 hours before smoking. I usually throw mine in the smoker the night before at 180 so it'll have an extended period of time for the smoke to penetrate, then in the morning raise the temp to 235. Once the meat hits about 150, it won't take on any more smoke flavor. \n\nCook until the temp hits 195, don't worry it won't be dry and overdone. You can't pull it if you only take it up to 160. Mine usually take between 12-14 hours. Then FTC (Foil, Towel, Cooler) for at least a half hour to let the juices re-distribute. The butt will stay hot for at least 4 hours in the cooler. Don't pull until you're ready to serve.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AndyJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:16:12.453Z",
                "reviewBody": "pulled pork is a favorite in our house.This was a nice blend of sweet and spicey.The only thing we changed was we used a cagun dry rub because we didn't have chilly. It worked great.Thanks for the recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JUDIBUGG424",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/113485/"
                }
            }
        ]
    }
]