[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/149/breakfast-and-brunch/french-toast/",
                    "name": "French Toast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21315/make-ahead-french-toast/",
        "name": "Make Ahead French Toast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1084605.jpg",
            "width": 1518,
            "height": 1010
        },
        "datePublished": "2000-06-27T23:11:27.000Z",
        "description": "We have made this French Toast for Christmas brunch for twenty four years! It originally came from the East Coast. If you like your French toast firmer, then cut back on the milk.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT14H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "5 eggs, lightly beaten",
            "1 ½ cups milk",
            "1 cup half-and-half cream",
            "1 teaspoon vanilla extract",
            "½ (1 pound) loaf French bread, cut diagonally in 1 inch slices",
            "½ cup butter, melted",
            "1 cup light brown sugar",
            "2 tablespoons maple syrup",
            "1 cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whisk together eggs, milk, cream and vanilla. Dip bread slices into egg mixture and place in a lightly greased 9x13 inch baking pan. Refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "The next morning: Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine butter, sugar, maple syrup and pecans. Spoon mixture over bread.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until golden, about 40 minutes. Let stand 5 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "French Toast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Debbie Tate"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.589285714285714,
            "ratingCount": 504,
            "itemReviewed": "Make Ahead French Toast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "502.8 calories",
            "carbohydrateContent": "51.8 g",
            "cholesterolContent": "161.6 mg",
            "fatContent": "29.3 g",
            "fiberContent": "2 g",
            "proteinContent": "11 g",
            "saturatedFatContent": "12 g",
            "servingSize": null,
            "sodiumContent": "346.8 mg",
            "sugarContent": "33.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-21T14:48:39.827Z",
                "reviewBody": "I was skeptical about making this recipe because of the mixed reviews, but I decided to try it and boy am I glad I did. One tip to help eliminate sticking: Get a cold stick of butter and press it into to bottom and sides of your baking dish, making a slightly thick layer of butter. THEN put the bread and mixture in. In the morning, use a flexible spatula and gently insert it underneath the bread to pull it away from the pan. This should definitely minimize any sticking. I always bake my own bread (Amish White Bread submitted by Peg on this site). I then cut it into 1.5 to 1.75 inch thick slices to ensure that all the mixture is absorbed, so make sure you use THICK BREAD. I then cut each slice into four and make French Toast Sticks so that they can be eaten on the run (in the car, at a bus stop, etc). They reheat very well. The recipe I use is as follows: 3 eggs, 1/2 cup milk, 1/2 cup cream, 1t Vanilla extract, 1.5t cinnamon, 1T powdered sugar, 3/4 loaf bread. I beat these ingredients well with a mixer.I top it with a heated mixture of 5T butter, 1.5T syrup, and 1/5 cup brown sugar. Don't be dismayed by negative reviews. This recipe CAN and DOES turn out great every time. Follow it as stated in the recipe, and then tweak it like I did until you find what works best for you and your family. This is a staple in our house now. Bake time of 40 minutes is usually dead on (sometimes I go an extra 5 minutes or so). Moist (NOT soggy), tasty, and (if you make sticks) travel friendly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DivineHealth7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1478626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-14T16:47:55.123Z",
                "reviewBody": "I decided to give this recipe a second chance with some modifications to make it a much firmer recipe. I took my loaf of French bread and split it down the middle lengthwise and then cut it into 1 inch slices. I omitted the half-and-half used three eggs and halved the remaining ingredients. All ingredients (except for the topping) went into a big bowl and I mixed them up until all the liquid was soaked up. After spraying the casserole dish with a cooking spray the bread was placed in a single layer and the topping was placed on top. I only cooked the dish for about 30 minutes. It made about 5 servings this way. Using this method the recipe is more like sticky rolls than French toast. Delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GFRIDAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/649465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-05T13:25:51.043Z",
                "reviewBody": "My husband is LOVING this dish! He is saying \"mmmmm 5, mmmmmmm 5\"! Since there are only three of us here today I pulled 6 pieces of Texas Toast out of the freezer. I sprayed the glass pan with Pam, whipped up the egg mixture with 1/2 cup of half and half and 1 cup of milk only. I just put the toast, whole, in the pan. This way, there were two whole pieces for each of us. After placing the dunked pieces in the pan, I sprinkled cinnamon over top. Then I poured the remaining egg mixture over top. This morning, when I pulled the dish out of the fridge it appeared that all of the egg mixture had been absorbed. By the way, I had only put chopped pecans over two pieces of the toast, since hubby is the only one that likes them for breakfast. I didn't have maple syrup so I just used some Aunt Jemima Butter Lite. I baked this for right at 40 minutes and my oven runs hot, so if you have a new oven you might need to go 45 - 50 minutes. As for the finished product, hubby loves it. Naturally, the edges of the toast got done faster than the middle. I think it is crucial to let this sit for the 5 minutes after bake time. I wonder if cutting the amount of butter down a bit would help? It was just a tad soggier in the middle, but overall, this is a wonderful recipe! Next time I will sprinkle powdered sugar over top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-03T20:44:40.733Z",
                "reviewBody": "This made our Christmas morning...it was the perfect breakfast to celebrate the holiday.  I used day old french bread from a local bakery and I took other reviewers advice and cut down on the milk to a 1/2 cup.  I also added a little cinnamon and nutmeg to the egg wash and used pure maple syrup to top it off!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. Chef Esh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mschefesh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-04T01:40:41.077Z",
                "reviewBody": "I make this regularly recipe compliments of Rhona and Leo Lococco of Lococco House B&B in St. Charles MO - what brings it to life for me is 1 tblsp of concentrated OJ in lieu of the vanilla. MMM...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookielady1971",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1521435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-06T01:58:11.217Z",
                "reviewBody": "i'm wondering if debbie intended to write that we should cut the french bread in 1 inch SLICES and not cubes. anyway that's what i did. u definitely need to lightly grease the pan. i thought i could get away with just laying foil in the pan but it ended up becoming a second skin and took forever to peel off. won't be making that mistake again. i only had 1/2 cup of pecan chips so that's all i used but it really was more than enough. i doubt i'll be using 1 cup when i make this again. we're fasting during this month of ramadan and i made this for my hubby and myself for our pre-dawn meal. it was worth getting up early for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HINA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/359688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-26T23:13:34.827Z",
                "reviewBody": "I was so worried that I would have soggy results and I almost lost sleep over it but woke up the next morning made the sauce and threw it in the oven... and it came out perfectly... (well one peice of toast stuck to the dish) served it to to a house full of visitors and they all raved... thank you so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "julesevilhr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1498118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-16T21:44:36.097Z",
                "reviewBody": "Lots of reviewers are complaining about this recipe being soggy, but nothing in the recipe says to pour all the remaining liquid over the bread. It just says to dip the bread in liquid. I'm sure it would have been like soup if I had poured all the liquid in the pan. I thought the consistency was great--crispy on the outside, but more like bread pudding on the outside, with a caramel sauce. This is the best french toast recipe I have tried. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PARKER720",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1277155/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-08T02:44:08.373Z",
                "reviewBody": "My family really enjoyed this recipe on Thanksgiving morning and I enjoyed not having to spend time cooking breakfast. Those who do not care for nuts did not care for this though. It was not soggy at all which I really liked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1178458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-09T16:17:11.607Z",
                "reviewBody": "so disappointed with this recipe. made it for the first time today hoping for a nice Easter breakfast and the middle of the bread slices were soggy (despite 40 min in the over) and had little to no flavor. should have know when I had so much extra egg batter and nut mixture. will not make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Frion",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1490729/"
                }
            }
        ]
    }
]