[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23971/danish-kringle/",
        "name": "Danish Kringle",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1989517.jpg",
            "width": 2432,
            "height": 4320
        },
        "datePublished": "2020-03-05T04:56:04.000Z",
        "description": "This recipe is from my father-in-law's mother who was born and raised in Denmark. It is a wonderful holiday pastry treat that is both beautiful and delicious. Plan to make your dough at least 1 to 2 days in advance--but it's very simple. It takes just a few minutes to prepare and refrigerate. Creating the kringle takes more time, but it is worth it!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT13H15M",
        "recipeYield": "3 braids",
        "recipeIngredient": [
            "1 cup butter",
            "2 cups sifted all-purpose flour",
            "1 cup sour cream",
            "1 cup butter, softened",
            "2 cups brown sugar",
            "1 ½ cups chopped English walnuts, divided",
            "1 cup confectioners' sugar",
            "2 tablespoons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cut 1 cup butter into flour until crumbly, leaving pea-sized chunks. Stir in sour cream, and mix well; dough will be very sticky. Form dough into a ball. Cover tightly, and refrigerate 8 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet. Prepare the filling by combining 1 cup butter, brown sugar, and 1 cup chopped walnuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough into three equal parts; return two parts to the refrigerator to keep cold. Quickly form 1/3 of the dough into a rectangle, and flour lightly. On a heavily floured surface, roll out to approximately 12x17 inches. Position lengthwise on the work surface. Along the long edges of the dough rectangle, use a sharp knife to cut 4 inch long angled lines about 1/2 inch apart. Spoon 1/3 of the filling along the length of the rectangle's uncut center. Alternating from one side of the dough to the other, fold each 1/2 inch wide strip towards the center, crisscrossing the filling in a braid-like fashion. Lightly press together the ends of the strips to seal. Sprinkle with 1/3 of the remaining walnuts. Repeat with remaining ingredients to form 3 braided danishes. Arrange danishes on prepared baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 minutes in the preheated oven, or until golden brown. Cool for approximately 30 minutes. While the danishes are cooling, prepare the icing: mix confectioners sugar and water until smooth. Drizzle in fine streams over warm danishes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Colleen Royal"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.606451612903226,
            "ratingCount": 155,
            "itemReviewed": "Danish Kringle",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "410.8 calories",
            "carbohydrateContent": "35.2 g",
            "cholesterolContent": "59.9 mg",
            "fatContent": "29.6 g",
            "fiberContent": "1 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "15.2 g",
            "servingSize": null,
            "sodiumContent": "157.2 mg",
            "sugarContent": "22.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-05T16:41:46.94Z",
                "reviewBody": "OMG, if you have never tried kringle, you HAVE to make this recipe.  My family and my work friends went absolutely crazy for it and are still talking about it to anyone who will listen.  The dough is super simple to make and work with.  It is so flaky, but dense and moist, and not too sweet, it's perfect! What I did was to divide the dough in half and put cherry pie filling in one half and half of the brown sugar/butter/nuts recipe in the other. The only change I would make is that the brown sugar/butter/nuts one had WAY too much butter. I used 1 stick (1/2 cup) and it leaked out everywhere and I ended up pouring at least a 1/4 cup of melted butter off of the pan because the kringle was swimming in it. Gross. When I made it again, I just dotted penny sized butter pieces sparsely over the brown sugar/nuts mixture as it lay in the dough and it worked fine, no problems. So definitely cut the butter down. I also made one where I microwaved frozen peach slices until soft, then mashed them with a potato masher with a little sugar and used that as filling. It was wonderful!!! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy Womack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2036722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T14:21:04.06Z",
                "reviewBody": "I made this for the holidays for gifts and they were super!  Everyone wanted the recipe. The only thing I would like to add is to make sure not to cut all the way up to the filling, Otherwise your filling seeps out while cooking, ask me how i know! !   ; )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIZMELIZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/225658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T21:50:37.497Z",
                "reviewBody": "If I had rated this recipe before eating the end result, I would have given it only 3 or 4 stars. Try as I may, there was no way I was going to get 3 kringles out of the amount of dough the recipe makes. I ended up with 2 and then the cuts were a little too long or something because a lot of the filling seeped out during baking. However, I transferred them immediatly upon removal from the oven to a clean surface so they wouldn't get stuck to the pan. The end result tastes absolutely awesome and in the end, was worth the trouble I had. I will make these again, doubling the amount of dough and making sure that my cuts aren't too long so the filling doesn't leak out. Thanks for sharing the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/713444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-16T01:30:59.457Z",
                "reviewBody": "This recipe gets 5 stars for tasting good and 5 stars for fun making it. One tip is to use a pizza cutter to make the cuts. It keeps the dough from tearing. Another good tip is to pay attention when the recipe says \"heavily floured surface\". You will have a lot of trouble with the dough if you are too cheap with the flour. I was able to make 3 just fine but its so much easier to work with when its cold so you have to roll fast. I made one with apricot preserves and cream cheese cooked apples and cream cheese and vanilla custard with chocolate drizzle. All three were delish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ami Davey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3256983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T13:08:03.013Z",
                "reviewBody": "This is a great recipe! I was so happy to find it as it reminds me of my childhood. The dough works up very nice as long as you keep it cold. I doubled the recipe and it worked fine. I also used canned pie filling for the filling and it worked great. Thank You for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSI_GIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/182620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T13:05:51.827Z",
                "reviewBody": "I'm a star with my family for finding this recipe! At every Schmidt (my maiden name) family reunion I go to there's always someone saying how they wish they could make kringle it's their favorite and on and on. My granddad grew up in Wisconsin near a bakery and he got to have fresh kringle on a regular basis. I'm making him this for Christmas and can't wait to see if it's just as good as he remembers it. Thanks for sharing Colleen! More comments coming later...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "az_starshine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/52914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-22T21:53:51.84Z",
                "reviewBody": "I was afraid that the dough wasn't going to work but it turned out really buttery and flaky. I filled my Kringle with strawberries and sprinkled with raw sugar and egg white before baking. My entire family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Darell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1468989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T13:06:29.983Z",
                "reviewBody": "A little work but worth the effort! I used pie filling und it turned out great; my family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deanna Krukow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/676513/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T16:43:00.203Z",
                "reviewBody": "I made this for Easter dessert and it came out great and none was left for me to take home! All I did was make the dough as directed divided it in 2 filled each with a 1/2 can cherry pie filling and baked as directed. I'm from Wisconsin and this is very close to the Kringle I remember. It was so easy that I will definitely make in the future! I didn't have too much trouble with it dripping onto the pan. It was fine. Thanks for this tasty recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURIE444",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-31T03:09:02.877Z",
                "reviewBody": "did not turn out right. to much butter will make with less and follow others suggestions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth Wotawa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7150935/"
                }
            }
        ]
    }
]