[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24154/marcias-famous-sticky-buns/",
        "name": "Marcia's Famous Sticky Buns",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F33434.jpg",
            "width": 2288,
            "height": 1712
        },
        "datePublished": "2020-03-05T04:56:08.000Z",
        "description": "I don't know if this is what you're looking for, but if you want something easy for the morning, this is it.  You have to start it the night before, but then all the work is done and it will seem like you went all out.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT13H55M",
        "recipeYield": "8 to 10 servings",
        "recipeIngredient": [
            "1 cup chopped walnuts",
            "1 (12 ounce) package frozen dinner roll dough",
            "1 (5 ounce) package instant vanilla pudding mix",
            "1 cup brown sugar",
            "2 teaspoons ground cinnamon",
            "½ cup margarine, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle nuts in the bottom of a greased Bundt pan.  Lay frozen roll dough on top of the nuts. Sprinkle dry pudding mix over the dough, then the brown sugar, then the cinnamon.  Pour the melted margarine over all.  Lay a damp paper towel over the pan and place it in a cold oven over night.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the morning, remove paper towel and place pan in cold oven. Heat oven to 350 degrees F (175 degrees C). Bake at 350 degrees F (175 degrees C) for 25 minutes.  Remove from oven and let sit for 5 minutes, then flip out onto plate.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Colleen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.377777777777778,
            "ratingCount": 135,
            "itemReviewed": "Marcia's Famous Sticky Buns",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "370.7 calories",
            "carbohydrateContent": "40.7 g",
            "cholesterolContent": "2.4 mg",
            "fatContent": "21.4 g",
            "fiberContent": "1.9 g",
            "proteinContent": "6.7 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "366.2 mg",
            "sugarContent": "18.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-21T19:36:17.423Z",
                "reviewBody": "This is a family favorite! The key to this recipe turning out perfect is to use the COOK and SERVE pudding. The instant pudding will not work as well. I use 24 Rhodes Dinner rolls cut in half. I roll each piece in the dry pudding melt the butter and brown sugar together and pour over the top. I bake mine for 35-40 minutes. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2104102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-24T03:54:41.45Z",
                "reviewBody": "I follow this loosely. (We call this \"cinnamon rolls btw - though it's probably techinically \"monkey bread.\") I tried it as written and was not happy. Read the reviews made some changes and love it! I sub butterscotch cook-n-serve pudding for the vanilla instant. I mix all the dry ingredients. Cut the rolls into 4-5 pieces each dredge through the brown sugar/cinnamon/pudding mixture and place on top of the nuts in the pan. After I pour the rest of the dry mixture over the rolls and pour the melted butter over all. I cover with foil and place in the fridge overnight. In the morning I place the uncovered pan in a cold oven then I turn the oven on to 350 and set the timer for 40 minutes. Great every time! (I probably would have given the original recipe maybe a 3.5 star rating - I had really large rolls without much ooey gooey sticky stuff... A solid 5 with my tweaks... )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gammaray (=",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4175968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-28T02:11:36.41Z",
                "reviewBody": "This is a very old famiy recipe of ours as well! Who the heck would make rolls like this from scratch again! Anyway.. I do make a couple of differnt changes. I use toasted almonds instead of walnuts (just personal taste) and about 3/4 box of COOK and SERVE Butterscotch pudding. Also use the Rhodes brand of frozen dinner rolls ( I put approx 16 rolls in the pan) I bake for about 40 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TIMROBYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T17:09:13.92Z",
                "reviewBody": "This is a Blue Ribbon recipe! I followed the instructions and prepared it before going to bed last night and when I awoke this morning and baked the rolls I was facinated with the results and so was my husband. They were the most beautiful and delicious sticky buns that I have ever had and without a doubt the easiest recipe I have ever followed. I didn't have quite a full pkg. of frozen dough but had about half and it still turned out beautifully. I would highly reccomend this recipe to anyone and I will be using it again and again. Thank you Marcia for being kind enough to share it with us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUNPUPPY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/743270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T21:03:25.67Z",
                "reviewBody": "These are great caramel rolls but I believe the recipe directions are wrong. What I do is thaw out two loaves of frozen bread dough and I do not let it rise. The first loaf I tear up in pieces and drop helter skelter in a 9/13 inch pan that is well greased. I then use a hand mixer to mix all the ingredients except the brown sugar  smooth. I also use cook and serve pudding and regular butter. Do not use the instant!  It will turn out clumpy! After mixing I pour it over the dough. Then I take the second loaf and tear that up and drop that on top of the dough and pudding mixture. Then I take the brown sugar and sprinkle it over the pan of rolls. The little that stick to the top of the rolls will make a nice glaze and will also keep the moisture in the bread. Then I let it double in size and bake for 30 min. on 375. The last 10 min place foil over them so they do not get too brown or burn. When they are done line a cookie sheet with foil and put wax paper on top. Spray the wax paper with oil and lay the cookie sheet with the foil and oil wax on top of the pan and flip over. Let sit for a few minutes to let the caramel drizzle in the rolls then carefully remove the pan! Voila! Perfect caramel rolls! I am positive that to just dump the pudding on top will make it clumpy so always mix first with the butter and cinnamon. My mom has made these since I was little and now my family loves them as well!  In fact I just put a pan in the oven to rise! Everyone I know loves these rolls!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trisha Owens",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4189794/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T20:49:53.303Z",
                "reviewBody": "This is a long time family recipe. We do not use instant pudding rather the \"cook and serve\" vanilla pudding. Each frozen roll is roughly an ounce so 12 ounces of rolls is a dozen. Follow the directions and this recipe turns out great! LOVE IT.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janevieve",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1577929/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-06T15:45:21.437Z",
                "reviewBody": "These are fantastic and very easy! I've made these a few times and they fly off the plate! I've substituted butterscotch pudding and it was still great. Caution....grease pan well and turn over on a big plate or a plate with edges. A must try recipe! Thanks for sharing!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeannette Cottick-Allen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-10T13:59:54.233Z",
                "reviewBody": "I was expecting this recipe to be really good after all of the reviews but it wasn't. It wasn't \"sticky\" at all. All of the pudding powder just sat on top. I had to pour cream cheese frosting all over it just to make it edible. I won't be making these again. Sorry",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2225106/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-05T01:27:56.463Z",
                "reviewBody": "This is a fabulous recipe! I have been making it for 34 years...ever since I moved to Wisconsin. We call it \"Monkey Bread\" up here. I don't understand how anyone could have a flop as I have never had one and it's so darn easy! Make sure you use enough melted butter. I do a couple things differently but I don't think it should make too much of a difference. I use 18 Rhodes frozen rolls. I think cutting them in half is a good idea as the rolls can be quiet large and messy to eat...but that's the fun of it. I spray plastic wrap with Pam and cover the rolls over night. I never refriderate them...I don't see how they would rise that way. In the morning I have a beautiful over-flowing bundt pan. Bake and viola perfection! I do suggest covering the pan with foil the last half of baking as the outer rolls get more dried out. Definitely use a large plate as the nut mixture accumulates on the bottom of the pan and then slides down the sides once the pan is inverted. This is a tradition on Christmas/Easter morning and a hit every single time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marsha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2202489/"
                }
            }
        ]
    }
]