[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/925/side-dish/vegetables/green-beans/",
                    "name": "Green Beans",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24745/sweet-green-bean-bundles/",
        "name": "Sweet Green Bean Bundles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1034179.jpg",
            "width": 1907,
            "height": 1350
        },
        "datePublished": "2020-03-05T04:56:16.000Z",
        "description": "A unique break from dressing marinades.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 (14.5 ounce) cans whole green beans, drained",
            "1 pound bacon, cut in half",
            "½ cup butter, melted",
            "1 cup brown sugar",
            "1 teaspoon garlic salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wrap 7 green beans with bacon and place in prepared dish.  Repeat, using all the green beans and bacon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine butter with brown sugar.  Pour over green bean bundles and sprinkle with garlic salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover with foil and bake for 45 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables",
            "Green Beans"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TRIOS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.628865979381444,
            "ratingCount": 485,
            "itemReviewed": "Sweet Green Bean Bundles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "608.3 calories",
            "carbohydrateContent": "31.1 g",
            "cholesterolContent": "92.1 mg",
            "fatContent": "49.4 g",
            "fiberContent": "3.4 g",
            "proteinContent": "10.7 g",
            "saturatedFatContent": "21.1 g",
            "servingSize": null,
            "sodiumContent": "1623.2 mg",
            "sugarContent": "26.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-24T21:43:23.38Z",
                "reviewBody": "When cooking for a party, time is always of the essence! So I turned this into a two-step process and it came out EXCELLENT, earning rave reviews from my guests! Not only was the taste great, but the presentation (the bundles) was impressive too, making me really look like a gourmet cook to my guests! The night before the party,I used fresh green beans and blanched them, then I lightly fried the bacon before wrapping the bundles, covered the baking dish with foil and put it in the refrigerator.  The next day I made the sauce, poured it over the bundles sprinkled with garlic powder (instead of garlic salt), covered the dish with foil, then put it in the oven at 350 degrees for 1/2 hour.  Turned the oven off, let it sit. Then right before serving time, turned the oven back on, removed the foil covering and cooked until heated through (about 10-15 minutes).\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AVOCET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/306646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T01:59:04.943Z",
                "reviewBody": "Yum these are my favorite.  This is just like my recipe, glad I found yours before I posted mine. I used this as one of the appetizers I served at my wedding.  Everyone loves these!! They look fancy like something you would see in a restraunt. Sometimes instead of wrapping them in bundles I will put 5 cans of cut green beans into a glass baking dish, sprinkle with garlic salt, cut bacon into peices and place on top of the green beans covering all,then sprinkle brown sugar over the top and pour one stick of melted butter over the brown sugar and bake at 350 for 1 hour or until bacon is crisp. I do this when I am serving a large group and it's better for those who want the bacon more crisp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ASHBERRY95",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/378590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-07T20:08:51.64Z",
                "reviewBody": "Wonderful recipe - The only change I made to this is that I used fresh green beans that I had steamed.  The bundles are very yummy and make a wonderful presentation as well!  Everyone raved about these at my Thanksgiving Dinner this year!  This is a keeper!\r\nYou can also do most of the prep work in advanced for a big meal such as Thanksgiving I discovered.  For this recipe I steamed my green beans in advanced then wrapped them in bacon and placed on a cookie sheet that was lined with wax paper and froze the bundles.  Once frozen I took the bundles off and placed them in zip bags (only to free up space in my freezer and get rid of the cookie sheet). Then on Thanksgiving Day I pulled the bundles out and let them thaw on the baking pan I was planning to cook them on and continued with the recipe by adding the sweet sauce on top before baking.  I was thrilled they turned out so well - and I didn't have to rush and make them at the last minute either!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lil' Southern Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1474183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-15T18:47:48.49Z",
                "reviewBody": "Like other users I used fresh green beans. I also prepared a day ahead of time so life was easier the day of the dinner party. I boiled fresh green beans for 5 minutes and fried the bacon 4 minutes. After assembling the bundles I covered the casserole dish and placed in the fridge. When it was time I covered them with the brown sugar mixture and baked them for 30 minutes covered and then another 15 minutes uncovered to crisp the bacon. Turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JLO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544007/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T17:01:10.653Z",
                "reviewBody": "The BEST green beans I every had!! I did not make in bundles I just mixed the green beans and bacon together and poured the butter and brown sugar mixture over it. It was made for a party and was a big hit!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHERIBYQUIST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/529695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-05T18:38:33.873Z",
                "reviewBody": "I've been making this recipe for years now.  It was one I got at a pot luck.  My recipe differs a little and you might prefer it.  I only use 3/4 of a cup of brown sugar (and I don't pack it very firmly), I use 1 tsp garlic powder, 1/2 tsp black pepper, and 1-1 1/2 tsp worcestershire sauce.  I cover the whole thing and bake at 350* for 20 minutes, then take the foil off and bake for another 15 minutes.  No broiling necessary that way.  I give this recipe 5 stars because it is VERY good...but...it is NOT to be confused with a green bean side dish.  Meaning you can only eat 3-4 of them...and they really are best in a pot luck setting, that way everyone gets 2-3 and it leaves you wanting more.  If you were to eat it as your 'vegetable' for a meal then yes, I can understand the concern over the nutritional info.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Torie Fraser Hadjis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/920146/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T15:48:20.57Z",
                "reviewBody": "Loved this recipe. I used fresh green beans, blanched them the day before, par cooked the back, rolled the beans in the bacon, made the sauce poured it over and covered overnight. The day of the dinner I cooked as directed. Made for a dinner for 10 and everybody loved them. They looked great and better still, they tasted great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cook Pod",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/773071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-21T21:18:36.187Z",
                "reviewBody": "I've been making these every Thanksgiving for years! However, I only use fresh green beans and blanch them for a few minutes until bright green. As a more healthy alternative, I skip the butter & sugar and toss the blanched green beans with some olive oil and a touch of dijon mustard. It also helps to cook the bacon for 2 minutes in the microwave before wrapping around the green beans. This will help speed up the baking time to about 25 min and prevent the green bean from being over cooked. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jodi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1779283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-28T19:15:28.78Z",
                "reviewBody": "Personally I don't like these. They are really sweet and I can't seem to get over how much fat are in these (154 g total). However most people do like them. That's why I gave it 4 stars. I've made it in bundles which is a very pretty way to make it. If you want an easier way just place the green beans in the bottom of a baking dish cut the bacon into pieces and place over the top of the beans drizzle with brown sugar and butter sauce and sprinkle with garlic salt. You get the same flavor with less work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVEPUZZLES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/593981/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T17:01:15.14Z",
                "reviewBody": "I made this dish because my older daughter thought it looked interesting. Both my girls thought this recipe was acceptable but said the sweetness was overpowering. My husband and I didn't care for it at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            }
        ]
    }
]