[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/836/desserts/cookies/bar-cookies/",
                    "name": "Bar Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25030/caramel-bars/",
        "name": "Caramel Bars",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F18081.jpg",
            "width": 3456,
            "height": 2304
        },
        "datePublished": "2020-03-05T04:56:23.000Z",
        "description": "Yummy oat bars filled with a gooey layer of caramel, chocolate and nuts!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "32 individually wrapped caramels, unwrapped",
            "5 tablespoons heavy cream",
            "1 cup all-purpose flour",
            "1 cup rolled oats",
            "¾ cup brown sugar",
            "½ teaspoon baking soda",
            "¼ teaspoon salt",
            "¾ cup butter, melted",
            "½ cup semisweet chocolate chips",
            "½ cup chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). In a medium saucepan over low heat, melt together the caramels and heavy cream, stirring occasionally until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the flour, oats, brown sugar, baking soda and salt. Stir in the melted butter until well blended. Press Half of the mixture into the bottom of a 9x13 inch baking pan. Reserve the rest.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the crust for 8 minutes in the preheated oven. Remove and sprinkle with chocolate chips and walnuts. Pour the caramel mixture over the top and then crumble the remaining crust mixture over everything.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return to the oven and bake for an additional 12 minutes, or until the top is lightly toasted. Cut into squares while it is still warm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Bar Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jordanna Novak"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6826923076923075,
            "ratingCount": 624,
            "itemReviewed": "Caramel Bars",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "194.8 calories",
            "carbohydrateContent": "23.7 g",
            "cholesterolContent": "20.5 mg",
            "fatContent": "10.9 g",
            "fiberContent": "0.9 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "127.5 mg",
            "sugarContent": "15.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-07-24T20:53:40.35Z",
                "reviewBody": "HELPFUL TIPS: First off, oh my gosh!! I'm not a caramel fan AT ALL, but tried this b/c of the 5* rating.  So glad b/c this is out of this world!  I love the idea of lining your 9X13 pan with foil. This allows you to just pull it out of the glass dish after it's cooked AND COOLED & cuts down on crumbling. Makes slicing easier. ...just don't rush the cooling process in fridge or caramel will harden!  This is a recipe where eyeballing is your best bet.  You MUST double the flour, oats, sugar, baking soda & salt, but TOTALLY not necessary to double the chocolate chips & walnuts (sweet overload). I found 1C of butter to be perfect to make the crust stick together.  In fact, the second & third time I made this, I didn't bother using a small portion of the crust b/c if you put too much on top, it just falls right off (as excess crumbs).  To solve this, when I put the top layer of crumbs on, I press gently into the caramel layer as if I'm making another crust.  Makes everything stick together nicely!  Used an entire bag of Kraft caramels (14 oz) OR already unwrapped bag (11oz) & 7T of heavy cream was the perfect consistency and enough to cover a thin layer.  Caramel takes a little while to melt, so be patient if it's your first time :)  Oh, I've baked this for 25-30 min. depending on oven.  Just take out once the top (crust) turns a nice golden brown.  Update: I noticed someone said not to use 1min oats. It's ALL I use & everyone always LOVES THIS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-17T05:15:52.92Z",
                "reviewBody": "I'm a professional baker and was searching for a recipe for a die-hard caramel lover, this one was a huge Hit.  These had to be shipped overseas by the way and were fresh tasting to the end.\n\nThe adjustments I made worked perfectly for me.  I used one 9\" X 13\" pan and one 8\" x 8\" square pan.  I tripled the oatmeal mixture. I doubled the caramel/cream mixture, adding 12 extra caramels plus 2 additional Tbls. of cream.  I omitted the nuts because the person receiving them doesn't eat nuts; instead, I added more chococate chips (dark choclate, their favorite).\n\nI added about 8 minutes to the final baking time; the top turns a nice, golden brown when the bars are ready.\n\nDon't bother trying to cut these until they're cool. \nThe 8\" X 8\" pan yielded 16 bars.\nThe 9\" X 13\" pan yielded 24 bars.\n\nSimple recipe, rich taste, great with coffee. I wrapped each one individually and they made a delightful presentation in the giftbox, very homemade appeal, buttery taste. \nThis one I will use again in gift assortments, very well received.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M-JVZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2347809/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-24T03:55:03.72Z",
                "reviewBody": "Kraft now makes a bag full of pea sized caramel bits which work great for this recipe, rather than unwrapping the squares..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "44ash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2559994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-28T10:34:33.577Z",
                "reviewBody": "Great for people who like caramel. A few tips: Double the oat/sugar/butter/flour/salt/bkg soda mixture. Then it will fit in a 9x13 Don't melt butter all the way just soften. Use about 1/2 cup of butterscotch chips instead of chocolate. Microwave the cream and caramels - cuts time. Super Easy and Super Delicious.I cut it when it was half way cooled and it was fine but don't cut right away because it will fall apart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Luv2travel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1796267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-11T18:40:49.12Z",
                "reviewBody": "This recipe would be five stars with modifications. I lined my pan with foil to begin - I wanted to make a 9x13 pan so after reading some of the reviews I doubled the oatmeal mixture (using 1 cup butter and 1/2 cup milk instead of 1 1/2 cups butter) and used exactly 50 caramels (one Kraft Caramels bag) with seven tablespoons heavy cream. The oatmeal mixture was a little sticky so instead of \"crumbling\" the remainder on top I pressed out small pieces and laid them over the top like a puzzle. Then I baked for twenty more minutes until golden brown. To cut them into bars I lifted out the foil with the whole dessert and partially froze them. They cut perfectly - I can't imagine trying to cut them warm from the oven - that would be a mess! When all was said and done they were terrific - absolutely the best bar cookie I've ever had. DEFINITELY a make-again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Maegan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2063672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T18:21:31.433Z",
                "reviewBody": "Jordanna thank you!!  I was recently at a Christmas party where these squares were served and I rushed home to find the recipe on allrecipes.com and there they are as big as life. I do believe these may very well be the best thing I have eaten in the sweets dept in a very long time. \r\nI have however made 1 major change. I put them in a 8x8 pan. They turned out terrible in the 9x13 and absolutely perfect in the 8x8. They are thicker googey and cooked to perfection. One other change I made was to put pecan pieces instead of walnuts as they are as soft chewy nut like the squares. It is great that these are so fast and simple to make and so yummy. Your cooking times and ingredients are exact for an 8x8. I am so very happy to have this recipe Jordanna, nice of you to share.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DARLENE410",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1212946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-02T13:59:36.883Z",
                "reviewBody": "I have made this recipe for years, exactly the same, but my baking dish calls for an 8x11 glass pan. The recipe fits it perfectly. I am amazed to see it on here. I sold Tupperware in the 70's, one of my hostesses had this at her party, I got her recipe and have made it since that time. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy Carnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-20T14:26:22.78Z",
                "reviewBody": "Delicious and chewy! Everything you imagine in a caramel bar. I doubled the recipe and used a 9x13 inch baking pan. When bars are warm fresh out of the oven it is almost as if they aren t completely cooked. But as they cool next day even they become this moist chewy cookie like bar. I can see where reviewers have suggested cutting back on the melted butter (next time I make these I will try cutting back 1/2 cup). Also used another review pizza cutter used while warm really works well. Very yummy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIAMOU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-06T06:18:27.14Z",
                "reviewBody": "These are delicious! The only reason I didn't give 5 stars is because it calls for too much butter. I made them again and only used 1/2 a cup of melted butter and just less than a 1/4 cup of milk to make up the difference. It was much less greasy and just as much flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1241332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-04T19:11:22.15Z",
                "reviewBody": "Too sweet. Way to much butter way too rich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "PINKPIGG33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/705467/"
                }
            }
        ]
    }
]