[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26027/elizabeths-extreme-chocolate-lovers-cake/",
        "name": "Elizabeth's Extreme Chocolate Lover's Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2131.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-03-05T04:56:48.000Z",
        "description": "If you are a chocolate lover, you're gonna LOVE this!! The best chocolate cake I've ever concocted!  The ganache and cream cheese chocolate buttercream frosting are absolutely decadent! Serve with fresh raspberries, if desired.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 - 2 layer 9 inch cake",
        "recipeIngredient": [
            "2 ¼ cups all-purpose flour",
            "2 teaspoons baking soda",
            "½ teaspoon salt",
            "6 (1 ounce) squares unsweetened chocolate, chopped",
            "½ cup unsalted butter",
            "2 ½ cups dark brown sugar",
            "3 eggs",
            "1 ½ teaspoons vanilla extract",
            "1 cup sour cream",
            "1 cup water",
            "6 (1 ounce) squares unsweetened chocolate, chopped",
            "¼ cup unsalted butter",
            "1 egg yolk",
            "4 cups confectioners' sugar",
            "2 tablespoons vanilla extract",
            "2 tablespoons heavy cream",
            "1 (8 ounce) package cream cheese, softened",
            "2 cups bittersweet chocolate chips",
            "1 cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch pans. Sift together the flour, baking soda and salt. Set aside. In the top of a double boiler, heat 6 ounces chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and brown sugar until light and fluffy. Beat in the eggs one at a time, then stir in 1 1/2 teaspoons vanilla. Stir in the melted chocolate. Beat in the flour mixture alternately with the sour cream. Stir in boiling water (batter will be thin). Pour batter into prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make the Chocolate Buttercream Frosting: In the top of a double boiler, heat 6 ounces chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm. In a large bowl, whip the butter for about 10 minutes until it is super fluffy, beat in egg yolk. Gradually blend in the confectioners' sugar, alternating with 2 tablespoons vanilla and 2 tablespoons cream, then blend in the melted chocolate. Beat in the softened cream cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make the Ganache:  In a large saucepan, combine chocolate chips and 1 cup heavy cream. Heat, stirring constantly, until chocolate is melted and smooth. Remove from heat and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Assemble the cake:  When cake is completely cooled, cover the bottom cake layer with as much ganache as desired. Refrigerate for 5 minutes, or until ganache has set. Spread frosting over the ganache. Cover with top layer of cake. Frost top and sides with buttercream, and garnish with more ganache.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ELIZABETHBH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.623529411764705,
            "ratingCount": 170,
            "itemReviewed": "Elizabeth's Extreme Chocolate Lover's Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "759 calories",
            "carbohydrateContent": "100.9 g",
            "cholesterolContent": "115.2 mg",
            "fatContent": "40.7 g",
            "fiberContent": "4.2 g",
            "proteinContent": "8.9 g",
            "saturatedFatContent": "24.7 g",
            "servingSize": null,
            "sodiumContent": "321.7 mg",
            "sugarContent": "64.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-11T21:08:11.133Z",
                "reviewBody": "I'm and experienced baker, and made this cake for a chocolate-loving friend's birhtday, and he loved it. This cake is chocolatey, and not overly sweet. For anyone having trouble with this cake, here's what I did: 1. always grease and flour your baking pans, then place parchment paper in them, and grease and flour (use cocoa for a chocolate cake) the paper. My cakes never stick when I do this. 2. The butter to sugar ratio in this recipe is low, it just won't cream. This is no big deal, the cake will still turn out well. Just go ahead and add one egg and then begin creaming. 3. Beat the butter/sugar/egg mixture at least two minutes, then add another egg, beat two more minutes, add the third egg, beat at least two more minutes. 4. This recipe will fill 3 9-in. cake pans if each one is filled slightly less than halfway. This makes an impressive looking cake when ganache and frosting is spread between each layer. 5. To make the ganache, boil the cream over medium heat, then add the chocolate chips, lower the heat, and whisk briskly until smooth. 6. This recipe's buttercream frosting is good, but unnecessarily complicated. Just cream the butter, mix the cream, vanilla and chocolate together,alternately add it and the confectioner's sugar to the creamed butter, then the cream cheese. I found the frosting too thick, so I added 3 tbs. milk. I left out the egg yolk completely. 7. Cake assembly-pour the ganache in the center of each layer, then carefully spread it just to the edge. Chil",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "frymama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2316747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-08T03:11:59.083Z",
                "reviewBody": "As someone who has never baked with ganache before it would have been helpful to know that I should have refrigerated or whipped it before trying to spread it on the cake. It was a colossal disaster. The worst baking experience I have ever had. Ganache spilling everywhere.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "MEGAN24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1083780/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-14T06:56:12.227Z",
                "reviewBody": "WOW!! I had never made a cake from scratch but wanted to try. I was a little leary and VERY scared. I pretty much followed this recipe exact with the exception that I used semisweet choc chips for the ganache. This cake was VERY time consuming - im sure that might have something to do with my inexperience. I did refridgerate the ganache (overnight, actually since it became very late) In the morning I whipped it with a hand mixer and it was perfect. I didn't think the batter was too thin and it fit fine in 2 pans. I also did firmly pack the brown sugar as I think someone else had suggested. Ok so I twisted things a little by frosting the entire cake with the ganache and using the buttercream frosting to garnish on top and the bottom - I also shaved some chocolate for decor. (im going to see if I can figure out how to load a pic).. Here's the best part - I take this absolutely beautiful cake to work with me tonight and had it in a crystal disply case (I work in a restaurant) I added it as a dessert special and of course because of the beauty of it was ordered by the very first table of the night. I was mortified because even with its looks I was so afraid that with the first cut it would collapse or explode or worse, I was afraid it would taste disgusting all put together. HOLY MOLY, it was a hit!! We sold almost the whole cake and people went on about it being the best cake they ever had and how moist it was, etc. I was beaming and LOVED taking credit for it!! Thank U!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRAZYKEL028",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1004367/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-27T04:53:16.32Z",
                "reviewBody": "I usually don't trust recipes I find on the internet. However this recipe looked so good that I tried it out on a family gathering. It was really great. An option that I really enjoyed was for the ganache: I made it first then let it set for about 3 hours while I made the rest of the cake stirring it every once in a while. The chocolate I used for it was the Ghiradelli's 60% Cacao chocolate chips (also comes in a bar form). That chocolate is amazing and made the ganache to die for!!!! Also it says to grease and flour the pans and that is a good idea. I used pam and flour and that works amazing-perhaps better than butter or crisco. And do watch out for the changes in vanilla. The cake says 1 1/5 tablespoons vanilla yet in the directions it says 1 1/5 teaspoons...I opted for the teaspoons and it turned out great. I had some fresh raspberries that I sprinkled on top and around the bottom of the cake. This cake is amazing and will be a favorite of mine!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pwoodson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2469798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-23T15:39:54Z",
                "reviewBody": "Have NO idead what went wrong with this recipe - but my own experience with this one is pure disaster. Prior to adding the boiling water to the batter the batter looked terrific. I added the 1 cup of boiling water to the batter and the batter became very thin (as the recipe says it will become). However the recipe says it makes TWO 9 inch layers - but instead it filled THREE 9 inch layers. (Now here's the worst part...) When baking in the oven all three layers overflowed - badly - and the cake seemingly refused to bake(?). The recipe says 35-40 minutes to bake and after an hour & 15 minutes I finally just took the pans out of the oven. The cakes were lopsided - and sunken in. When taking the layers out of the pan ALL cake layers stuck badly to the pans. One of the layers came out like a DOUGHNUT(?!?) - about 3\" diameter staying inside the pan! This is for a birthday party tomorrow night so I iced the cake anyway - but this cake is without doubt one of the ugliest lopsided cakes I've ever made - and I'm actually afraid to see what it tastes like. Luckily I have ice cream to go with it - so I'll most likely stop at the store & get stuff to make ice cream sundaes just in case the first bite of cake tells me not to serve it to anyone else... Very very odd.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "exnyker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1819036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-28T20:52:51.687Z",
                "reviewBody": "This cake is fantastic! It got rav reviews from friends and family alike. I have a friend who asks me if I made it again almost everytime I see her! Personal Preference - I make the ganache and the frosting FIRST. Then the cake. By the time the cake is cooled the ganache and frosting are perfect spreading consistencies. And sometimes I use semi-sweet chocolate for the ganache - it depends what is in the cupboard. It's the perfect chocolate cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Camille",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1086801/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-04T19:22:31.51Z",
                "reviewBody": "Great cake! Made this for a dinner for 5 birthday celebrants & they all loved it couldn't stop talking about it! The waiter & the table next to us also tried it & raved about it. Now I did do something unusual to personalize it for the celebrants who were all from New Mexico a state that loves its chiles so much that chiles are the official State Vegetable! I added NM hot green chile jam to the cake batter (1/3 cup jam per 9\" layer) & NM red chile powder to the ganache. A total & memorable success! The addition of jam to the cake batter of course affected the texture but it was still terrific: moist & rather dense. I will make it again without those changes & update my review later. I chose another frosting (butter cream which I also spiked with red chile powder) - because I did not want the raw yolk of this recipe's frosting. The bottom layer was frosted chilled in fridge to firm then the thick fluid of ganache was poured & spread over that. For a very easy decorating method I put some ganache into a squirt bottle. Alternatively liquid ganache can be poured over each layer. Note: for easy & perfect removal from pans line pan bottom with wax paper trimmed to fit it. Grease it & the sides then dust it all with a mixture of flour & cocoa powder. Adding cocoa powder prevents the appearance of a film of white flour contrasting against the dark chocolate an old baker's trick. Allow pans to cool on racks for 10 mins. before turning out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-17T15:29:42.467Z",
                "reviewBody": "I won second place OVERALL at our State Fair with this cake....over approx 250 cakes! It is fabulous. My only change is I use choco-bake instead of unsweetened chocolate",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNEBACON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/414164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-11T18:34:28.89Z",
                "reviewBody": "This is an excellent Chocolate cake to make. The cake part is so moist and almost brownie like that you could eat it just like that with no frosting at all. I ended up adding some sugar to the ganache filling cause I thought it was a tad too bitter for me. I also used Parchment paper to line my pans and they almost fell out it was so easy to remove from the pans. The frosting is a little thick and heavy and was kinda hard to spread over the Ganache filling. All in all I would make this again. I am having a dinner party tonight and will let you know what others think about it...This is a very very chocolate cake with a nice frosting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAVID1RAY2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/882417/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Elizabeth's Extreme Chocolate Lover's Cake",
            "description": "A chocolate lover’s cake you won’t easily forget!",
            "uploadDate": "2018-04-04T17:28:30.128Z",
            "duration": "PT2M40.149S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F333373c3-403a-4453-8b60-1c707fb77543%2F838c3d7e-9240-41ae-8b98-e6a47bc98a88%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5763941440001"
        }
    }
]