[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/693/meat-and-poultry/turkey/ground/",
                    "name": "Ground Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/31780/rosemary-turkey-meatloaf/",
        "name": "Rosemary Turkey Meatloaf",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F15733.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2020-03-05T04:57:03.000Z",
        "description": "This is a delicious alternative to the usual meatloaf.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ½ pounds ground turkey",
            "2 cups dry bread crumbs",
            "1 onion, chopped",
            "1 egg, beaten",
            "1 cup milk",
            "½ cup balsamic vinegar",
            "1 clove garlic, minced",
            "1 teaspoon salt",
            "1 teaspoon pepper",
            "1 ½ tablespoons chopped fresh rosemary",
            "1 cup canned tomato sauce",
            "¾ cup brown sugar",
            "1 tablespoon Dijon mustard"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, mix together the ground turkey, bread crumbs, onion, egg and milk. Season with balsamic vinegar, salt, pepper and rosemary. Press into the prepared pan. Blend together the tomato sauce, brown sugar and mustard; pour evenly over the top of the loaf.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 1 hour in the preheated oven, or until juices run clear when pricked with a knife.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Ground Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MICKQ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8263157894736843,
            "ratingCount": 380,
            "itemReviewed": "Rosemary Turkey Meatloaf",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "362.1 calories",
            "carbohydrateContent": "47.1 g",
            "cholesterolContent": "92.9 mg",
            "fatContent": "9.8 g",
            "fiberContent": "2 g",
            "proteinContent": "20.9 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "807.3 mg",
            "sugarContent": "27.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-13T03:31:50.36Z",
                "reviewBody": "After reading several reviews that the loaf turned out mushy, I molded the meat in the loaf pan and inverted it out onto a wire-rack to form its shape. I placed the wire-rack  on top of a foil-lined cookie sheet. This works great. It prevented the meatloaf from being soggy and it also allows the sauce to cover all the sides. As for the sauce, I replaced the brown sugar with honey. It  is a good compliment to the dijon mustard  and it helped thicken the sauce. Will definitely make this again, its very tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PARKER71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1246979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-08T19:09:08.85Z",
                "reviewBody": "I have been making this recipe for 3 years and just remembered that I should review it. It quite good. If you make it as is, it will come out juicy and will likely fall apart (but still taste good). I cut back on the milk and vinegar to address this. If you're interested in keeping the calories low, you can use skim milk, all white meat turkey, cut back on the breadcrumbs, and cut back the sugar (1/4 cup is enough) and it all still tastes great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1971732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-09T16:21:39.34Z",
                "reviewBody": "It is not fair to rate a recipe when you really did not follow it but after reading the recipe and the mainly the first two pages of reviews and making many many meatloaves over the years I had to take some tips from the posters.... so here goes.\nFor Modifications I used \n1 cup bread crumbs\n1/4 cup balsamic\n1/4 cup milk\n1 tsp chopped fresh rosemary\n2 garlic cloves - sauted in advance with the onions.\nUsed a meatloaf recipe topping that we have been using for years - it is sweet but we like it and don't have to open a can of tomatoe sauce.\nFor the topping I used 1/2 cup of ketchup with a good dash of worchesterchire, 2Tbsp of brown sugar and Tbsp of dijon.\nBake the meatloaf for the 1 hour as required BUT after the first half hour turn the meatloaf out of the pan onto a foil wrapped cooking pan.  The meatloaf will keep its shape and you can \"glaze\" it with the topping put it back in the oven and it will coat it on all sides and kind of carmelize.  Hope this helps.\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Comeandgetit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2363829/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-18T23:46:52.923Z",
                "reviewBody": "This is one of those recipes you will either love or hate. It is really different----but I loved it! Great use for ground turkey--which can end up bland in some recipes. LOVED the use of fresh rosemary. I made a few changes---I used 2 lbs. of ground turkey (just because I had it) & only 1/2 cup milk & 1 cup Italian Bread Crumbs & 1 cup plain bread. By accident forgot to add the balsamic vinegar! I'll have to try it next time ---now I'm curious if it will be just as good with it. Per previous reviews I halved the amount of topping. I'm glad I did because I thought it was just sweet enough. However I read the amount wrong on the Tomato Sauce and only ended up adding 1T. with the brown sugar & dijon---I'll do the same next time because I was happy with the topping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tizzylizz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1150935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-26T21:40:57.67Z",
                "reviewBody": "We liked this dish a lot. For one thing it was surprisingly moist. But that had a lot to do with the type of ground turkey we used it had a 15% fat level. We eat a lot of ground turkey here no beef ever because of intolerance issues. So we certainly know of the 99% fat free turkey products. But they tend to taste like balsa wood frankly. Pure protein always does. If you think about it boneless skinless breasts (chicken or turkey) are not the stuff of a simple sauté. You have to add something even if it s only cheese or gravy. In fact for this dish I d have added about a cup of grated cheese if it were built on the fat free type of turkey. We didn t fiddle much with the recipe at all. Made it just as is. Came out very well and the sauce is nice. It did have a vinegar flavor though. My wife thought that just made it sweeter but I was very aware of it. I do like balsamic vinegar so that was OK with me. Instead of prepared Dijon Mustard we used Colman s Mustard (the powder stuff that comes in those mustard yellow tins). It did very well but be warned this is not your grandma s mustard. This stuff is spicy hot much too hot if you re not into spicy heat at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MikePhx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2075474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-06T19:04:21.797Z",
                "reviewBody": "For my first turkey meatloaf I used this recipe. It was good but I made a couple of changes: no sugar in fact I left out the glaze - for my tastes I don't need it but Oops I forgot the garlic (might have added a little zing oh well next time) I also used dried rosemary leaves (about 1 Tbsp) used only 1/2 Cup of milk I used chopped scallions for the onions and added chopped celery. The result was a tasty loaf. Last night's turkey meatloaf was served with steamed green beans and broccoli and onion tater tots I think I'll try to serve this meal every year on the Tuesday after Labor Day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bazdazzle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T00:38:52.56Z",
                "reviewBody": "This has to be one of the worst recipes we've ever tried. The sauce was much too sweet and the consistency of the meatloaf was awful. We had to throw the entire pan out and by then we were too disgusted to actually eat dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ALS75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T18:58:54.153Z",
                "reviewBody": "A great meatloaf find for those of us who don't/can't eat red meat. I have prepared this for my boyfriend and I as well as for an office potluck and everyone just loved it. I sometimes cut the amount of balsamic vinegar in half and used 1/4 cup of worstchester sauce to give a little stronger flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Scwkitty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/949304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-11T21:19:36.793Z",
                "reviewBody": "Very yummy! I reduced vinegar to 1/4 cup per other reviewers' comments and also reduced the sugar in the sauce. Ended up cooking the meatloaf for about 90 minutes till we got a 170 degree reading on our meat thermometer. (We are sticklers for safety! I think 160 would have been ok...) It was great and made clean slices no mush here! For extra pizzazz we lined the bottom of the pan with 5 slices of bacon-precooked slightly to reduce fat. Mmmmmmm! Fed the 2 of us with a green salad for 3 days with a little left over to nibble on. (we're small eaters.:) Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTENMAG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/790197/"
                }
            }
        ]
    }
]