[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/670/main-dish/pork/ham/",
                    "name": "Ham",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14978/main-dish/pork/ham/whole/",
                    "name": "Whole",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/34523/glazed-ham/",
        "name": "Glazed Ham",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F760438.jpg",
            "width": 2288,
            "height": 1712
        },
        "datePublished": "2020-03-05T04:57:07.000Z",
        "description": "A raw ham is slow roasted, then seasoned with a sweet smoky sauce during the last hour to make a memorable meal with little actual work involved.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT8H35M",
        "totalTime": "P0DT8H40M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (8 pound) bone-in shank ham",
            "4 cups water, or as needed",
            "½ cup honey",
            "½ cup brown sugar",
            "2 tablespoons liquid smoke flavoring",
            "2 tablespoons Worcestershire sauce",
            "1 pinch ground cloves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 275 degrees F (135 degrees C). Place ham in a roasting pan. Pour in water to a 2 inch depth. Cover with a tight fitting lid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 6 to 8 hours in the preheated oven (all day or all night). Remove from the oven, pour off drippings and reserve. Debone ham, removing any excess fat as well, and return to the roasting pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Skim fat from the top of the drippings, and discard. In a small bowl, mix one cup of the drippings with honey, brown sugar, liquid smoke, Worcestershire sauce and cloves. Pour this over the ham, cover and return to the oven. Remaining drippings may be discarded or reserved for other uses.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for another 30 to 40 minutes in the preheated oven. Let stand for 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Ham",
            "Whole"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Connie Barnett"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.673139158576052,
            "ratingCount": 309,
            "itemReviewed": "Glazed Ham",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "511.7 calories",
            "carbohydrateContent": "21.2 g",
            "cholesterolContent": "183.3 mg",
            "fatContent": "20.7 g",
            "fiberContent": "0.1 g",
            "proteinContent": "57.4 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "158.3 mg",
            "sugarContent": "20.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-24T17:28:26.187Z",
                "reviewBody": "This was wonderful!!!!  I used a 6 pound double smoked, fully cooked picnic ham and put it in the slow cooker with 1/2 the amount of water in the recipe.  I cooked it on low for 8 hours.  2 hours before the time was up I removed the drippings, skimmed the fat of the top and added the honey and brown sugar and cloves.  I did not use liquid smoke or worchestershire sauce.  I actually doubled the amount of glaze as I had two cups of drippings and didn't see the sense in wasting them.  I poured it back over the ham and let it cook for an hour and a half.  I then turned the crock setting to high and removed the lid and basted the ham cooked for half an hour more and pulled the ham out to rest.  I then took the drippings and boiled them on the stovetop gently to reduce.  I served this with baked root vegetables, a salad and some steamed green beans and the glaze reduction on the side which was excellent for adding onto the root veggies and the ham.  Everyone loved the ham and I have only enough left to make a casserole with!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NEWSAHMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1082523/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-26T17:17:22.403Z",
                "reviewBody": "If I could give more stars than 5, I would. This ham was amazing! It was so tender, I could not pick it up out of the pan without it completely falling apart! Here's some secrets that I did. First, I used a 8-pound smoked picnic ham rather than a shank ham. I put it in a dutch oven without a rack. I put the water in as directed. I PUT THE HAM IN FAT SIDE UP! This allowed for the fat to penetrate and \"baste\" the ham while cooking. I put the lid on  it and forgot about it for 7 hours (1 hour per pound) at 275 degrees. Then I poured all of the liquid out, glazed the ham, anc baked it for another hour. I will definately make this again. It was a hit with my husband who is always looking for that meat to fall off the bone. Now if only I could make a roast this tender....  :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leslie Sullivan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/995256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-25T22:41:25.733Z",
                "reviewBody": "Wow.. This was AMAZING! I even used a small, boneless, presliced, alredy cooked ham and it was still Amazing! I just cooked it in the water for an hour to get some of the juices in the water and than I followed the directions for the glaze exactly like it's stated and than poured it over the slices and covered it and cooked it for another hour... and like another poster said the meat that was submurged at the bottom of the pan was the best... We were all fighting over those slices! This is definatly a keeper and I can't wait to try it at Easter w/ a real ham.  THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "giggletush",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-12T16:43:51.213Z",
                "reviewBody": "This ham was so good it turned out extremely tender. I used a fully cooked 18lb ham for easter. Put it in the oven with the water and let it cook slow for about 3 and a half hours. I didn't debone it but cut a checkerboard pattern on the top of the ham and poured the glaze over. returned the ham to the oven for another half hour and sliced. So good everyone had compliments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "saraha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2279163/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-01T16:20:24.733Z",
                "reviewBody": "This was awesome! We did a ham for New Year's and I actually did this in my slow cooker. I put the ham in cooked for about 5 hours on high then added the glaze and cooked for 1 1/2 hours on low. The only problem I had was trying to figure out how to get it out of my crock pot! The sauce smells and looks a little weird when you mix it up and I was leery because I'm used to the regular honey/brown sugar glaze but once it's had time to cook on the ham it's perfect. I made this with the \"potato casserole\" (recipe submitted by JeremyBeeler - also a five star recipe... just don't check the nutrition information!)which I've made from time to time over the years and green beans with almonds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dani",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16913/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-17T14:18:20.95Z",
                "reviewBody": "I just made this for Easter and everyone loved it. It was a tad sweet for my taste but that's just me. It was the first time I've made a ham and didn't realize how much fat is on a shank ham so when I pulled it out of the oven after 8 hours I was shocked at how little meat was left after removing the fat. I had a 10 lb ham and was planning to feed 13 people. What was left was not enough to do that so I had to grill 6 chicken breasts and we ate every bit of both. It was easy though and a hit so I will make it again with the knowledge that I need about 1 lb per person.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYG827",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/470525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T19:53:00.78Z",
                "reviewBody": "Very good. I cooked it for Easter for a family of die-hard baked ham (the 60.00-specialty store kind) fans. It was a big hit from waking up in the morning to the delicious smell (cooked over night). It fell off the bone. I will say I was nervous baking my own ham but it was worth it. The ham was different than any store bought ham I had ever had. Thanks for a great easy recipe. I will make it again and I won't wait until next Easter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kirsten Holmes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/631218/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-10T00:15:56.15Z",
                "reviewBody": "Used this recipe with a precooked spiral sliced 9lb. ham. As suggested I cooked for 1 hour on 250 degrees then followed the recipe pouring the glaze over the ham. I patted some brown sugar over the top but that's just my preference. It cooked for about 2 hrs more and was done and delicious. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deanna Latendresse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/847639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-24T23:33:04.267Z",
                "reviewBody": "First, let me say this:  I am a NON-HAM person.  With that being said, my boyfriend said  \"Hey, let's cook ham for Christmas Eve\".  Here's is what we did:  We used an 18 lb supermarket bone-in, precooked ham.  We cooked it for 3 1/2 hours at 275 degrees in water (about 2 inches in the roasting pan), tightly covered in foil.   We took the ham out of the over, kept 1 cup of the \"ham water\" to add to the glaze recipe (made exactly as directed) and poured out the remainder of the \"ham water.\"  We DID NOT remove the bone.  The ham was recovered tightly with the foil, returned to the oven (still at 275 degrees) and cooked for 30 more minutes.  When finished, it was AMAZING!  The meat literally fell from the bone.  We stood at the stove, peeled pieces of the ham off, dipped the pieces in the \"glaze water\" at the bottom of the  pan, and looked at each other with big, goofy smiles.  My boyfriend (who IS a Ham Person) thought it was fantastic, but would have liked the glaze to be a bit thicker--maybe not add the \"ham water\" but brush the ham with the glaze, as is?    Maybe use a thickener like cornstarch?  He wasn't sure.  Needless to say, I have become a \"Ham Convert\", thanks to this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mountain Gal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8392224/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Glazed Ham",
            "description": "Raw ham is slow roasted and seasoned with a sweet smoky sauce.",
            "uploadDate": "2013-03-04T21:15:23.783Z",
            "duration": "PT4M18.133S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F882c1e2c-c76d-4fd2-8e80-ce4e260ab46b%2F0e073767-d8a2-4ba3-9a71-1a085d8ced44%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2203263957001"
        }
    }
]