[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/350/bread/quick-bread/muffins/",
                    "name": "Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/35757/strawberry-oat-muffins/",
        "name": "Strawberry Oat Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F622442.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2020-03-05T04:57:10.000Z",
        "description": "A delight to munch on with that morning coffee!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "12 muffins",
        "recipeIngredient": [
            "1 cup rolled oats",
            "1 cup buttermilk",
            "1 cup all-purpose flour",
            "1 teaspoon baking powder",
            "½ teaspoon baking soda",
            "1 teaspoon salt",
            "1 egg",
            "¼ cup vegetable oil",
            "¾ cup brown sugar",
            "1 teaspoon vanilla",
            "1 cup chopped fresh strawberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a muffin pan, or use paper liners. In a small bowl, combine oats and buttermilk, and let stand 5 minutes. In a medium bowl, combine flour, baking powder, baking soda and salt; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat together the egg, oil, brown sugar and vanilla. Blend in the oat mixture. Stir in the flour mixture, just until moistened. Fold in strawberries. Fill muffin cups 2/3 to 3/4 full.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 15 to 20 minutes, or until a toothpick inserted into the center comes out clean.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SWIZZLESTICKS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.310344827586207,
            "ratingCount": 203,
            "itemReviewed": "Strawberry Oat Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "175.6 calories",
            "carbohydrateContent": "28.2 g",
            "cholesterolContent": "16.3 mg",
            "fatContent": "5.7 g",
            "fiberContent": "1.2 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "308.1 mg",
            "sugarContent": "15.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-25T21:43:52.313Z",
                "reviewBody": "With the exception of adding 1/4 tsp. of cinnamon just as a taste preference, I guess I'm one of the few who made this recipe as written--no substitutions, no modifications. (Cornstarch in a muffin batter?) Even after mixing them up, baking them and, finally, eating them, I can confidently tell you these are a perfect strawberry oatmeal muffin, and the recipe needs no tinkering or tweaking to make them so. Tender crumb, just the right amount of sweetness for a muffin, beautiful light brown color,  and bursting with plump little chunks of red strawberries. These are perfectly rounded, moist and delicious with a pleasant and delicate pairing of the oatmeal and strawberry flavors. Thanks for sharing the recipe for these Wendy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-27T16:57:48.14Z",
                "reviewBody": "These muffins are fabulously moist and delicious!  I decided to make these muffins because of the rolled oats.  My 5yo son has borderline high cholesterol and oatmeal can help reduce it naturally and he will not eat just oatmeal.  Firstly, I doubled the recipe because I have 5 children and 12 muffins wouldn't have lasted for more than 5 minutes in our house.  I took some suggestions from the other reviewers and changed the recipe in the following ways:\r\nI substituted whole wheat flour for 1/2 the amount of regular flour; I used one mashed banana for 1/2 of the amount of oil; I added cinnamon along with the soda, powder and salt.  If I had egg substitute on hand, I would have used that instead of regular eggs.  I also used fresh cut strawberries.\r\nThese muffins are delicious and so much more healthy than the standard fare...great source of fiber!  Thanks for submitting such a different recipe for strawberries!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TiredMomtoSIX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/748214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-07T16:47:38.733Z",
                "reviewBody": "Yumm! As others suggested I made a few changes: juice of 1/2 a lemon and 2%; cut the oil in half and used a 1/4 cup cinnamon applesauce (great flavor!), zest of my 1/2 lemon, 1/4 tsp. ground nutmeg, a generously rounded tsp. cornstarch, and about 2 Tbsp of flax seeds for a healthy kick. I used a bunt pan instead of muffin tins and it was ready in about 17 minutes. I want to try it with whole wheat flour. But it was gorgeous when it came out of the oven, a good gooey center, not too mushy but I might add a little more cornstarch next time to combat my juicy berries.  I will defiantly make this again, perhaps with cranberries and orange zest!\n\n\nOkay I just had to come back to change my rating, I did the recipe again same as above except this time with a Tbs of corn starch, FANTASTIC!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GreenGoddess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744603/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-29T22:03:10.293Z",
                "reviewBody": "I made this recipe with my oldest son. We used lactose-free milk that we \"soured\" with lemon juice. I taught him to mix the buttermilk with the oats and let it \"sit\" for 15-20 minutes before adding the rest of the wet ingredients. We did substitute one mashed banana for the oil and we cut the sugar back to a half cup. We made no other changes. I did make a judgement call and asked him to let the batter sit just a little longer maybe ten minutes because it was quite wet even though the oats had soaked up a lot of the buttermilk previously. My son and I kept leaning over the bowl to smell the batter because it smelled wonderful. We baked the muffins at 350 for 20 minutes. They turned out very nicely--chewy dense muffins with the perfect amount of strawberries. I'm really glad we substituted the banana in place of the oil it was a nice combination with the strawberries. NOTE: For all those wanting to make this recipe watch your batter. You might have to let it sit a while to get the oats to soak up some of the liquid too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T11:44:21.893Z",
                "reviewBody": "This was definitely a keeper - but I DID make some changes: As suggested by others I added some corn starch. I then doubled the baking soda. I used a white/whole wheat blend (altho next time I may go all whole wheat. I used vanilla soy milk with a tbls. of cider vinegar instead of buttermilk which I seldom have on hand. Because of that I did not add vanilla. I did however add a lot (how much?) cinnamon and nutmeg. Also added coarsely chopped pecans and tried go-go berries instead of raisins or craisins. Finally I added an equal amt of maple syrup instead of sugar. These came out a tad too sweet for me but hubby loved them. I used just-bought fresh strawberries and they were not at all mushy. The consistency was perfect the tops were rounded. Next time I will use whole grain flour apple sauce or bananas instead of oil and I will mix/match nuts & dried fruit. But definitely a keeper. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "E.J. FRANK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/278323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-13T05:20:51.32Z",
                "reviewBody": "Delicious! I loved the texture of the oats and the flavor of the strawberries. A keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-01T00:45:30.56Z",
                "reviewBody": "These were tasty - I definitely recommend them! I did make a bunch of recipe modifications based on previous reviews and my daughter's egg allergy which is why I gave the original recipe four stars instead of five. I used 2% milk soured with vinegar instead of buttermilk substituted 1/3 cup whole wheat flour for the white flour replaced the egg with a mix of 1 Tbsp flax meal and 3 Tbsp hot water plus added 1 Tbsp cornstarch 1/2 tsp cinnamon and a handful of raisins. I baked them for 17 minutes. These were light yet moist and fluffy in the middle - not gummy at all - and the strawberries were tasty! These are definitely going into my regular rotation. Thanks for giving me a good recipe to work with!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MELISSA_B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-06T16:41:26.22Z",
                "reviewBody": "I made these muffins this morning and they turned out moist. I was a little afraid because I don't usually like strawberries baked in things because of their tendency to get mushy. I chopped the strawberries small to avoid big mushy pieces. The muffins had a good flavor kind of like strawberry jam baked into the muffin. I have had better muffins (ones with more butter/sour cream) but these are very good considering they are a little lower in fat. Because they were so moist I might try reducing the oil a little next time. I doubt I would miss it. I also made it all in one bowl. I started with the oatmeal/buttermilk let it sit a few minutes added the wet ingredients on top blended well and then added the dry ingredients on top of that. I stirred just until moist and then folded in the strawberries. They were fine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFERLYNN2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-06T18:55:20.16Z",
                "reviewBody": "Had a hard time cooking these all the way through and still after 25 minutes the strawberries were making the inside soft. I guess the cornstarch others recommended would eliminate this. I will try it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "THE HOOVE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/759783/"
                }
            }
        ]
    }
]