[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/37965/asian-fire-meat/",
        "name": "Asian Fire Meat",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F819094.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T04:57:18.000Z",
        "description": "For a great tasting beef dish from Asia, fire meat is delicious and easy to prepare. Ice cold beer is the beverage recommended with fire meat.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ cup soy sauce",
            "1 tablespoon sesame oil",
            "2 tablespoons brown sugar",
            "3 cloves garlic, crushed",
            "1 large red onion, chopped",
            "ground black pepper to taste",
            "1 teaspoon red pepper flakes",
            "2 tablespoons sesame seeds",
            "2 leeks, chopped",
            "1 small carrot, chopped",
            "1 pound beef round steak, sliced paper thin"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the soy sauce, sesame oil, brown sugar, garlic, and red onion. Stir in the black pepper, red pepper flakes, sesame seeds, leeks and carrot. Mix in the meat by hand to ensure even coating. Cover and let marinate for at least 2 hours or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush the bottom half of a wok with cooking oil, and heat over medium-high heat. Put in all of the meat and marinade at once, and cook stirring constantly. The meat will be cooked after just a few minutes. Remove from heat and serve with rice or noodles. For Korean-style fire meat, roll the meat mixture up in a leaf of red lettuce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SONNYCHIBA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.332142857142857,
            "ratingCount": 280,
            "itemReviewed": "Asian Fire Meat",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "381.8 calories",
            "carbohydrateContent": "22.3 g",
            "cholesterolContent": "71.4 mg",
            "fatContent": "20.5 g",
            "fiberContent": "2.8 g",
            "proteinContent": "27.3 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "1886 mg",
            "sugarContent": "11.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-27T17:25:17.487Z",
                "reviewBody": "Marinating the meat longer than 2 hours just turned it to a slimy, mushy mess.  I marinated mine for 2 hours, than drained off the marinade, reserving it for later, patted the meat dry, and browned in batches in a 12-inch skillet so the meat would actually brown.  Only after all the meat was browned and added back to the pan, did I add the marinade do the pan.  Don't use round steak, it gets tough and rubbery very easy and has a livery taste, use sirloin or flank steak for better tenderness and flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-04T03:54:16.71Z",
                "reviewBody": "A couple of options regarding the marinade:  If done in a wok, cook the meat and veg first.  Put on a plate, then add the marinade to the wok and reduce.  Pour on top of the meat/veg.  If done in a skillet, make sure it is 12\" which covers a very large cooking area.  Flared skillet is even better.  Make sure liquid evaporates as quickly as possible.  You want browned meat.\n\nIn either method, make sure your pan is screaming hot.\n\nYou can always add soy sauce, but you can't take it away.  So marinade your meat using 1/2 soy sauce and 1/2 stock or water.\n\nDon't marinade the sesame seeds.  As you're heating up your pan, put the sesame seeds in and swirl a couple of times in the dry pan.  Reserve and add on top of the cooked mixture.  That way, the sesame seeds get toasted, then relax to let the oils re-distribute.  Who wants a wet sesame seed?\n\nI don't know if it's Chinese, but I added scallions (green onions) at the end.  Fabulous.\n\nIN the end I separated the meat from the sauce, and cooked soba noodles in the sauce with some water added.\n\nThis is a great starter recipe.  Expand your horizons with it.\n\nI made spring rolls with some, and red lettuce leaves with others.  Either way it was delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scott Simmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1287563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:07:46.967Z",
                "reviewBody": "We made this last night and loved it. Used london broil and sliced it partially frozen on the meat slicer so as to get those paper thin slices. Didn't have leeks but don't know as they would've added anything. As suggested we rolled each one up in a red lettuce leaf along with about a tablespoon or so of rice that had been cooked with chicken broth and asian seasonings. Using the lettuce made it very refreshing. Although the beef was tender having been sliced so thin it may benefit from adding a tablespoon of water and 1/2 teaspoon of baking soda to the marinade. This will give you beef that'll melt in your mouth! As for the heat I thought it'd be too much but after cooking it really mellowed and even my low-heat tolerant husband agreed that it could be bumped up a bit. All in all great. Easy quick cooking very tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin Seidel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/636468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-11T13:32:53.437Z",
                "reviewBody": "This was a good base recipe but it needed some changes to the cooking/marinating process. I know from experience that if left too long sitting in soy sauce the meat becomes de-natured and slimy. I also didn't like the idea of all the vegetables sitting in soy sauce for hours. I marininated the meat in 1 Tblsp soy sauce a bit of minced garlic sesame oil cornstarch and 1/2 tsp baking soda for about an hour. I stir fried the garlic some ginger and the red pepper flakes in very hot peanut oil for about 30 seconds then added the onions leeks and carrots (which I grated) and stir fried them for 3 minutes or so. I removed the vegetables from the pan added a bit more oil and stir fried the meat until it started to become crispy. Then I poured the sauce to which I added some sherry more sesame oil and 1 Tblsp cornstarch over the meat and simmered briefly until it thickened. Then I returned the vegetables to the pan and stirred them into the sauce. This came out great. I served it with leftover sesame noodles and my family liked it a lot. Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-06T15:50:14.89Z",
                "reviewBody": "Gary this is DELICIOUS! My husband and I like a little more heat and more complex sweet so I made the following changes: 1. substituted brown sugar for maple syrup 2. upped the red pepper flakes to 1 tbsp AND added 1 tbsp of Asian chili paste (we like food that makes us sweat) 3. Added 1 can of water chestnuts This is a keeper--thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Javagoddess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/javagoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T00:44:17.077Z",
                "reviewBody": "This is a great easy recipe. Perfect when you have a busy day coming up. You can add all kinds of things. I've added ginger shallots cabbage bean sprouts bamboo shoots celery and toasted sesame seeds. A tip about sesame seeds. You can buy them at a middle eastern market in your city and get about 6 oz. for 1.29 compared to 3.29 for 2 oz. at the supermarket. If I have a lot of veggies in it I double the marinade and thicken with a cornstarch slurry at the end of cooking. My husband LOVES this dinner and I love making it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "good cooker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/420347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-03T14:32:57.78Z",
                "reviewBody": "this recipe screams, 'KEEPER'~!  I had a cheap old round steak I got reduce priced.  This is an excellent way to prepare what can sometimes be a tough old cut of meat.  I did not have leeks, so subbed sliced mushrooms.  I let this marinate for 24 hours before preparing.  By the time I put my rice on the stove and heated my wok at the same time and by the time the rice was done, so was this....I did add a cornstarch slurry at the end to thicken a bit and served over jasmine rice.  When putting together the marinade, I used low sodium soy but was about 3 tbsp shy of the specified amt. so used regular soy.  Once I got the marinade together, it tasted a bit salty.  I added about a tsp more of brown sugar to help balance out.  I would recommend using low sodium soy since half cup is what this recipy specifies....but absolutely delish!~  I like spicy so added more tunisian chili powder. *love the sesame seeds for a little crunch and presentation.  I also added a handful of beautiful huge cashews to carry on the crunch...mmmmm wonderful addition.  This is right up there with Asian Orange Chicken from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-29T10:25:37.28Z",
                "reviewBody": "I'm a lover of Asian food and unfortunately althought quick and easy to prepare found this an unimaginative recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JDEKEHOE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/567827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-19T15:25:57.323Z",
                "reviewBody": "This is a great - and flexible recipe; it's a regular on my menu. I up the red pepper by a 1/2 tsp leave out the leeks double the carrots and add a handful of fresh ice-cold sugar snap peas during the last 3 minutes - or else I serve them on the side as a balance for the heat. They really enhance the experience. I also use a lean roast for the meat as this seems to come out more tender and flavorful. I also splash in some sesame oil when I cook the rice - adds a complex smoky essence to the overall dish. To cut down on empty carbs I sometimes serve this with slightly undercooked cabbage; the sweetness of the unsalted cabbage counters the soy and spice. Just wrap a small amount in a cabbage leaf and feast! An excellent meal and easily expandable for more guests.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Canis Canon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4783413/"
                }
            }
        ]
    }
]