[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/670/main-dish/pork/ham/",
                    "name": "Ham",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14978/main-dish/pork/ham/whole/",
                    "name": "Whole",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/41750/ritas-sweet-holiday-baked-ham/",
        "name": "Rita's Sweet Holiday Baked Ham",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F749966.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T04:57:33.000Z",
        "description": "This is my mom's holiday ham recipe. She would cook this easy recipe on my birthday. Made with maraschino cherries, sliced pineapples, brown sugar, honey and much more yummy ingredients. You'll love this ham dinner, and it's not just for the holidays, but great any time of year!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "1 cup maple syrup",
            "1 cup orange juice",
            "1 cup ginger ale",
            "½ cup brown sugar",
            "½ cup honey",
            "1 (10 ounce) jar maraschino cherries, halved",
            "1 (12 pound)  fully-cooked, bone-in ham",
            "1 (15.25 ounce) can pineapple slices in juice, drained",
            "1 box round wooden toothpicks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the maple syrup, orange juice, ginger ale, brown sugar and honey. Stir in the juice from the maraschino cherries, and half of the cherries. Score the outer edge of the ham with a sharp knife in a diamond pattern. Cuts should be about 1/4 inch deep. This will allow the ham to soak up the juice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the ham into an  oven bag, and carefully pour the juice mixture over it, keeping all of the juice in the bag. It may look like there is too much juice, but the ham will soak it up while baking. Place the pineapples onto the top of the ham, and secure with toothpicks. Place cherries into the centers of the rings, and secure with toothpicks also. Tie the end of the bag closed with the ties provided, place in a large roasting pan, and cut a few small slits in the top of the oven bag.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the ham for 2 hours in the preheated oven. The internal temperature should be 160 degrees F (80 degrees C) when done. Be sure not to touch the bone when taking the temperature. Remove ham from bag to a serving plate, and let stand for 10 minutes before carving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Ham",
            "Whole"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AMOREFATA1972"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.648967551622419,
            "ratingCount": 339,
            "itemReviewed": "Rita's Sweet Holiday Baked Ham",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "666.5 calories",
            "carbohydrateContent": "28.1 g",
            "cholesterolContent": "127 mg",
            "fatContent": "42.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "42.1 g",
            "saturatedFatContent": "15 g",
            "servingSize": null,
            "sodiumContent": "2917.8 mg",
            "sugarContent": "23 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-05-08T20:57:19.373Z",
                "reviewBody": "It was the first time I had ever cooked ham in a bag and it was truly excellent. I did not cook it for 2 hrs at 350 I slow roasted it at 200 for about 6 hours and the flavor went all though the ham. I was afraid it could be dry because of the length of time slow roasting but it was not. I also had marinated the ham in the bag with all the ingrediants over nite prior to baking. Again it turned out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIANNE35",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-19T22:31:37.03Z",
                "reviewBody": "Mmmmmmm!!!! This is the first ham I've ever made and I made it for Christmas dinner along with scalloped potatoes baked dill carrots corn pudding rolls and salad. It was just myself my brother and my dad but we all thought this was the best ham ever! It was cheaper than a fancy store bought ham and tasted better. In addition to looking gorgeous it was sooooo sweet and tender it was falling apart. The glaze is also really simple to prepare. The only problem I had is I kept making holes in the oven bag when I was cutting the diamonds into the unbaked ham so I'd recommend doing that BEFORE putting it in the bag (I thought I'd save some dishes) and be careful with the toothpicks not puncturing the bag when you put on the pineapple! Also buy the biggest oven bag you can find. Our ham took about 45 minutes longer to bake than the recipe said and it was also 10 pounds. I think it's important to use an oven bag because it keeps the ham nice and moist. The glaze didn't reduce like I thought it would but I put it in a bowl in the refrigerator then took off all the solidified ham fat (eww!) on the surface and it was a great sauce! This is definitely a repeat thanks for the recipe! I've wanted to have a ham like this since I was a little girl...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Bunny Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thebunnychef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T22:27:12.03Z",
                "reviewBody": "Wow, I made this recipe today and have NEVER heard anyone rave about how juicy a ham was until today.  I used an 8-lb. butt portion, and scaled the recipe to 18 servings.  I placed the dressed up ham in the bag with the juices the night before and just took it out the next day an hour before oven time.  I baked it at 325 degrees until it reached 160, about two and a half hours.  I let it sit for about 15-20 minutes in the bag while I finished the sides.  I basted it twice during baking, but didn't need to.  Tip:  prepare the ham, i.e., score, pineapples, cherries, etc.  Then place the empty bag in a pan, and then put the ham in the bag, and pour juices over.  Once the ham is in the bag, you can't move it without the toothpicks piercing it!  This ham needs no sauces to cover it ... it stands on it's own, and that opinion was unanimous.  Try this, it's terrific and easy cleanup is a bonus.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "claudygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T05:37:48.653Z",
                "reviewBody": "Excellent recipe. This will be my standard method of preparing ham from now on. I deviated from the recipe somewhat in that I forgot to buy oven bags at the store. Therefore I scored my ham mixed the marinade and poured it over my ham uncovered in a roasting pan. I had a 15 pound semi-boneless ham and therefore cooked it for 2 hrs and 45 minutes. I probably basted it 3 to 4 times while it cooked. It turned out fantastic. I did wait to place my pineapple slices and cherry halves on during the last hour of cooking as I was afraid they may burn if placed on the ham sooner (since I was cooking mine uncovered). To me this recipe defines the traditional holiday ham.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VDUNIGAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795042/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-01T01:20:17.327Z",
                "reviewBody": "This was good but I was a bit disappointed with the flavor. I didn't use an oven bag so that I could baste the ham but it still did not have as much flavor as I would have liked. The most flavorful of course was the bottom part that was cooked in the glaze for the full 2 hours. I liked but will find a way to keep more of the glaze on the ham. Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-28T15:37:03.17Z",
                "reviewBody": "This is the best tasting ham I have ever made or tasted that anyone else has ever made! I have never been able to make great ham and I have finally found the perfect recipe! EVERYONE LOVED this and there were NO leftovers! I followed the recipe exactly and my children thought I was a genius because they have never had ham like this. The cherries make it delicious and beautiful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BISKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/242121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-19T22:32:17.39Z",
                "reviewBody": "I made this for thanksgiving. The ham got eaten WELL before the turkey. Went over great and smelled SOOO good when it was cooking. I made sure to baste it ALOT.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JoyLee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-28T16:31:00.78Z",
                "reviewBody": "Made this ham for Easter Sunday and got rave reviews from the family. I did a 9 pound shank and cooked it at 300 degrees for a little over three hours basting every half hour or so. (I didn't use the oven bags because they're a pain in the butt in my opinion). Even without using the bag this ham still came out very tender and not at all dried out. I took the advice of some other members and tried bringing the leftover juices to a boil with some cornstarch but my \"gravy\" didn't thicken up... not sure what I did wrong. It still tasted great when poured over the ham. Overall very pretty and even more tasty! Thanks Rita!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRindell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/917993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-19T22:32:15.013Z",
                "reviewBody": "pretty easy and good...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Midyette Allen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683562/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T17:39:13.317Z",
                "reviewBody": "I'd give it two stars but the ingredients were expensive and the sauce has a peculiar aftertaste and not a very pleasant aroma. I started with an excellent spiral ham that would have done well on its own. However this recipe had rave reviews so I thought I'd try it. The genuine maple syrup and honey were expensive but I had high hopes. It would have been better to baste the ham rather than to bag it as the top ended up dry and the bottom is soaked in an expensive and odd tasting concoction that includes orange juice maraschino cherry juice and ginger ale. You have to be careful with the bag and the juice level or you'll end up with a carbonized sugary mess in your oven. I also made the mistake of using Diamond party toothpicks (food-safe no-run color) which did bleed into the pineapple rings (gross - thanks Diamond!) I'm going to have several friends and family over to try it and hopefully we will like it once it's cooled down a little more. Just a horrible expensive mess in my view that ruined a perfectly good ham and a cup of genuine maple syrup and organic honey.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "tryanythingonce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6174168/"
                }
            }
        ]
    }
]