[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
                    "name": "UK and Ireland",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/706/world-cuisine/european/uk-and-ireland/irish/",
                    "name": "Irish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46530/guinness-corned-beef/",
        "name": "Guinness&reg; Corned Beef",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3428896.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2020-03-05T04:57:47.000Z",
        "description": "I discovered this tasty St. Patrick's day treat when I attended an Irish Rovers Concert. My family and friend insist that it is a staple at get togethers any time of the year. Roast this Corned Beef slowly at a low setting for a melt in your mouth delight. The aroma is fantastic!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "4 pounds corned beef brisket",
            "1 cup brown sugar",
            "1 (12 fluid ounce) can or bottle Irish stout beer (e.g. Guinness(r))"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). Rinse the beef completely and pat dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the brisket on rack in a roasting pan or Dutch oven. Rub the brown sugar on the corned beef to coat entire beef, including the bottom. Pour the bottle of stout beer around, and gently over the beef to wet the sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and place in preheated oven. Bake for 2 1/2 hours. Allow to rest 5 minutes before slicing.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "recipeCuisine": [
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SHAMELESS Morrow"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.416454622561493,
            "ratingCount": 1179,
            "itemReviewed": "Guinness&reg; Corned Beef",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "286.2 calories",
            "carbohydrateContent": "14.4 g",
            "cholesterolContent": "61.2 mg",
            "fatContent": "16.9 g",
            "fiberContent": null,
            "proteinContent": "16.8 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "1384.3 mg",
            "sugarContent": "13.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-26T19:09:55.157Z",
                "reviewBody": "Excellent.  I've made this twice in the crockpot and learned a few things.  You do have to cover the meat with the liquid or the parts not submerged will get bitter.  It took two cans of Guiness to cover.  Do add the seasoning packet for more of the traditional flavor.  Also, cut the fat off the one side before cooking or the flavor won't get in the meat as much and it'll be a bit on the fatty/greasy side.\n\nNext time I may be brave and try one can water, one can Guiness since it seems expensive to use two cans.\n\nDon't forget the brown sugar (light/golden worked fine for me) and the seasoning packet - it all goes in there!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Loladear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/383920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-17T18:50:00.06Z",
                "reviewBody": "***COOK CORNED BEEF IN (I repeat, *IN*) THE BEER***\n\nThis is such a fantastic recipe, I can't even begin to tell you, but the most important thing is to actually cook the meat in the beer-- this not only infuses the meat with the flavors it's soaking in, but it also makes it unbelievably tender. Last year I cooked it in a big pot and added the veggies the last hour-- my husband and his friends were making fun of me the entire week beforehand because they thought I would \"ruin\" St. Patty's Day by going out on a limb... boy, were they shocked when it turned out so good that they're actually REQUESTING it this year!... my husband has been looking forward to today for the last month! This year, I plan to use my new crock pot since it's been my experience that meat gets even more amazingly melt-in-your-mouth the longer you cook it... Give this one a try!\n\n(I've never written a review before, but this recipe is so good, I felt compelled to spread the good news and dispel any doubts others have had!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1817352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T00:07:18.497Z",
                "reviewBody": "I wish I could give it 10 stars. I was very nervous about making this since it is not the norm. I made this for st. Paddy's day for a true Irish family(my husbands) and they loved it ( I also did the boiled corn beef just incase). His father (from Ireland) said it was the best corn beef he ever had and he truely enjoyed it. I even loved it and I am not a big fan of corn beef. The beer is not strong and the brown sugar is just perfect. My husband wants me to cook it this way all the time. Thanks so much for the recipe. Will make again and again and again. I did boil the cabbage and potatoes in a different pot since I didnt have room for them. The carrots I did with the meat and wow. I recommend everyone to try it this way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SOSHEA33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780011/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-20T17:01:37.063Z",
                "reviewBody": "Wow! Very good! My first time making corned beef and it’s so easy and tuned out so wonderful! I made it with a 2.5lb flat cut corned beef brisket and used 1 can of Murphys instead of Guinness, cooked in a slow cooker for 6hrs. (Note: Murphys is similar to Guinness but not as bitter and strong as Guinness, it’s the Irish stout that I prefer. If you don’t like Guinnes try this recipe with Murphys!) I rinsed the beef under water (too bloody!), trimmed fat off and coated with 2tbsp of brown sugar then placed it in the slow cooker. Poured the stout into a bowl, then I added the spice pack came with the corned beef PLUS additional spice (peppercorns, allspice, cloves, thyme...etc) to the stout than poured the mixture into the slow cooker. At 2.5 hrs before eating, I put on \"High\" and added 6 halved red potatoes, 4 chopped carrots and 1 chopped onion. I added the 1 cabbages, cut into wedges, 1 hr before eating. This came out just perfect, the house smelled wonderful while it's cooking! The beef were so tender, all the vegetables were a bit over cooked so I'll put them in for shorter time next time or just cook them on low(?). I also made the \"amazing Irish soda bread\" from this site. Highly recommended!! Please give this a try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Em",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2232961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-03T12:45:51.377Z",
                "reviewBody": "This recipe MUST be cooked in a slow cooker, on low, all day  if you want it to be juicy and tender!! Make sure you buy Flat cut corned beef instead of Point cut too. I've made it a few times and the meat just falls apart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2189853/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-17T00:24:39.903Z",
                "reviewBody": "Absolutely delicious!\nI put in a crockpot on high for 8 hours. Added red potatoes, carrots, and onions with 3 hours to go, then cabbage with 1 hour to go.  Will definitely make again. Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KASTEG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/809830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-05T01:48:56.167Z",
                "reviewBody": "The second time I made this I added a 1/4 cup of whole black peppercorns 2 cloves garlic and 2 bay leaves (remove bay leaves prior to serving) and cook per the instructions. Absolutely fantastic and definitely better than the written recipe - Make sure your beef is covered and for those wondering the flat cut works best for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-17T01:24:25.57Z",
                "reviewBody": "This is a terrific recipe.  I read all of the other reviews, and (with very few exceptions) the only complaint I read was that it's too tough.  This is purely a function of how long you cook it; cook it longer, and it gets more tender.  Here's what we did... we didn't bother putting the corned beef on a roasting rack.  Instead, we put the corned beef, sugar, and guinness in a dutch oven (yes, the meat was sitting right in the beer).  We put it (covered) in a 300 degree oven, and then every 45 minutes we turned the meat over.  After two hours, we added cabbage and potatoes, and then let it go for another 1.5 hours.  When we were done, the meat was a little tough, so we cooked it for another 45-60 minutes.  When we were done, we had the best corned beef we've ever had.  Usually we smother our corned beef with mustard and our potatoes with ketchup, but we needed neither with this delicious (and ridiculously easy) recipe.  It's slightly sweet, but really nicely flavored.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSHABLETT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/914996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-02T18:20:42.653Z",
                "reviewBody": "This is now the only way I cook corned beef. I also cook it in a crockpot. It is easier and comes out so tender. Make sure to not use the spices that come with the meat - just use the brown sugar and Guinness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EmpressQueenB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1613688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-04T01:02:22.603Z",
                "reviewBody": "I opted for the slow cooker since it seamed fool-proof and should have been very tender. But no. Started the cooker at 7am St. Patty's Day. 11 hours later I stuck a fork to it. Brick. Fork wouldn't even penetrate it. Same after 14 hours. Ended up cooking this center-cut beef all night and pulled the plug after 21 hours with slight increase in tenderness but it sure smelled great! Had it for dinner the next night and everyone loved it even though it was still very firm. Next time I'll use a more conventional recipe from Allrecipes and just drink the beer on the side :) UPDATE: I believe my problem was in using Guiness EXTRA Stout. This, as I found out later, has a much higher alcohol content than regular draft. Almost 4 times as much. Too much booze would certainly toughen the roast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "GEOFORCE6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1282885/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Guinness® Corned Beef",
            "description": "Quintessential recipe to know if you love corned beef! \n",
            "uploadDate": "2019-02-26T20:45:44.187Z",
            "duration": "PT28.779S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F75f91f0c-dc00-4b62-9f5f-d7e699fcb441%2Fb3437525-8e46-4fce-900b-96af1fa215b3%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6007448061001"
        }
    }
]