[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13387/main-dish/pork/pork-chops/baked/",
                    "name": "Baked",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46537/pork-chops-with-apples-onions-and-sweet-potatoes/",
        "name": "Pork Chops with Apples, Onions, and Sweet Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F450764.jpg",
            "width": 2002,
            "height": 1503
        },
        "datePublished": "2020-03-05T04:57:47.000Z",
        "description": "This is so easy, so good, and so versatile! I've used pork chops with and without bones, pork loin, and pork roast. You can sprinkle the brown sugar, salt, and pepper on the different layers or all at the end, as mentioned in the recipe.  Play around with the brown sugar and spices to your taste.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 pork chops",
            "salt and pepper to taste",
            "2 onions, sliced into rings",
            "2 sweet potatoes, sliced",
            "2 apples - peeled, cored, and sliced into rings",
            "3 tablespoons brown sugar",
            "2 teaspoons freshly ground black pepper",
            "1 teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season pork chops with salt and pepper to taste, and arrange in a medium oven safe skillet. Top pork chops with onions, sweet potatoes, and apples. Sprinkle with brown sugar. Season with 2 teaspoons pepper and 1 teaspoon salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and bake 1 hour in the preheated oven, until sweet potatoes are tender and pork chops have reached an internal temperature of 145 degrees F (63 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes",
            "Baked"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ashbeth"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.230434782608696,
            "ratingCount": 460,
            "itemReviewed": "Pork Chops with Apples, Onions, and Sweet Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "312.8 calories",
            "carbohydrateContent": "38.8 g",
            "cholesterolContent": "44.6 mg",
            "fatContent": "12.1 g",
            "fiberContent": "5 g",
            "proteinContent": "13.6 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "770.7 mg",
            "sugarContent": "23.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-20T00:38:18.17Z",
                "reviewBody": "I didn't see that anyone else had suggested this, but I did this recipe in my slow-cooker. I put the sweet potatoes on the botom, since they take the longest. Then I put a layer of onions and apples, then the chops, then another layer of onion and apples. On each layer i lightly dusted with salt and pepper and then sprinkled with a brown sugar/cinnamon/nutmeg mix - probably used double-triple the amt of brown sugar called for. I cooked it on medium for about 5 1/2 hours. It turned out GREAT. The pork really soaked in the flavor since it was sandwiched between the onion and apples(used golden delicious, by the way, sliced thick, and the texture was perfect). The flavor of this was perfect for an autumn evening - I love this combination!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinNurse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1217797/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T20:22:18.733Z",
                "reviewBody": "If I could give this more than 5 stars I would - but that was on my second try.  The first try was a bit of a disaster but still tasted terrific.  I'd like to pass on what I learned:  The amount of ingredients were on the mark, except for the pepper.  1)make sure you slice the onion and sweet potatoes very thin - they will then cook within the hr. 2) Cut the apples thicker - not too thick - since they take a shorter amt of time to cook (if too thin they will turn to mush)  3) Use the \"GRANULATED\" brown suger (I used the old fashioned kind the first time and it wouldn't melt - the pepper got stuck in the sugar - I had to mush in down - not a pretty sight!).  I also cut back on the pepper the second time - we love pepper, especially on sweet potatoes but found that 1 tsp. was sufficient).  I cooked this in a corningware baking dish with cover and the second time it was a pretty presentation and everyone loved it.  It is fun and easy to prepare.  One pork chop per serving is not enough in my house!!!  Believe it or not - it is a light meal.  You might want to serve a salad with it since some were looking for a third chop!  The pork really picks up the juices while it is cooking.  This is a keeper and a really quick meal - thanks Ashbeth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aspiring Chef Rita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T08:33:35.45Z",
                "reviewBody": "My family enjoyed this recipe a lot. Instead of sprinkling the chops with salt and pepper, I used Morton's Seasoning Salt, which is a nice blend of seasonings. I did mix cinnamon with the sugar and made a little more than what is called for. Next time I would not use the onions. My family did not think the onions blended well with the sweet potatoes and apples. I also did not season the casserole with the 2 tsp. of pepper and the 1 tsp of salt. Somehow I didn't think that would go well with the sugared potatoes and apple slices. I would suggest that if you make this recipe, you microwave the sliced sweet potatoes for a couple minutes to give them a head start in cooking. I found the potatoes were a little hard and the meat a little overdone, following the recipe. I think if you started the potatoes, you could cook this recipe for about 45 minutes and get juicier chops.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARY DOMAZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/278426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-26T02:45:43.14Z",
                "reviewBody": "We Loved this.  I browned the chops and onions frist. Then I whisked balsamic vinegar, maple syrup, brown sugar and mustard then poured it over everything. I also nuked the sweet potaoes for 2 min before I put them in the dish to give them a head start.  I cooked it for 30 min.  delish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2024902/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-10T20:45:39.88Z",
                "reviewBody": "I added a half cup of water to the pan before baking so the pork chops wouldn't dry out, and they were so moist and tender.  Also, I had to bake them for an extra 15 minutes or so because the potatoes were still crunchy.  I recommend tossing the apples, onions, potatoes, and seasonings together before putting them over the pork chops because all of the seasonings stayed on the top and I had a layer of veggies/fruit that were way too seasoned and a layer without seasonings.  Last thing, add a little bit of garlic powder to the pork chops before putting them in the pan, it really adds a nice flavor.  This was a HUGE hit with my family and they beg me to make it over and over again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Marie Henson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2281192/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-18T01:03:42.437Z",
                "reviewBody": "This was an excellent use of both pork chops (in this case, boneless loin chops) and sweet potatoes.  I did adapt the recipe slightly, partly based on earlier comments, and the result brought raves from my non-pork-fan husband.  First, I dredged the chops in a flour/salt/pepper mixture and browned them in a small amount of margarine in the frying pan.  I then layered the onions, potatoes and apples twice, dusting each layer with salt, pepper, brown sugar and cinnamon.  I sprinkled the top with nutmeg, and drizzled 1/2 - 1 cup apple cider over all.  I then covered the pan and slow-baked it for slightly more than 2 hours at 325 degrees.  The result was a fabulous dinner, with tender meat and perfectly done potatoes and apples.  We were very happy with the experiment; my husband's final comment was, \"Well, this sure is a keeper!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CCPONTIAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1290347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-24T19:32:44.393Z",
                "reviewBody": "This was so good, even my fiance who doesn't like sweet potatoes ate it up.  Here are the changes I made:  1) I placed the chops in a glass 9 x 13 dish 2) I cooked the whole sweet potatoes in the microwave (after washing and poking holes) for about 4 minutes, then peeled the skin off and chopped 3) I only used 1 onion 4) I put the sweet potato, onion, and apple in a big bowl and mixed it with the brown sugar, a small bit of pepper, and a few good grinds of sea salt.  The aroma of this cooking was amazing.  This was a great dish for the first day of fall!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "baking wifey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2329874/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-28T11:18:38.17Z",
                "reviewBody": "We loved this recipe. It was a breeze to put together and was simply delicious. I did brown the chops before baking. I wouldn't change a thing about this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "coalsa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/483262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-11T17:43:15.9Z",
                "reviewBody": "The only reason this got four stars was because it simply served as a \"spring board\" for me in creating an awesome autumn dinner.  I took this basic idea and completely  modified it for a slow cooker. First, I mixed the onion, apples (chunked instead of rings), 1/2 cup dried chopped cherries, and two stalks celery with 1 teaspoon cinnamon, ¼ teaspoon nutmeg, and 2 Tablespoons brown sugar.   Next, I layered the sweet potatoes at the bottom of the slow cooker and lightly sprinkled them with some more cinnamon and brown sugar. I poured half of the first mixture over the potatoes.  Salt and pepper pork on both sides and lay atop the apple/onion/cherry/celery mixture in the slow cooker. I poured the remainder of the apple/onion/cherry/celery mixture on the top of the pork. Finally, I dumped about 1 cup of apple cider over  the contents of the slow cooker and cooked on low for about 6-7hours. This assembly took only 15minutes and I had an amazing, juicy dinner that was perfect with a huge hunk of challah bread from the local bakery to soak up the sweet/savory juice.  My mom was shocked that she had arrived at my house after a 6hour drive before me since I had work until 7pm, and at 7:30 I had such an awesome dinner on the table.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "emily.c.craggs@gmail.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3150046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-03T22:42:30.673Z",
                "reviewBody": "I'm sorry but the pepper on this awful. It was so hot we ended up eating cereal for dinner. I think if you put MAYBE 1/4 of the amount called for you would have an \"OK\" meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "MOM2NICANDNAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1355111/"
                }
            }
        ]
    }
]