[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1014/meat-and-poultry/pork/tenderloin/",
                    "name": "Pork Tenderloin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/51464/apple-rosemary-pork-tenderloin/",
        "name": "Apple Rosemary Pork Tenderloin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2380548.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2020-03-05T04:58:00.000Z",
        "description": "This roast is by far the best tenderloin recipe I've ever made. The sweetness imparted from the gravy and the apple flavor is quite different from what is typically expected from a pork roast. The apple and onion mixture cooked with the roast makes an excellent side dish with a little of the gravy over the top.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "4 teaspoons dried rosemary",
            "1 ½ teaspoons dried thyme",
            "1 ½ teaspoons dried marjoram",
            "salt and pepper to taste",
            "3 pounds pork tenderloin",
            "1 (12 fluid ounce) bottle hard apple cider",
            "water",
            "3 Granny Smith apples, cored and cut into 1 inch pieces",
            "1 large red onion, cut into 1 inch pieces",
            "5 tablespoons brown sugar",
            "⅓ cup all-purpose flour",
            "¾ cup maple syrup"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together rosemary, thyme, marjoram, salt, and pepper.  Rub herb mixture over tenderloin. Place in a container, and pour hard cider over roast.  Add water until pork is completely submerged. Cover, and refrigerate 6 to 8 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place roast in a roasting pan, elevated from the bottom, and pour marinade around the meat. Bake for 1 hour in preheated oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix apples and onion. Put mixture around and on top of roast. Spoon brown sugar over entire pan evenly. Place roast back into oven, and continue to cook for 1 hour more, or until meat reaches 145 degrees F (63 degrees C). Transfer roast, apples, and onion to a serving platter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For the gravy, brown flour in a skillet. Pour the marinade/drippings mixture into the skillet. Stir in syrup. Cook and stir over high heat until liquid has thickened to desired consistency.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice roast, and serve with gravy.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Tenderloin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Bob Myers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4714285714285715,
            "ratingCount": 70,
            "itemReviewed": "Apple Rosemary Pork Tenderloin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "517.7 calories",
            "carbohydrateContent": "58.2 g",
            "cholesterolContent": "126.3 mg",
            "fatContent": "11.2 g",
            "fiberContent": "2.4 g",
            "proteinContent": "41.4 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "492.2 mg",
            "sugarContent": "46.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-24T00:37:56.163Z",
                "reviewBody": "I put the coated tenderloin into a big ziploc bag and dumped the apple cider only into the bag until covered (then sucked out all the air so it was completely covered) I let it marinade for 8 hours, took it out for an hour to raise the temperature, then cooked as directed, and added 2 apples and 1 pear to the tenderloin and cider marinade as directed and completed cooking. Afterwards, in my super heavy duty roasting pan, I cooked the marinade over my gas stovetop and added more cider since I didn't add water at all. I have a photo! Husband LOVED this! My first tenderloin ever cooked and it was a great success! Served with roasted garlic rosemary baby red potatoes (Baked in some olive oil with the roast during the last hour of cooking time) and steamed green beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "WATTYZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/826946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T00:51:32.553Z",
                "reviewBody": "This is a mouth watering recipe. The flavor from the apples is wonderful. I did not have apple cider so I improvised with apple sauce and the result was superb. I also used different herbs because I did not have these handy. Bottom line..I don't think you could mess this recipe up..it is a definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMMY VAUGHT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/289283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-20T23:40:01.31Z",
                "reviewBody": "A perfect meal for the Fall. I used my crockpot and cooked the pork with just the Granny Smith apples and appled cider. After 8 hours on low the apples were reduced to applesauce and the pork was so tender. I removed the pork from the sauce and added a splash of heavy cream and maple syrup to sweeten. I cannot tell you how delicious this recipe was - - and how wonderful the house smelled while it was cooking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KOALAGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T21:10:47.257Z",
                "reviewBody": "This is the best pork roast I have ever made. Of course like most of us I made some changes. I have fresh rosemary in the garden so I used that plus some fresh Oregno and dried majoram. I ran 2 long sprigs of rosemary longitudinally thru the roast and then mixed chopped fresh rosemary and oregano plus 1.5 tsp of dried majorum, 2 tsp of minced garlic, kosher salt, pepper and some olive oil. I rubbed this all over the roast and popped it in the roaster and cover the top of the roast lightly with some italian bread crumbs and added regular cider. Baked covered for an hour and then uncovered for an hour with the apples and onions and a few carrots thrown in for color. Spooned the brown sugar over the top as directed.  For the gravy, I skipped the maple syrup as the non-alcoholic cider had made the drippings sweet enough. Made the gravy with cornstarch (personal preference).  The roast was delicious and incredibly tender. I served it with roasted garlic mashed potatoes and homemade French Baguette garlic bread.  My wife loved it",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/baron/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-15T20:46:32.623Z",
                "reviewBody": "This was very yummy. The only changes I made was to use half the amount of maple syrup called for, ( and that made the gravy plenty sweet enough for this sweet tooth) and I marinaded the roast in a bag (with all the air squeezed out) with apple cider (no water) and added chicken broth to the roasting pan halfway through the cooking time to make sure there was enough juice for the gravy. Also, being a garlic lover, I added two cloves of garlic with the apples and onions. Make sure you used a meat thermometer, as I find the cooking time a bit too long. Very flavourful, juicy and a definate do-again recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CANADIAN COOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-14T15:46:38.5Z",
                "reviewBody": "This recipe is delicious and a nice change to the usual pork tenderloin marinated in soy sauce mixtures. I did cut the cooking time to 45 minutes each part instead of and hour each. My mother did it for an hour each part and hers came out dry and tough. Wonderful flavors!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINGIN523",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/597250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-15T13:59:07.17Z",
                "reviewBody": "My family really enjoyed this meal. I used apple juice instead of the cider and cut the cooking time in half (just use a meat thermometer to determine when it's done so you don't \"kill\" it). The rub was a bit too much in the end; I may just add the herbs/spices to the marinade next time instead. I really loved the \"gravy \" although the pork is so flavorful you don't even need it. I used red delicious apples and they were the best part!! Overall this was very good and I will definitely make it again! Thanks Bob!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BETHANY S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/206779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-17T21:07:22.2Z",
                "reviewBody": "We enjoyed this recipe however I would make a few suggestions. First my cooking time was about 1.5 hours (instead of 2) and my apples & onions didn't cook all the way so I would suggest adding the apples after 30 minutes and let them cook until the tenderloin reaches 160 degrees. Also definitely use a meat thermometer if you have one. After I completed the gravy I added the apples and onions to it and let them cook a bit together then I served them together in a bowl with the sliced tenderloin on the side. One last tip I tied 2 tenderloins together and cooked them as one. It's the first time I've done this and it worked well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lewsidsmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1500105/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T03:00:31.623Z",
                "reviewBody": "This was an excellent recipe, but I must admit that I changed a few things. I used a 1 1/2 pound tenderloin, and then combined 1/4 cup scotch and 3/4 cup cider for the marinade and added 2tsp of garlic as well. I then seared the porl in an oiled roasting pan for 5 minutes before adding the marinade, and I reduced the cooking time to 1 hour at 375F and the pork came out juicy and tender. The sauce did not have a strong scotch taste at all, but melded well with the maple syrup and brown sugar. My husband ate 3/4ths of the 1 1/2 pound tenderloin that I made. He says that it is the only way he'll eat his pork from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KITICAT22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/980315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-20T17:22:42.26Z",
                "reviewBody": "Hmmmm. This was \"OK.\" I purchased a pkg. of 2 (1 lb.) pork tenderloins a few wk. ago. I used one then but froze the other for a future meal. This past wk. I thawed the unused tenderloin b/c I wanted to try this recipe. To take the guesswork out of how long to cook my tenderloin I used my Williams-Sonoma digital thermometer set to register 160 deg. (i.e. med.). I should have cooked to 170 deg. as I like my pork well done (but my fiance likes his med. so he wins tonight!). I pretty much followed Bob's directions to the letter except for halving everything (remember I only had a 1 lb. tenderloin available) adding 2 sm. cubed sweet potatoes/3 garlic cloves & using a combo of GrannySmith/Jonagold apples & a little less maple syrup than called for (I used 1/4 c. b/c I was afraid that my gravy would be too sweet otherwise). I added my potatoes/onions/apples with the uncooked tenderloin rather than waiting until the second hr. It didn't even take an hr. for everything to cook thoroughly so I am glad I did (2 hours even for 3 lb. meat - my gosh!!!). My only regret was adding the potatoes (they didn't cook thru in the allotted time... my bad!). Note: Although I used hard cider (Woodchuck) as a marinade I'm sure regular cider or juice for that matter would work just as well. Served w/ pork stuffing garlicky green beans & dinner rolls this was a filling meal. Thanks for sharing your recipe Mr. Meyers:) This is a perfect fall dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            }
        ]
    }
]