[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/52299/vegetarian-phad-thai/",
        "name": "Vegetarian Phad Thai",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F731643.jpg",
            "width": 1500,
            "height": 1125
        },
        "datePublished": "2020-03-05T04:58:02.000Z",
        "description": "This recipe is the closest I've come to imitating the heavenly Phad Thai I had in London. It's a little sweeter than the Phad Thai dishes I've tried in the U.S. Raw cabbage and/or carrots may also be served on the side.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound dried rice noodles",
            "2 tablespoons vegetable oil",
            "4 eggs, beaten",
            "2 tablespoons peanut oil",
            "1 ½ cups peanut butter",
            "⅓ cup water",
            "⅓ cup soy sauce",
            "1 cup milk",
            "1 ¼ cups brown sugar",
            "⅓ cup lemon juice",
            "2 tablespoons garlic powder",
            "1 tablespoon paprika",
            "cayenne pepper to taste",
            "1 pound mung bean sprouts",
            "1 cup shredded carrots",
            "¼ cup chopped green onions",
            "½ cup chopped, unsalted dry-roasted peanuts",
            "1 lime, cut into wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Submerge the rice noodles in a large bowl of hot water for about an hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1/2 tablespoon of oil into a large skillet, and add eggs. Scramble into medium-sized pieces, and transfer to plate. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan, mix together peanut oil, peanut butter, water, soy sauce, milk, brown sugar, and lemon juice. Season with garlic powder and paprika. Heat until sauce is smooth. Season liberally with cayenne pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain noodles; noodles should be very flexible, but still relatively firm. Heat remaining 1 1/2 tablespoons vegetable oil in  a large saucepan or wok. Cook noodles in oil, stirring constantly, until they are tender, about 2 minutes.   Stir in peanut sauce, sprouts, carrots, scallions, ground peanuts, and the scrambled eggs. Continue to cook over low heat until vegetables are crisp-tender, about 5 minutes. Serve immediately, garnished with lime wedges.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SKLIMCZAK"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.935483870967742,
            "ratingCount": 93,
            "itemReviewed": "Vegetarian Phad Thai",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "830.4 calories",
            "carbohydrateContent": "103.6 g",
            "cholesterolContent": "95.4 mg",
            "fatContent": "39.4 g",
            "fiberContent": "7 g",
            "proteinContent": "23.6 g",
            "saturatedFatContent": "8.1 g",
            "servingSize": null,
            "sodiumContent": "998.8 mg",
            "sugarContent": "44.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-08-04T10:13:43.34Z",
                "reviewBody": "This is my recipe but I got married and have a new log-in name! A few notes based on other reviews and my subsequent experiences with the recipe: YES - follow package directions for the rice noodles... when I created this recipe I was buying noodles from an Asian market and could not read the text on the package. You can actually even use linguini or fettuccini if you don't have access to rice noodles (not quite as good but this is obviously an Americanized recipe anyway). You do not have to sautee the noodles before tossing them with the sauce -- I too have problems with them sticking to the pan and have pretty much just eliminated this step. Finally when I have it on hand I also substitute lime juice for the lemon though lemon works just fine. A side of shredded cabbage and julienne carrots/cucumbers provides a refreshing break from what can be a heavy dish (especially with all that sauce - but I love it!). Hope that helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAHWILKERSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1152919/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T15:22:17.013Z",
                "reviewBody": "OK...too peanut-ty and lacked some depth. I took the advice of some of the other reviewers and reduced the peanut butter (I used smooth ground natural with no added salt/sugar) to 3/4 cup and reduced the brown sugar to 1/2 cup but it was still too much. I also used 3 cloves of fresh garlic pressed chili paste instead of cayenne pepper and lime juice instead of lemon. Here's some helpful hints that I will try the next time: don't cook peanut sauce too early...it goes from that nice smooth sauce to a gloppy thick mess that doesn't want to stir through the noodles. Don't skimp on the oil when sauteing the noodles. I'd never made rice noodles before and mine ended up all clumped together (I didn't soak them for a full hour either). Skip adding the extra peanuts. Julienne carrots instead of shredding to add some crunch. Maybe increase the lime juice chili paste and add some fish sauce...give it a try! Thanks Sarah for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BIZZYSMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/382801/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-29T18:16:19.153Z",
                "reviewBody": "This is easy and Absolutely Fabulous. My husband and I thought it was better than what we get at the Thai restaurants we frequent. I substituted curry paste for paprika to good effect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIBRA818",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/713190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-18T22:37:31.907Z",
                "reviewBody": "This was absolutely delicious. I soaked the noodles in water for a little over an hour. I didn't have peanut oil but seasame oil worked just as well. I cooked the sauce in a large pot and sauteed the vegetables in a large pan. The noodles were plenty soft and so I just added them to the sauce while I was cooking the vegetables. (I didn't have a wok) I added the veggies to the large pot and stirred everything up and served. Absolutely yummy the next day as leftovers too. Restaurant quality. I've also cut the recipe in half and used linguine noodles which made it all come together really quickly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1147886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-05T03:36:30.913Z",
                "reviewBody": "Wonderful! Just like the savory Seattle Phad Thai I used to get years ago (minus the tamarind which I will add next time)!! A few caveats: I used a can of coconut milk in place of the 1 c. milk and only about 1/3 c. brown sugar despite using Adam's natural chunky PB which is not very sweet; I also used Asian chili sauce not cayenne. For veggies I used 1 pkg firm tofu snowpeas onion greens and shredded cabbage. Everything came together so quickly and easily & angel hair pasta was just great with this; we'll be making this recipe again and again in the years to come!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "izaacotter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3065414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-29T18:16:49.997Z",
                "reviewBody": "I have found that Phad Thai is a tricky thing. To get a truly authentic taste it is necessary to use authentic ingredients. However I for one don't usually have all of these ingredients on hand. So I've been looking for a recipe that closely approximates the flavors without requiring all of the traditional ingredients. This recipe comes the closest of any that I've tried. It was too sweet (and I only used 1 c. of sugar to begin with!) and I add a bit more lemon juice to give it that tang. Also don't be skimpy with the cayenne; it takes at least 1/4 t. or more to get the right heat. I will definitely make this dish again and I'll probably keep tweaking it. One last thing--this recipe makes an absolutely enormous amount of sauce! We barely used half of it. But it's a good leftover too. =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/374258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-13T20:11:02.733Z",
                "reviewBody": "My daughter and husband loved this dish. I did however make some changes based on others' reviews. I lowerd the amount of peanut butter and sugar to 3/4c and used lime instead of lemon. Great dish! I will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KERRIE73",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/790682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-13T20:10:59.467Z",
                "reviewBody": "I didn't think this recipe was that great. Submerging the noodles in hot water for 1 hour was WAY too long. The noodles turned out way to soft. I did cut the brown sugar and peanut butter in half like the other reviewers suggested and I thought the sauce was very good. Not sure that I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFERK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/486570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-13T22:57:22.23Z",
                "reviewBody": "Amazing! Added a bit of Tofu with the egg. Make sure to get the fresh lime its worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "christaandcaleb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7108491/"
                }
            }
        ]
    }
]