[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
                    "name": "Seafood Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13293/main-dish/seafood/salmon/",
                    "name": "Salmon",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15846/main-dish/seafood/salmon/baked-salmon/",
                    "name": "Baked Salmon Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/54702/asian-salmon/",
        "name": "Asian Salmon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5638023.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2002-10-07T02:38:44.000Z",
        "description": "Wild salmon is marinated and baked in an Asian-inspired soy and sesame sauce, served with hot cooked rice.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds salmon fillets, with skin",
            "2 tablespoons olive oil",
            "2 tablespoons rice vinegar",
            "2 tablespoons soy sauce",
            "1 tablespoon packed brown sugar",
            "2 cloves garlic, minced",
            "1 pinch ground black pepper",
            "2 tablespoons minced onion",
            "1 tablespoon sesame oil",
            "2 cups long-grain white rice",
            "1 teaspoon dried dill weed",
            "3 cups water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Make several shallow slashes in the skinless side of the salmon fillets. Place fillets skin-side down in a glass baking dish. In a medium bowl, whisk together the olive oil, rice vinegar, soy sauce, brown sugar, garlic, pepper, onion and sesame oil. Pour the liquid over the salmon, cover, and refrigerate for 1 to 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, combine the rice, water, and dill weed. Cover pan, bring to a boil, then reduce heat to low and cook 20 minutes, until rice is tender and water has been absorbed. Allow to stand for 5 minutes before removing lid and fluffing rice with a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove cover from salmon, and bake the fish and the marinade for about 30 minutes, or until fish can be flaked with a fork. Serve salmon over the rice, and pour sauce over.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Salmon",
            "Baked Salmon Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lynseey"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.553488372093023,
            "ratingCount": 860,
            "itemReviewed": "Asian Salmon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "388.1 calories",
            "carbohydrateContent": "39.6 g",
            "cholesterolContent": "50.5 mg",
            "fatContent": "12 g",
            "fiberContent": "0.7 g",
            "proteinContent": "27.9 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "278.5 mg",
            "sugarContent": "1.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-13T00:26:39.187Z",
                "reviewBody": "I debated on how to rate this recipe since it turned out delicious but if I had actually followed the recipe the results would not have been as appealing. I had 1 1/4 lbs of salmon and doubled the sauce recipe. It ended up being the perfect amount of sauce for two people. Can't imagine having 2 lbs and following the sauce recipe as written. I also added 1 tsp of fresh ginger since I can't image an Asian dish without that. Also the baking time really seemed off to me. 30 minutes is a long time to cook salmon- even a thicker filet. I checked mine after 15 minutes and they were done (and they were average sized filets). I did taste it at this point and it was good but not great and the fish was not very appetizing in appearance. So I followed the advice of another reviewer and removed the filets from the marinade and stuck them under the broiler on low for about 7 minutes. THey carmelized beautifully. I also condensed the sauce on the stovetop a little. Did do the dill rice(make sure to cover the rice when you lower to simmer temp) and served it on a platter with the salmon on top and a little sauce drizzled over it. Garnished with a fresh dill sprig. Looked and tasted wonderful. The broiling is a must! I think Grilled Salmon by Tina is still my favorite but we will definitely make this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mommyluvsnoah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-04T18:47:13.323Z",
                "reviewBody": "I am now CONVERTED!!!  I hate salmon - it's almost always dry and incredibly fishy... but for it's health benefits I'm trying to start eating it at least once a month.  After a long recipe search and much deliberation, I made this recipe last night. WOW WOW WOW - it is finger-licking good.  The sauce was amazing – so smooth and silky, gentle and flavorful. I doubled the sauce as many have suggested and I wish I tripled it; I also added about a tablespoon of fresh ginger and didn't add any olive oil; maybe next time I'll add a little cilantro as well. I marinated the fish for about an hour, but the marinade hasn’t had enough time to fully permeate the fish, next time I’ll try marinating for a longer period.  I baked the fish for about 30 minutes and it turned out moist and juicy and oh so delicious.  Can’t wait to entertain with it this weekend.  Thank you soooo very much LYNSEEY for converting me to a salmon eater. (I really wish I could give more then 5 stars - this recipe towers above all others.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BOGINIA2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/842505/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-20T20:19:29.937Z",
                "reviewBody": "I wish i had looked at the previous reviews notes before makeing this, should have cut the oil in half and doubled the marinade. Had the potential to be great! smelled wonderful, but not much flavor. I will try again with the changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sakuraiiko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sakuraiiko/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-22T04:43:27.017Z",
                "reviewBody": "I made this recipe last night for my husband and in-laws. It was absolutely delicious. I followed the advice of several others. For starters I doubled the marinade which is a \"must\" and added a dash of cornstarch to thicken the marinade at the end for pour back over salmon! I added ginger to the marinade- delicious. I baked for 15 minutes skinside down then broiled skin side up for 5 or so minutes. It was perfect! 30 minutes is way too long to bake. I served the salmon over Whole Grain Brown Rice by Lundberg Jubilee(from Whole Foods). I also cooked a quick/delicious mixed vegetable dish (Fire Roasted Vegetables from Trader Joes) and placed the veggies on top of the rice and on sides of the salmon. I also decorated each plate with spinach leaves drizzled with olive oil and rice vinegar. The overall presentation looked quite tasty and the mixture of rice veggies and salmon indeed tasted wonderful. If you are cooking for four I strongly recommend atleast 1 1/4 lb of salmon. I look forward to making this delicious dish again and it was a huge hit with the family. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "heidib24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1851433/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T17:40:26.81Z",
                "reviewBody": "this was a really good quick and healthful marinade for salmon would work great on swordfish. Doubled the amounts for the marinade and cut the amount of oil in half and used 1 1/2 lbs of salmon. very good will make again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHERRIE K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/720610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-27T22:15:27.997Z",
                "reviewBody": "All I can say is AWESOME! My 8 year old daughter HATES (well let me say hated) salmon. The evening I made this she refused to try it. We made her sit at the table until she had one bite. She sat there for about an hour and a half. FINALLY she took a bite. She loved it! And it was cold! She ate the whole filet. I was shocked. She told everyone the next day that here favorite food was salmon now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Scott Krekeler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/733869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-12T02:04:13.88Z",
                "reviewBody": "THE BEST SALMON EVER! I loved this salmon so much I ate it a-top of jasmine rice w/ soy sauce for 5 days in a row!!! I was not much of a salmon girl before but with a little revision of this recipe my outlook on salmon has changed. I have a cute little blue notebook I keep all my recipes & I have decided to name this recipe: \"The Salmon EVERYONE Liked\". This title came about because I made this recipe for MYSELF but my whole family came begging for a bite because it smelled so yummy and they all liked it so much that none of them made any annoying suggestions for the next time I make it(which was a change for once). This recipe is good for 12 ounces of salmon(2 servings) Okay here's my revised recipe: 1 T EVOO 2 T Rice Vinegar 2 T LOW sodium SOY SAUCE 1/2 t sesame oil or toasted sesame oil(which I use) 1 T & 1 t brown sugar 2-3 cloves garlic 2 T white onion 1 T chopped green onions/chives some grated ginger pepper I mix all the ingredients then pour over the salmon (keeping all the bits on top of the salmon). Refridgerate for about an hour. I cook in 350 oven about 10-15 minutes then pop in the broiler for about 5 minutes (If you like the charred/crispy taist leave in for 7). I serves on top of a bowl of Trader Joe's Jasmine Rice. Then drizzle everything with soy sauce. YUM-O I have made this for myself more than about 7 times in the past 2 weeks so I think you can tell I like it A LOT! LOL",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "teenbeauty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2320922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T00:32:05.507Z",
                "reviewBody": "My husband and I love this recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leticia's kitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5043778/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-01T14:44:10.25Z",
                "reviewBody": "I followed this exactly...except for the fact that the salmon fillet we had didn't have skin on it.  Hubby loved it.  I thought it was really good too.  I will definately make again, but will probably let it cook under the broiler for a few minutes at the end to get the good carmelization that another reviewer suggested.  Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-28T21:49:25.78Z",
                "reviewBody": "OK but sort of boring.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "beuschk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7930142/"
                }
            }
        ]
    }
]