[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/344/bread/yeast-bread/whole-grain-bread/",
                    "name": "Whole Grain Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15509/bread/yeast-bread/whole-grain-bread/wheat-bread/",
                    "name": "Wheat Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/54981/kid-friendly-wheat-bread/",
        "name": "Kid-Friendly Wheat Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9001202.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-03-05T04:58:08.000Z",
        "description": "An easy kid-friendly wheat sandwich bread, especially easy if you have a mixer with a dough hook.  My picky kid even eats the crust!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "1 ½ cups warm water (110 degrees F/45 degrees C)",
            "1 tablespoon brown sugar",
            "2 (.25 ounce) envelopes active dry yeast",
            "2 cups all-purpose flour",
            "4 cups whole wheat flour",
            "⅓ cup packed brown sugar",
            "2 teaspoons salt",
            "⅓ cup vegetable oil",
            "½ cup milk, room temperature"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Measure the water into a large bowl, or the bowl of a stand mixer and stir in 1 tablespoon of brown sugar. Sprinkle the yeast over the top and set aside until foamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add 1 cup of the all-purpose flour and 3 cups of whole wheat flour to the bowl along with the brown sugar, salt, vegetable oil and milk. Mix on low speed to blend ingredients. Continue to mix on medium speed, adding the rest of the flour 1/2 cup at a time, until the dough clings to the hook and cleans the sides of the bowl. You may not need to add all of the flour. Mix on medium speed for about 5 minutes. Oil the bowl and turn the dough to coat. Cover loosely and set aside to rise until doubled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough and place on a floured surface. Divide into two equal portions and use a rolling pin to roll each one into a rectangle that is about 16x8 inches. Be sure to press out all of the air bubbles. Roll the rectangles into loaves and pinch the seam together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place loaves seam side down into greased 9x5 inch loaf pans. Cut a few slits across the top of each loaf using a sharp serrated knife. Set aside to rise until your finger leaves a dimple when you press into a loaf, 30 to 45 minutes. Preheat the oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the loaves for 15 minutes in the preheated oven, then reduce the temperature to 350 degrees F (175 degrees C). Bake for an additional 30 minutes, or until loaves are deep brown. Remove from pans to cool on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Whole Grain Bread Recipes",
            "Wheat Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan K."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.737373737373737,
            "ratingCount": 99,
            "itemReviewed": "Kid-Friendly Wheat Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "150.5 calories",
            "carbohydrateContent": "26.5 g",
            "cholesterolContent": "0.4 mg",
            "fatContent": "3.6 g",
            "fiberContent": "2.8 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "198.4 mg",
            "sugarContent": "3.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-08-27T14:28:07.25Z",
                "reviewBody": "Many compliments on this bread recipe. Minor changes> molasses instead of brown sugar when feeding the yeast in the first step (easier to mix), half wheat and half all purpose flour. In the future, I will make this with 3/4 of the dough in one bread pan, and use the leftovers for dinner rolls, as each half did not make such a large loaf as I like for slicing for sandwiches. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mcmeg12",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2492014/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-17T20:41:28.973Z",
                "reviewBody": "Delish! Has a regular wheat bread taste (like store bought) and I got a wonderful crisp crust on mine without doing anything special. I made it exactly as written except I did not need the last cup of flour in the recipe and instead of rolling it out I just shaped the loaves in the pan into rectangles that fit the pans.  Here's a tip: do not over rise for the second rising. If you let it rise for too long (more than 35 mins. or so) it will over rise and then deflate if you try to move it to the oven and it will be flat like mine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy Womack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2036722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-09T23:03:02.083Z",
                "reviewBody": "Very good bread!  It is definitely kid friendly, because within minutes of taking this out of the oven, the smell got their attention and almost an entire loaf was gone within ten minutes.  I did do a few things different, but not so much to change the recipe, per se. I always use King Arthur flour or home-grinded.  In this case, I used KA flour, as it is far superior to all other brands, imo.  Used coconut oil for the vegetable oil; Rapunzel sugar instead of brown sugar; Himalayan salt; and raw milk.  The end results were delicious!  Oh yes, only used three cups plus 2 TBSP. of the whole wheat flour.  It's easy to know when you have added enough flour, if you're using a stand mixer with a dough hook.  The dough will come together and completely come away from the sides of the bowl.  It'll also come away from the dough hook (not be sticky to it) where the dough hook is only kneeding it.  If kneeding by hand, same thing, except with your hands, it won't be sticky to your hands anymore and will come away from them. Just a tip for anyone new to bread making.  :)  Do a search on bread making and you'll find all sorts of tricks of the trade!  Bread making is so much fun!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMLVS2COOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1341716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-23T21:51:09.073Z",
                "reviewBody": "This bread came out fantastic. I don't have any bread making equipment so i kneeded the dough for about ten minutes prior to the first rising. It rose beautifully and i love the way the slits in the top look. I find that most breads become dense after cooling however this stayed quite fluffy. I don't have little kids at home but this was definately hubby friendly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cheryl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2877796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-27T19:50:46.46Z",
                "reviewBody": "Easy to make very delicious. Not as sweet as a honey wheat bread which I like. Good wheat flavor. I boil water in my teapot and fill an extra metal loaf pan 1/2 full with boiling water and then put it in the oven with the bread. It makes the oven work more like a brick oven and gives the bread a real crusty crust but I do this with all yeast breads (my hubby loves a good crust). Otherwise I followed the recipe exactly and it turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellie Limnios Zaccone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2478417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-05T06:53:27.407Z",
                "reviewBody": "This is so good.  It really is kid-friendly, too!  All of my babies just loved this and couldn't stay out of it.  I didn't need all of the flour- left out the last cup.  I used canola oil in this.  I wouldn't bake at 400 next time though- it got brown really fast and was a teensy bit dry on the ends.  I think 350 for the whole amount of time might be better.  I didn't follow the directions for shaping, but probably should have (my loaves looked funny).  I pulled this out of the oven at 5pm and the first loaf was totally gone 4 hours later.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-16T23:51:47.643Z",
                "reviewBody": "This was very good and easy to make - I used half AP flour and half wheat. I used my bread machine to mix the dough and then let it rise in a warm oven (pre-heat to 200 degrees then turn OFF!) with a damp towel over bowl for an hour. Shaped loaves (you don't need to roll out just shape into a rectangle and plop in buttered pan) and baked as directed. I really enjoyed the end result and this really is kid (baby) friendly as many wheat bread recipes contain honey and children under 1 year are not supposed to eat honey. These make great toast sticks for my little guy to enjoy. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cara McGuire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2139845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-24T20:23:28.793Z",
                "reviewBody": "Perfect sandwich bread! Soft bread & crust but firm enough to hold up while slicing thinly for sandwiches & toast. I made 1 loaf & some sticky buns since I had to roll it out anyway. Both were a hit with my husband & 4 yr old. It didn't need to bake more than 30 min. in my oven (15min @ 400F 10-15min @ 350F.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Art&Jess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2954056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-18T15:49:25.413Z",
                "reviewBody": "The double loaf worked well in my kitchenaid. I used almost all of the flour. I rolled and tucked one and shaped the other into a loaf. The rolled and tucked one was much nicer and didn't stick to my pan but had huge holes in the loaf even though I rolled it tightly. I googled how to make french bread and the technique worked on this for rolling and tucking. It's more like fold and pound. This time there were no holes and it was great.. gone in 30 minutes. Also need to remember 15 minutes at 400 and 30 at 350 or even less time if I don't want to burn this! Thanks!!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookingInSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2310458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-19T20:35:19.02Z",
                "reviewBody": "This recipe wasn't bad just wasn't my favourite. I like more dense bread than this. It is very light and my crust came out quite tough especially the bottom. Not overcooked just hard. The flavour is good but not awesome. Thanks for the recipe though:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "caroline",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4745418/"
                }
            }
        ]
    }
]