[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/55271/banana-spring-rolls/",
        "name": "Banana Spring Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F14305.jpg",
            "width": 2032,
            "height": 1354
        },
        "datePublished": "2020-03-05T04:58:09.000Z",
        "description": "Bananas rolled in spring roll pastry and deep fried. Very easy to make, and delicious with ice cream. Doesn't get simpler!!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "8 spring rolls",
        "recipeIngredient": [
            "2 large bananas",
            "8 (7 inch square) spring roll wrappers",
            "1 cup brown sugar, or to taste",
            "1 quart oil for deep frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oil in a deep-fryer or large cast-iron skillet to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Peel bananas, and slice them in half lengthwise, then crosswise into fourths. Place one piece of banana diagonally across the corner of a spring roll wrapper, and sprinkle with brown sugar to taste. Roll from the corner to the center, then fold top and bottom corners in, and continue rolling. Dip your finger in water and brush the last edge to seal. Repeat with remaining banana pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry a few banana rolls at a time in the hot oil until evenly browned. Remove to paper towels to drain. Serve hot or cold.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "BINEVE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.32258064516129,
            "ratingCount": 62,
            "itemReviewed": "Banana Spring Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "325.1 calories",
            "carbohydrateContent": "53.3 g",
            "cholesterolContent": "2.9 mg",
            "fatContent": "11.6 g",
            "fiberContent": "1.5 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "191.1 mg",
            "sugarContent": "30.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-07T03:07:20.437Z",
                "reviewBody": "What a beautiful photo!  What a simple idea.  HOWEVER...I would like to title my review of the recipe... \n\nHard Cooking Lessons Learned From The Making of Banana Spring Rolls.\n\n1.  No small children in the room during the making of this recipe.  (Swearing is inevitable).\n2.  If you buy the crisp spring roll skins...you need to soak them before trying to wrap the banana.\n3.  Do not soak them all together.  They will stick like a fly on the windshield.\n4.  Do not soak them too long.  They turn into something that resembles somthing that nasty construction workers cough and spit out.\n5.  Wrap the bananas and seal well.  Otherwise, when they hit the oil, out comes the banana, out comes the sugar.\n6.  Make sure you have everything ready and waiting in it's place.  Burning bananas while you are trying to wrap just sucks!  Have the paper towels, tongs, and whatever else ready!\n7.  Rolling these babies in cinnamon and sugar improves this dessert tremendously!\n8.  Most important tip.  Do not bite into hot banana roll!  \n9.  Make sure small children are still out of the room when you decide to ignore my advice and bite into that hot spring roll anyways.\n\nThis tasted alright but I'm not sure it was worth the mess, swearing and aggravation that ensued.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MYKIDSMOM5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1403956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-10T19:47:59.873Z",
                "reviewBody": "OK great variations already and of course I had to step it up for my own guilty pleasures! USE EGG ROLL WRAPPERS! USE PLANTAINS! Yummier! I used dark brown sugar on my plantains then dusted them with cinnamon nutmeg and cloves before rolling. I let them cool BRIEFLY on a paper bag didn't stick then placed them on wire racks. Then I drizzled melted dark chocolate in a zig zag design over the tops of the rolls. Slice diagonally and serve with fresh tropical fruit and berries on a powdered sugar dusted platter. To die for I swear!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alice C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2174429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-22T19:49:45.67Z",
                "reviewBody": "Served it for guests and family and everyone loved it. My 9 yr old son helped me make them. We broke the bananas in half and rolled them in brown sugar-cinnamon mix. Then rolled the banana in the wrapper and sealed. We made them ahead and put them in plastic wrap in the fridge until it was time to serve dessert. It only takes a few seconds to fry them. I cut them in half after cooling a second. I sliced on a diagonal instead of straight across because then they look prettier on the plate when you stand them up. Served with a scoop of vanilla and a drizzle of caramel sauce. Put blueberries and cut up strawberries around the plate with a sprig of mint and the crowd went wild! We have already made them again! The whole thing went together very quickly! You can dress them up or eat plain either way they are great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sbee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/612749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-19T13:58:24.06Z",
                "reviewBody": "Yummy. This is also pretty much a great recipe for a popular Filipino dessert called \"Turon\". You can use either the bananas or ripe cooking bananas (also known as Plantains - make sure they're yellow and spotted) which I preferred to use for a sweeter taste. However if you use Plantains you'll need more spring roll wrappers. I used 2 Plantains which made about 12 rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOODGU1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1162744/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-08T14:50:06.28Z",
                "reviewBody": "This is pretty good - reminds me of the banana rolls growing up in the Philippines. The only changes I'd do it actually use plaintain (cooking bananas) and jackfruit (sliced and flattened). The jackfruit's already sweet so you don't have to put too much sugar. You can get the bananas and jackfruit at most Asian or ethnic stores.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chibipulse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1513910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-29T19:31:02.947Z",
                "reviewBody": "If you are counting calories, instead of deep frying just bake them for 15 minutes, be sure to brush a little olive or canola oil first so they will be crunchy and to prevent sticking. Delicious!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eimy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3847996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-31T13:41:00.873Z",
                "reviewBody": "i feel bad rating this 4 instead of 5 because i really enjoyed them and thought this was a quick unusual dessert. but there is a lot of room for personalization and \"improvement\". other fruit might be added with the bananas as might some spices (i think i'll try some cinnamon and/or nutmeg with the bananas or some allspice with some other fruits). also mind your manner of wrapping and be sure you seal the rolls so that the oil doesn't saturate the fruit. a great recipe i'm sure i'll make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lockesmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1719054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-05T00:18:10.843Z",
                "reviewBody": "We found it tasty but we think that for starters a better direction on dough would be welcome. We will do this again with strawberries and will post our comments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Juan & Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1509287/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T20:32:53.543Z",
                "reviewBody": "These were so messy and time consuming and not worth the effort. The taste is okay but not like the real thing. My oil was destroyed and I had to soak my tongs for 45 minutes to get them clean. Plus it says to drain them on paper towel but if they stay there any longer than 2 minutes they stick to the paper. I will not make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Bliss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697741/"
                }
            }
        ]
    }
]