[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/57326/bobs-habanero-hot-sauce-liquid-fire/",
        "name": "Bob's Habanero Hot Sauce - Liquid Fire",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5629974.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2020-03-05T04:58:14.000Z",
        "description": "Using fewer habanero peppers can reduce the spiciness in this extremely hot habanero hot sauce.  The sauce works wonders as a pick-up for Bloody Mary drinks.  Flavors meld wonderfully and the sauce keeps nicely for a long time.  Warning: A dash is all you need and it is best to use gloves when handling the habanera peppers.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT8H15M",
        "recipeYield": "1 quart",
        "recipeIngredient": [
            "12 habanero peppers, seeded and chopped",
            "1 (15.5 ounce) can sliced peaches in heavy syrup",
            "½ cup dark molasses",
            "½ cup yellow mustard",
            "½ cup light brown sugar",
            "1 cup distilled white vinegar",
            "2 tablespoons salt",
            "2 tablespoons paprika",
            "1 tablespoon black pepper",
            "1 tablespoon ground cumin",
            "½ teaspoon ground coriander",
            "½ teaspoon ground ginger",
            "½ teaspoon ground allspice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the peppers, peaches, molasses, mustard, brown sugar, and vinegar into the container of a food processor or blender. Measure in the salt, paprika, pepper, cumin, coriander, ginger and allspice. Blend until liquefied. Pour into clean jars, and refrigerate overnight before using.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Bob Miller"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.772861356932153,
            "ratingCount": 339,
            "itemReviewed": "Bob's Habanero Hot Sauce - Liquid Fire",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "22.5 calories",
            "carbohydrateContent": "5.3 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.2 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "242.6 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-23T15:28:12.44Z",
                "reviewBody": "I've made this many times. The first time I followed the recipe exactly and everyone said it was sweet ( maybe a good rib sauce). Second time I reduced the molasses to 1/4 cup and used peaches in lite syrup. Huge difference - perfect HOT SAUCE. Also, second time it kept a good color after molasses was added. In a family where hot is never hot enough - this is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Monica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2200579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-23T20:29:38.733Z",
                "reviewBody": "Very good, but can really taste the mustard.  I used French's yellow mustard, and that flavor is strong.  I also used 7 habaneros w/ seeds and it has a nice heat to it that warms your whole mouth.  Otherwise, followed the recipe exactly.  Very good, but maybe will modify the amount mustard the next time.  ***I just made another batch using only 1/8 cup mustard, 3 cloves garlic, dash of liquid smoke, 8 habs w/ seed.  I didn't pre cook peppers, I placed everything into the food processor and liquified, then cooked for about 10 minutes.  This is too die for!   I am baking fries right now to dip in it!  I am thinking this is my new JERK sauce!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jnick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1552879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-04T00:08:54.03Z",
                "reviewBody": "I hope you like hot!!...  Really Good Sauce!  Sweet, hot, complex flavors, and just when you think everything is fine, those habaneros come strolling across your tongue in a sort of delayed reaction and make your hair stand up...  I made a double batch of this stuff, using just two tablespoons of yellow mustard, and added a teaspoon of liquid smoke.  Otherwise, followed the recipe. It was a nice fiery orange color when I had processed the habs and the peaches.  When I added in the molasses every thing turned a dark reddish brown... Sort of looks like BBQ sauce.  Still good, but I may try using light amber honey intead of molasses next time to keep that lovely orange glow.  It just seems like this sauce should be a nice red-orange color, to match the taste.  Regardless, this sauce is fantastic!  It gets better as it ages and mellows.  I will definately make this again, after I go through the two 24 oz. jars I made the first time!  (It is going fast...) I think I will try bottling some for gifts. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "flying chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2869869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-10T21:38:32.95Z",
                "reviewBody": "I have made this sauce three times and like it each time. The first time I made this, the mustard taste was  too strong. The second time I made it, I omitted the mustard and added a little liquid smoke, delicious! The third time I added a few peppers with seeds to give it more heat (I like it hot) with the liquid smoke and no mustard. It came out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAULAU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1015075/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-14T20:44:10.733Z",
                "reviewBody": "Good Stuff! I also added about 10 or so cloves of roasted garlic. Then I  took half the batch and put it in a sauce pan. Heated it up and added a little cornstarch and peach juice together to thicken it. Awesome stuff on hamburgers. Really tasty and doesn't kill your taste buds! I have both thick and thin sauce to cover any foods you want to add a little kick to! Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1475563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-15T21:31:53.857Z",
                "reviewBody": "I gave this recipe 5 stars instead of the 4 that I'm really feeling about it mainly because I want people to try it. GREAT recipe, but with some flaws. I just finished my second time making it. (made a double batch this time) The first time with all scotch bonnets(which for those of you who don't know, are about equivalent in heat to habeneros) and this time I made them with MOSTLY Bhut Ghost Peppers (which for those of you who don't know, is the second hottest pepper in the world). For anyone who does not want their sauce to be sweet, I HIGHLY recommend cutting the brown sugar AND the molasses in half. I substituted honey for the molasses the first time and it was fine. I also use peaches in LIGHT syrup to make the sauce less thick AND as a bonus it lowers the calorie count. With scotch bonnets I ended up using 15 peppers. With the Ghost peppers I ended up using 6. I also, per some reviews add a few cloves of garlic, some grated white onion, fresh thyme leaves, and a lime juice water mixture to my sauce to my tastes. Overall with these changes to my preferences, this recipe makes an AMAZING sauce that is great on ANYTHING. Start with half of the sweet ingredients and 3/4ths of the peppers and then add accordingly to your specific tastes. Stop adding peppers when the sauce is just a TAD bit milder than you like because the heat will increase a little as it ages in the fridge. Try it and you wont regret it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen914",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3012817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-03T20:26:17.55Z",
                "reviewBody": "I love this recipe but had enough habaneros to make four batches. I now have 160 oz of this sauce and am not sure what to do with it. I tried freezing it in a muffin tin as another user did however it just turned into slush. I'd really like to jar it or can it so I can save some and give some away but I'm not sure if it will keep.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Slapshot31",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2431731/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-24T12:42:08.187Z",
                "reviewBody": "This is excellent. We pan roasted some garlic and aded it. It was not as hot as we expected. next time we are going to add jalapenos 1/2 the molasses and use honey add some finely minced onions and lime juice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1074352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-27T00:14:01Z",
                "reviewBody": "Great sauce. I made half because I didn't have a lot of peppers. I used 5 small habaneros. Didn't have peaches but added a little more sugar. Didn't have mollasses but used honey instead and a little more honey to make up for the peaches. Very good smoky sweet devilish sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Charlie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2272491/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T15:24:04.863Z",
                "reviewBody": "First off this calls for WAAAYYYYY too much mustard. Even with only 3 Tbsp it's too much. And I am a mustard fan but WOW. Mustard and hot sauce serve 2 completely different flavor-purposes. Also too much cumin. The first time I made this it tasted like mustard-taco. However I really wanted to make it work because I love hot sauce so I made it again and cut out the cumin altogether and decreased the mustard down to the 3 tbsp I mentioned. Still too much mustard. However I am determined to use this as a base for a good fiery sauce. Next time I will use 1-2 tbsp of brown mustard dijon or spicy like Guldens or Grey Poupon instead of the regular yellow mustard I've used before. Also I used 12-14 habaneros WITH seeds and the heat was still less than tabasco or frank's. It was hotter in my belly than in my mouth. The flavor definitely gets better the longer it sits in the fridge. Also I have to admit that it's great with food that normally calls for mustard such as burgers. BTW I followed some other reviewers and used honey instead of molasses cilantro instead of coriander added garlic and even tried simmering it for awhile (which did help a little). Don't get me wrong it seems like it has serious potential but I can't believe it has upheld a 5-star rating as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RDean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4389448/"
                }
            }
        ]
    }
]