[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/61024/asian-orange-chicken/",
        "name": "Asian Orange Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F11%2F3864686.jpg",
            "width": 650,
            "height": 465,
            "caption": "Photo: SunnyDaysNora"
        },
        "datePublished": "2003-05-17T07:46:16.000Z",
        "description": "A delicious citrus chicken recipe with flavors reminiscent of the orange chicken from a popular restaurant in the mall.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 ½ cups water",
            "2 tablespoons orange juice",
            "¼ cup lemon juice",
            "⅓ cup rice vinegar",
            "2 ½ tablespoons soy sauce",
            "1 tablespoon grated orange zest",
            "1 cup packed brown sugar",
            "½ teaspoon minced fresh ginger root",
            "½ teaspoon minced garlic",
            "2 tablespoons chopped green onion",
            "¼ teaspoon red pepper flakes",
            "3 tablespoons cornstarch",
            "2 tablespoons water",
            "2 boneless, skinless chicken breasts, cut into 1/2 inch pieces",
            "1 cup all-purpose flour",
            "¼ teaspoon salt",
            "¼ teaspoon pepper",
            "3 tablespoons olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour 1 1/2 cups water, orange juice, lemon juice, rice vinegar, and soy sauce into a saucepan and set over medium-high heat. Stir in the orange zest, brown sugar, ginger, garlic, chopped onion, and red pepper flakes. Bring to a boil. Remove from heat, and cool 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the chicken pieces into a resealable plastic bag. When contents of saucepan have cooled, pour 1 cup of sauce into bag. Reserve the remaining sauce. Seal the bag, and refrigerate at least 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another resealable plastic bag, mix the flour, salt, and pepper. Add the marinated chicken pieces, seal the bag, and shake to coat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large skillet over medium heat. Place chicken into the skillet, and brown on both sides. Drain on a plate lined with paper towels, and cover with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wipe out the skillet, and add the sauce. Bring to a boil over medium-high heat. Mix together the cornstarch and 2 tablespoons water; stir into the sauce. Reduce heat to medium low, add the chicken pieces, and simmer, about 5 minutes, stirring occasionally.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "HARRY WETZEL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.458432304038005,
            "ratingCount": 2105,
            "itemReviewed": "Asian Orange Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "445.4 calories",
            "carbohydrateContent": "68.7 g",
            "cholesterolContent": "34.2 mg",
            "fatContent": "11.2 g",
            "fiberContent": "1.4 g",
            "proteinContent": "17.8 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "762.8 mg",
            "sugarContent": "36.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-09-17T21:34:28.157Z",
                "reviewBody": "Great orange flavor - tastes similar to restaurant Crispy Orange Chicken. The following changes should improve texture...\nAfter frying chicken keep warm on baking sheet in oven. Reduce cornstarch to 2 tsp. and dissolve in 1 Tbsp. water before wisking into boiling sauce. Transfer chicken to serving platter and pour sauce over all.  Don't heat chicken in sauce or crispy coating will flake off into sauce. Broccoli, sweet peppers, carrots, snow peas, and/or scallions would be nice - may need extra sauce if adding veggies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeannette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1455306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-01T15:01:20.077Z",
                "reviewBody": "SCRUMPTIOUS!!!  What I love about this recipe is one can tinker with the marinade by adding more or less of something until satisfied before pouring over the chicken.  I had some leftover pineapple juice so subbed part of that for the water.  I also added 3 cloves crushed garlic, only lightly packed the brown sugar, was 2 tbsp shy of the rice vinegar so added more lemon juice to make up the difference.  I grated the rind of one whole medium orange which equaled 2 tbsp. and put the pulp from that orange into the 'brew'.  Didn't have green onion so subbed some red onion for that.  Thanks for the suggestion of the sesame oil...love that nutty flavor it gives.  I didn't coat the chicken w/flour.  I just heated some wok oil and stir fried it that way.  Added some red pepper chunks to the stirfry for flavor and color(yum) and served over basmati rice. I made the cornstarch slurry using orange juice instead of water. Garnished with cilantro.  This is a definite keeper...wish there were more stars. One of the best Asian dishes I have made so far...not too tart, not too sweet.  Just the right balance.  One would swear this came from the Chinese carry-out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-29T00:10:03.477Z",
                "reviewBody": "The only tips I can provide in a recipe like this one is to emphasize the need to -completely- brown the chicken on all sides, keeping stirring to a minimum.  The best option for this would most certainly be to use a wok.  Adding a touch of Sesame oil to the olive oil adds flavor, and doesn't add much cholesterol or fat.  Also, most Chinese restaraunts use batter-dipped chicken as opposed to this recipe's use of marinade and flour, making it a -much- healthier choice than ordering out.  All in all, fantastic variance on the Orange Chicken recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "The Code",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2411472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-24T22:05:31.657Z",
                "reviewBody": "This was great! I've made it twice already and followed suggestions from others like using less cornstarch and subbing pineapple juice for some of the water, also added a little sriracha for a kick and it turned out very flavorful.  However, if you want the breading to stick to the chicken, dip it first in a beaten egg mixed w/ a little bit of water (to thin it out) before rolling in the flour breading, this works really well...re-dip in egg and flour again for a thicker/crispier breading.  It's a little bit more work, but trust me it pays off because this way you can cook the chicken with the sauce at the end without worrying about the breading falling off.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TropicAnna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2261318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-16T02:55:39.46Z",
                "reviewBody": "Amazing!  This was so easy to prepare and it tastes even better than what you get in a restaurant.  For the sauce I used 1 c. of water and 1/2 c. of orange juice plus the juice of 1/2 of one small orange and then cut up the other half into small pieces and added that. I didn't have fresh ginger root, so I used powdered ginger and used a bit more garlic.  What I like about this sauce is you can modify it to suite your tastes.  I let the chicken marinate all day. (I might try this one on the grill over the summer).  For the breading I added a little garlic powder to the flour mixture and took the advice of another reviewer and dipped the chicken into egg thinned out with a little water.  The breading stuck to the chicken perfectly and after cooking I removed it then thickened the sauce. (start with a small amount of cornstarch and water 2 tsp. to 1 Tbsp. and thicken desired consistency) I served it over rice, and a vegetable medley of steamed broccoli, red peppers, baby corn, and carrots.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-12T16:45:19.017Z",
                "reviewBody": "This was very good.  It was a little too strong on the orange flavor.  I think I would reduce the orange zest a bit.  I followed other reviews, and let the chicken stay crisp keep warm in a 200 degree oven after I fryed it.  When everything was ready, I served it family style in a big bowl.  I layered white rice, then a mixture of veggies (pea pods, carrots, broccoli, and mushrooms that I stir-fryed in a little of the sauce), the chicken, then I poured the orange sauce over it.  Finally, I topped with sliced almonds and crispy noodles.  Update:  I've made this again since my 1st review, and we've decided that this is definitly a 5 star recipe instead of the original 4 stars.  I think I finally found a good balance with the orange zest!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan May",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2324640/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-10T04:43:36.623Z",
                "reviewBody": "just a little note.  You must make sure to mix the water and cornstarch together thoroughly before adding it to the sauce.  If you still find the sauce to be starchy, next time you try it, you can leave 1 tbs of oil in the pan after frying the chicken and add the cornstarch to that and cook stirring frequently for ~5 minutes before adding the rest of the sauce...it will have the same thickening effect.  Hope that helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HARRY WETZEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/258377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T23:25:29.47Z",
                "reviewBody": "This was very good. I used Panko bread crumbs instead of flour. I also did not add the chicken back to the pan but kept it warm in the oven. I added at least a cup of chicken broth to the sauce into the pan and reduced it before adding in roughly 1 1/2 tbsp of cornstarch (mixed with liquid from pan) to the pan to thicken. Placed the chicken on top of rice then poured the sauce over the rice. There was plenty of sauce for the whole dish. This was soooooooo yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321285/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-12T18:15:51.513Z",
                "reviewBody": "This recipe has a wonderful flavour.  I added a lot more orange zest because I was craving a good orange taste and I also added a few drops of sesame oil as per another reviewers suggestion.  As for the cornstarch problem that everyone had been complaining about, a quick glance at the amount of sauce in the pot told me that the cornstarch measurement was WAY off.  I only used about 2 teaspoons with a bit of water and the thickness of the sauce was perfect.  I also added broccoli which really picked up the orange taste...delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pichoux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1625890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-06T21:29:48.517Z",
                "reviewBody": "I made this yesterday but, althoough I adjusted the cornstarch amount, we didn't care that much for the sauce. The marinated chicken was very good but all in all, too much work for the so-so result!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SunFlower",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1144581/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Asian Orange Chicken",
            "description": "See how to make takeout-style crispy orange chicken.",
            "uploadDate": "2012-06-21T00:57:49.814Z",
            "duration": "PT4M32.856S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F5715485e-5368-48c1-90bb-3ecb40a28570%2F1530b991-83e5-4259-a41f-6f4d19e7ede7%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1699390498001"
        }
    }
]