[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/849/desserts/cookies/no-bake-cookies/",
                    "name": "No-Bake Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69235/gobble-up-granola-snacks/",
        "name": "Gobble Up Granola Snacks",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1036113.jpg",
            "width": 1300,
            "height": 975
        },
        "datePublished": "2020-03-05T04:58:34.000Z",
        "description": "This is a quick granola snack recipe that my sister-in-law gave to me one snow day when the kids were home.  She told me the kids would eat the batch in a day and she was sure right!  I tend to double the recipe so I am not making it every day!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "18 bars",
        "recipeIngredient": [
            "2 ½ cups crispy rice cereal",
            "2 cups quick-cooking oats",
            "½ cup raisins",
            "½ cup packed brown sugar",
            "½ cup light corn syrup",
            "½ cup crunchy peanut butter",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the rice cereal, oats, and raisins. Set aside. Grease a 9x13 inch baking dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the brown sugar and corn syrup in a small saucepan over medium heat. Heat just until boiling, then remove from heat and stir in peanut butter and vanilla until smooth. Pour over the cereal and oat mixture, and mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Press into the prepared pan using the back of a large spoon. Allow to cool, then cut into squares.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "No-Bake Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TINAMARIES"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.632592592592593,
            "ratingCount": 675,
            "itemReviewed": "Gobble Up Granola Snacks",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "146 calories",
            "carbohydrateContent": "25.6 g",
            "cholesterolContent": null,
            "fatContent": "4.2 g",
            "fiberContent": "1.7 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "72.3 mg",
            "sugarContent": "10.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-13T22:49:11.463Z",
                "reviewBody": "So yummy! I made the following changes and they are the perfect consistency.  I used honey in place of the corn syrup.  I used 1/4 cup raisins, 1/8 cup chopped pecans, 1/8 cup coconut in place of the 1/2 cup raisins.  I added 4 tablespoons ground flax for health.  I used old fashioned oats in place of quick and I added 1/4 teaspoon cinnamon for flavor.  I followed the recipe for everything else.  These are better than any store bought granola bar for sure!  Make sure you spend enough time mixing the mixture so that it is evenly coated.  I thought I might have the crumbly problem at first but I just kept mixing and they came out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHMANESSA8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/957689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-16T20:25:17.017Z",
                "reviewBody": "I made these for the first time in March 2005 and followed the recipe except for the vanilla extract.  They were quite yummy, although a bit crumbly as others mentioned and could have been a bit more flavorful.  I really liked how not messy they are to make, too.  I just made these again this week, except used honey instead of corn syrup, made  a bit more of the sugar concoction  and used those Florida Natural fruit snacks instead of raisins.    Prepared this way, the granola bars hold their shape quite well and taste  fantastic.  My boyfriend almost died when he had the first bite and I suspect I'll be making them weekly now.  Update 7/07: I use this recipe more than any other recipe EVER!  I guess we like things sweet, but I always use 2/3 cup brown sugar, 2/3 cup honey and 2/3 cup peanut butter.  Perfect for us. I also just dump the mixture onto a cutting board after getting it all mixed up and shape it into a square with my hands, let it set, cut them up and individually wrap in foil. I've tried lots of dried fruits in them and they're all great, usually use cranberries.  I'm going to try adding cinnamon next time!  THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Bunny Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thebunnychef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-05T19:08:19.957Z",
                "reviewBody": "HELPFUL TIPS AFTER READING ALL THE REVIEWS: I found it easier to use my hands and not a spoon to flatten and pack together in a pan.  Honey makes all the difference instead of the oil.  Then I placed it in the fridge for an hour, cut in squares, and placed each one in plastic wrap for easy grabbing.  Store at room temperature as they get dry/not chewy if left in the fridge.  I can't believe how good these are.  I do agree with the poster who used 2/3 C of everything (raisins, brown sugar, honey, pb) instead of 1/2 C.  Makes a huge difference!!!!  I also sprinkled some pecan pieces (NOT crushed, just chopped a tad) OR sliced almonds ...about 1/4 - 1/3 a cup, & it was the perfect combination!  I used a bag of raisin/cranberry mix instead of JUST raisins.  You can really make this colorful w/your choice of fruits for the holiday season!  I don't allow my kids to have chocolate, but I can easily see why others insert m&m's in these. Just be sure to add them last so they don't melt!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-05T18:15:18.667Z",
                "reviewBody": "This recipe is delicious...with a few changes. Here is what I did to make it more healthy:\n1. Eliminate corn syrup and add 1/2 cup water with 1 Tb honey. \n2. Used whole oats--but soak it in just enough hot water to soften it up (but don't add so much that it becomes watery)\n3. Original recipe was a bit too sweet, so I used slightly less than 1/2c brown sugar on my next batch.\n4. Use wheat puffs instead of rice.\n5. Add 2 Tb. flax.\n6. Use around 2/3 c lowfat peanut butter to make batch stickier and to eliminate any crumbliness.\n7. Press finished batch firmly to hold it in place.\n8. Add some pumpkin spice or cinnamon.\n9. Use nuts or other fruits in place of raisins---be creative! I used soy nuts, pine nuts and baked pears---delicious!\n...enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2840924/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-18T13:37:19.5Z",
                "reviewBody": "This is very good and very versatile. The binding ingredients are the corn syrup sugar and peanut butter. If you look at the other recipes on this site they are basically all the same. I used Special K because I couldn't find Rice Crispies. I also ran out of oats so I just topped it up with choc chip muesli. And instead of raisins I put chopped almonds because my daughter doesn't like raisins. As others have done I am going to try honey next time. Tip: if the mixture hardens while mixing just put it in the microwave for 20 seconds and continue. It was not easy to mix. I lined the pan with a big piece of foil filled in the mixture folded the foil over and used my hand to press it down firmly and evenly. Therefore I did not have sticky hands a sticky pan or a crumbly mixture like others have experienced.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "goldfish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/97045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-27T02:23:19.577Z",
                "reviewBody": "I wish there were more stars. The great thing here is that you can substitute forever and still have a GREAT recipe. I use cheerios instead of \"crispy rice cereal\" and I add some crushed up pretzels for a nice salty crunch. I prefer craisins to raisins and I use almond butter (way expensive but healthy they and tastes great). I usually gripe when reviewers give this many changes but the point is IT IS A GREAT RECIPE... SIMPLE VERSATILE AND DELICIOUS.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "esmiregal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1762588/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-06T09:58:30.11Z",
                "reviewBody": "Taste like a rice crispy bar!  I've made them 3 times in the last couple of days using M&Ms and chocolate chips instead of raisins and smooth peanut butter.  Fill the 1/2 cup 3/4s full of the light corn syrup and add a little honey to get to a full 1/2 cup - it helps the bar stick together better (don't use more or it turns out too sweet).  Also add a 1/4 tsp of salt - don't know why but it makes a world of difference in the taste in a good way.  Thank you so much for this easy delicious recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NUKA1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1831843/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-31T05:31:27.577Z",
                "reviewBody": "This recipe was absolutely delicious! I tweaked a bit of this recipe by using honey instead of corn syrup. I also used a full tablespoon of vanilla extract instead and since I'm not a big fan of raisins I used cranberry trail mix instead. Personally after making this recipe many times I found that adding about 1 tbsp of butter really helps. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1979305/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-24T20:49:37.997Z",
                "reviewBody": "Okay I have made these three times in five days and my kids are asking me when I am making them again. AND my DH has asked for them in his lunch. I guess everyone in my house loves them! These went together super fast and I like the cereal/oats combination and unlike alot of granola or granola bar recipes there isn't alot of sugar so they are healthier and less expensive to make. I made the first batch as directed the second minus the raisins and pressed mini chocolate chips on top and in the third I replaced 1/2 cup of cereal with coconut and added finely chopped dried apricots. They were all very good. Thanks for the keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANDRABETH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/132271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-02T17:12:27.623Z",
                "reviewBody": "When I first tried this I thought I would be giving it 1 star because it wasn't holding together at all. You do have to give it time to set. These were very good but they just wernt overly flavorful as prepared in the actual recipie. I found adding cashews crushed sunflower seeds chocolate chips and raisins helped a lot. Good basic recipie. First few bites arn't that great but they do grow on you. Make sure you cut them into small pieces not large bars they hold together that way. Also let them fully cool. Make sure when you put it in the pan you press it firmly down and together not just let it lay loose.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYCASS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/206279/"
                }
            }
        ]
    }
]