[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/759/desserts/candy/popcorn-candy/",
                    "name": "Popcorn Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/73761/microwave-caramel-popcorn/",
        "name": "Microwave Caramel Popcorn",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7302025.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-03-05T04:58:46.000Z",
        "description": "Caramel popcorn made in under 15 minutes with the miracle of the microwave. Easy and fun - not to mention delicious.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H15M",
        "recipeYield": "4 quarts",
        "recipeIngredient": [
            "4 quarts popped popcorn",
            "1 cup brown sugar",
            "½ cup margarine",
            "¼ cup light corn syrup",
            "½ teaspoon salt",
            "1 teaspoon vanilla extract",
            "½ teaspoon baking soda"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the popped popcorn into a large brown paper bag. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 2 quart casserole dish, or other heat-proof glass dish, combine the brown sugar, margarine, corn syrup, salt and vanilla. Heat for 3 minutes in the microwave, then take out and stir until well blended. Return to the microwave, and cook for 1 1/2 minutes. Remove from microwave, and stir in the baking soda.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour syrup over the popcorn in the bag. Roll down the top once or twice to close the bag, and shake to coat the corn. Place bag into the microwave, and cook for 1 minute and 10 seconds. Remove, shake, flip the bag over, and return it to the microwave. Cook for another 1 minute and 10 seconds. Dump the popcorn out onto waxed paper, and let cool until coating is set. Store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Popcorn Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SUBGIRL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.687103594080338,
            "ratingCount": 473,
            "itemReviewed": "Microwave Caramel Popcorn",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "172.6 calories",
            "carbohydrateContent": "23.8 g",
            "cholesterolContent": null,
            "fatContent": "8.7 g",
            "fiberContent": "1.1 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "282 mg",
            "sugarContent": "14.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-10T23:13:12.64Z",
                "reviewBody": "This is SOOOO good and easy! However, do yourself a favor. First, transfer your popcorn into a blow and then to another, leaving all of the unpoped kernels at the bottom of the first bowl. Toss the unpoped kernels. Return popcorn to bowl. This takes less than a minute and saves you a lot of time later (you don't have to find the unpoped kernels stuck in caramel!) When my caramel mixture was ready, I poured it unto the popcorn and tossed the caramel eavenly in the bowl to make sure the popcorn got evenly coated. Then, I transfered the coated popcorn into the brown paper bag. Depending on your microwave, it might be smart to cook it only 30 sec. at a time or to reduce the power because the first time I made it it burned. I cooked mine for 1:30 minutes (30 sec. at a time) at a reduced 50% power and it turned out perfectly.\nNote: For dairy-free version, replace the butter with 1/2 cup of Safflower oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ilareau",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2125125/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-27T00:41:03.687Z",
                "reviewBody": "Another tip.  Spray the inside of your paper bag with Pam cooking spray before adding the popcorn.  It helps keep the caramel from sticking to the bag.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bev",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3197405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-15T15:25:01.657Z",
                "reviewBody": "Awesome!  Didn't read all reviews first and burned the caramel in my first attempt - so pay attention to the cooking time (it's only a few minutes after all : ) ).  The second time I cooked the caramel sauce for 1.5 minutes, stirred than another 1.5 minutes then added the baking soda.  When I re-microwaved it I only did 45 seconds per side and it turned out perfectly! Also as with other reviewers, I halved the recipe and used one bag of microwave popcorn.  Delish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/609250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-05T13:58:50.35Z",
                "reviewBody": "warning....do not make if you are looking for a little something to satisfy your sweet tooth...because you will eat way tooo much of this stuff. the beauty of this treat is how quickly it comes together and then wow.....pure delight to the taste buds. i had no trouble with preparing...only trouble is it is way addicting!!!  before my husband and i knew it we had polished off the whole bowl. i will definately make again but not often...too fattening and too good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Victoria Binggeli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1685822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-22T23:32:51.887Z",
                "reviewBody": "First of all, this popcorn turned out great.  It was easy to make, and the cleanup was a snap.  I made this recipe using 2 bags of microwave popcorn.  The box said that each bag was 12 cups popped, but when I measured it after popping it, it was actually 8 cups per bag.  This made 2 bags perfect for this recipe (4 quarts exactly).  I did not have any paper bags to toss the popcorn in (who does anymore?), so I used the empty microwave popcorn bags instead!  Since they are made to fit 12 cups of popped popcorn, and they actually only popped 8, there was enough room in each bag to fit half of the caramel popcorn back into each one for the second part of the recipe.   The whole process was like this: pop the popcorn, pour both bags into a large bowl, dump it into another large bowl and remove the un-popped kernels from the bottom.  Split the popcorn in half (half in each bowl), cook the ingredients for the caramel as directed in the recipe, pour half of the caramel onto the popcorn in each bowl, mix the caramel into the popcorn using a couple of large spoons, pour each bowl of popcorn into its own empty microwave popcorn bag, and then microwave each popcorn bag individually as directed.  My microwave is high-powered, so I did 1 minute at 50% power, then shook the bag, then did another minute at 50% power.  It worked great!  Since microwave popcorn bags are wax-lined, the caramel didn't stick to them at all, and everything worked out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adam Ellis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3635083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-15T21:30:37.967Z",
                "reviewBody": "Ok, this is soooo good. I have made  caramel popcorn the \"old fashioned\" way many times. Never again. This was so easy and quick and tastes just as good (if not better) than traditional. Couple of notes though: First, real butter is so much better and worth the extra cost because you can really taste the difference. Second, my butter/brown sugar mix boiled over in the m/w and made a big sticky mess which I then had to put the bag on, so I suggest you put a plate under the bowl to catch any mess. Third, I used m/w popcorn, I just omitted the salt and ate some while the butter/sugar mix was cooking. My bag says that each bag makes 10 cups, so it's about 4 cups too much. I used two bags (most of two bags, anyway) Terrific recipe, LOVE IT. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gillian DaPrincess DeConto",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742536/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-26T03:07:40.82Z",
                "reviewBody": "I didn't think I had any corn syrup (I actually did) so I used honey. It still tasted great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Courtney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-24T22:30:34.627Z",
                "reviewBody": "it was soooooo good the second time. NOTE TO EVERYONE: THE BAKING SODA IS IMPORTANT!!! the first time i made this i didn't have baking soda so i didn't use it. and it was gross the butter and karo syrup dont combine and it had oily karo syrup on the top. but luckily the second time i was smart and i did use it. ps: the caramel is a good ice cream topping!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2317375/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-03T19:21:10.673Z",
                "reviewBody": "At first when I microwaved it for the first 1 minute and ten seconds it smelt really good and it was fine then i microwaved it again (as said in the instructions) and that pretty much ruined it. It smelt burnt although it didn't appear to be that way and it never got evenly spread in the paper bag with the popcorn in it; I don't recommend this recipe OR just follow your intuition on when the caramel should be ready and find a different way to evenly coat the popcorn in the caramel.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "iLfood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2338211/"
                }
            }
        ]
    }
]