[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1563/side-dish/sauces-and-condiments/chutney/",
                    "name": "Chutney Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/75320/spicy-peach-chutney/",
        "name": "Spicy Peach Chutney",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1039317.jpg",
            "width": 1280,
            "height": 1057
        },
        "datePublished": "2020-03-05T04:58:49.000Z",
        "description": "This chutney closely resembles imported Indian chutneys and is good with all curry dishes.  It is also great with cream cheese and crackers.",
        "prepTime": "P0DT8H0M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT10H0M",
        "recipeYield": "6 - 1/2 pints",
        "recipeIngredient": [
            "4 pounds sliced peeled peaches",
            "1 cup raisins",
            "2 cloves garlic, minced",
            "½ cup chopped onion",
            "5 ounces chopped preserved ginger",
            "1 ½ tablespoons chili powder",
            "1 tablespoon mustard seed",
            "1 teaspoon curry powder",
            "4 cups packed brown sugar",
            "4 cups apple cider vinegar",
            "¼ cup pickling spice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large heavy pot, stir together the peaches, raisins, garlic, onion, preserved ginger, chili powder, mustard seed, curry powder, brown sugar and cider vinegar. Wrap the pickling spice in a cheesecloth bag, and place in the pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring to a boil, and cook over medium heat uncovered until the mixture reaches your desired consistency. It will take about 1 1/2 hours to get a good thick sauce. Stir frequently to prevent scorching on the bottom.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the spice bag, and ladle into hot sterilized jars. Wipe the rims with a clean moist cloth. Seal with lids and rings, and process in a barely simmering  water bath for 10 minutes, or the time recommended by your local extension for your area. The water should cover the jars completely.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Chutney Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Shana"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.333333333333333,
            "ratingCount": 66,
            "itemReviewed": "Spicy Peach Chutney",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "51.3 calories",
            "carbohydrateContent": "12.6 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.1 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "5.1 mg",
            "sugarContent": "10.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-05T15:17:55.543Z",
                "reviewBody": "I am the original submitter of this recipe.  I feel compelled to write this review after reading the last couple reviews.  Some have said that it takes at least four hours to get the chutney to a thick consistency.  When I first made this recipe, I also felt that it was a little thin, but I went ahead and processed it anyways.  When the chutney had cooled off after processing it was quite a bit thicker.  I still only cook the chutney for 1 1/2 hours.  I also wanted to note that the recipe says that it takes 8 hours for prep.  That is an error that all recipes made when printing the recipe.  It doesn't really take much more than 30 minutes to do the prep work.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/665320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-04T01:51:32.973Z",
                "reviewBody": "This is an excellent recipe but several items should be noted: the prep time is NOT 8 hrs. 3 - 4 Hours is realistic including canning time. I added 1/4 c fresh finely chopped jalapenos to add a little spice. The chili powder did not add enough heat for my taste. I also added 1/2 bulb of garlic instead of just a few cloves. I found it difficult to find preserved ginger so I used crystalized ginger in the same portions. Easy to make and has been such a delight for my entire family - including extended family - that I made a 2nd batch. I doubled the recipe to use as gifts later this year. Thank you for the nice recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1268256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-20T21:05:41.833Z",
                "reviewBody": "I have been making this same recipe for about 40 years now (I've lost track of the number of batches).  A couple of things I have learned:  1.  Mix all ingredients in a large bowel, cover with a dish cloth and let sit overnight - the flavor becomes deeper 2. Cook time for thickness will vary based on the ripeness of the peaches. I usually cook 2 hours... and as suggested when my patience is not there or time does not allow, a little pectin goes a long way. 3. Roasted garlic if you have time adds a slightly more robust taste.  This is a standard in my house with grilled meats and salmon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "seafox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3602653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-10T22:08:53.797Z",
                "reviewBody": "Very very good! The house smelled wonderful while the chutney was cooking and my guests and I enjoyed the finished product. This chutney would be good with pork chicken fish - I served mine alongside cornbread with a barbecue meal. I halved the recipe and it yielded exactly 3 cups.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINGIRLLJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/451423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-26T02:09:57.58Z",
                "reviewBody": "I really liked this recipe. I thought I would share my notes on how I made it this year using Pomona's Pectin to speed the cooking process and so I can make it again next year. Thanks Shana for posting such a great recipe. Spicy Peach Chutney 4 pounds sliced peeled peaches 1 cup raisins (I used golden) 2 cloves garlic minced (I used a little less and added about Tablespoon of salt while mincing) 1/2 cup chopped onion 5 ounces chopped preserved ginger ( I am going to try grated peeled fresh next time) 1 1/2 tablespoons chili powder (cayenne) 1 tablespoon mustard seed 1 teaspoon curry powder 4 cups packed brown sugar (possibly dark brown due to use of 1/3 white sugar) 4 cups apple cider vinegar 1/4 cup pickling spice (Tampico smells better than Mojave brand to me) MODIFICATIONS TO ORIGINAL INSTRUCTIONS TO USE POMONAS PECTIN: (The advantage to this is reduced cooking time and better control over jelling) Boil 2/3 of brown sugar vinegar spice packet and can add onions and garlic now or after 10 15 minutes depending on texture desired. Boil until reduced by 1/3 to over high heat should reduce into a syrup. About 1 minute prior to adding peaches add rest of spices. I used cayenne pepper for heat instead of chili powder and mix. Add peaches and calcium water as per recipe for peach jam for volume you are making using hot method on Pomona s pectin box recipe insert.Take 1/3 sugar(white) and mix pectin very well with hand into sugar",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RussellPar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3750202/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-13T19:44:28.937Z",
                "reviewBody": "If it looks like soup or a sauce don't panic! CHEAT!;) You can still save your time and money you invested. Just add some gelatin and/or pectin. You can find it in any large grocery store in the baking isle and it only costs a couple of dollars. One box should do it. It will vary depending on how long you have cooked down the chutney. I wished I didn't leave mine on the stove simmering while I went to the store. I would have liked it more fresh than dark brown Also I would slice the peaches a good centimeter in thickness and cut the segment in half. Because when you cook down the chutney you want some peach substance left over. Once you have added the pectin you won't notice the set until you have cooled the chutney down. Anyways it may not be te conventional way and I'm not too sure it changed how the original recipe's was suppose to taste but it shouldn't have and worked and tasted great! I just gave it a stir after I cooled it down in the fridge and I got nice thick chutney suitable for Indian Royalty. If you're looking for something a bit different then this is the one. There is no doubt that when you serve this to your guests that it's homemade cause you can't buy something like this in the store. But make sure you have fun with the recipe and play with it..make it your own if you love onions add more onions. That's the fun of cooking and if you're like me it's never the same the next time around.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hobbes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5370987/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-13T02:13:15.513Z",
                "reviewBody": "This is a great chutney with just a touch of heat. My family loved it with a curry dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Joan HealyHartill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1611678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-22T01:54:40.72Z",
                "reviewBody": "This recipe took a loooong time. I know chutney and it took four hours for this to get to the right consistency. However it did turn out great so if you have the time this is a good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DundeeMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2986712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-06T18:25:17.613Z",
                "reviewBody": "Shana I modified this recipe. My husband cannot stand the smell of garlic. So I did not use garlic or onions. I used only two cups of brown sugar. I used a teaspoon of cinnamon and turmeric. one tablespoon of my own curry powder that contains sesame seeds flax sseds urud and channa dhal fennel cumin coriander red chilli pepper black pepper etc. My peaches are from my tree. One helpful suggestion regarding peeling Peaches-- Blanching. Soak the peahes in boiling water for five minutes drain cool and then peel. I also sterilize bottles in a pressure cooker. I am a microbiologist sterilizing with steam under pressure is the best technique of sterilizing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "tmlakshmi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3899614/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-19T18:25:05.673Z",
                "reviewBody": "This adds way to much liquid. No amount of cooking will reduce this to the semi-paste consistency of good chutney which is just slightly thinner than marmalade. I've been simmering for nine hours and I still have soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "sandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5229670/"
                }
            }
        ]
    }
]