[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
                    "name": "Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16429/appetizers-and-snacks/snacks/party-mix/",
                    "name": "Party Mix Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77178/caramel-pretzel-nut-popcorn/",
        "name": "Caramel Pretzel Nut Popcorn",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1477803.jpg",
            "width": 1704,
            "height": 1705
        },
        "datePublished": "2020-03-05T04:58:56.000Z",
        "description": "This is a very good holiday treat the my kids can't get enough of. It combines the sweetness of caramel with the saltiness of pretzels, nuts and popcorn. There is no mess because it is mixed in a large throw-away brown bag!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "32 cups",
        "recipeIngredient": [
            "8 cups broken salted pretzels",
            "20 cups popped popcorn",
            "4 cups dry roasted peanuts",
            "3 cups brown sugar",
            "¾ cup light corn syrup",
            "1 ½ cups butter",
            "1 teaspoon salt",
            "1 teaspoon baking soda",
            "2 teaspoons vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the pretzels, popcorn and peanuts into a large paper bag or, if you have one, a very large bowl. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium heat, combine the brown sugar, corn syrup, and butter. Cook, stirring to melt the butter and dissolve the sugar, until the mixture comes to a boil. Once the mixture is at a full boil, continue to cook for 5 minutes, stirring constantly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from the heat, and stir in the salt, vanilla, and baking soda. The mixture will foam up when you add the soda, so use a long spoon to stir. Immediately pour the sugar mixture over the popcorn and pretzels in the bag. Shake until evenly coated. For a crispier treat, boil the sugar mixture longer, or bake the finished mix in the oven at 350 degrees F (175 degrees C) for about 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Snacks",
            "Party Mix Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "rookieswife"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6938775510204085,
            "ratingCount": 98,
            "itemReviewed": "Caramel Pretzel Nut Popcorn",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "377.5 calories",
            "carbohydrateContent": "43 g",
            "cholesterolContent": "22.9 mg",
            "fatContent": "21.4 g",
            "fiberContent": "2.7 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "616.7 mg",
            "sugarContent": "16.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-09T18:41:43.2Z",
                "reviewBody": "I made this recipe last night.  Some of the reviews mentioned how the popcorn stuck to the paper bag.  I solved that problem by lightly spraying the inside of the bag with Pam.  It worked like a dream.  I baked it at 250 degrees for 1 hour stirring every 15 minutes.  I thought it was still going to be kind of mushy, but today it's nice a crisp.  Very good flavor.  I will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Susie Maenpa-Pavey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2198381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-29T20:05:53.997Z",
                "reviewBody": "I made this recipe for a holiday party and gave the leftovers to the host. Another person in their family is anti-sweets and gave the leftovers back to us. The host actually called and asked us to return the leftovers because it was the best he's ever tasted! You know a recipe is good when someone is willing to humiliate themselves to get more! Also I drizzled melted chocolate into the mix. Great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1694389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-06T19:33:43.763Z",
                "reviewBody": "YUM! I modified it because I'm lazy like that. 2 bags of microwave popcorn crushed up pretzels and chopped up pecans with the brown sugar base. 10 extra minutes in the oven definitely did the trick. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FARBIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1393854/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-30T03:16:27.793Z",
                "reviewBody": "What a yummy treat...Even better then crunch and munch and cracker jacks. I only had 2 cups peanuts so I threw in 2 cups almonds. Next time I'll try cashews. Soo good. I did skip the paperbag method and just mixed in a large stock pot and put into two aluminum lasagna pans and baked for the 10 minutes. Absolutely delicious. Soak your dishes in warm soapy water for 15 min for easy clean-up. This recipe makes a ton so you might want to half it. Once you start eating-you wont stop. The salty pretzel adds such a nice twist to this caramel popcorn treat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-04T21:03:27.887Z",
                "reviewBody": "This recipe is great except it doesn't mention what turns out to be the most important part of making caramel corn. After making a first batch with clumps of caramel mixed in with plain parts with no caramel a woman at work clued me it to the critical missing step! Once you have mixed the caramel in with the popcorn pretzels and nuts put small batches in a PAM-sprayed microwave-safe bowl and put in the microwave on high for two to three minutes total stopping after each minute to stir the mixture. The caramel will completely coat the popcorn and stuff yielding that great texture similar to cracker jacks. Other than that missing tip (which I can't believe wasn't in any reviews that I saw) this recipe works great! The paper bag idea is definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LANGDEV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1040177/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T21:58:38.687Z",
                "reviewBody": "I made this today for Christmas gift baskets. It made a lot of treats and turned out great. I did bake it on parchment lined cookie sheets for a few minutes after pouring on the carmel. I will make it again but next time I think I will put 1/2 of the popcorn mixture on the bottom of the bag then half of the carmel half popcorn half carmel. I think it will probably mix easier that way. I will also use the suggestion of spraying the bag with pam to avoid too much stickage. No loss - I just ate the stuck stuff while backing the rest of the batch... Great Recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFERGREEN1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2139356/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-24T19:29:10.177Z",
                "reviewBody": "GREAT..but a couple changes make it AMAZING... used 2 bags of (lowfat-ha ha) kettle corn. made exactly to directions using pretzels and cashews. Put in large stainless bowl sprayed w/cook spray. (you could also spray inside of paper bag to prevent sticking) Mixed well. Put 2/3 of it in a foil (for easy clean up) roasting pan in oven for only about 5 minutes and then I melted about 8 Dove dark chocolate candies in microwave tossed chocolate in remaining 1/3 caramel corn and put in fridge to cool. Took about 15 min. Broke up large pieces and added it to remaining cool caramel corn. This is a real treat. Trust me try it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CIMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2173756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-02T19:50:32.42Z",
                "reviewBody": "This caramel is perfect! I did a half batch using one bag of low-fat butter-flavored microwave popcorn. I broke the pretzels by hand which was time-consuming (next time I'll stick the pretzel sticks in a baggie and beat them with something:) and I used regular salted peanuts. I also used salted butter (next time I'll use 1/2 cup butter and 1/4 cup margarine to see how it works!). The caramel mixture foamed up after I added the vanilla not the baking soda. I think it was the alcohol in my fake vanilla flavoring.:) I put it all in a huge brown bag and had the same problem other reviewers had: the caramel pools on the bottom. So I madly stirred it and dumped it out on two baking sheets to cool. Peeling the caramel-covered peanuts (the nuts sunk to the bottom) out of the bag was a hassle but yummy! I did not need to put it in the oven letting it cool on the cookie sheets was perfect for us. My three-year old loves it. Thanks Rookieswife.:) You rock.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Duckball",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1241884/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-24T23:32:29.92Z",
                "reviewBody": "WOW really good!! I didn't have a paper bag so I mixed it in a large stock pot. This is the second time I've made this...the first batch went really fast. I doubled the recipe this time but I don't recomend it...too much to mix at one time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CASSAUNDRA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1263979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T18:35:33.077Z",
                "reviewBody": "While this was tasty I thought there wasn't quite enough sauce. Spraying the bag is a must and thank the reviewer for that. Shaking the bag didn't quite get it done so I stirred the contents of the bag with a long wooden spoon. I personally would have liked it a little more chewy and not crisp so next time I will cook the caramel a little less. But is is tasty and I will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Ruthann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3678907/"
                }
            }
        ]
    }
]