[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/230/world-cuisine/latin-american/caribbean/",
                    "name": "Caribbean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83421/trinidad-stewed-chicken/",
        "name": "Trinidad Stewed Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4525570.jpg",
            "width": 2759,
            "height": 1839
        },
        "datePublished": "2020-03-05T04:59:15.000Z",
        "description": "Tender golden brown chicken that goes great with anything.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (4 pound) whole chicken, cut into pieces",
            "3 tablespoons finely chopped green onion",
            "3 tablespoons chopped fresh cilantro",
            "1 teaspoon minced garlic",
            "1 teaspoon chopped onion",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "1 tablespoon vegetable oil",
            "¼ cup brown sugar",
            "1 cup water",
            "½ cup canned coconut milk",
            "1 teaspoon red pepper flakes",
            "2 tablespoons ketchup",
            "1 tablespoon butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken on a plate. Sprinkle the green onion, cilantro, garlic, onion, salt and pepper over it. Cover, and marinate for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a deep pot over medium heat. Stir in the sugar, and cook until the sugar has melted into a nice golden brown syrup. Add the chicken pieces, and brown quickly while turning continuously. Cover the pot, and let it cook for 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in 1 cup of water, coconut milk and pepper flakes. Replace the lid, and cook over medium heat for 10 minutes. Stir in the ketchup and butter. Continue cooking until chicken is fork tender, 20 to 30 minutes. Taste and season with additional salt and pepper if needed. Serve chicken with the sauce in the pot as a gravy.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Caribbean"
        ],
        "recipeCuisine": [
            "Latin American",
            "Caribbean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MASONBROWNE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.591194968553459,
            "ratingCount": 318,
            "itemReviewed": "Trinidad Stewed Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "310.5 calories",
            "carbohydrateContent": "8.7 g",
            "cholesterolContent": "65.3 mg",
            "fatContent": "20.9 g",
            "fiberContent": "0.4 g",
            "proteinContent": "21.5 g",
            "saturatedFatContent": "7.8 g",
            "servingSize": null,
            "sodiumContent": "404.4 mg",
            "sugarContent": "7.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-07T17:34:01.79Z",
                "reviewBody": "Being Trinidadian myself I can give a bit more imput into this recipe. We make this hugely popular dish very often and it can be done with variations. I have never heard of using coconut milk in stewed chicken that's usually in curries, You can omit the coconut milk for a very lowfat dish and use chicken broth instead. We usually blend (in blender or food processor)our seasonings such as cilantro, green onions, lots of garlic, a little water or vinegar to moisten and preserve  spanish thyme and of course hot peppers TO TASTE if you can take it. We marinate like some of the comments said longer, overnight is good. We brown just like the recipe said but even even longer than two minutes don't be afraid to really brown as long as you stir it and it does not burn, however I personally use about two tablespoons of sugar or you can also use a few drops of browning such as Benjamin's which comes in a bottle (it is caramelized sugar) or Gravy Master. As you brown adding a little ketchup and soy sauce then add water(or broth), chopped onions, and diced potatoes which thicken, then simmer for 1/2 hour to forty mins and then add a little cornstarch mixed with water toward the end to thicken. It will have a different flavor from original recipe if you omit the coconut milk. As a variation we also stew beef and pork cubes the same way, just cook longer, very delicious. ( a shot of rum in the marinating meat is great and if you like ginger a little bit of it grated is good too).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MYRTS78",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T02:03:36.793Z",
                "reviewBody": "With Trini roots, I found this recipe to be very much like what I am use to cooking. The only difference is that I mix the green onion, cilantro, garlic, onion, salt, and pepper....along with fresh thyme in a food processor with about 1T olive oil till it becomes a paste. Then, I rub it into the chicken and marinate it overnight. I also use the rest of the coconut milk mixed w/water to make herbed dumplings (not the kind w/baking powder....I like mine chewy and dense for this dish). Serve w/rice or with doubles (trini delicacy). Mmmmmmm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kali Doogarsingh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2419979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-26T19:55:58.817Z",
                "reviewBody": "This is extremely good.  I used boneless chicken, breasts & thighs and it came out great.  I added a bit more red pepper, and more garlic.  This is now on my kids (teens) most requested list.  I've found that soaking/marinating the meat much longer than 30 minutes is best.  I've never yet used a full bone-in chicken, which I suppose has a lot more flavor than boneless, skinless, thighs and breasts. Therefore, doctoring even further is good.  Also, the sauce tends to be thin because everyone adds the whole can of broth and the whole can of coconut milk.  If you do that, you need to double the initial step with the brown sugar mixture at the beginning.  Make sure to serve with an overabundance of jasmine rice cooked with chicken broth and spiked with cilantro, and green onion and red pepper to taste.  All of the optional steps shouldn't be optional.  They make the dish.  Don't skip.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nette/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-04T03:41:11.43Z",
                "reviewBody": "This is not really a traditional trini stew chicken. it looks too pale. tradition stew chicken is normally a deeper brown and that is because the sugar is allowed to brown and not just melt as instructed by this recipe. then the butter is absolutely unnecessary. with the vegetable oil and cocnut milk you are just adding too much fat without adding flavour. To cut colries and fat even more the vegetable oil can even be eliminated just put the sugar to brown in the pot and then throw in the chicken, then add the cocnut milk etc..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "TW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3179941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-27T10:56:54.447Z",
                "reviewBody": "OMG was this ever good! I only needed 4 servings so halved the amount of chicken (used skinless thighs) but made the full amount of sauce. It was great over rice. I had a little trouble with the brown sugar and oil initially. The burner must have been too hot so the brown sugar turned hard as a rock almost instantly. I redid it at low heat and it worked fine. I'm sending this recipe to everyone I know. It is a new favorite at my house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Toni Greathouse St John",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1760841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-09T02:36:53.09Z",
                "reviewBody": "All the ingredients incorporated really well together making this a very flavorful dish. I made a couple of changes; omitted the garlic replaced the cilantro with parsley and added some lime zest and lime juice to the chicken marinate. The lime juice adds some tanginess to the dish. We served it with coconut rice which is a very nice compliment. We loved it and will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PARKER71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1246979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-23T13:43:17.073Z",
                "reviewBody": "We loved this dish! I used chicken breasts cut into large cubes used cilantro in a tube added onion powder & eliminated the green onion & squeezed the juice from a lime over the chicken to marinade. To the sauce I added baby carrots used half coconut milk & half chicken broth for the water & I completely forgot the ketchup & butter. LOL I served this w/ jasmine rice cooked in chicken broth & coconut milk w/ mango slices alongside. I garnished w/ chopped parsley & a chive blossom bloom. I loved the pretty colors! The green from the parsley orange from the carrots yellow from the mango & purple from the chive blossom was just beautiful! Thanks for a great recipe MASONBROWNE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-09T15:46:39.827Z",
                "reviewBody": "I would give this recipe 10 stars. Rarely do I find a recipe that I will make again and again. OMG this is good! I too omitted the water and added a whole can of coconut milk. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LOOSENUP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-03T22:04:59.81Z",
                "reviewBody": "I loved this recipe. Wonderful flavor. I used a whole can of coconut milk - tasted amazing. I have made recipe several times and leeks can be used as well as green onion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ARCHICATS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1328292/"
                }
            }
        ]
    }
]