[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/88404/chile-garlic-bbq-salmon/",
        "name": "Chile Garlic BBQ Salmon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5536279.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2020-03-05T04:59:28.000Z",
        "description": "Salmon with a spicy Asian-style twist.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 pounds whole salmon, cleaned",
            "¼ cup soy sauce",
            "1 tablespoon chile sauce",
            "1 tablespoon chopped fresh ginger root",
            "1 clove garlic, chopped",
            "1 lime, juiced",
            "1 lime, zested",
            "1 tablespoon brown sugar",
            "3 green onions, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare outdoor grill for high heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Trim the tail and fins off of the salmon. Make several shallow cuts across the salmon's skin. Place salmon on 3 large, slightly overlapping sheets of aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, stir together soy sauce, chile sauce, ginger, and garlic. Mix in lime juice, lime zest, and brown sugar. Spoon sauce over the salmon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold the foil over the salmon, and crimp the edges to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "If using hot coals, move them to one side of the grill. Place the fish on the side of the grill that does not have coals directly underneath it, and close the lid. If using a gas grill, place the fish on one side, and turn off the flames directly underneath it; close the lid. Cook for 25 to 30 minutes. Remove to a serving platter, and pour any juices that may have collected in the foil over the top of the fish. Sprinkle with green onions.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "JAYDA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.63973063973064,
            "ratingCount": 297,
            "itemReviewed": "Chile Garlic BBQ Salmon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "437.9 calories",
            "carbohydrateContent": "5.3 g",
            "cholesterolContent": "133.9 mg",
            "fatContent": "24.7 g",
            "fiberContent": "0.7 g",
            "proteinContent": "46.2 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "737.5 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-25T23:40:30Z",
                "reviewBody": "This recipe is fabulous!  I cooked it in foil in the oven at 425 for 20 minutes and threw in slices of red pepper too, which were amazing with the sauce.  I will make this again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TERRALYNN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1169490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-01T01:13:32.373Z",
                "reviewBody": "I loved this and I am very picky about salmon recipes. Like other reviewers I thought the flavors would overpower the salmon but the marinade really wasn't too strong at all! I used a 1 lb. salmon filet cut into 2\" chunks but kept the other quantities the same wrapped in foil and baked in the oven for about a half hour. The only thing I would do differently next time is use lite soy sauce (personal preference) and if baking like I did this time I would open the foil for the last 5 minutes to let the sauce carmelize a bit. Will definitely try this with a whole salmon some day as the recipe states!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-14T02:40:05.663Z",
                "reviewBody": "Living in the Pacific NW I don't like to add anything too fancy to salmon....my husband was worried that this dish would cover up the flavor of the salmon..and amazingly it enhanced the flavor of the salmon. This is a regular salmon dish in our family now...don't hesitate to try it if you love the real salmon flavor...this did NOT cover it up",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFANDERSEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1136754/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-13T12:33:33.25Z",
                "reviewBody": "I can't wait to try this on whole salmon on the grill because it was absolutely delicious on filets done in the oven. I spooned the marinade on the filets about an hour before putting them in and wrapped them in foil while they waited. I used a hot oven for 20 minutes. About 450 degrees. Probably a lower temp would have worked just as well. I have a side of salmon that I'm going to try it on next tomorrow in fact outdoors on the grill. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rainstripe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1887734/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-19T17:05:48.857Z",
                "reviewBody": "We love this recipe and this is one of the easiest salmon recipe anyone can make. I made it twice already. The first time I followed the recipe as it was written. We were very impressed. Though after reading most of the reviews many reviewers were wondering if the fish can be marinated more than 30 minutes. I personally do not agree marinating more that 30 minutes. I want to taste my fish and have the marinade compliment the fish not the other way around. So the second time I made this recipe I decided to make my marinade a day early. I combined ALL the ingredient (except for the fish) in a container added a small drop of sesame oil and about 15 cilantro leaves. The next day I poured the marinade on the fish marinate it for 30 minutes and baked it. Sprinkled it fresh scallions and cilantro. The dish is so delicious. All the ingredients complimented each other. Although when i serve this dish to a group of people I think I will strain the marinade before pouring it to the fish. The presentation will be better if my guest do not see the chucks of garlic ginger and wilted scallions and cilantro. Can't wait to make this again. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs. Lagdameo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3259464/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-29T06:36:10.013Z",
                "reviewBody": "Another 5 star salmon recipe for us. My husband another couple that I had over for dinner tonight were all in agreement. I forgot to put the lime juice in and did not have any fresh ginger (so used 1 tsp. ground) and did not have any green onions....even with all this..it was absolutely fabulous. Thank you for an excellent recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OODLES_OR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-22T11:07:47.703Z",
                "reviewBody": "I needed a little something to spice up the usual bland fish dinner at my household. When i found the chile garlic bbq salmon recipe on my favourite website in the world I thought lets give it a shot. My kids who dont normally like fish asked for seconds and my wife thinks ive been going to chef school when shes at work. Only we know my secret.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jer123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2910642/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-15T12:45:20.14Z",
                "reviewBody": "When I first read this recipe I saw the words BBQ and then looked at the ingredients and thought it sounded like a nice combination. What I didn't realize when I went to make it was the complete foil wrapping. Seems to me that if you're going to completely wrap something in foil then why cook it on the grill? Probably the reason the majority of the reviews made this in the oven. We didn't we marinaded in the chili sauce a 3.5 pound salmon for about an hour I had to double the marinade but left only 1 tablespoon of grated fresh ginger. I didn't have a fresh lime so just used a tablespoon of lime juice no zest. And a few more garlic cloves. We grilled our fillets right on the grill with out any foil then basted them in the marinade that I quickly cooked on the stove-top with a teaspoon of cornstarch. This was one of the best marinades I've ever tried on salmon and we have tried just about every recipe on this site. My chili sauce is from World market and might be part of the reason such a good flavor. Was just the right amount of spice and sweet combination and yet let the full flavor of the fresh salmon come through. The fish was so moist tender and flaky. My husband thanks you...I thank you for we would've never thought of this marinade without your recipe. If you're grilling no need for the foil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-11T06:17:43.373Z",
                "reviewBody": "This is good! I added a little soy sauce rice wine vinegar a shake of sesame oil olive oil and used it as a marinade. I served it with a cucumber salad on top yum yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gibsey23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1819661/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-29T17:29:37.157Z",
                "reviewBody": "Pretty good!!! Made this for dinner last night. Prep couldn't be any easier! I like the fact that the marinade is made with ingredients I usually have on had (with the exception of chile sauce - I had to buy Sriracha since I didn't have it readily available). Instead of purchasing a whole 1.5 lb. salmon (I halved the recipe for my bf and I) I purchased two large filets which were about.5 lb. each. I made exactly half the marinade (i.e. enough for 3 servings / 1.5 lbs. fish). I added the white portions of my green onions to the marinade but saved the green parts for garnish as directed. Instead of grilling I sealed each filet in a double thickness of aluminum foil and baked closed for 20 minutes and then slightly opened for an additional 5 minutes. Served atop porcini mushroom risotto with a side of sweet potatoes and fresh cracked wheat french baugette purchased at my Italian bakery. While I liked this (and it's healthy to boot!) I didn't think it was flavorful enough to make again. Perhaps marinating for longer than 30 minutes (as I did) would do the trick??? I think this could use a little kick as well... red pepper flakes or a very spicy chile sauce (and more of it) perhaps??? Thanks for sharing:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            }
        ]
    }
]