[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1311/breakfast-and-brunch/cereals/granola/",
                    "name": "Granola Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/98390/megans-granola/",
        "name": "Megan's Granola",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F639760.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2006-01-08T18:39:20.000Z",
        "description": "My daughter and I came up with this recipe and it is absolutely wonderful.  Several of my children who typically don't care for granola, loved it. I've tried many granola recipes and this tops them all.  Enjoy!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "30 servings",
        "recipeIngredient": [
            "8 cups rolled oats",
            "1 ½ cups wheat germ",
            "1 ½ cups oat bran",
            "1 cup sunflower seeds",
            "1 cup finely chopped almonds",
            "1 cup finely chopped pecans",
            "1 cup finely chopped walnuts",
            "1 ½ teaspoons salt",
            "½ cup brown sugar",
            "¼ cup maple syrup",
            "¾ cup honey",
            "1 cup vegetable oil",
            "1 tablespoon ground cinnamon",
            "1 tablespoon vanilla extract",
            "2 cups raisins or sweetened dried cranberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Line two large baking sheets with parchment or aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the oats, wheat germ, oat bran, sunflower seeds, almonds, pecans, and walnuts in a large bowl.  Stir together the salt, brown sugar, maple syrup, honey, oil, cinnamon, and vanilla in a saucepan. Bring to a boil over medium heat, then pour over the dry ingredients, and stir to coat. Spread the mixture out evenly on the baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until crispy and toasted, about 20 minutes. Stir once halfway through. Cool, then stir in the raisins or cranberries before storing in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals",
            "Granola Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "annie9"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.830145371078807,
            "ratingCount": 1307,
            "itemReviewed": "Megan's Granola",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "368.6 calories",
            "carbohydrateContent": "45 g",
            "cholesterolContent": null,
            "fatContent": "20 g",
            "fiberContent": "5.8 g",
            "proteinContent": "8.3 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "121.9 mg",
            "sugarContent": "19.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-15T17:39:20.78Z",
                "reviewBody": "There is a slight mistake on the recipe. My original calls for 1 Tablespoon (not teaspoon) of cinnamon and 1 Tablespoon of vanilla.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "annie9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1717371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-18T16:33:59.537Z",
                "reviewBody": "I have been making this granola recipe for over a year now and am finally getting to writing a review...WONDERFUL!!!  I find it too sweet if I use the honey, brown ugar and maple syrup. I omit the brown sugar entirely and use  cup maple syrup and a tablespoon of honey.  The nice thing about granola is that it's so easy to modify...I never use the same nuts or seed twice!!  Hazelnuts, pumpkin seeds (added later becuase they \"pop\"!), cashews are among my favorites.  Of course, the good ol standby peanuts and almonds never fail!  I bake about 200 for 40-45 mins, gives you more control over the level of toastiness (or burntness!) you desire.  I often will add in some flax seed meal, excellent health benefits.  I will try the coconut oil for health benefits (and flavor!)  Thank YOU!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MEGOSLAND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1191973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-29T06:48:30.483Z",
                "reviewBody": "Wow!  Thanks for the recipe.  By far the best granola I have ever had.  I eat it 5 or 6 times a week - as cereal, mixed with yogurt or as a dry snack.  For variations, try one or all of the following:  substitute coconut oil for regular oil (the health benefits are amazing), reduce sunflower seeds (they are a little over powering) to 1/2 cup and add 1/2 cup ground flaxseeds, add 1 cup shredded coconut with 10 minutes left to bake.  If you want to get the kids to eat it, substitute 1 cup of chocolate chips or m&m's for 1 cup of raisins (not quite as healthy, but still MUCH better for you than a candy bar and boy is it good!  Kind of a trail mix granola.)  With the shredded coconut and the chocolate chips, it tastes like a healthy magic cookie bar.  :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "oregonrain",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1635535/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-10T23:07:20.113Z",
                "reviewBody": "This recipe tasted wonderful!  My only complaint is that it doesn't explain very much for a novice.  This was my first time making granola, and I burned the first couple batches because I kept expecting it to harden and clump as I cooked it, instead of AS IT COOLED.  Even then, 20 minutes was too short for crunchy granola.  I found 25 minutes at a 300 was just about perfect for my taste.  I also left out the nuts, so that could have had something to do with it.  I also would have preferred a glaze or sugar dusting on the raisins.  I didn't feel they mixed well with the other textures and flavors.  Other than that, it was a great recipe, and I kept the slightly burnt granola to eat with yogurt.  It still tastes pretty good, just a little toasty. I'll definitely try again, WITH nuts next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "southerncook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2850194/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-06T14:40:06.36Z",
                "reviewBody": "This recipe is great. I did modify quantities, using 10 cups of rolled oats (to match the size of the packaging), omitted the almonds, added unsweetened coconut, and increased the pecans and walnuts by 1/2 cups each, and wheat germ and oat bran by 1/4 cup each. For the wet ingredients, I largely kept the quantities the same. Instead of using maple syrup, I used sugar free E.D Smith syrup that uses apple juice concentrate and I increased the amount to accommodate for the extra dry ingredients. Once the granola had cooled, I added 1 1/2 cups of flax meal. Adding it at the end, rather than before the cooking process, keeps the nutritional value intact (breaks down in heat). Yummy, healthy and not too sweet. Thanks for this recipe Annie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1158836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-25T22:54:55.307Z",
                "reviewBody": "I used 1/2 applesauce and 1/2 canola oil and we love it. It's not so heavy and greasy like other granola. I also stirred in miniture chocolate chips as soon as I pulled it out of the oven and stirred them in immediately. They melt nicely into the granola and you taste it but it's not as chunky. We absolutly love it. I used only the honey and maple syrup and it's quite sweet enough. Otherwise I followed the recipe except I omitted the walnuts. This one is truly a keeper. Exactly what I was looking for. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maria Joy Schrock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2870287/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-06T21:09:51.92Z",
                "reviewBody": "This is my first try at homemade granola. This recipe is easy and -- from the little tastes I took along the way -- yummy.\n\nBUT!\n\nThere is a fine line between \"toasted\" and burnt. My granola is burnt. Just watch out. Even an extra minute can kill the whole batch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jvermeulen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1819408/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-15T01:48:26.08Z",
                "reviewBody": "I make this all the time because it magically vanishes in our house!! This is addictive! The proportions work very well, and of course, substitutions are easily made. I use whatever nuts we have on hand. Craisins are delicious, as well as any other dried fruit you like. I also like to sub a cup or two of cheerios or special K for the oat bran to give another dimension to the granola. **Note** to get the granola to chunk, BOIL the sugar/oil mixture (I just put it in a large measuring cup and microwave it until it bubbles - less cleanup), then stir and bake as directed, but after it's toasty, pull it out and DON'T STIR ANY MORE. Let it cool. It should cool and form a large brick that can be broken into satisfying chunks. Then sprinkle the fruit into the container with the granola. **Also, for those trying to skimp, you can sub applesauce for oil/ fake sugar/ yada yada and it will taste alright but it will NOT be as crispy and scrumptious. If you're going to go to the trouble, make the good stuff and follow this recipe. It's healthy and oh so good. Seriously. Try this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mirby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2167139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-23T21:34:50.21Z",
                "reviewBody": "The organic, nutty, rustic flavor is perfect. I love this recipe. It's the first time I've made granola and I was very pleased.\n\nHere's some thoughts: 1) Buying all the ingredients is expensive, but worth it. Figured on a \"per bowl\" basis, the cost isn't so outrageous though, because, 2) the recipe yields a LOT.  I didn't have a bowl large enough to mix all the ingredients, so I used a large roaster, 3) I prepared it as written and though the recipe is versatile and I might experiment a bit, it's really perfect \"as is,\" 4) I am a huge nut fan and the ratio of nuts in this recipe is very high, 5) this is probably common sense, but if you use two baking sheets, monitor the baking sheet closest to the oven heating element closely. The granola closest to the heating element will burn and stick to the foil if baked too long.\n\nI wonder what the purpose of the oil is.  I would like to use olive oil next time or leave out the oil all together, but I'd like to know what the ramifications might be. I'd hate to spend the money for the ingredients only to learn that the recipe was ruined because an ingredient was left out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-25T20:27:40.55Z",
                "reviewBody": "I followed the recipe and cooked it at 315 deg F. Wow - it burned black in 4 minutes. I know my oven cooks on the hot side but I think the temp you have must be wrong. The small part that survived was good though. Not my favorite recipe though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Joanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7557151/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Megan's Granola",
            "description": "See how to make easy homemade granola with oats, nuts, and dried fruit.",
            "uploadDate": "2013-08-02T19:58:03.746Z",
            "duration": "PT3M46.347S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd7c23967-4a3d-4d6e-ba64-ca2d8f1c1b14%2F5172a543-f426-485b-bc88-fd8ce7449ba1%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2581503907001"
        }
    }
]