[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/103714/zesty-summer-chicken/",
        "name": "Zesty Summer Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F71028.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T05:00:04.000Z",
        "description": "This easy-to-make chicken dish is full of Asian flavors!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 tablespoons dark soy sauce",
            "¼ cup fresh lime juice",
            "2 tablespoons sunflower oil",
            "1 jalapeno pepper, seeded and chopped",
            "2 cloves garlic, minced",
            "1 (1 inch) piece fresh ginger root, minced",
            "1 teaspoon ground coriander",
            "2 tablespoons brown sugar",
            "2 tablespoons grated lime zest",
            "6 (6 ounce) skin-on, boneless chicken breasts",
            "1 tablespoon cornstarch",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk the soy sauce, lime juice, sunflower oil, jalapeno pepper, garlic, ginger, coriander, brown sugar, and lime zest together in a bowl until the sugar dissolves. Place the chicken into a resealable plastic bag, and pour the marinade overtop. Mix to coat chicken, then seal bag, and refrigerate at least 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large, nonstick skillet over medium-high heat. Remove the chicken from the marinade, and shake off excess. Place into skillet, skin-side down, and cook until the skin crisps, about 4 minutes. Turn chicken over, and continue cooking on the other side until no longer pink in the center. Once done, remove the chicken and keep warm. Pour the remaining marinade into a skillet. Dissolve cornstarch in water, and stir into the sauce until thickened and clear. Bring the mixture to a boil, reduce heat to medium-low, and simmer 5 minutes. Serve chicken with sauce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "simpson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.933333333333333,
            "ratingCount": 15,
            "itemReviewed": "Zesty Summer Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "296 calories",
            "carbohydrateContent": "7.7 g",
            "cholesterolContent": "95.7 mg",
            "fatContent": "13.6 g",
            "fiberContent": "0.5 g",
            "proteinContent": "34.2 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "984 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-08T00:32:36.19Z",
                "reviewBody": "I made this tonight. It was good but next time I would decrease the soy and add more lime juice. The meat was too salty and you couldn't taste the lime. I did not use the sunflower oil did not have any and used boneless skinless chicken breasts. I will make this again but with the changes. Thanks for a good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "5galsandadad",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2738804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-08T00:24:45.603Z",
                "reviewBody": "I have mixed feelings about rating this recipe. The ingredients were good and I was intrigued by the idea of using coriander since I usually use it only in Indian- or African-inspired dishes. I increased the recipe by 50% - except for the soy which I thought was a little too much. As I was reading the recipe I kept thinking \"What sauce? How is this going to make a sauce?\" I thought maybe there would be more juice from the chicken or something...Sure enough when my chicken was done I was virtually sauceless and ended up with a goo after I added the cornstarch. I added chicken broth until I had sauce consistancy - and even with that dilution I think there was too much soy. I strained the sauce because the bitty chunks in it didn't appeal to me. In the end with my tweaks I ended up with a pretty good dish. If I do decide to make this again I'll forget about the sauce altogether because the chicken really is fine on its own. If you want sauce you'll need more liquid than provided. Sorry this is so long. N R Thanks for your efforts simpson I appreciate the chance to try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-08T00:25:52.657Z",
                "reviewBody": "I'm not sure what to say about this one. I did make several changes because I thought I had everything to make this except the limes and ended up in the kitchen with very few of the actual ingredients(having an off day apparently) so I did some subbing. I had lime juice but no zest so I increased the lime juice. I didn't have the coriander but since curry powder has coriander I tossed that in instead. I had jarred spicy jalapenos so I just used them. I had skinless chicken breasts and didn't have sunflower oil so just used regular vegetable oil. I couldn't taste any lime like another reviewer said--the soy sauce overwhelmed it and it just tasted like marinated chicken with soy sauce. Good but I was hoping for more lime taste. The spicy jalapenos actually mellowed out in the marinade; they just made the sauce itself too spicy to really use as a gravy for the chicken. Bf loved it though; I made the recipe with the written serving sizes--6--and he ate 3 pieces of chicken (one with gravy). He liked the gravy as well just complained it was too spicy. It was a very quick gravy to make and thick and gooey. I marinated the chicken overnight. I guess I'm making it again but I might increase the lime and decrease the soy sauce because I really was looking forward to a lime taste. N R",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-11T23:59:20.77Z",
                "reviewBody": "I reduced the soy by 1/2 and slightly increased the lime juice to taste. For personal preference I used bone in chicken. It tasted okay. THX.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1837326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-11T23:52:28.947Z",
                "reviewBody": "After reading the other reviews for this recipe I was very skeptical about it. I did not have nor could I find coriander so the recipe went without. I used real garlic Veggie Oil and ground ginger and added cilantro. Altogether I would have to say this really wasn't \"Zesty.\" In fact it was more like a homemade teriaky sauce. It was good. I made some Cilantro-Lime Rice to go with the chicken and sauce. O and I grilled the chicken which I really can't imagine it otherwise.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Samantha Peters Clough",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2794155/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-06T18:38:30.66Z",
                "reviewBody": "I tweaked this recipe to fit my liking while still using the same ingredients recommended. The flavours I definitely wanted to make sure I could taste was the saltiness of the soy sauce the tang of the lime and the spicy-ness of the jalapenos - therefore I doubled and tripled the amounts recommended. Had a nice mix and thought it tasted quite good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2598006/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-22T10:56:18.29Z",
                "reviewBody": "My family enjoys this recipe. I use boneless skinless breat marinate it overnight and cook it on the gas grill. Yum! TY for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lydia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1682946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-08T00:45:43.737Z",
                "reviewBody": "So I can tell that I have been out of town for 2 weeks. I always have limes and jalopenos on hand. I had 1 lime and no jalopenos. So I used some lemons and chili pepper flakes to sub. I just thought this was ok. Both my daughter and I thought it was a little to much citrus but my husband said \"you have been in a slump on that web site the last couple of times this is good\" so go figure. I have several recipes that are similar to this one with better results so I think I will stick with them. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETJAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/745460/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-01T11:48:11.4Z",
                "reviewBody": "Following the advice of others I used 2T soy sauce and added 1/4c water. I also used 1 tsp of cornstarch to thicken marinade in a small saucepan rather than skillet. The spicy lime flavor really came through and was an interesting chance of pace.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Keeli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9626188/"
                }
            }
        ]
    }
]