[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1014/meat-and-poultry/pork/tenderloin/",
                    "name": "Pork Tenderloin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/128953/marinated-pork-medallions-with-a-ginger-apple-compote/",
        "name": "Marinated Pork Medallions with a Ginger-Apple Compote",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F294764.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T05:03:56.000Z",
        "description": "Fresh pork medallions are marinated in a balsamic vinegar and garlic blend and topped with a fresh, homemade ginger-apple compote.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 cups balsamic vinegar",
            "2 tablespoons minced garlic",
            "1 tablespoon chopped fresh thyme",
            "1 cup olive oil",
            "1 pork tenderloin, cut into 2 inch pieces",
            "½ cup butter",
            "¼ cup packed brown sugar",
            "1 apple, thinly sliced",
            "¼ cup dried cherries",
            "1 tablespoon minced fresh ginger root",
            "1 pinch ground cinnamon",
            "1 pinch ground nutmeg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Puree the balsamic vinegar, garlic, and thyme in a blender until mixed. With the blender running, slowly pour in the olive oil until thickened and incorporated. Pour the marinade into a resealable plastic bag. Add the pork pieces, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for medium heat, and lightly oil the grate. Remove the pork from the marinade, and shake off excess. Discard the remaining marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the pork on the preheated grill until no longer pink in the center, about 10 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Once cooked, remove from the grill, cover with aluminum foil, and allow to rest for 5 to 10 minutes before slicing.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the pork is cooking, melt the butter in a saucepan over medium heat. Stir in the brown sugar until it begins to simmer. Add the apples, cherries, ginger, cinnamon, and nutmeg. Cook and stir until the apple is tender, about 5 minutes. Serve the sliced pork topped with the apple compote.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Tenderloin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "adam"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.681818181818182,
            "ratingCount": 44,
            "itemReviewed": "Marinated Pork Medallions with a Ginger-Apple Compote",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "536.3 calories",
            "carbohydrateContent": "45.4 g",
            "cholesterolContent": "110.1 mg",
            "fatContent": "31.3 g",
            "fiberContent": "2 g",
            "proteinContent": "19.3 g",
            "saturatedFatContent": "16.2 g",
            "servingSize": null,
            "sodiumContent": "239 mg",
            "sugarContent": "39 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-04-14T15:25:42.837Z",
                "reviewBody": "Delicious! The pork comes out moist tender and full of flavor - not at all dry unless you over cook it. Start off with a good quality balsamic vinegar and you can't go wrong. There is however a bit too much marinade. For about 2 lbs. of pork tenderloin I used 1 cup of balsamic vinegar and 1/4 cup of olive oil. I left the amount of garlic and thyme the same and added some fresh rosemary as it pairs well. I pricked the tenderloin serveral times with a fork and sprinkled it with a bit of kosher salt and cracked black pepper cut it up into pieces then poured the marinade over top and let it go all day. The longer it marinates the better. The pork will basically soak up most of the marinade. This is very similar to \"Grilled Pork Tenderloin with Balsamic Vinegar\" from this site. So if you like this you'll like that one too. When cooking it on the grill I skewered it to make it easier to turn and cook evenly. For the compote I used half the amount of butter fresh cherries (15) 1/4 tsp. of ginger powder and eyeballed the cinnamon and nutmeg. The compote is very good. I could see using dried cherries or dried cranberries depending on your tastes. This is a definite keeper and will make you look like a star in front of guests.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-01T16:13:57.273Z",
                "reviewBody": "Adam thank you for a really nice twist to a wonderful pork loin dinner. Rather than cutting up the meat into medallions I left the loin whole. I did cut the marinade ingredients by about half and let it marinade for about 2 hours. There was still plenty of marinade and the longer the meat sat in the marinade the more it absorbed and was so incredibly delicious and tender that I didn't even need to use my knife. It was genuinely fork tender. I also cut the amount of butter in the compote and added reconstitued dried cranberries to the apples and ginger mix. This was a really nice side dish to the entree and my guests think I'm a kitchen genius so thank you for making me look so good. I'll be doing this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avon- status quo PRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3326566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T17:30:47.357Z",
                "reviewBody": "We loved the flavors. As others have pointed out the quantity of marinade is excessive. I made half the recipe put the 2 rather large tenderloins in a plastic container that fit them comfortably and poured that half recipe on and it was enough to submerge them. That's a convenient amount but I think I could make only a fourth of the recipe from these costly ingredients and put them in a bag that can be turned over. Definitely make only a fourth for 1 tenderloin. The compote is great and about the right amount for two tenderloins. Definitely do not slice the meat until after grilling. We grilled according to package directions. 10 minutes would not have been long enough on our gas grill at 400 -- more like 20 minutes. Quantity wrong timing wrong - otherwise a very fine enhancement to the pork.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSEP47",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1106489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-08T17:54:39.367Z",
                "reviewBody": "What a delicious dinner! I only used 2 tablespoons of oil and 1/4 balsamic vinegar to marinade the pork and it was plenty. I also marinated it overnight and left it whole until I served it. For the apple compote I only used 2 tablespoons of butter added some apple juice and used cranberries instead of cherries and it turned out fantastic! I served over rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bobbi123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3552751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T22:02:30.373Z",
                "reviewBody": "This was a very delicious meal for four people! I used a pork tenderloin that was about 1.25 pounds (half of a Costco sealed bag) and all the recipe for the compote (minus the nutmeg because I didn't have any). The marinade however I cut in half and even froze half of that for another meal. I wasn't sure if I was supposed to cut the tenderloin before marinating or after grilling but I decided to cut before. I will try it whole the next time. Served over sticky (calrose) rice this was one very yummy meal! (Well my husband doesn't like rice so I served his over a baked potato!) And I have more marinade in my freezer for another meal--the best of all possibilities! Thanks Adam for a very great dinner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-09T18:44:00.867Z",
                "reviewBody": "This turned out fantastic! I think you can easily use half the amount of marinade if you are only making one pork tenderloin. I sliced my tenderloin into about 1 inch slices and marinated them that way so they absorbed more flavor. Cooking on grill really adds a nice flavor that you won't get if you cook on stove or in oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2500506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-01T20:09:38.25Z",
                "reviewBody": "Awesome recipe! I used 1/2 of a 6 lb pork loin--not a true tenderloin--sliced in half then sliced 1/2\" thick and pounded to 1/4\" thick. I made about 1/3 the marinade for this amount of meat and had no problems. For sweetest flavor follow the recipe of 1/2 hr marinating in the fridge; for more tangy flavor in the meat marinate on the kitchen countertop for 1 hr up to 2 hrs. The thin pounded medallions grill very quickly so watch for overcooking--don't let them get hard and tough. Serve with a fresh steamed vegetable crusty bread and a nice Riesling and be prepared for oohs and ahhs!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "morble",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2490810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-26T02:06:29.92Z",
                "reviewBody": "This flavor combination is excellent but using 2 cups of balsamic vinegar and a cup of olive oil for a 30 minute marinade is ridiculously wasteful in my opinion. I just made the compote and put a couple of teaspoons of balsamic vinegar in it and used some of the liquid to baste the pork when it was almost done. Turned out great. In retrospect the half cup of butter in the compote is also unnecessary excess. Next time I'll use a tablespoon or two of butter and some white wine or apple juice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Josie1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2013843/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T22:12:26.917Z",
                "reviewBody": "Use Craisins (of any type) substitute for the cherries for an amazing twist to this already excellent recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jason",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/661066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-13T11:32:24.413Z",
                "reviewBody": "not as good as reviews indicated",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "123GRIZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1244869/"
                }
            }
        ]
    }
]