[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/129500/uncle-whites-bread-machine-rolls/",
        "name": "Uncle White's Bread Machine Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F684571.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T05:04:00.000Z",
        "description": "My family says I am famous for my rolls. I hope you like them too.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H35M",
        "recipeYield": "12 rolls",
        "recipeIngredient": [
            "3 cups bread flour",
            "1 cup buttermilk",
            "2 tablespoons packed brown sugar",
            "1 ½ teaspoons kosher salt",
            "1 (.25 ounce) package active dry yeast",
            "1 egg yolk",
            "2 tablespoons canola oil",
            "stick butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the bread flour, buttermilk, brown sugar, salt, yeast, and egg yolk into a bread machine. Using the Dough setting, allow the machine to mix the ingredients until moist. Pause the cycle and pour in the oil, then let the machine continue to the end of the Dough cycle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease muffin pans or a baking sheet, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, and remove it from the machine. Divide the dough into 12 equal parts, form into round, smooth rolls, and place them into the cups of the muffin pans or on baking sheet, making sure the rolls don't touch each other.  Cover the rolls with a kitchen towel, and let rise in a warm place until double, about 25 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the rolls are rising, preheat oven to 350 degrees F (175 degrees C). Bake the rolls in the preheated oven for 20 minutes, or until golden brown. Rub the tops of the hot rolls with a stick of butter for a soft crust, cool the rolls slightly, and serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DwightNT"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.473684210526316,
            "ratingCount": 76,
            "itemReviewed": "Uncle White's Bread Machine Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "175.6 calories",
            "carbohydrateContent": "28.3 g",
            "cholesterolContent": "20.4 mg",
            "fatContent": "4.4 g",
            "fiberContent": "0.9 g",
            "proteinContent": "5.2 g",
            "saturatedFatContent": "1.1 g",
            "servingSize": null,
            "sodiumContent": "270.5 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-08-05T20:42:26.707Z",
                "reviewBody": "Ohhh, I SO enjoyed this bread! Regular ol' sliced bread works out better for our needs, so I made this into a loaf rather than rolls.  Because I like less sweetness and more density in my breads I reduced the sugar to one tablespoon.  I also used butter instead of oil, but that's no biggie either - I'm sure I would have been equally as happy with the canola oil (if, in fact, I ever used canola oil in the first place). I threw in a fair amount of fresh dill just for a flavor variation but this bread is just fine on its own. It's rich and flavorful, which I fully expected because of the egg yolk, buttermilk and  brown sugar.  It has a beautiful pale golden blush of color. Rolls or bread, this is a real winner - one of the better recipes I've tried.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-25T18:16:54.903Z",
                "reviewBody": "Yum SO good! I ended up adding a bit more buttermilk than called for (about 1-1/4 cup) because it appeared to be a little dry after my bread machine got it all mixed up. Also next time I will just go ahead and add the oil with the rest of the wet ingredients into my machine before beginning the dough cycle. I don't see any point to adding it later. Instead of using a whole stick of butter I just melted about 2 Tbsp. and brushed it on with a pastry brush during and also after baking. Instead of rolls I chose to make the dough into a loaf by rolling it into a rectangle and rolling it up from the long side tucking ends under. The result was beautiful! Sliced beautifully smelled wonderful and tasted even better. I will definitely use for rolls next time I need them. Thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-25T16:18:01.87Z",
                "reviewBody": "I was drawn to this recipe because of the buttermilk (needed to use some up) and the smaller amount of flour. I gave it five stars because it fit just what I was looking for. Tried this for Sunday dinner.I was worried about the buttermilk not being warm when I started but it seemed to make no differance. I made only one change.I used brown sugar splenda blend; but will warm the milk egg and oil next time and add togeather to see if it does.As Valerie did. I made smaller rolls about 24 as I was hoping to have some leftover for Monday's dinner will have to make more. Son and husband took them for a snack on the way to work and class. Now I have a use for buttermilk beyond ranch dressing and fried chicken. Thank you Musterdseed for a wonderfuly easy & tasty recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robograndma Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/robograndma/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-27T21:33:56.48Z",
                "reviewBody": "Fabulous silken dough a dream to work with. The rolls are good. However there's an elusive something missing from the flavor. After a bit of analysis I believe that they're lacking that ever-so-slight sweetness the palate expects to taste in a dinner roll. Presumably this is because the acidic contribution of the buttermilk serves to counteract and cancel out the sweetness of the sugar addition. It's quite possible that this could be improved by doubling the sugar - don't know. It falls short of the 5 star rating because Colleen's Potato Crescent Rolls on this site produces the quintessential dinner roll the touchstone against which all others are judged for me. If you make the two recipes side-by-side you will understand there is absolutely no comparison. That said this is a respectable alternative. Note: I also baked as a loaf and the consensus is that it's more successful when baked in this manner. The lack of sweetness which makes the flavor border on blandness in a roll translates better into bread. The ideal backdrop for whatever meat and fixings you choose to place between the slices its lovely moist texture contributes to a memorable sammie. Sturdy enough to stand up to slicing without crumbling. In fact when I ate my sandwich this bread was so moist that not a single crumb fell on the plate! Great for morning toast as well. Baked in a 9\"X5\" loaf I get 14 full slices and 2 heels. I always keep slices in the freezer. As bread 5 star as rolls 4.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-30T18:48:45.38Z",
                "reviewBody": "WOW! WOW! I have been searching for the best recipe.....and this is it my friends! The only tweaking involved was getting rid of the brown sugar and using white sugar. I had to add a bit more flour but I think that was personal preference. I also made them into \"cloverleafs\"(3 small dough balls) in each cup of the muffin tin.I let them rise most of the afternoon and kept brushing melted butter on top (butter kept absorbing into the dough). When they came out of the oven they were crispy on top and absolutely delicious! A total family pleaser...my 4 year old Daughter even ate them and she does not like bread at all. THANKS!!:D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TracyB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2993629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-09T20:54:48.977Z",
                "reviewBody": "Really delicious with a rich taste that makes you think they are full of fat but they're not! I even used fat free buttermilk and did not brush with butter. Instead I beat the unused egg white slightly and brushed it on the rolls before putting in the oven for a beautiful golden brown finish and nice crust. I did the cloverleaf style and they looked great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katquilter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6757/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-17T15:30:52.437Z",
                "reviewBody": "I thought these were awesome! My husband would have rated a 4 because he likes his rolls crunchy on the top and I could have made them that way but following the directions exactly-I loved how dense and soft these were. I used all-purpose since I couldn't find bread flour and I made my buttermilk since I didn't have any on hand and they still came out perfect. So excited to have found an easy and quick roll recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cassy Taylor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3544418/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-28T23:55:17.42Z",
                "reviewBody": "I replaced 1 cup of flour with whole wheat used only one tablespoon of (white) sugar and used a whole egg. This made eight of the best hamburger buns I've ever eaten. Highly recommended!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nelleke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5831013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-08T20:05:26.07Z",
                "reviewBody": "I made this recipe for my family and they loved it! I don't have a bread machine so I made the rolls by hand and they turned out great. We even had some for breakfast the next morning with jam!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "teri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3668389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-09T02:25:14.917Z",
                "reviewBody": "something went wrong for me. I made buttermilk using 1% milk and vinegar as I've done before and as several other reviewers did letting it sit 10 minute before adding anything else. Otherwise I followed the directions - took the dough out of the machine just after it did the \"punch down.\" It was a little stickier than I was expecting but nothing ridiculous. made the balls put them in the greased muffin tin covered with a towel and put in the sunlight for half an hour. They rose a little more but not doubled. Went ahead and baked them ten minutes later - they were thick and a bit hard on the outside.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "alk02g",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2809825/"
                }
            }
        ]
    }
]