[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/139888/easy-indian-style-chicken/",
        "name": "Easy Indian-Style Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5680134.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2020-03-05T05:04:39.000Z",
        "description": "This is an easy and authentic-tasting Indian dish that the entire family will love! Tastes great with plain basmati rice topped with a couple tablespoons of yogurt (especially if you made the chicken spicy!)",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "1 teaspoon cumin seed",
            "1 onion, finely chopped",
            "¼ cup tomato paste",
            "¼ cup water",
            "1 pound skinless, boneless chicken breast halves - cubed",
            "½ (14 ounce) can coconut milk",
            "½ teaspoon brown sugar",
            "½ teaspoon hot chile paste",
            "1 pinch cayenne pepper",
            "¾ teaspoon ground turmeric",
            "salt and pepper to taste",
            "½ cup chopped cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a large skillet over medium heat. Add cumin seeds, and fry for a few minutes until they become fragrant and begin to pop. Stir in chopped onion, and cook until the onion has softened and turned translucent, 3 to 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir together tomato paste and water, and pour into skillet. Stir in chicken, and cook until it has firmed and turned white, about 5 minutes. Add coconut milk, brown sugar, chile paste, cayenne pepper, turmeric, salt, and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring mixture to a simmer, then reduce heat to medium-low, cover, and continue to simmer until the chicken is tender and no longer pink in the center, about 15 minutes. Sprinkle with chopped cilantro before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Ania"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.188118811881188,
            "ratingCount": 101,
            "itemReviewed": "Easy Indian-Style Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "316.4 calories",
            "carbohydrateContent": "11.4 g",
            "cholesterolContent": "58.6 mg",
            "fatContent": "20 g",
            "fiberContent": "2.5 g",
            "proteinContent": "24.6 g",
            "saturatedFatContent": "11.1 g",
            "servingSize": null,
            "sodiumContent": "195.7 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-05-24T16:21:41.167Z",
                "reviewBody": "Hi, I am Indian and cook mostly Indian food for my family. I came on allrecipes looking for something different than what I'm used to. For this recipe, let me say straight off the bat--all Indian/Pakistani curries have garlic and ginger paste. The most common way is to throw it in the beginning when frying onions. Also, if you're old school, use fresh tomatoes (paste cuts down the time, I guess). I've never used coconut milk and tomato paste in the same recipe myself, but that's an interesting combination. For the red pepper--a pinch is not sufficient. It will be too bland, at least 1 tsp. I would add all the spices in the beginning when frying the onions, then put the chicken and THEN the tomatoes. Definitely more spices or this will be too bland (try cumin powder, coriander powder, etc). I hope this helps someone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Aisha Ahmed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7501383/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-11T20:57:56.577Z",
                "reviewBody": "This recipe is the easiest Indian recipe i've seen so far and tastes so good! If you like extra sauce though, I would suggest you use a little more than 1/2 can of lite/regular coconut milk instead. This insures that you will have enough sauce to eat over rice with. Also, I didn't have any cilantro on hand so I didn't use it. I did however, add more tumeric and cumin until it tasted strong enough because I like my Indian dishes very articulate. I served this with basmati rice and naan, so delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2432919/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-16T21:37:22.543Z",
                "reviewBody": "Per others reviews, I doubled the cumin and turmeric. I used tsp. cumin seed and 1 tsp. ground cumin. I didn't have chili paste, so I used 1 tbsp. sriracha sauce instead. Since sriracha already has sugar in it I omitted the brown sugar. It was pretty spicy. I often use coconut cream instead of coconut milk in recipes. About 3 tbsp + 1 c. water = 1 c. coconut milk. It's cheaper this way. I think next time I'll add potatoes. It was very flavorful and would be great with tofu!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3982756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-07T16:22:31.943Z",
                "reviewBody": "This recipe would rate a 5 if the amounts of spices were doubled. I at the suggestion of other reviewers here pretty much doubled the spices used. I also used ground cumin because I was out of cumin seeds and that was fine. I also used hot chili oil instead of chili paste and it mixed well. Because I like savory spicy food I tripled the amount of brown sugar in the mix and it turned out fantastic. Because I was looking to get some vegetables in the mix at the last few minutes of simmering I added some baby spinach leaves. They were great in the mix and didn't detract from the dish. Even my overly picky brother who \"doesn't do hot\" loved this. Serve it with basmati rice and naan and you're set.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alicia_A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/139639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-19T01:29:59.09Z",
                "reviewBody": "This was so good! I have zero complaints about this one. It was incredibly easy and so tasty. The recipe says the chili paste and cayenne pepper are optional but be sure to add it. It gives it great flavor. In my opinion it wasn't spicy at all. I'm not sure what cumin SEED is or if it's the same thing but I just used ground cumin. Very delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimiko Proctor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1892522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-10T23:11:44.543Z",
                "reviewBody": "I was so surprised by how good this is! I didn't expect the flavors to be so intense when I read the ingredients I thought it may be a bit too sweet and I don't like \"sweet meat\" lol. As I was cooking it I thought there wasn't a lot of sauce so I doubled all the sauce ingredients but left the chicken the same. I followed the recipe ingredients exactly EXCEPT I accidentally added A LOT more turmeric because the top fell off while I was adding it! However it tasted really good so I think I will always add more than the recipe calls for say 1.5 tsp for a double sauce batch. I also added one red chile and one green chile but I left them whole. This gives flavor without a lot of heat. I did that instead of the paste along with a small sprinkle of chili powder because I didn't have any paste. Otherwise I followed it as written. It was so good! Will certainly make again and again! Don't be too critical if you're looking for gourmet indian because this isn't it. But it's a fantastically flavored dish that will please a wide variety of people.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Yankee Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2249831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-24T15:35:56.827Z",
                "reviewBody": "This was an easy and yummy different way to make chicken. It's definitely not the full flavored dish that you would get at an indian resturant but a pretty tame at-home version.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sjohutch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1702826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-11T01:46:10.47Z",
                "reviewBody": "This is one WICKED GOOD recipe! A palate pleasing blend of flavors that can be ready to serve in minutes! I doubled the saucy ingredients and served with basmati rice. Mahdzoon (plain yogurt) on the side. My 20-year-old cousin deemed it \"the bomb!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherylann Hope Sharoian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2453013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T21:50:12.553Z",
                "reviewBody": "This is a great start! I added a can of mixed veggies and really upped the spice via garlic powder and curry powder. Also to trim some fat I didn't use the coconut milk (gasp) instead subbing plain Lowfat greek yogurt and added a dallop of sour cream when served. Delicious! Thanks for sharing! We will use this again often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna Brue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mommycookstoo/"
                }
            }
        ]
    }
]