[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/364/desserts/frozen-desserts/",
                    "name": "Frozen Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1556/desserts/frozen-desserts/ice-cream/",
                    "name": "Ice Cream",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16195/desserts/frozen-desserts/ice-cream/vanilla-ice-cream/",
                    "name": "Vanilla Ice Cream Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/140588/honey-vanilla-ice-cream/",
        "name": "Honey Vanilla Ice Cream",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F679231.jpg",
            "width": 1500,
            "height": 1125
        },
        "datePublished": "2020-03-05T05:04:41.000Z",
        "description": "This is the best homemade vanilla ice cream I've ever had.  The honey and brown sugar give it a rich, buttery taste that can't be beat.",
        "prepTime": "P0DT4H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT4H30M",
        "recipeYield": "1.5 quarts",
        "recipeIngredient": [
            "2 cups milk",
            "1 (7 inch) vanilla bean, split lengthwise",
            "6 egg yolks",
            "1 cup packed brown sugar",
            "3 tablespoons honey",
            "¼ teaspoon salt",
            "2 cups heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium pan, heat the milk and vanilla bean to simmering. Do not boil. In a mixing bowl, whisk together the egg yolks, brown sugar, honey, and salt until light colored and frothy. While whisking constantly, slowly combine the hot milk with the egg mixture. Transfer the mixture back to the sauce pan. Cook over medium heat until mixture reaches 180 degrees Fahrenheit (82 degrees Celsius) when tested with a candy thermometer, or becomes thick enough to coat the back of a metal spoon. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the vanilla bean from the mixture and reserve. Strain custard into a large bowl. Scrape seeds from the vanilla bean into the custard. (Vanilla bean pod may be used again.) Stir the heavy cream into the custard. Cover the surface of the custard with plastic wrap and refrigerate for 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When cold, freeze in an ice cream maker according to the manufacturer's directions.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frozen Dessert Recipes",
            "Ice Cream",
            "Vanilla Ice Cream Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "M. McCarthy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5966386554621845,
            "ratingCount": 119,
            "itemReviewed": "Honey Vanilla Ice Cream",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "277.3 calories",
            "carbohydrateContent": "27.7 g",
            "cholesterolContent": "160 mg",
            "fatContent": "17.7 g",
            "fiberContent": null,
            "proteinContent": "3.5 g",
            "saturatedFatContent": "10.4 g",
            "servingSize": null,
            "sodiumContent": "89.5 mg",
            "sugarContent": "26.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-23T19:46:29.847Z",
                "reviewBody": "This is a creamy, smooth, rich and not too sweet custard-style vanilla ice cream with a delicate, but perfect hint of honey and brown sugar (I have to disagree with those who compared this to Butter Pecan ice cream--this is an entirely different flavor, the only similarity being the brown sugar used in both.)  This is an unusual and creative twist on vanilla ice cream that really works. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-03T23:30:49.647Z",
                "reviewBody": "I thought this recipe was excellent.  I made just a few changes, which was to cut back on the cream by one cup and replace it with whole milk (cut back on some of the fat.) Just before adding everything to the ice cream maker \nI whipped it with an electric mixer to \"fluff\" it up. I also cut back on the sugar by a little more than 1/4 cup but increased the honey by 2-3 tablespoons (I love honey.) The result was a very creamy - and honey tasting - ice cream.  Topped with some granola it made a great treat.  I will make this one again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2612497/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-04T22:26:00.417Z",
                "reviewBody": "Loved this recipe!  A few families got together and had our version of \"Iron Chef\" this past Memorial Day.  Ice cream was determined to the what the contest would be based on.  I saw this recipe and decided that I would use it because I decided that the less complex the recipe the better.  Needless to say,  I  won the contest by the votes of multitudes of people at the celebration.  I doubled the recipe to fit my ice cream maker.  It had a very rich vanilla flavor and the combination of honey and brown sugar added a deeper dimension of sweetness to it.  Almost caramel-like.  It had a really smooth creamy texture that was unlike any of the other contestants.  It was almost fluffy.  Thank you for the recipe.  I will be using it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey Hermes Irby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2162098/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-06T21:27:32.403Z",
                "reviewBody": "I have tried many ice cream recipes with no luck, but this one is AWESOME!!!!  I made it for a dinner party this past weekend and it got RAVE reviews!! They were all lovin' the flavor the honey added and it was so thick and creamy.  To top it all off, this recipe is just the righ amount to fit into my Cuisinart ice cream maker so it was perfect!  I will make again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kayla Paulsen Neal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2416385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T17:37:06.53Z",
                "reviewBody": "This is a fantastic recipe! I'd never made ice cream before and recently bought a KitchenAid ice cream maker attachment for my stand mixer. This recipe looked better than the one in the KitchenAid booklet so I decided to try it. It turned out very rich sweet and buttery tasting and reminded me somewhat of butter pecan flavor. I didn't have a thermometer to measure the temperature while cooking and wasn't sure how \"thick\" the egg/milk mixture was supposed to get. I cooked the mixture about 10-15 minutes and it became quite frothy on the top so I thought it must be done at that point. It wasn't what I would call \"thick\" but it did seem like the texture was slightly different than when it started. I tried another Honey Vanilla recipe since making this one and it didn't have sugar but a lot more honey (3/4 cup). It didn't turn out as tasty as this recipe so I imagine this one is hard to beat! The only downside is how fattening it is....which I wouldn't worry about when making for a party/other guests but for just us at home will have to make lower fat gelato & sorbet recipes so we don't balloon up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AJB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2372080/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T22:52:50.117Z",
                "reviewBody": "Great taste and consistancy but way too sweet! Would reduce the brown sugar by half next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hot Chilli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/678930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-09T15:53:35.21Z",
                "reviewBody": "I wanted something different from the traditional vanilla ice cream and this fit the bill perfectly! I wasn't sure what to expect. But what I got was an ice cream turned out so creamy and delicious with a subtle honey taste while you indulge but the honey taste really kicks in afterwards. What a wonderful way to enjoy each bite of your ice cream! I knew this ice cream would turn out creamy when it said to strain the custard. This technique is usually used in a gelato recipe that I absolutely love! Always turns out smooth and extra creamy! I used vanilla extract since I didn't have vanilla beans on hand and there was a very small \"bite\" of \"too much sweetness\" in the ice cream but nothing too noticeable. I think reducing the sugar just a smidgen would work fine. Otherwise if you want an alternative to plain vanilla...This Is It!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxanne J.R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-16T21:57:25.323Z",
                "reviewBody": "Oh my freakin' WORD!!! This will have to be kept under lock and key to keep me from making myself sick gobbling it all up before the holiday. I made it today to have for serving on top of Thanksgiving pies and it's so unbelievably delicious that it's a major temptation. The marriage of honey and vanilla is sheer genius! The honey is just barely discernible but it complements the vanilla flavor to perfection. I didn't have any whole milk so I substituted fat-free half and half. No matter. The texture is wonderful the flavor sublime. It melts in a silken ribbon on the tongue leaving a delightful taste on the palate that makes you crave another spoonful. I cut back on the brown sugar by 25% after reading several reviews that noted excessive sweetness. After tasting the solution it was just a bit short of sweetness so I simply added about 2 Tb Splenda to make it just right. Awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-05T05:51:25.033Z",
                "reviewBody": "Delicious! Perfect on its own but I added toasted coconut and broken pecan granola bars...excellent. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-29T20:33:41.153Z",
                "reviewBody": "Turned out a little too eggy tasting for me. Great texture just didn't enjoy the flavor as much as I thought I would and no one else liked it",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "acissejrae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7671579/"
                }
            }
        ]
    }
]