[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1031/main-dish/sandwiches/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/143375/ting-town-barbeque-beef-sandwich/",
        "name": "Ting-Town Barbeque Beef Sandwich",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F286607.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T05:04:51.000Z",
        "description": "This recipe is adapted from a famous local favorite served at Ting-Town, a drive-in closed since 1970, in the Iron Range or Arrowhead region of northeastern Minnesota. Serving the beef on hamburger buns makes the dish extra authentic.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT7H20M",
        "totalTime": "P0DT7H40M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "3 stalks celery, sliced thin",
            "1 large onion, coarsely chopped",
            "4 cloves garlic, minced",
            "1 cup ketchup",
            "1 cup barbeque sauce",
            "1 tablespoon prepared yellow mustard",
            "1 cup beer",
            "2 tablespoons cider vinegar",
            "2 tablespoons Worcestershire sauce",
            "2 tablespoons brown sugar, packed",
            "1 teaspoon chili powder",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "4 pounds boneless beef chuck roast, trimmed of fat",
            "16 hamburger buns, split"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make the sauce, combine the celery, onion, garlic, ketchup, barbeque sauce, mustard, beer, cider vinegar, Worcestershire sauce, brown sugar, chili powder, salt, and pepper in a bowl; stir until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the chuck roast in a slow cooker. Pour the sauce evenly over the meat. Cover and cook the roast on HIGH for 3 hours. Reduce heat to LOW, and continue cooking until very tender, about 4 hours more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "About 1/2 hour before serving, remove the chuck roast from the slow cooker and shred the meat with a large fork. Return the meat to the slow cooker, and cook uncovered so the sauce thickens, on LOW for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, dip the flat sides of hamburger buns into the sauce and top with meat.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Xoloitzcuintli"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4523809523809526,
            "ratingCount": 42,
            "itemReviewed": "Ting-Town Barbeque Beef Sandwich",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "355 calories",
            "carbohydrateContent": "35.3 g",
            "cholesterolContent": "51.6 mg",
            "fatContent": "15.1 g",
            "fiberContent": "1.7 g",
            "proteinContent": "17.5 g",
            "saturatedFatContent": "5.6 g",
            "servingSize": null,
            "sodiumContent": "801 mg",
            "sugarContent": "9.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-22T18:40:41.547Z",
                "reviewBody": "This recipe is wonderful. My son has a hickory grilled steak house restaurant and when I tried this recipe (with his restaurant in mind) I was so impressed that I took the finished product to the restaurant for a taste test. He and all the servers and cooks tried it and loved it. They plan to put it on the menu. The time consuming part is measuring all the ingredients for the sauce but it is worth it!! Love this site and love love love the recipe conversion program on each recipe that allows me to change the number of servings. Thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bensmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2429058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-23T17:16:53.107Z",
                "reviewBody": "I admit it makes no sense at all, but it was mostly nostalgia that drew me to this recipe. Coming from the Iron Range of Northern Minnesota myself, it somehow felt like \"home.\" But it takes more than sentimentality to make a great recipe and this one missed the mark for us.  With all the ingredients involved I anticipated something indescribably fantastic, but in the end it was just predominantly sweet and all but masked the rich, beefy flavor you'd want and expect - edible, but not a repeat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-08T03:30:46.527Z",
                "reviewBody": "Exactly what I was looking for. We loved this recipe. I also used 1 cup of beef broth instead of beer. I noticed about 2 hours before it was done that the sauce was thin so I took the lid off of the crock pot for the last 2 hours to thicken it up. Just keep your eye on it. I think if I didn't notice until the last 30 minutes that the sauce was too thin I wouldn't have had enough time to thicken it up before I served it. This recipe is so flavorful we are still loving the leftovers! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Krysdyer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/355850/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-24T05:13:54.31Z",
                "reviewBody": "This makes a lot of beef barbeque. Mom never made it but up North we used to have it every now and then for school lunch. I live in the South now where pork barbeque is king and chicken barbeque comes in second and beef barbeque is rare. But I had a chuck roast I wanted to do something different with so I thought I d cook some up. Southern hubby gobbled it up. It was great as sandwiches on hamburger rolls. I made this just as written (including open crock sauce thickening and dipping the bun tops) except left out the celery since I had none. I did add 1 tsp. celery seed for a touch of the celery flavor though. I used a good Sweet Baby Ray s BBQ sauce. I only had a 3 lb. roast but even so the recipe makes a lot of sauce even if it had been the 4 lb. one specified. Tasty and hearty beef barbeque all around. Not too sweet not too spicy. I thought just about right for the beef. I might tweak it with a little liquid smoke next time. Not hard to make at all. Don t let the long list of ingredients intimidate you. All are pretty common things you probably have on hand. It really only took me a few minutes to measure out all the stuff in the sauce and you only have to chunk / chop up one onion. I served this with my favorite Taste of Home s Creamy Coleslaw (from this site) that I whipped up in no time. This is a good meal for a day when the family is on the run. Leave the slow cooker on warm set the package of hamburger buns out on the counter and let everyone serve them",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUSTCYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/36207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-24T16:30:29.147Z",
                "reviewBody": "Although there are a lot of ingredients to this recipe and it takes a little extra time getting them all together the flavor is amazing! You will not be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNIENC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/940759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-22T20:43:46.833Z",
                "reviewBody": "Mmm -- we liked this a lot. Never having had the original we can't speak to whether it is or isn't but as written (with one tiny addition) it was great Super Bowl food. And made a ton of leftovers! The one tiny addition: while the meat is out of the cooker for shredding defat and run the immersion blender through the liquid. I chose to do it this way because while I like the flavor of the celery I don't like actually eating the celery. I learned that trick a long time ago. Hides the veggies so I don't notice that they're there! It also hides the cooked onions from the kid who won't eat those. Our BBQ sauce choice: Sweet Baby Ray's. We will definitely be having this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/608223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-28T22:58:24.65Z",
                "reviewBody": "Best barbeque ever in my book! The only thing I changed was using steak sauce instead of Worchestershire just because it's what I had. I let it cook all day on low in the crock then put it on the stovetop for about 45 min on medium-low to thicken the sauce. \"Dipping\" the buns is a great tip too. Would make a great 'stuffed' baked potato IF there were any leftovers! Sending this recipe to my whole family thanks so much for sharing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elisa Griscom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/75290/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-28T19:01:55.73Z",
                "reviewBody": "We have this every year for my son's birthday party. Feeds lots of people and everyone loves it! One hint - the longer you can cook the meat the easier it is to shred. I start it the night before to make sure it is REALLY done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katiemomto3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2488530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-16T20:07:01.68Z",
                "reviewBody": "YUMMY!!! I seasoned and seared the meat in a hot pan with a few splashes of olive oil before placing it in the crockpot. I then followed the recipe pretty much exactly; the only change I made was to double up on the chili powder and add a little bit of tabasco sauce. Also when the meat was done I removed it to shred it and poured the sauce into a stove top pan. Brought it to a rolling boil and used a couple of Tbsp. of cornstarch to thicken it some. Then I put the shredded beef back in the crockpot and added the sauce to it. ABSOLUTELY DELICIOUS! This would work equally as good with pork or chicken too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee Ridgeway",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684980/"
                }
            }
        ]
    }
]