[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/145549/in-a-pinch-ketchup/",
        "name": "In-a-Pinch Ketchup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F214034.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T05:05:00.000Z",
        "description": "I made this one night when I ran out of ketchup and was making a meatloaf.  I kept adding and writing it down, and Voila! I had a homemade ketchup with simple ingredients and went well with just about anything.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "1 1/2 cups",
        "recipeIngredient": [
            "1 (6 ounce) can tomato paste",
            "2 tablespoons white vinegar",
            "5 tablespoons brown sugar",
            "1 teaspoon garlic powder",
            "1 teaspoon onion powder",
            "¼ teaspoon allspice",
            "1 teaspoon salt",
            "1 teaspoon molasses",
            "1 tablespoon corn syrup",
            "1 ¼ cups water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix together the tomato paste, white vinegar, brown sugar, garlic powder, onion powder, allspice, salt, molasses, corn syrup, and water in a saucepan over low heat; simmer gently until you get the consistency of ketchup, 45 minutes to 1 hour. Taste and adjust salt if necessary before serving.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "outnumbered"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.423423423423423,
            "ratingCount": 111,
            "itemReviewed": "In-a-Pinch Ketchup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "41 calories",
            "carbohydrateContent": "10.3 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.6 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "308.2 mg",
            "sugarContent": "8.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-30T17:45:09.437Z",
                "reviewBody": "Below is my original review, but I want to add that with a bit of experimentation (my goal was not to use this in a pinch, but to eliminate the need for store bought) I have decided that it is much better with these adjustments:  pinch allspice (I used ~1/8tsp in a double batch), only 1 tb brown sugar, and 2tsp molasses.  Tastes much more like ketchup, and less like a sweet tomato based dipping sauce.\n_______________________________________\nFANTASTIC alternative to store bought ketchups!  The add in/customization possibilities are endless as well.  I think store bought ketchup is nasty, but I WILL use this.  I did find this recipe a bit too sweet, but that's no skin off my back.  I'll just use it to make BBQ sauce, and make another batch with only 3 tb of brown sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAZBERISWRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699247/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-29T23:58:47.887Z",
                "reviewBody": "I've been developing a BBQ sauce that meets all my needs and I finally nailed the formula, which starts with a ketchup base. But I think store bought ketchup is disgusting and wanted something homemade. This was PERFECT! It was the perfect base so all I had to do was add my secret ingredients. It made my sauce taste even better than it already did. I'm going to use this as a regular ketchup as well. A little tip; Instead of letting it cook for just an hour I put it in my small crockpot and let it sit on low all day. YUM! Thank you for this GREAT recipe! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/472898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T15:44:43.58Z",
                "reviewBody": "This ketchup tastes a lot like the Whataburger ketchup... which is my favorite.  It is sweet and tangy and has a brighter flavor than those on the store shelves.  Because I didn't have tomato paste, I substituted a can of tomato sauce and omitted the water.  It turned out great!  This ketchup also cans well.  I have made up a large batch and jarred it using my canner.  I open a jar when needed and refill the ketchup bottle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AndiSue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2406423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-23T18:50:52.467Z",
                "reviewBody": "After making burgers I realized I lacked the ketchup, and really didn't want to run down to the store to get a can.  So, although my family was skeptical, I went to AR to find a recipe.  Let me tell you something: I'm never going to buy ketchup ever again.  This recipe is fantastic.  I didn't even follow it exactly and it turned out fantastic!  I didn't have tomato paste so I used a 4-oz can of tomato sauce, and omitted the water; also I had no onion powder or syrup, so I didn't use them.  I really wanted to eat right away so I skipped the simmering part, although that made it more liquid than regular ketchup it tasted perfect anyway.  My family was stunned.  Thank you so, so much for saving the day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tibbadee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2453375/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T17:14:32.48Z",
                "reviewBody": "Pretty good, but will be better with some adjustments next time. Didn't use corn syrup & very glad I didn't. It's too sweet as it is. I'll cut down the brown sugar next time. But, will probably make it again as I like knowing exactly what's in my condiments. :D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2150557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-18T22:19:32.78Z",
                "reviewBody": "Fantastic!  I was making fish and chips, but I can't stand mayo/tartar/malt vinegar, etc.  I'm a ketchup girl.  No ketchup in the house, so I figured I'd try to create my own using this recipe.  No corn syrup, and added a few dashes of Worcestire sauce and it was amazing!  I ate it with my fish, and will be using it for tomorrow's game day sliders!!!  Update:  added a splash of liquid smoke... amazing!  You'll want to eat it with a spoon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLS1220",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/558112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-24T21:14:30.007Z",
                "reviewBody": "I like this recipe a lot better then store bought ketchup..store bought has too strong of a vinegar taste for me...and this was perfect..I did not have molasess so I left that out. I also use honey in place of corn syrup all of the time..It still turned out wonderful for me..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1600009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-26T22:54:27.523Z",
                "reviewBody": "I subbed the corn syrup w/ honey, as that's what I was trying to avoid, and I don't have any allspice.  But the rest of the recipe I followed as is, and it was good!  Definitely cheaper and better than the store-bought stuff I'll never be buying again.  Next time I will cut the brown sugar amount in half, though, use less salt, and only use 3/4 cup of water (adding the extra 1/2 cup just increases the cooking time, because you reduce it right back out.)  Thanks for an easy, easily customizable recipe!  EDIT: made again with allspice as indicated, and IT'S WAY BETTER. Don't skip it if you don't have to.  Cut the brown sugar to 1 tbsp second time (we all thought it was way too sweet), which I liked better also.  That's just preference though.  Using only 3/4 cup water, I only had to simmer for 5ish minutes. Score!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "moxie & mirth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3148162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-22T18:58:23.22Z",
                "reviewBody": "Exactly what I needed to make a base for my homemade low-sugar BBQ sauce for Cajun Meatballs. I was trying to wrap my head around how I could use a sugar substitute in place of the brown sugar and corn syrup when it hit me.....\"Zero\" cola. Instead of water, I used the zero cola and it gave the sweetness it needed without adding sugar or corn syrup. (I'm trying to lose weight and eat better without added sugar or preservatives.) I only used a dash of salt and it was just what I needed. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-16T18:18:10.627Z",
                "reviewBody": "This doesn't seem like it is in a pinch. It has quite a few ingredients to measure and, it has to simmer for about 1 hour! And, I have never tasted ketchup this SPICY before. Unless, this is what homemade ketchup tastes like? I am going to freeze and save it to use with sloppy joes, baked peppers, or another recipe. I don't think I would like ketchup this spicy with fries. I was looking for something sweeter. I wish I would have tasted it before adding the allspice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            }
        ]
    }
]