[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/162438/poor-mans-mock-lobster/",
        "name": "Poor Man's Mock Lobster",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F225732.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T05:05:45.000Z",
        "description": "Try this recipe for chicken that is marinated and grilled, dipped in butter and tastes amazingly like lobster. My Dad actually got this recipe from a friend of his, and it's too wonderful to keep it a secret! Serve with clarified butter for dipping.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT3H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ cup soy sauce",
            "¼ cup vegetable oil",
            "1 teaspoon garlic salt",
            "¼ teaspoon black pepper",
            "1 tablespoon packed brown sugar",
            "1 teaspoon dry mustard powder",
            "2 teaspoons ground ginger",
            "½ cup pineapple juice",
            "6 skinless, boneless chicken breast halves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a saucepan, combine the soy sauce, oil, garlic salt, pepper, brown sugar, mustard powder, ginger and pineapple juice. Bring to a boil, stirring to dissolve the sugar. Boil for about 5 minutes, then remove from the heat and allow to cool completely. When cooled, place the chicken into a large resealable bag and pour the marinade over it. Press out as much air as you can, seal and refrigerate for at least 2 hours to marinate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat a grill for medium-low heat. When hot, lightly oil the grate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the chicken on the grill and discard the marinade. Cook until chicken juices run clear, 20 to 25 minutes. Turn as needed to keep the chicken from burning.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Joyful_Mamma"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.419847328244275,
            "ratingCount": 131,
            "itemReviewed": "Poor Man's Mock Lobster",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "247.1 calories",
            "carbohydrateContent": "7.2 g",
            "cholesterolContent": "67.1 mg",
            "fatContent": "12.2 g",
            "fiberContent": "0.3 g",
            "proteinContent": "26.2 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "1564.3 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-16T12:45:11.437Z",
                "reviewBody": "This recipe was excellent! I think it is unrealistic to expect it to taste \"just like\" lobster. Of course it doesn't. But it IS a similar taste and the texture is good too. It was tender and delicious. IF your favorite way to eat lobster is diped in melted butter and IF it is a treat that you simply can't afford very often I think you will thoroughly enjoy this recipe as a substitute. With boneless chicken breasts on sale so often this is absolutely a perfect way to serve them. We cooked them on a grill and just until done which was about 20 minutes as the recipe said turning them often. I think the smokey flavor helped. We marinated the chicken only about two hours-- next time I might marinate over night. EVEN if you just think this tastes like chicken it is EXCELLENT chicken. I would absolutely recommend it and absolutely recommend savoring each bite dripping with melted butter. YUM. Thanks to the person who posted this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bkeels",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2857886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-18T11:20:56.55Z",
                "reviewBody": "We loved this chicken! It didn't REALLY taste like lobster but the marinade was excellent the chicken juicy and I liked the butter dipping idea. I did bake mine for 30 minutes at 350. Husband suggests next time a little Old Bay seasoning for more of the seafood taste. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2350004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-03T22:15:12.147Z",
                "reviewBody": "Oh my! Absolutely loved it! I prepared this yesterday for my family..hubby and grown sons..and got rave reviews from them all. I followed the recipe exactly as written and wouldn't change a thing. The only thing I did that wasn't stipulated in the recipe was give the chicken breasts a bit of a pounding to further tenderize before marinating but not enough to flatten. The descriptive words that were passed around the table were: MMMMM Delicious Soooo tender & juicy WOW thats fantastic don't lose that recipe. I discovered that a tin of pineapple tidbits has just the required 1/2 cup of pineapple juice in it (so I didn't have to go out to buy the juice) and I used the pineapple tidbits in a dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bevvy38",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3562662/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-10T10:12:13.117Z",
                "reviewBody": "You have GOT to try this!!! The chicken is excellant - it sounds weird to did it into butter but wow is it good! I will be making this several times. I did marinate for 24 hours so the flavor really carried all the way through. This is a don't miss! I am not getting into if it tastes like lobster - who cares - it tastes great and that is all my family cares about! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "funfastfish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2173465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-25T03:02:52.563Z",
                "reviewBody": "My man fell in love with me all over again. I only had boneless skinless thighs but they soak up the marinade just fine. I've never cooked a marinade before but I'm thinking this will be the new standard recipe I use. Takes more time but worth it...and the butter was a wonderful (if sinful) touch. Works great on kebabs too! UPDATE: just want to say that I use this recipe all the time and it always turns out scrumptious. Tonight it was blsl thighs and bone in drumsticks. DBF asked if I had put bacon in the marinade:D heehee! I did make one sub this time; used the juice from a jar of Dole tropical fruit in juice instead of straight up pineapple juice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ONIOND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1013798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-30T23:16:48.447Z",
                "reviewBody": "I thought this chicken was excellent! It does have a similar taste and texture to lobster when dipped in butter. I made this last week and am making it again tonight because even my picky husband liked it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristyR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/647042/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-21T17:19:05.493Z",
                "reviewBody": "I've been using this marinade all winter. I actually thought I'd already rated it. Depending on how much chicken I am preparing depends on how much oil I add to the marinade. Overall I'm sure I use less. I used garlic powder and added no more salt to the recipe than is in the soy sauce. This is an EXCELLENT recipe. I've broiled it and am looking forward to grilling it this summer. When I take BLSL breasts out of the freezer I add the marinade to the frozen breasts and let it thaw in the marinade. Very tasty! The melted butter dip contributes to the \"illusion\" of lobster and is very good. But not necessary to enjoy this dish. Bon apetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LadySparkle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ladysparkle/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-04T23:39:02.97Z",
                "reviewBody": "This was FABULOUS!  Now, as far as it tasting like lobster...it tasted like lobster kind of like grilled portabellas taste like steak...every now and again you get a bite where you can *see* it, but otherwise, not so much.  However, that doesn't mean it doesn't taste GREAT!  My only *complaint* is it was a bit salty (which is so weird for ME to say...Mr. LTH looked at me like I was nuts when I said that out loud)!; I think next time (yes, there WILL be a next time) I will use reduced sodium soy sauce.  THANKS for a great recipe!  Oh, I cooked the marinade in the morning & put the chicken in the frig to marinate all day (about 12 hours).  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T20:03:07.443Z",
                "reviewBody": "My family literally requests this recipe weekly; it's that good. Here's a sauce they prefer to the dipping butter (although it's more caloric): add 1/2 stick butter to 2 T. mayo and 5 T. cream cheese. Add 1 t. cayenne pepper 2 T. chilli powder and 2 T. grated parmesean cheese. Microwave until softened.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "fortuitous",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4562197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-21T15:46:00.633Z",
                "reviewBody": "It was ok nothing special. The marinade was good but not great. I wasn't expecting it to really taste like lobster so there was no surprise there when it didn't.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ambibambi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2759786/"
                }
            }
        ]
    }
]