[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/162501/quinoa-porridge/",
        "name": "Quinoa Porridge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4463194.jpg",
            "width": 4128,
            "height": 2322
        },
        "datePublished": "2020-03-05T05:05:45.000Z",
        "description": "Looking for ideas for the quinoa you picked up at Trader Joe's?  Here's a dairy and wheat free breakfast porridge thick, rich and delish for those cold mornings in the Andes.  Those with nut allergies may wish to substitute soymilk or regular cow's milk for the almond.  Adjust sugar to your taste or substitute with agave syrup or black strap molasses (use half as much). This recipe can easily be doubled.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "3 servings",
        "recipeIngredient": [
            "½ cup quinoa",
            "¼ teaspoon ground cinnamon",
            "1 ½ cups almond milk",
            "½ cup water",
            "2 tablespoons brown sugar",
            "1 teaspoon vanilla extract",
            "1 pinch salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat a saucepan over medium heat and measure in the quinoa. Season with cinnamon and cook until toasted, stirring frequently, about 3 minutes. Pour in the almond milk, water and vanilla and stir in the brown sugar and salt. Bring to a boil, then cook over low heat until the porridge is thick and grains are tender, about 25 minutes. Add more water if needed if the liquid has dried up before it finishes cooking. Stir occasionally, especially at the end, to prevent burning.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Six Pack To Go"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.211764705882353,
            "ratingCount": 85,
            "itemReviewed": "Quinoa Porridge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "173 calories",
            "carbohydrateContent": "31.3 g",
            "cholesterolContent": null,
            "fatContent": "3 g",
            "fiberContent": "3 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "89.7 mg",
            "sugarContent": "12.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-10T20:38:20.133Z",
                "reviewBody": "This is a great way to get protein in the morning because it's disguised as carbs!  I noticed that some people had trouble with this recipe and I think it helps immensely to COVER the saucepan.  I always put a lid on when I'm cooking quinoa, so that's what I did with this recipe.  The quinoa was done after about 20 minutes, I then uncovered it and let the extra liquid cook off until I had my desired consistency.  Came out perfect!  I recently switched to (unsweetened) almond milk so I was excited to see a recipe that called for it.  Loved the cinnamon and vanilla.  I added some raisins and craisins and sprinkled some extra brown sugar on top.  Yum!  ****Update:  I now make this with only 1 cup of milk and no water.  Cover and simmer, and it only takes about 10-15 min. to cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-01T14:09:42.99Z",
                "reviewBody": "This is SOOOOO good! For health reasons I have to eat tons of protien every day and I get sick of stuffing my face with meat all day. This was a very refreshing breakfast very tasty and different! It's in the 80s here already but this winter this will be a staple! Next time I'll use less liquid I like my porridge thick enough to stand a spoon up in it. I added chopped walnuts and dried fruit and a little extra cinnamon. Excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MomZilla (Evin)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2701003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-21T18:04:15.043Z",
                "reviewBody": "This recipe has way too much liquid, maybe that's why several people thought theirs wasn't cooked in the time specified. If you're expecting this recipe to soak up all the liquid like oatmeal does, you'll be disappointed.  The quinoa I bought (Costco) is pre-rinsed, and the cooking instructions on it are to use 1 part quinoa to 2 parts liquid, brown it in butter or oil, then add liquid, bring to boil, reduce heat and simmer for 15 min. I have substituted several different liquids, and it always turns out perfect and fluffy like rice.  So, I still gave this 3 stars, because after I altered the liquid amounts to 1/2 c water and 1/2 c almond milk, it did turn out quite nice. I like it with chopped almonds and dried cranberries mixed in at the end for breakfast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LUV2COOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1807918/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-07T16:11:29.073Z",
                "reviewBody": "I made this for my family as I'm a big \"You are what you eat\" fan and this is one of the ingredients suggested by Gillian. I was surprised that such a healthy ingredient tasted good. I won't be a fan of quinoa over night but this definitely opened my mind to using quinoa in some other recipes. When I followed the direction I found that the quinoa was still a bit crunchy after it was prepared. I don't know if this is common or not but the next time I make it I think I will cook it a bit longer. Also if you are feeding other people with this recipe it comes out closer to two and a half (very filling) servings. I would suggest that you make this in conjunction with blueberry muffins as the combination of flavors was delicious. Thanks for submitting the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sai",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2972548/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-31T21:57:52.733Z",
                "reviewBody": "this was really really good. it had the perfect amount of sweetness. it had a tiny bit of a crunch but it wasnt really crunchy like it sounded like everyone else's was. i cooked it longer than 25 minutes only because i wanted it to be thicker. i cooked it at a very low simmer for 25 minutes and the texture was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2503235/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T19:50:17.147Z",
                "reviewBody": "I LOVE this recipe. It's a great way to start the day. I am an oatmeal fan and find this cereal to be lighter than oatmeal yet just as filling. I add cinnamon nutmeg craisens and vanilla and cook it in soy milk. Once cooked I add a scoop of ground flaxseed. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "blkbtrfly01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3693426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T23:43:08.263Z",
                "reviewBody": "This was really good and an interesting new way to use quinoa but some changes were needed in the cooking method. I did not add the water and just used 1.5 cups soy milk since that seemed like way too much liquid from my previous experiences with quinoa (figured I could add the water later if it was needed- it wasn't). I also covered the pan while it was simmering to help with water absorption. After the quinoa was cooked through I took off the lid and simmered until it reached the consistency I wanted. I topped with a bit more brown sugar and some walnuts. This made a delicious breakfast for two (it was not three servings for us) and I think we both could have eaten a bit more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "stephanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3701650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-30T17:09:32.5Z",
                "reviewBody": "This was good but not out of this world. I used regular milk as I only had that and decreased it to about 1/2 c as others suggested. It didn't need the full 25 min but it probably took about 20. I omited the salt as well. This only made 2 portions and that is coming from a light eater. I will make it again but I think I want to play around with it to make it REALLY good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MK!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mk/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T19:10:40.67Z",
                "reviewBody": "This was great! What a great change for breakfast! Made exactly as stated except for I added a tad less water. Thanks! Excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FASTCOOKIN44",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1460032/"
                }
            }
        ]
    }
]