[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/166820/cilantro-chili-pepper-sauce/",
        "name": "Cilantro-Chili Pepper Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4527954.jpg",
            "width": 3002,
            "height": 3002
        },
        "datePublished": "2020-03-05T05:05:54.000Z",
        "description": "I am overrun with wild cilantro in my back yard.  Literally, it feeds my compost bin more than my family even though we use it in everything.  This sauce (perhaps more of a pesto) is fabulous on anything but the obvious choices are chicken and tuna.  Enjoy.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "1 cup",
        "recipeIngredient": [
            "3 fresh red chile peppers",
            "1 tablespoon sesame oil",
            "3 cloves garlic, minced",
            "1 pinch kosher salt",
            "½ cup malt vinegar",
            "2 tablespoons fish sauce",
            "2 tablespoons brown sugar",
            "3 tablespoons soy sauce",
            "1 teaspoon lime juice",
            "1 bunch cilantro, chopped",
            "1 green onion, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the stem end off of the chile peppers, and remove the seeds using a thin knife, otherwise leaving the peppers whole. Place the peppers into a skillet, and toast over medium-high heat, turning frequently, until the skins of the peppers have blackened and loosened, about 10 minutes. The peppers are ready when 1/4 of the skin has blackened. Remove the peppers, place into a small bowl, and cover with plastic wrap. Allow to cool and steam for about 15 minutes, then remove and discard the skins. Chop the peppers, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the sesame oil in the skillet over medium heat. Stir in the garlic, and cook for 2 minutes to soften, then increase heat to medium-high, and stir in the chopped peppers and salt. Cook and stir until the mixture is hot and sizzling, about 1 minute. Pour in the vinegar, brown sugar, and fish sauce. Bring to a boil, then reduce heat to medium-low, and allow to simmer for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scrape the mixture into a blender, and add the soy sauce, lime juice, cilantro, and green onion. Puree until smooth. Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jeff"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.666666666666667,
            "ratingCount": 9,
            "itemReviewed": "Cilantro-Chili Pepper Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "48.9 calories",
            "carbohydrateContent": "7.7 g",
            "cholesterolContent": null,
            "fatContent": "1.8 g",
            "fiberContent": "0.6 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "672.8 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-16T16:00:29.783Z",
                "reviewBody": "Hey, I submitted this recipe - what am I supposed to rate it?\n\nBut seriously, a couple notes from the guy who submitted this.  First, I happened to have made this last night and forgot the soy sauce until just before serving.  I have to say I liked it better WITHOUT it.  Something about the soy sauce took over some of the other flavors - particularly the sweetness.  I might recommend tasting before adding the soy sauce and if you like it, stop there.  \n\nSecondly, if you cook with it - for example stir fry some chicken chunks with this sauce - the sweetness mysteriously goes away.  Better to add the sauce to already cooked food.  Despite the \"use immediately\" note, you can make this first and warm up quickly in the microwave just before plating - do it in as many 10 second runs as needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2526280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-19T02:42:38.84Z",
                "reviewBody": "Wow this was impressive. I actaully didnt make this recipe but my hubby did. I served this on top of pan-fried snapper and it complemented it very well. I didnt add the soy sauce like suggested. Thanks I'll (or my husband) be making this often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2359108/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-08T17:03:15.657Z",
                "reviewBody": "Jeff you're right It's better without the soy sauce... grin. You're recipe is so similar to what I make several times a week as a dipping sauce for sticky rice that I saved it in my recipe box. Now my DH can make the sauce if I'm not able. I don't measure. Therefore my recipe isn't really a \"recipe\" LOL. You have done our family a great service... Thank you! P.S. - a teeny bit of shredded kaffir lime leaf adds a unique spark... you know... just for a little change-up now and then.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "StirringThePot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2740509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T22:20:54.637Z",
                "reviewBody": "I couldn't find any spicy red chilies. I substituted sweet red chilies so it would keep that dark red color. I added crushed red pepper flakes reestablish the spicy kick that I had lost by using sweet chilies. It worked well. It was amazing served over grilled salmon. Guests raved.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jnshenk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2819187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-23T23:06:17.603Z",
                "reviewBody": "Good recipe. Jeff I read your profile and if you're anything like me you're probably checking up on your published recipe every day or so to see if anyone left a comment. Well here it is! I love the sauce--chicken was my choice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPEARL20",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1218005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-07T04:10:33.147Z",
                "reviewBody": "I love this recipe! I am from New Mexico and had a ristra of dried red chilies I needed to use and thought how can I make my red sauce a little different then normal. Here's what I did...I took about 20 dried red chilies after shaking out the seeds and taking off the stems soaked them in hot water for about 20 minutes. Then rinsed. Put them in a pot of boiling water for about 40 minutes. Took out the chilies and put them into a food processor with 3 cups of the chili water and blended it until it was pulp like. Put the mixture into a big fry pan and added the garlic vinegar soy sauce fish sauce and brown sugar (amounts not measured) and cooked it until it boiled. Then I put the mixture back into the food processor with the lime juice (a half of a lime) cilantro and green onion and blended it until it was smooth. LOVE THIS RECIPE! I'm making Pasole tomorrow and will use this as my base mix. Thanks so much for sharing and all the great comments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sunny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12459601/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-07T18:59:33.81Z",
                "reviewBody": "This sounds really good (LOVE cilantro) and am anxious to try it but there are so many different types of red chili peppers ranging in heat (from very mild to off the charts) and size (very small 2 1/2\" to very large 8\") that your recipe can have hugely different results based on what type/size of peppers you use. Can you tell us what type/size you used in your recipe? Thanks Jeff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tempe Foodie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8953529/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-03-07T20:07:37.34Z",
                "reviewBody": "When you buy cilantro, it comes in a large bunch. I usually end up throwing most of it away, as it goes bad before I could possibly use it all.  I was very happy to come up on this recipe. I  made it according to the recipe, except I didn't have fish sauce. I did have oyster sauce,  so I used it and backed off the brown sugar.  the result was spectacular! I  used it on vegetables and on sliced turkey.  I lined tortillas  with it and added my beans, rice, etc. It was wonderful!  I  will  definitely be making more of this, as I  love cilantro.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marge Hoffman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21163831/"
                }
            }
        ]
    }
]