[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
                    "name": "Pork Rib Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/995/meat-and-poultry/pork/ribs/spare-ribs/",
                    "name": "Spare Ribs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/173108/slow-smoked-pork-spareribs/",
        "name": "Slow Smoked Pork Spareribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2300045.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2020-03-05T05:06:08.000Z",
        "description": "Pork spareribs are rubbed with a sweet and spicy dry rub, slowly smoked over red wine and fruits, then finished on the grill with a sticky barbeque sauce.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT4H15M",
        "totalTime": "P0DT8H55M",
        "recipeYield": "16 pounds",
        "recipeIngredient": [
            "¼ cup kosher salt",
            "¼ cup packed brown sugar",
            "¼ cup paprika",
            "3 tablespoons ground black pepper",
            "1 tablespoon garlic powder",
            "1 tablespoon onion powder",
            "1 teaspoon cayenne pepper",
            "½ teaspoon celery seed",
            "16 pounds pork spareribs",
            "1 apple, quartered",
            "1 orange, cut into wedges",
            "1 lemon, cut into wedges",
            "1 lime, cut into wedges",
            "1 onion, cut into wedges",
            "3 cups red wine",
            "3 cups water",
            "¼ cup soy sauce",
            "¼ cup lime juice",
            "½ cup ketchup"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the salt, brown sugar, paprika, black pepper, garlic powder, onion powder, cayenne pepper, and celery seed in a bowl; set aside. Remove all heavy fat from the ribs, then remove and discard the membrane covering the rib side. Cut the slabs into 3 to 4 bone portions, cutting evenly between the ribs to leave some meat on each portion.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rub the spice mixture into the rib portions front and back until all of the spice mixture has been used. Place the ribs into a resealable plastic bag, and refrigerate 4 hours to overnight. Letting the ribs sit overnight will give them the best flavor.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When ready to cook, fill the water pan of your smoker with the apple, orange, lemon, lime, onion, red wine, and water. If you do not have a water pan, place the ingredients into a metal bowl, and set the bowl on the drip tray, above the heat source. Smoke with the wood chips of your choice at 250 to 300 degrees F (120 to 150 degrees C) until the ribs are no longer pink, and the meat easily pulls from the bone, 4 to 6 hours or more depending on the smoker and temperature. Change the wood chips according to manufacturer's directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for medium-low heat, and lightly oil grate. Stir together the soy sauce, lime juice, and ketchup in a bowl to make the barbeque sauce; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After the ribs are fully cooked, remove them from the smoker, and brush them with the barbeque sauce. Cook on the preheated grill, brushing occasionally with the sauce, until the sauce has become sticky and infused into the ribs, 15 to 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Rib Recipes",
            "Spare Ribs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Charles B. Simpson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.6666666666666665,
            "ratingCount": 9,
            "itemReviewed": "Slow Smoked Pork Spareribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "878 calories",
            "carbohydrateContent": "14.5 g",
            "cholesterolContent": "240.1 mg",
            "fatContent": "60.5 g",
            "fiberContent": "2.3 g",
            "proteinContent": "59 g",
            "saturatedFatContent": "22.1 g",
            "servingSize": null,
            "sodiumContent": "1923.5 mg",
            "sugarContent": "8.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-03T19:08:49.817Z",
                "reviewBody": "This was the first time I'd ever attempted smoked pork spareribs. I followed this recipe precisely and the result was unanimous acclaim from all of my dinner guests that these were the absolute best ribs they'd ever had! There was one minor change, since we were unable to start dinner on time. I took the ribs off the grill and put them into a Pyrex baking dish, covering them tightly in aluminum foil. I then wrapped this in a triple layer of beach towels until we were ready to serve 30 minutes later. Not only were they still warm, but incredibly juicy as well. I plan to do it this way next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "steveglo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3594950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-17T15:30:45.217Z",
                "reviewBody": "After reading the review by jho I feel that the directions to this recipe need to be reviewed. This recipe does not call for specific type of wood chip as every person has already decided on what they like I developed this recipe using hickory and apple chips but I've also used whatever I had on hand just make sure that the chips are well soaked. The barbecue sauce portion is meant to be used if desired and adds a subtle taste that should not override the smoked flavor of the smoking process. The sauce should only be used on the ribs after the ribs go through the slow smoked process and should be done on a regular grill over indirect heat you want the sauce to be very sticky. You may also use the sauce as a side on the table instead of cooking the sauce on the ribs. Some of my guests over the years prefer the ribs without the sauce. When using the rub you may adjust the amount you rub onto the ribs. There should be some leftover rub when you are finished applying the rub to the ribs. This recipe was never meant to be used directly on a grill. Direct grilling has a tendency to dry out the meat. This recipe was developed using a Brinkman Slow cooker using charcoal I have used a Brinkman gas slow cooker as the heat can be better controlled. I am now using a BBQ Grillware slow smoker when cooking these ribs. The main secret to moist great tasting ribs is slow cooking at a temperature of 225 to 250 degrees. The water/wine in pan helps keep a moist environment.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Charles B. Simpson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1024506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-11T22:36:02.607Z",
                "reviewBody": "Your getting closer to the real thing.  I do Comp. Smoking style in my smoker and you need to try to keep temp at 225 to 275. I use a remote thermometer and keep my smoker temp at 230 . Over 275 and it cooks too fast, need 3 hours of wood chipds added every 30 min . after 3 hours smoke has penetrated into meat as far as it can and you just need to slowly bring the internal temp of meat up to 240 adding sauce only for last 30 to 60 minuets as you don't want the sugars in the BBQ sauce to burn.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DougsRubs\"Doug\"",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4302495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-21T03:25:15.68Z",
                "reviewBody": "Excellent- This came out well without all the time vested into it- I'm sure it would be amazing with the smoker. But I don't have a smoker so I dry-rubbed the meat (which was incidentally mostly frozen) and then grilled it basting the meat with the sauce. It came out fantastic and our guests loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1592675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-23T18:14:03.84Z",
                "reviewBody": "We were not impressed. We followed the recipe to the letter. We found the rub lacking flavor the fruits and wine did nothing as far as we could tell and we straight up didn't like the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "TIGERTRAX3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/291800/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-26T16:41:57.58Z",
                "reviewBody": "I'm still trying to figure out what I did with this recipe that ruined 12lbs of ribs. I think any one of the methods would have worked but everything was too much. The rub drowned out the wonderful mesquite taste I'm used to when smoking meat 8 hours. The sauce in no way complimented things at the end. I'll not risk this again but I would recommend going straight to the grill and no more than 2 hours of letting the rub stand on the meat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jim Holt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3355997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-09T18:50:43.5Z",
                "reviewBody": "I give this recipe three because of the changes after the changes it's a five. First I believe the amounts are way too much for the amount of ribs. I found it best to combine all the dry ingredients and place them in a shaker. This way you can control the amount based on the amount of meat. I have found that the fruit and wine are best left for dessert. I use the rub with alittle apple juice and place them in plastic wrap with absolutely no air to help the spices penetrate the meat. Let set over night in the fridge and cook as you please.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori LeNoir White",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3071191/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-02T11:24:08.75Z",
                "reviewBody": "I like the recipe. I only made 4-lbs as a test and didn't get any last minute guests so had a little problem with pepper portions. I used my Brinkmann smoke-n-grill for the first time and used Applewood wood chips about every hour.. The ribs were pretty meaty and tasty for 2.99/lb from Safeway. They were good especially for smoking for the first time but the Ironing Chef said that I needed to reduce the black pepper a bit (see above) season the ribs longer (I did 2-3 hours it recommends 4-hrs to overnight) and longer smoking (I did 4-hrs but probably should have gone 6-hrs). I did make the sauce but served as a dip and the lime hint was nice). I need to get a grill to keep the coals out of the ash for hotter temps (caused me to poke and check them more than necessary) and probably a thermometer with numbers not just Warm Ideal Hot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vincent Guinnane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3490111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-10T07:17:47.49Z",
                "reviewBody": "Good flavor but watch the time in the smoker. Mine finished much earlier than expected and were dried out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12680669/"
                }
            }
        ]
    }
]