[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
                    "name": "Canning and Preserving Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
                    "name": "Jams and Jellies Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/174275/spicy-tomato-jam/",
        "name": "Spicy Tomato Jam",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F680356.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T05:06:10.000Z",
        "description": "More like a relish than a true jam, this spicy delicacy will tingle your taste buds and is a great way to use a bumper crop of tomatoes and super over cream cheese with crackers!  I always get rave reviews whenever I open a jar of this jam. Use as you would a relish &ndash; great over cream cheese served with crackers!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "8 half-pint jars",
        "recipeIngredient": [
            "3 pounds tomatoes",
            "1 gallon boiling water",
            "1 cup cider vinegar",
            "½ cup apple juice",
            "1 ½ cups brown sugar",
            "1 ½ teaspoons salt",
            "½ teaspoon ground black pepper",
            "½ teaspoon ground mustard",
            "½ teaspoon ground allspice",
            "½ teaspoon ground cumin",
            "¼ teaspoon cayenne pepper",
            "1 lemon, quartered and sliced thin"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the tomatoes in a large pot and pour the boiling water over the tomatoes; allow to sit 5 minutes. Remove tomatoes from boiling water and place in ice-cold water until cool enough to handle.  Slip off skins and stems.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Coarsely chop the tomatoes in a food processor; reserve any juices and add to chopped tomatoes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine vinegar, apple juice, brown sugar, salt, black pepper, mustard, allspice, cumin, and cayenne pepper in a large non-reactive pan over medium heat; cook and stir until sugar dissolves completely; stir in the chopped tomatoes. Bring the mixture to a boil; reduce heat and simmer, stirring frequently, until liquid has reduced by half, 30 to 45 minutes. Add the lemon slices and cook another 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Canning and Preserving Recipes",
            "Jams and Jellies Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DLAMB3"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.09375,
            "ratingCount": 32,
            "itemReviewed": "Spicy Tomato Jam",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "51.5 calories",
            "carbohydrateContent": "12.8 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.7 g",
            "proteinContent": "0.5 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "118.3 mg",
            "sugarContent": "11.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-08-24T18:01:55.67Z",
                "reviewBody": "I love this! However, I made a few changes which I think made it better and will help clarify the process. Instead of weighing the tomatoes, I used 12 cups of diced tomatoes, mostly because with less, the cup of vinegar I added to only 8 cups was way too vinegary for my taste. I used only one cup of brown sugar, left out the cayenne and added cinnamon, cloves and nutmeg. I cooked it down for 2 hours and canned 3 pints. The leftover half pint tasted great on fresh bread. I'll be making lots of this - it's absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMLYTKA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1023252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T19:16:45.073Z",
                "reviewBody": "I had never heard of tomato jam before a friend mentioned it last year. Found myself with way too many grape tomatoes some months ago and decided to try a few tomato jam recipes. This one is a little too spicy for my tongue but won a BLUE RIBBON at the State Fair this year. And my hubby & guests like it. There is no arguing with that kind of success!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Miss Hilary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4443655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-08T16:03:45.973Z",
                "reviewBody": "This was my first attempt at canning so I followed the recipe to the letter. Awesome flavor. The only reason I'm giving fewer than five stars is because my yield was only 4 half-pint jars instead of 8 (I may have cooked it down too much.) I'll definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Kroger Molloy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2698473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-18T23:24:57.61Z",
                "reviewBody": "This is kind of bland. I followed the recipe exactly and really don't care for it at all. If I planned to make it again I would definitely add more sugar and probably some cinnamon and nutmeg too. I expected it to be more like a relish but it ended up tasting not spicy enough for a relish and not sweet enough for a jam. I have to say I was somewhat disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "cynthiab50",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5684244/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-04T16:48:50.557Z",
                "reviewBody": "I had too many tomatoes this year so I decided to use them in this recipe it turned out to be a nice flavour spicy tomato jam. The only thing is that I dobled the recipe and reduced the mix until it had a jam consistency and it didn't fill 7 pints so... don't spect much from 3lbs of tomatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Milenka Stocking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3967258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-20T00:17:15.023Z",
                "reviewBody": "I did a double batch with an extra # of tomatoes with the hopes of 7 pints I got 6. I like the flavor but could have used more precise instructions as a \"noob\". (This is my first time canning anything other than dilly beans) I simmered for at least two hours. Apparently that was not enough as it is still too thin. I thought maybe it would thicken up but it hasn't. (I guess that makes sense nothing really in it to thicken but just want to pass that on in case someone else thinks the same thing) I took it off the burner b/c it looked like all the tomatoes were cooked pretty much to nothing and I had the impression that it would stay chunky it did not. Also I wasn't sure if I was supposed to just slice up a whole lemon or peel it. I kept it whole. I used one lemon for the whole double batch and I think that was more than enough I can taste it clearly. Overall I liked it and will make it again except for boiling it down a lot more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee Gaiski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-26T06:36:41.59Z",
                "reviewBody": "I was worried about the combination of ingredients and even while cooking the \"jam/relish \" I was not certain how it was going to turn out; however now that it's done I'm thinking it's pretty near fantastic! I took some suggestions by reviewers and added 1/2 of a finely chopped small Gravenstein apple 1/8 tsp ground cloves and 1/8 tsp nutmeg. I did not pack the 1 1/2 C. of brown sugar but because the jam was too vinegary-sharp tasting I added another 1/2 C. of unpacked brown sugar. It would be great with cream cheese chips chicken or pork. It's worth the extra work!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14339092/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-07T17:12:47.797Z",
                "reviewBody": "I have made this recipe 3 or 4 times now and I love it. I have used canned diced tomatoes and fresh tomatoes and it has turned out well each time. I leave the skin on and it makes it a bit chunkier and still tastes good. The recipe is very adaptable I seldom have all the ingredients and have used different vinegars apple cider instead of juice etc. I always simmer it longer on the stove than the recipe says so it thickens properly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Gray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7351334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-01T23:05:57.153Z",
                "reviewBody": "I am not a novice. I have been canning for over 50 years! In my opinion this is way to much work and time. From the time your start your water to heat to steam the tomatoes until you put it in the jar(with the right consistency) it takes about 4 hours!! Another 30 minutes to process and now it's 41hours.I used 10 cups of chopped tomatoes and it yielded 5 1/2 pints. I",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rabbithash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12753669/"
                }
            }
        ]
    }
]