[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/198617/root-beer-pork-chops/",
        "name": "Root Beer Pork Chops",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F08%2F06%2Fd3ca32a5-0ad6-40d9-96de-62880dd75d4f.png",
            "width": 1920,
            "height": 1080
        },
        "datePublished": "2020-03-05T05:06:41.000Z",
        "description": "These are great for outdoor grilling. Simple and very tasty. The glaze at the end gives them a lot of concentrated flavor.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "4 pork chops",
        "recipeIngredient": [
            "4 (1-inch thick) pork chops",
            "3 (12 fluid ounce) cans or bottles root beer",
            "salt and pepper to taste",
            "1 cup beef stock",
            "2 tablespoons brown sugar",
            "½ teaspoon chipotle-flavored hot sauce",
            "2 teaspoons Worcestershire sauce",
            "1 pinch salt, to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the pork chops in a dish; pour 2 cans of the root beer over the chops. Place in refrigerator to marinate at least 2 hours. Remove the pork chops from the root beer; season with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the remaining can of root beer, the beef stock, brown sugar, hot sauce, and Worcestershire sauce in a saucepan over medium heat; simmer the mixture until it reduces to about 3/4 cup. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grill the pork chops on the preheated grill until the no longer pink in the center, about 8 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Brush the chops generously with the reduction sauce and continue cooking for about 2 minutes more per side. Remove from grill and brush with any remaining sauce. Season with salt to taste before serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ken from CA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.808988764044944,
            "ratingCount": 267,
            "itemReviewed": "Root Beer Pork Chops",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "408.6 calories",
            "carbohydrateContent": "37.5 g",
            "cholesterolContent": "106.6 mg",
            "fatContent": "9.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "41.8 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "169.6 mg",
            "sugarContent": "37 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-02-20T20:40:26.777Z",
                "reviewBody": "I will agree somewhat with WERFLY.  This was written toward my some of my families tastebuds (which can be a little wimpy at times).  That's the one I submitted.  I prefer it marinated all day with the rootbeer and a tablespoon of worchestershire, heavily salted/peppered prior to grilling.  2 teaspoons chipotle sauce and I also use Campbells 2x strength beef broth to start for this.  The reduction down to 3/4 cup is approximate (I tend not to measure things-rather go by taste), it should be pretty potent and salty sweet.  Remember, you have to taste everything and make sure to adjust seasoning to your families tastes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ken from CA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2410985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-01T22:52:29.03Z",
                "reviewBody": "This recipe is awesome!  I let the chops sit in the root beer for about 6 hours.  WARNING- Do not make if you don't love good food!  EDIT- I thought I should add I let the chops marinate for 6 hours because that is the amount of time I had.  Defintely will do it for longer next time.  Also, I used a charcoal grill, which lends a nice flavor in my opinion.  In addition, my pepper mill is filled with a combo of black, white and red pepper corns, which is a wonderful combo that adds another flavor dynamic.  Finally, I used habanero hot sauce (Big Ben's BBQ brand- which I highly recommend), instead of chipotle flavored.  Very tasty.  A tip of my hat to you Ken!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Puck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-07T22:27:12.75Z",
                "reviewBody": "Because it's unbelieveably cold out, I can't grill these like I would have liked. So....what I did was combine all the ingredients (with a couple tablespoons of cornstarch wisked in), braised my pork chops and stuck everything in the crockpot. Only change I made was adding in some sliced onions and minced garlic that I sauteed in the pan that I braised the pork chops in. I didn't need the extra salt as my beef broth and the worchestershire was salty enough on it's own. This made for some very tasty and moist pork chops but it needs a little something else. I can't put my finger on it. Maybe a tablespoon of dijon? A bay leaf? I liked the combination of the root beer and beef broth, it was sweet and beefy all at the same time.....it's just missing just a little somethin'-somethin'. This went really well with mashed potatoes. NOTE: I also used Campbell's beef broth only because it's double strength and has a stronger flavor than your usual boxed broth. I used a quality root beer, too. I think that makes all the difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-25T16:56:57.803Z",
                "reviewBody": "WOW, that was unexpectedly soooo good.  My husband doesn't really love porkchops but he said he would have liked a big pile of them.  I told him there was a secret ingredient (RB) and he forbid me to tell him because they were so good.  I followed the recipe exactly (except I didn't have hot sauce) and they were wonderful.  A++ and I will make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan Mitchell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2139700/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-03T16:25:24.807Z",
                "reviewBody": "After talking to Ken about my experience with this recipe I decided on reviewing it two ways. First of all as written while still producing a tender finished dish I give it a 4 for the fact that even beyond \"personal taste\" I think this would be a bit bland but with SO much potential. That said it turns into an easy 5 star with Ken's changes which he states in his review. So I added more chipotle hot sauce a fair bit of black pepper more Worcestershire sauce and I did marinate the chops in all of those ingredients not just the root beer. Followed the rest of the recipe as stated. We used Barq's root beer because we much prefer the \"bite\" to it as opposed to a sweeter one. I would do it all the same next time other than omitting the brown sugar but again that's only a personal taste in not liking things as sweet as some do. That does NOT lower my rating.:) Thank you Ken for the addition and the clarifying review.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Keni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1885019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-24T01:08:28.04Z",
                "reviewBody": "I really wanted to love this recipe.  I love root beer and I'm always looking for new ways to do pork chops.  I followed the recipe exactly - marinating in the root beer and then using fresh root beer to combine with the other ingredients and reducing the liquid down to 3/4 cup and using it as a 'glaze' while grilling.  The end result was -- ok.  The chops were a little on the sweet side - but that's really all there was.  It seemed like a lot of effort for only an 'ok' end result.  For us, they were average - not bad - but not particularly special. **8/23/2010 update - I used the leftovers from this in the Pork Salad Croissant recipe from this site.  The leftovers worked GREAT in this salad.  The sweetness of the root beer was a nice complement to the spice of the chutney in the recipe and worked well with the apple and grape.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Dutchgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3180618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-22T20:42:55.037Z",
                "reviewBody": "WOW! i didn't think i'd like this cuz i dislike root beer....but the meat was so tender and juicy...I marinated it for 4 hours and then cooked it with the sauce made on the stove (couldn't wait for it to be only 3/4 cups so i had 2 cups of sauce) i put half of it on the pork chops covered and baked at 350 for 30 min, took out, added more sauce ,and cooked for another 20 min....turned out so delious my boyfriend was in heaven..THANKS ken for the recipe definately a keeper",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaitlyn Murphy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4824869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-27T19:30:54.81Z",
                "reviewBody": "A keeper! My husband and I made this for my mother visiting from out of state. I did use a tsp of the chipotle tabasco sauce and I still felt it could have used a little more kick but my Mom thought it was perfect as I had made it a good balance.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Qween of My Destiny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3013883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-19T18:26:46.167Z",
                "reviewBody": "I'd printed this recipe off and gave it to my dad for him to make sometime (I'm not big on grilling, myself) and he finally got around to it tonight. It was a winner! We all ate it and enjoyed it. My dad said it took more work than he usually likes to put into cooking supper, but I consider that a good thing - much better than a bottled sauce or marinade. Thanks for the great recipe Ken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3513546/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Root Beer Pork Chops",
            "description": "These are great for outdoor grilling. Simple and very tasty. The glaze at the end gives them a lot of concentrated flavors.",
            "uploadDate": "2021-08-06T14:23:59.775Z",
            "duration": "PT1M7.392S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb7628077-0c32-436f-97ad-fd6d0dd43c50%2Fed8a1596-360e-4b51-b972-abafef5fbc25%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6266816609001"
        }
    }
]