[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214581/brown-sugar-banana-bread/",
        "name": "Brown Sugar Banana Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7843571.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-03-05T05:07:20.000Z",
        "description": "Brown sugar and cinnamon add depth to this moist, sweet bread.  The perfect present for friends and loved ones!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 9x5-inch loaf",
        "recipeIngredient": [
            "4 ripe bananas, cut into chunks",
            "1 ¼ cups light brown sugar",
            "½ cup butter, softened",
            "1 egg",
            "1 teaspoon cinnamon",
            "1 teaspoon vanilla extract",
            "¼ cup whole milk",
            "2 cups all-purpose flour",
            "½ teaspoon baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon kosher salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the bananas into a large plastic zipper bag, seal the bag, and smoosh the bananas with your fingers until very well mashed. Set the bananas aside. Place the brown sugar and butter into a mixing bowl, and mix on medium speed with an electric mixer until light and fluffy, 1 to 2 minutes. Cut a corner from the plastic bag, and squeeze the mashed bananas into the bowl of brown sugar mixture. With the electric mixer on medium speed, beat in the bananas, egg, cinnamon, vanilla extract, and milk until the mixture is well combined. Switch the mixer to low speed, and gradually beat in the flour, baking soda, baking powder, and kosher salt just until the batter is smooth, about 1 minute. Spread the batter into the prepared loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the bread is set and lightly browned on top, about 40 minutes. A toothpick inserted into the center of the loaf should come out clean.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "The D Family"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.496842105263158,
            "ratingCount": 475,
            "itemReviewed": "Brown Sugar Banana Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "414.7 calories",
            "carbohydrateContent": "71.9 g",
            "cholesterolContent": "54.5 mg",
            "fatContent": "12.9 g",
            "fiberContent": "2.5 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "364 mg",
            "sugarContent": "41.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-06-27T19:33:44.457Z",
                "reviewBody": "Phenomenal banana bread recipe! Very flavorful, moist and full of great banana flavor. I only made a couple minor mods to the original recipe: I cut the butter down to 2 tbl., only used 1/2 c. brown sugar and substituted whole wheat four for the AP. With the flour switch, I was nervous that the texture would be 'off,' but I was wrong! It turned out super moist and perfect...and the sweetness from the 4 bananas more than made up for the brown sugar I cut out. Excellent recipe...will definitely make it again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BacardiGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2080866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-15T17:32:08.6Z",
                "reviewBody": "I lightened this bread up just a touch--not by much. I got 12 large muffins and 8 mini-muffins. 350 for 20 minutes for the large muffins and 10 minutes for the mini-muffins. Very moist and lightly spiced. Is there anything more comforting than homemade banana bread?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-15T18:28:26.44Z",
                "reviewBody": "This is a very good banana bread!  The first time I made it, it didn't turn out so well.  The second time was much better.  I beat the butter (real, usalted) and sugar a lot longer and used 3 large bananas.  I use skim milk and dark brown sugar, since that's what I had on hand, and 1/4 tsp. regular salt instead of kosher.  I found that it took about 60 minutes to bake, instead of 40.  The bread still didn't rise that much, but at least it didn't sink in the middle like the last time!  I made a topping of 3 Tbsp. brown sugar mixed with 1 tsp. cinnamon.  The thing I like most about this bread is the \"soft\" texture, which must be attributed to the brown sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-01T04:14:59.47Z",
                "reviewBody": "I couldn't wait to review!!  I wanted to review before it was done but I held on.  I followed the recipe to the letter.  After 40 minutes it looked beautiful and smelled even better, but the toothpick came out WET!  I thought I did something wrong.  I put it back in another 10 minutes and still wet.  I came back to read the reviews and was so relieved to see so many other people say it took 60 minutes or more.  WHEW!  I put some foil over top so my beautiful brown crust on top wouldn't burn and turned the oven off, then put it back in and just let it set.  Sorry but I didn't pay attention to how long it took, I was doing dishes.  The pick came out clean when it took it out.  It's moist and so yummy (I ate it warm, it was too tempting!).  Oh, I did make one teeny addition... after I put it in the pan I sprinkled some cinnamon sugar on top for the sparkly crusty top.  That's it!  YUMM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3710881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-26T22:54:15.543Z",
                "reviewBody": "Bread tastes great! Made recipe this afternoon. Like the idea of putting soft bananas in a zip-type bag and smashing. Recipe took a bit longer to make then stated, but turned out so much better this time. The first time loaf ended up in the trash; I mixed milk & egg while cold - bread sank in middle after removing from oven. This afternoon mixing brown sugar and butter took 14 minutes rather than 1-2 minutes. Using an Oster stand mixer; I mixed on the #10 setting (grind) for 10 minutes, holding bowl with one hand to keep it from spinning too fast. Added 4 minutes on #5 (whip setting). Mix didn't get fluffy, but was light. Brought milk and egg to room temperature (abt 1 hr). Items blended much better than using cooler ingredients like the 1st time. Lowered speed to #3 (puree) and combined last 4 items; batter looked more like rippled waves on a beachfront rather than being smooth. Before pouring mix into loaf pan, I hand mixed batter with spatula to get bits of mashed bananas to smooth out. Baking time was about 43 min. Finished loaf tasted great after cooling a bit, but much better after being in frig 4-5 days. Tastes great by self, or putting a light coat of butter or dopple of whipped cream on slice. (Hard to stop at one piece.) Not overly sweet; just right for folks who don't tolerate a sweet sugary taste. I'm glad I gave this recipe a second chance.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The King's kid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2918241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-12-07T08:29:34.24Z",
                "reviewBody": "I hate when people rate a recipe after making changes to it, but here I go anyway..... I actually searched specifically for a banana bread recipe with brown sugar so i could use the splenda brown sugar blend for a coworker that has to watch his sugar and starch intake.  I made this bread using the splenda and I used 1 1/2 cups of almond flour and a half cup regular flour and let me tell you, it was better than the full sugar banana cake I made for everyone else!! My 19 year old son asked me to make another \"diet\" one for the house! I've subbed out the almond flour in a few different recipes, but this one has worked out the best so far.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSYPAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1378346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-01T22:39:04.663Z",
                "reviewBody": "Excellent! Baked for 60 minutes in an air-bake pan; 40 minutes wasn't enough. Very moist-one of the best banana breads I've made. I tried this recipe because I was out of white sugar and had bananas to use up. Added a handful of chocolate chips to the mix for fun and sprinkled oats mixed with brown sugar on top before I baked it. I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy Kelley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2278142/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-06T23:44:07.47Z",
                "reviewBody": "This is the best banana bread I have ever had or made.  Very moist.  I doubled the recipe and used a large loaf pan, a regular loaf pan and a large muffin pan.  The regular loaf pan turned out perfect at 40 minutes, the muffins were perfect at 20 minutes and the large pan had to cook to long for the bottom of the bread to survive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6848394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-30T17:41:35.527Z",
                "reviewBody": "A very delicious bread!  I made sure to follow the advice of some of the other reviewers so my bread wouldn't sink in the middle.  I beat my butter and sugar for a good bit, probably about 7-8 minutes.  I also let my egg come up to room temperature before using it and warmed the milk up a bit in the microwave.  I only ended up using 3 medium bananas since that was all I had on hand.  My bread took 50 minutes to bake instead of 40, but came out perfect on the first try!  It had just the amount of banana flavor that I like and was incredibly soft from the brown sugar!  The cinnamon was a great compliment to the bananas as well.  This is a keeper, thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aosuki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3167542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-03-02T04:18:00.273Z",
                "reviewBody": "The problem  with  this recipe, like many of yours, is your vague measurements. \nFour bananas can be 2 cups, three cuos, etc. You need precise measurements in baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathryn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25020987/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Brown Sugar Banana Bread ",
            "description": "This banana bread recipe is full of flavor and easy to make from scratch! ",
            "uploadDate": "2020-08-28T07:10:03.952Z",
            "duration": "PT1M31.285S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F80a5739b-f87f-49be-a470-658b3a6ba22e%2F62b0a74e-610c-4813-8b10-00718ca1dd0a%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6185107024001"
        }
    }
]