[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16233/meat-and-poultry/turkey/legs/",
                    "name": "Legs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216099/its-way-better-than-thanksgiving-turkey-turkey/",
        "name": "It's Way Better Than Thanksgiving Turkey Turkey",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4388122.jpg",
            "width": 1080,
            "height": 1080
        },
        "datePublished": "2020-03-05T05:07:42.000Z",
        "description": "Unless you're deep-frying turkey, I suggest you make the switch over to this method of cooking turkey, even for holidays and special occasions. Alter the amount of ingredients depending on the number of people attending your amazing turkey feast; my version is for three people.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H45M",
        "totalTime": "P0DT4H15M",
        "recipeYield": "3 turkey legs",
        "recipeIngredient": [
            "½ cup extra-virgin olive oil",
            "3 turkey legs, rinsed and patted dry",
            "salt and ground black pepper to taste",
            "2 teaspoons dried thyme",
            "6 sprigs fresh rosemary",
            "3 tablespoons butter, cut into small chunks",
            "1 ½ tablespoons minced garlic",
            "½ cup diced onion",
            "½ tablespoon red cooking wine, or to taste",
            "½ tablespoon brown sugar",
            "2 tablespoons all-purpose flour",
            "1 ½ cups chicken stock",
            "4 dashes browning sauce (such as Gravy Master®)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the olive oil into a roasting pan. Place the turkey legs into the oil; turn the legs over several times to coat with oil. Sprinkle each leg with salt, black pepper, and thyme; pull the leaves from 3 sprigs of rosemary and sprinkle onto the turkey legs. Place the remaining 3 sprigs of rosemary around the legs in the oil. Place butter pieces on the legs; sprinkle each leg with garlic and scatter the onion in the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast the legs in the preheated oven until the turkey skin is browned and the juices run clear, 1 1/2 to 2 hours, basting every 20 minutes. Reduce heat to 300 degrees F (150 degrees C) and turn the legs over in the pan. Roast for 1 hour, basting every 20 minutes. Reduce oven heat to 200 degrees F (95 degrees C) and roast until the skin is golden brown, about 1 more hour. Remove the turkey legs to a serving platter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make gravy, move the roasting pan with the oil and drippings to a burner set on medium heat; whisk in the cooking wine and brown sugar, stirring until the sugar has dissolved. Use the whisk to scrape up and dissolve any brown flavor bits left in the bottom of the pan. Whisk in the flour, a little at a time, and stir until the flour is smoothly incorporated into the mixture; pour in the chicken stock and whisk constantly until the gravy comes to a simmer and thickens, about 5 minutes. Stir in the gravy browning sauce; allow the gravy to simmer for 3 to 5 minutes and serve with the roasted turkey legs.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Legs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Fetish Cook"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.125,
            "ratingCount": 8,
            "itemReviewed": "It's Way Better Than Thanksgiving Turkey Turkey",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "926.9 calories",
            "carbohydrateContent": "11.8 g",
            "cholesterolContent": "209.2 mg",
            "fatContent": "63.2 g",
            "fiberContent": "1.3 g",
            "proteinContent": "74.2 g",
            "saturatedFatContent": "17 g",
            "servingSize": null,
            "sodiumContent": "646.9 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-16T18:53:40.07Z",
                "reviewBody": "I don't know how the previous reviewer made this on a work day as it is very labor intensive - having to baste it every 30 minutes and change the temperature three times.  Also, my turkey legs got really brown within the first hour and at the end of cooking, everything in the pan was black!  The legs got a bit dried out. I followed the recipe exactly, too.  I made the gravy by taking out all the blackened veggies and then adding the sugar and wine, etc.  - and it was really good.  I wonder if I should have covered the roasting pan when I cooked the legs?  I would shorten the first cooking time for sure.  I will make it again, but adjust temps and cooking times!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MimiChris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3784292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-05T00:46:29.49Z",
                "reviewBody": "This was a real treat just to serve during the work week to my family. They all loved it. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1066136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-19T09:02:53.28Z",
                "reviewBody": "Not sure how everyone else did this but I followed the recipe to the letter and my Turkey legs were fully cooked (meat falling off the bone) tender and delicious in just under 2 hours of cook time! I only got to do 1 1/2 hours at 400 then not quite a half hour at 300 and they were already done. So now I have to find a creative way to keep them hot for the next hour and 45 minutes! (kind of frustrating) I can only imagine the state of the legs if I had kept cooking for another almost two hours! And forget about gravy. Everything in the pan is charcoal black - onions garlic and spices - there is no water or broth in this recipe so everything just fries to a crisp leaving nothing but butter oil and black bits to make gravy with. Not sure how this recipe got so many 5 stars... check out other turkey leg recipes... they all say to roast them in 2 hours and they add some kind of liquid... kind of makes you wonder if maybe they are right!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "inezanzen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1631963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-16T06:51:06.023Z",
                "reviewBody": "I can't even begin to tell you how amazing this dish is. My boyfriend who doesn't even care for turkey finds this to be phenomenal. I think he has made it for me at least 5 times now. The turkey is never dry. The gravy is wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "herzeleid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2779139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-14T18:04:24.84Z",
                "reviewBody": "I thought this was an excellent recipe though I did tweak it a bit. Since some of the reviewers said the veggies at the bottom were getting burned instead of baking for 400 degrees for an hour before lowering the heat I let it cook for about three hours at 300 degrees and I covered the roasting pan in tin foil. It came out perfectly cooked and incredibly moist with a lot of great flavor. The gravy is also superb I would keep this recipe for that alone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Beebopalooa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9318917/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-17T18:49:57.32Z",
                "reviewBody": "This was so good! The turkey stayed so juicy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crst",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3919484/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-30T02:19:16.76Z",
                "reviewBody": "This is definitely a good method even though it is extremely labor intensive. I didn't care for the flavor very much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Buckwheat Queen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/melaniegiovenzana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-11-29T02:26:00.797Z",
                "reviewBody": "I have made this every Thanksgiving for almost 10 years now made it once and now my family demands it. I will say I listened to the reviews and tweaked the times. 400 for about an hour 300 for about 45 min 200 30 min or until skin is brown. It takes some tweaking and some intuition. I keep an eye on the internal temperature when I get to my 165 then I start concentrating on the skin browning. basting every 20 min is a must! if you see the onions getting over done or not enough juice to baste just add some chicken broth to the pan. I do thighs as well as Drumsticks (family request) and the recipe works great on thighs as well. Tried the thighs on a rack one year family said back in the pan too dry on the rack. Hope this helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen Doll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26580792/"
                }
            }
        ]
    }
]