[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216319/homemade-sweet-italian-sausage-mild-or-hot/",
        "name": "Homemade Sweet Italian Sausage (Mild or Hot)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F785124.jpg",
            "width": 4320,
            "height": 3240
        },
        "datePublished": "2020-03-05T05:07:45.000Z",
        "description": "This is a very versatile Italian sausage which can be used in many different ways. You can take it from mild to hot and it's very easy to use. There are also different options for type of meat to use, like ground chuck or ground turkey (do not use ground beef). If using ground turkey, you'll have to coat your skillet with a little olive or veggie oil before cooking as it has very little fat and will stick to skillet.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT12H20M",
        "recipeYield": "3 1-pound portions",
        "recipeIngredient": [
            "3 pounds ground pork",
            "3 tablespoons red wine vinegar",
            "1 tablespoon salt",
            "1 tablespoon freshly cracked black pepper",
            "1 ¼ tablespoons dried parsley",
            "1 tablespoon garlic powder",
            "1 tablespoon onion powder",
            "1 tablespoon dried basil",
            "2 teaspoons paprika",
            "2 teaspoons crushed red pepper flakes, or to taste",
            "¾ teaspoon ground fennel seed",
            "¼ teaspoon brown sugar",
            "⅛ teaspoon dried oregano",
            "⅛ teaspoon dried thyme"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the pork and red wine vinegar in a mixing bowl. Sprinkle with salt, black pepper, parsley, garlic powder, onion powder, basil, paprika, red pepper flakes, fennel seed, brown sugar, oregano, and thyme. Knead until flecks of spice are evenly distributed through the sausage.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the sausage into thirds, and form into 3 logs; wrap each in plastic wrap. Place wrapped sausage into a freezer bag before freezing, or store in refrigerator for at least 12 hours before cooking.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Michelle Leigh Gossman"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.717948717948718,
            "ratingCount": 234,
            "itemReviewed": "Homemade Sweet Italian Sausage (Mild or Hot)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "243.1 calories",
            "carbohydrateContent": "2.3 g",
            "cholesterolContent": "73.6 mg",
            "fatContent": "16.4 g",
            "fiberContent": "0.7 g",
            "proteinContent": "20.5 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "640.3 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-17T18:44:11.943Z",
                "reviewBody": "Very easy to make and the spices are just right.  I used all pork the first time and made pattys with a burger press (about 14 pattys).  Hubby loves this recipe, but since he is a hunter, he is looking forward to a venison version, so stay tuned for the update.  His gun is ready and waiting! Thanks Michellegambel, I love the spice combination you developed!  :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4255830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-29T00:21:04.62Z",
                "reviewBody": "This is awesome! I'll never buy premade Italian Sausage again. I left out the brown sugar - don't know if I missed it or not but I take out processed sugars of all my recipes. I did however put raw honey in as a replacement (don't measure how much). I also added a bit of olive oil to it while mixing just to make it a little more moist. It worked!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CALLIEW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1112012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-06T11:09:06.617Z",
                "reviewBody": "Absolutely fabulous. Best sweet italian sausage I've ever had! I made only one change and that was using just a pinch of salt instead of a whole tablespoon. Thank you so much for sharing your recipe. Next time I make this I might try this with half ground turkey to see if I can't make it a little healthier. EXCELLENT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-28T23:30:48.743Z",
                "reviewBody": "( GREAT SAUSAGE )This sausage recipe is better tha any meat market in upstate NY.   I started with a 7Lb. pork but and cut it into 2\"x2\" cubes with the fat , Put it into (2) 1 gal. zipper bags. The first bag I made mild . Bag #2 I added 2 Jalipenos diced up small. Put all your ingredients into each bag , zip and mix well to coat all sides of meat. Refrigerate , run through meat grinder with the fine grind blade and a casing attachment.   Easy as that...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rich from NY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3613113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-06T01:47:25.657Z",
                "reviewBody": "I love making my own sausage because you're really in control of what goes into the food, and especially with sausage commercial products which are full of sodium and msg making pork, a relatively healthy meat into a heart attack waiting to happen. As for this recipe my husband is in love with it! I only had a pound of pork so I went ahead put all the spices called for in the recipe in a spice grinder to blend them evenly, makes about 7 tablespoons, put a third of that into the pound of pork, cooked it off and used in Lasagna Rollotini. Soooo good, even if I would let my husband go back to commercial sausage he wouldn't in a million years. Thanks so much for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs.West",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5650640/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-01T18:18:38.653Z",
                "reviewBody": "Perfect! After seeing this recipe I found some ground pork on sale at the store and so I had to try this recipe. It came out really well. Tasted just like Italian Sausage! I didn't have any ground fennel so I just used fennel seed. I think I used about a tablespoon but I didn't really measure that part. I used kosher salt and 1 1/2 t of red pepper flakes. And I completely forgot the brown sugar didn't seem to affect it at all. And to test it out I used the first pound in one of our family favorite recipe. Passed the test:) Thank you for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-04T23:42:00.007Z",
                "reviewBody": "Delizioso!! I love this recipe. I love it because I make it and there is no guessing what is in it or artificial ingredients. The flavor is authentic and can be tweeked to preference. I make 1/3 of the recipe and reduce everything by 1/3 with the exception of the fennel, brown sugar, oregano and thyme which I use the full amount. This really is a great recipe and I'm very happy to have it. For the best flavor let it ripen 24 hours before using.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindalmt/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-04-25T00:32:04.637Z",
                "reviewBody": "This was a good base recipe. I used 4lbs of pork shoulder and then added 2 TBSP of toasted Fennel and a little more than 3 TBSP of brown sugar. I added a little more of each spice and a wise old Italian once told me to use 1 TBSP of salt per pound of pork. For 4 lbs I used 3 TBSP of kosher salt. This is the 2nd time I have made this and it was perfect. I also use 1TBSP of red wine vinegar per pound so I did use 4 TBSP for what I had. I also added fresh garlic, about 2 TBSP. \n\nThe key to making sausage is keeping it cold. Cut shoulder into strips to feed into grinder. After you cut them stick them in a bowl and into the freezer for 30-45 minutes. Grind the sausage after that and once ground put back in a bowl for 30 minutes in the freezer without spices. Take out and flatten like a hamburger, cover the top with all of the spices and fold in. If you use the same bowl you used in the freezer the bowl will still be cold and you grind it again with the spices back into the bowl. Grinding again with the spices breaks it down a little more and blends the spices perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Joe Jaques",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1317221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-24T22:14:20.37Z",
                "reviewBody": "4 stars because too salty. I calculated to 8 servings as I only had 2 lbs of ground pork. I didn't have red wine vinegar so I used a white balsamic. Because that has a sweetness to it I didn't add the little bit of brn sugar. I scaled the crushed red pepper back a bit and used a full tsp of oregano and thyme. I mixed all this and then froze it to use for lasagna another time. Today after I cooked it up and tasted it; I was bummed that it was so salty (and I like salty food). I'll make it again but add only 1/2 salt called for. Then this will be 5 stars I'm sure. I'm hoping all the other ingredients in my lasagna mellow it out...guess I'll find out soon as I'm cooking it for dinner tonight. Update: I added sausage to 1/2 of my lasagna and did notice how salty that side tasted. But...the next day after re-heating...it was fine (strange). Anyway I'll still go w/half the salt next time. If it could use more after cooking I can add it; sure can't take it out though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MakeItWork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/makeitwork/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-04T00:20:21.757Z",
                "reviewBody": "I didn't care for this recipe. The basil is overpowering. I would however increase the brown sugar thyme and oregano. I used the auto adjust button to reduce the recipe to 4 serving sizes to accommodate the 1 lb of pork I had to use and those ingredients translated down to just a pinch each not enough to make a difference in the recipe whether for the original serving size or not.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            }
        ]
    }
]