[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13392/main-dish/pork/pork-chops/stuffed/",
                    "name": "Stuffed",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216452/stuffed-pork-chops-with-cranberries/",
        "name": "Stuffed Pork Chops with Cranberries",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5035216.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2020-03-05T05:07:48.000Z",
        "description": "Pork chops, baked or grilled, stuffed with cranberries and pine nuts, served with cranberry sauce.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 pork chops",
        "recipeIngredient": [
            "1 cup dried cranberries",
            "2 cups boiling water",
            "2 tablespoons toasted pine nuts",
            "1 teaspoon ground cinnamon",
            "½ teaspoon ground cloves",
            "1 tablespoon brown sugar",
            "4 cups chicken stock",
            "¼ cup white wine",
            "¼ cup red wine",
            "¼ cup cranberry juice",
            "1 tablespoon brown sugar",
            "4 (1-inch thick) pork chops",
            "salt and black pepper to taste",
            "2 tablespoons olive oil",
            "2 tablespoons dried cranberries",
            "2 tablespoons toasted pine nuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To prepare the cranberry filling: Soak 1 cup dried cranberries in the boiling water for 20 minutes. Drain the cranberries, reserving 1/4 cup of the water. Place the cranberries, reserved water, 2 tablespoons pine nuts, cinnamon, cloves, and 1 tablespoon brown sugar in a food processor. Process until finely chopped; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring the chicken stock to a boil over high heat. Reduce heat to medium, and simmer until the chicken stock has reduced to half its original volume, about 15 minutes. Add the white wine, red wine, cranberry juice, and 1 tablespoon of brown sugar. Continue cooking until the sauce has reduced by half again, about 10 minutes. Keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut a pocket into the side of each pork chop, about 3/4 of the way through. Stuff each pork chop with the dried cranberry mixture, then season on all sides with salt and pepper to taste. Heat the olive oil in a large, ovenproof skillet over medium-high heat until it begins to smoke. Cook the pork chops on one side until golden brown, 3 to 4 minutes. Turn the pork chops over, and cook another few minutes until browned on the other side too.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1 cup of the sauce into the skillet and bring to a simmer. Place the skillet in the preheated oven, and bake until the pork is no longer pink in the center, 8 to 10 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, place each pork chop onto a warmed dinner plate, and spoon the sauce from the skillet over top. Sprinkle the pork chops with 2 tablespoons dried cranberries and 2 tablespoons toasted pine nuts for decoration. Serve with the remaining cranberry sauce.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes",
            "Stuffed"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "POPS OHIO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3076923076923075,
            "ratingCount": 13,
            "itemReviewed": "Stuffed Pork Chops with Cranberries",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "627.8 calories",
            "carbohydrateContent": "40.3 g",
            "cholesterolContent": "147.1 mg",
            "fatContent": "23.7 g",
            "fiberContent": "2.5 g",
            "proteinContent": "57.6 g",
            "saturatedFatContent": "5.7 g",
            "servingSize": null,
            "sodiumContent": "1057.1 mg",
            "sugarContent": "31.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-25T00:08:12.07Z",
                "reviewBody": "Ok. I made this wonderful dish without the sauce. I made the filling (cranberries, boiling water, cinnamon, cloves, brown sugar--I omitted pine nuts), and I'll tell you, in my personal opinion, that was enough sauce for the whole dish. It came out EXCELLENT. My momma couldn't stop talking about how delicious it was and I was just pleased as punch with the outcome. The sweet spiciness of the cranberries contrasted perfectly with the saltiness of the pork chop. Next time I will be sure to use less cloves--for they pack a powerful punch. Perhaps 1/4  tsp instead of half.  Now, keep in mind even though I omitted the sauce I was only making two chops. So if you are cooking for four and choose to omit the sauce you MUST double the cranberry filling. When the pork chops finished cooking I made a small bed of the cranberry filling on a plate, laid the chop on it, and lastly dabbled a little cranberry filling on top of the pork chop.   Now from my experience, the side I used was a twice baked stuffed potato--with sour cream, bacon, chives, and gouda. It contrasted PERFECTLY. Some of my potato mixed in with the cranberry filling and they were two perfect matches. Im serious about this people! I'm not gonna lead yall astray here!  Lastly I had a side salad with a basic head of lettuce, all natural balsalmic vinagrette and homeade croutons. The salad, however you may choose to make it, added an outstanding crunch to the whole meal.  I couldn't finish my plate and I was sad :(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "grneyedgem",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6177665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-11T01:44:56.933Z",
                "reviewBody": "Very time consuming recipe but well worth it! I also only made two pork chops but that worked out nicely because we enjoyed having more of the cranberry filling to put on top of the chops. I made the sauce but we really didn't use it the next time I make these which I will be for sure I will not be making the sauce. It came out runny for me and did not add tons of flavor so I will just leave it out next time. Overall awesome recipe! I will definitely be making it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eric S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3517316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-16T19:11:15.787Z",
                "reviewBody": "This meal was simple experimental and exceptionally tastey! I used sage instead of cloves and that mixed perfectly with the flavor of the cranberry. It was lightly sweet unlike the normal cranberry tanginess. In the future I might add in more pine nut I feel that would take out some of the sweetness and add a more savory feel! I would absolutely recommend this recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "torianne87",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5882240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-07T00:20:08.53Z",
                "reviewBody": "This is the best stuffed pork chop I have ever eaten. I have often searched for a pork chop recipe that would flavor the pork and this one does just that. A wonderful culinary experience. My family loves it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catchef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6270915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-12T18:25:09.9Z",
                "reviewBody": "We loved this. I did not have pine nuts so I just omitted them but I did add a little goat cheese to the stuffing. I think it gave it a great flavor and was a good contrast to the sweet cranberries. I also did not take the time to make the sauce but instead made a little extra stuffing heated it through and served on top. I will be making this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kristin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2287688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-04T22:24:06.487Z",
                "reviewBody": "Unfortunately we didn t like this dish at all. I can t believe I wasted time and good and not cheap ingredients making this. The chops were absolutely tasteless. The recipe makes too much cranberry sauce which is too watery not salty and really lack of flavor. The sauce uses too much chicken stock that \"kills\" other ingredients. The final sauce tastes like chicken stock coloured and a little flavored with red wine. 1 cup of the sauce is too much the meat soaks and loses its flavor and we didn t like that after baking the meat wasn t baked but was boiled. This cooking process made the meat tasteless and not tasty. The cranberry filling itself is delicious but it doesn t make the whole dish with the meat. Sorry but we were really upset and disappointed with this stuff.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DiamondGirl amanecer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2761942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-04T17:18:59.683Z",
                "reviewBody": "This was the best pork chop recipe ever. It will be hard to make another recipe after having this one. It was absolutely delicious. My whole family raved about it. Thank you!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wayne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4788407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T21:10:12.583Z",
                "reviewBody": "These were delicious and easy! I used thick center cut pork chops. The needed to bake about 15 minutes before they were done. I will definitely make this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T16:29:05Z",
                "reviewBody": "A-MAZ-ING!!!This is my first time rating a recipe... and it's because this was so good. Would be a great holiday tradition meal but good anytime. I had no pine nuts so I substituted with chopped almonds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "reiteradair",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4944972/"
                }
            }
        ]
    }
]