[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
                    "name": "Pork Rib Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/995/meat-and-poultry/pork/ribs/spare-ribs/",
                    "name": "Spare Ribs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216985/tender-pork-spare-ribs/",
        "name": "Tender Pork Spare Ribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F608875.jpg",
            "width": 3956,
            "height": 2880
        },
        "datePublished": "2020-03-05T05:07:55.000Z",
        "description": "I saw a Celebrity Chef use this braising method for baby back ribs, so I decided to give it a try for pork spare ribs. I changed the seasonings and increased the cooking time and I have been very pleased with them every time. They're really tender and the meat is so flavorful that you don't have to add BBQ sauce unless you want to. My neighbor is the one who told me about the fajita seasoning, and she was right on!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P0DT16H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup brown sugar",
            "½ cup fajita seasoning (such as Fiesta®)",
            "2 tablespoons Hungarian sweet paprika",
            "2 racks pork spareribs, fat trimmed",
            "1 cup beer",
            "3 cloves garlic, minced",
            "1 tablespoon honey",
            "3 tablespoons Worcestershire sauce",
            "1 tablespoon prepared brown mustard"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix the brown sugar, fajita seasoning, and paprika in a bowl. Rub both sides of the pork spareribs with the brown sugar mixture. Place the spareribs in a 9x13-inch baking pan; cover and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 250 degrees F (120 degrees C). Whisk together the beer, garlic, honey, Worcestershire sauce, and mustard in a bowl. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Tear off 2 large sheets of heavy duty aluminum foil and lay them shiny-side down. Place a rack of spareribs on each sheet, meaty-side up. Tear off 2 more sheets of foil and place them on top of the ribs, shiny-side up. Begin tightly folding the edges of the foil together to create a sealed packet. Just before sealing completely, divide the beer mixture evenly into each packet. Complete the seal. Place the packets side-by-side on an 11x14-inch baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the ribs are very tender, 3 hours and 30 minutes to 4 hours. Carefully open each packet, and drain the drippings into a saucepan. You may only need the drippings from one packet. Set ribs aside. Simmer the drippings over medium-high heat until the sauce begins to thicken, about 5 minutes. Brush the thickened sauce over the ribs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the ribs back into the oven and broil until the sauce is lightly caramelized, 5 to 7 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Rib Recipes",
            "Spare Ribs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kerri Jaggers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.643504531722054,
            "ratingCount": 331,
            "itemReviewed": "Tender Pork Spare Ribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "943.3 calories",
            "carbohydrateContent": "37.4 g",
            "cholesterolContent": "240.5 mg",
            "fatContent": "60.6 g",
            "fiberContent": "0.7 g",
            "proteinContent": "58.4 g",
            "saturatedFatContent": "22.2 g",
            "servingSize": null,
            "sodiumContent": "701.5 mg",
            "sugarContent": "29.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-23T00:23:24.83Z",
                "reviewBody": "This was really good, but I didnt use fajita seasoning when i made it, or sugar. Instead i let it cook in a bit of cola.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "savina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4811488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T17:04:20.623Z",
                "reviewBody": "This is a fantastic recipe. Lots of flavor and the most tender, fall off the bone meat you'll ever cook. I followed the recipe exactly with the exception of reducing the sauce. I ended up with close to 2 cups of sauce after braising which took 20 min on medium heat to thicken up. The sauce was also VERY salty from 1/2 cup of fajita seasoning and I ended up adding about a 1/4 cup of brown sugar and a Tbsp of dijon mustard and it was perfect. **TIP** do not forgo the broil process, this gives the meat a nice sticky, caramelized coating that is the key to finishing the flavor of these ribs. One final thing, don't omit the fajita season (I used Fiesta brand), it helps to tenderize and lends lots of flavor. I will definitely be making these again and I think I'll try some liquid smoke next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "beesknees",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5356949/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-05T04:30:45.817Z",
                "reviewBody": "I used the basic outline of this recipe and it is to die for, I used McCormicks Sweet and Spicy rub  instead of fajita seasoning with the brown sugar, and bbq and mesquite grilling spices, and mojo crillo for the liquid, that was all, I used the juice at the end with 1 cup of BBQ sauce boiled and reduced before I broiled them, we werent even done with dinner before the kids asked when we were having them again.  I cant wait to try a brisket using this recipe as a guideline I finally did try it with the brisket, bake at 300 for 5 hours, it melts in your mouth, my husband and kids have asked for the brisket and ribs again and again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "reg410",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5204527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-28T01:46:38.18Z",
                "reviewBody": "Oh.  My.  God.  These ribs are to die for!!  I made them for Memorial Day weekend.  My son told me he was only going to have \"a couple\" because he had another bbq to attend.  He ended up eating a rack and a half and called his friend to say he would be late! My husband couldn't stop eating them either.  I made them exactly as written and I wouldn't change a thing!  They were the most finger lickin', fall off the bone ribs I ever had.  I loved them so much I went into my recipe box and threw out every other rib recipe I had in the house.  I cooked down the liquid as stated and it made an incredible sauce.  We were tasting it as it was cooking down and could barely leave it alone.  I highly recommend this recipe.  It is absolutely fabulous.  My only regret is I can't give it more than five stars.  I'd give it ten if I could.  Thanks so much for a fabulous recipe that my family will be enjoying for many years to come.  I can't wait to make them again....4th of July is coming up soon!  Seriously, try this recipe.  You won't be sorry.  I think the people who had problems weren't doing something right.  After they came out of the oven, I finished them off outside on the grill.  I used Sam Adams summer ale for the beer but I think any light color ale would work.  I wouldn't use Guinness or a dark beer.  I didn't find low sodium fajita mix.  I used Old el Paso regular and it was awesome!!  I didn't notice any salty taste at all.  Mmmmmmm, mmmmmm, GOOD!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joan Roberts Stamp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9351362/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-29T20:08:20.907Z",
                "reviewBody": "So disappointed. I followed the recipe as written. Smelled fabulous when baking (250 degrees 3 hrs. Took them out of the oven and unwrapped the foil in anticipation of tasting some fabulous ribs. Instead all I had were tough,inedible pieces of meat. Lots of time and money wasted here. I do not know what I did that made these turn out this way. I have reviewed the recipe again to see what I forgot but cannot find anything. I will have to throw these away. We were really looking forward to our rib dinner, too. Many have obviously had great success with this recipe but I am not sure that I will give it another go in the future or not. Well, that's the 'fun' of cooking and some you win and some you don't!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Leese",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4633058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-07T00:39:49.063Z",
                "reviewBody": "This recipe was pretty easy to follow, especially when it was my first time making ribs and I had only 6 hours to cook it.  So my review might help those who want to make ribs but have less than 7 hours.  I made it with three racks, and did not have time to refrigerate before cooking.  I had cut the racks to make four pans.  It did not affect the tenderness or taste.  I also did not use the garlic, honey or mustard since I was short on time and wanted to get the ribs in the oven so they could cook for the four hours.  After four hours I poured about a cup of the drippings with two cups of sweet baby rays in a sauce pan and boiled it down.  After flipping the ribs over, I brushed the ribs with the sauce and left the temp at 250 and repeated @ 3 times for @ 15 minutes.  I kept them in the oven b/c there were too many racks of ribs to move to the counter or top rack to broil or grill outside.  Also, people were hanging out in the kitchen (like they always do) and I didn't want to navigate around them to get to the grill.  I made the foil packets for the ribs, and put them in foil trays.  I think this worked better than the cookie tray since the juices from the ribs and beer sauce spilled out of the foil packets and would have have been hard to manage if they were in a shallow cookie sheet. Plus easy clean up! Hope my review helps shy rib cooks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "susan G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2210894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-03T02:28:34.687Z",
                "reviewBody": "Wow! These were the best ribs I have ever eaten! It takes a lot for me to really want to make a recipe again and this was honestly the tenderest, tastiest wrack of ribs I've ever eaten for such little work. I will never make ribs any other way again ever. I made a few minor changes and kept the method the same. I have a lot of spice blends from Penzey's so I decided to use a heavy dose of some Northwoods Fire mixed with a handful of brown sugar instead of the seasoning mentioned. Also, It is July and I did not want to heat up my apartment with having an oven on for 3 hours so I used my cusinart convection toaster oven and baked the ribs for 3 hours at 350 on the convection setting and they were meltingly tender beyond what I can describe to you. The meat had the most wonderful flavor that completely permeated it. Oh, also, I have something called a Deni meat tenderizer which I poked throughout the ribs after I rubbed it with seasoning so the seasoning really penetrated the ribs and I didn't give them any marinating time at all, I just put them in the oven right after covering with the spice rub. To finish, I did not use the pan juices because I felt that there was a lot of fat that drained off the ribs during cooking so I brushed a tad of Bullseye BBQ sauce which was voted the top store BBQ sauce from Cooks Illustrated. I finished under the broiler for about 10 minutes and these ribs were one of the best things I've ever made and I cook all the time.Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cuppycake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7066948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-19T17:14:40.303Z",
                "reviewBody": "very good and the whole family really enjoyed it even the neighbors. I did tweek it a little. I used wine instead of beer and spicy BBQ rub instead of fajita mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Dunkley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindagwynn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-04T17:49:43.367Z",
                "reviewBody": "Family loved them; glad I bought an extra rack of ribs while they were on sale! I forgot to save the drippings to make a sauce but the kids and hubby loved them anyway. Thanks for posting the recipe! Please note: many reviewers have commented that the sauce didn't thicken. I've had great success using a \"fat separator.\" It looks like a measuring cup and it has a spout that stems from the bottom of the cup. Simply pour all the gravy in and let it rest about a minute and the fat will float to the top. Pour the gravy into the pan but keep an eye on the separator and do not pour in the clear fat. Discard the fat but don't pour it down the drain or your pipes will clog. Your sauce will thicken I promise! Hope that helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Johanna WISHES she were a",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1041860/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "What's Cooking in Austin, TX?",
            "description": "What's cooking in Austin? Kerri's fall-off-the-bone pork ribs.",
            "uploadDate": "2011-08-04T06:05:01.712Z",
            "duration": "PT5M56.122S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F4621833d-7df2-4ffe-bbd5-11e3f1d2b111%2F58701ddb-674d-420f-9996-f1b4281a94a4%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1093072208001"
        }
    }
]