[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229054/chocolate-tres-leches-cake/",
        "name": "Chocolate Tres Leches Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1036211.jpg",
            "width": 975,
            "height": 1300
        },
        "datePublished": "2019-06-06T23:40:37.000Z",
        "description": "A chocolate version of a Mexican classic. This moist and delicious cake tastes like you spent all day in the kitchen but a boxed mix makes it so easy! For variety, you can add one tablespoon coffee-flavored liquor (such as Kahlua®) to your milk mixture or a 1/2 teaspoon of cinnamon to your cake batter.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "1 cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package Swiss chocolate cake mix (such as Duncan Hines®)",
            "1 ¼ cups chocolate milk",
            "½ cup canola oil",
            "3 eggs",
            "1 teaspoon instant espresso powder",
            "1 (14 ounce) can sweetened condensed milk",
            "¾ cup half-and-half",
            "¾ cup evaporated milk",
            "3 tablespoons unsweetened cocoa powder",
            "1 cup confectioners' sugar",
            "½ cup unsweetened cocoa powder",
            "3 cups heavy whipping cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 9x13-inch pan with butter and flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat cake mix, chocolate milk, canola oil, eggs, and espresso powder together in a large bowl with an electric hand mixer on a low speed until dry ingredients are moistened. Increase speed to medium and continue beating another 2 minutes; pour into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 35 minutes. Remove cake from the oven and allow it to cool in the pan until it is no longer hot to the touch. While the cake is still warm, poke lots of holes all over the cake with a small skewer or a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk sweetened condensed milk, half-and-half, evaporated milk, and 3 tablespoons cocoa powder together in a bowl until cocoa is mostly incorporated into the liquid; slowly pour the milk mixture evenly over the cake. Allow the cake to cool completely as the liquid soaks into it.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift confectioners' sugar and cocoa powder together in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat heavy whipping cream in a stand mixer on medium speed for about 1 minute. While continuing to mix, add sugar-and-cocoa mixture to the cream in 2 batches, allowing the first to incorporate before adding the second. Increase mixer speed to medium-high; beat until soft peaks form and the cream is thickened and spreadable. Spread chocolate whipped cream on the cake to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MrsFisher0729"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.872727272727273,
            "ratingCount": 55,
            "itemReviewed": "Chocolate Tres Leches Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "471.7 calories",
            "carbohydrateContent": "46.3 g",
            "cholesterolContent": "100.9 mg",
            "fatContent": "30.8 g",
            "fiberContent": "1.9 g",
            "proteinContent": "7.5 g",
            "saturatedFatContent": "13.7 g",
            "servingSize": null,
            "sodiumContent": "318.9 mg",
            "sugarContent": "32.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-09-30T19:23:40.777Z",
                "reviewBody": "This is a fabulous cake! Ever since I made it my family has been begging me to make it again. Love that. Very easy to make to which is always a plus. I couldn't find the Swiss chocolate cake so I ended up using Devil's Food. I realized when I was making it that my cake mix was 16 oz and not the 18.25 called for. I wasn't sure what would happen since it was a smaller box so I cut the chocolate milk down to 1 cup. It worked nicely. When I was making this my hubby and my boys were thinking it was going to be weird since you pour all the milks over the cake, but they all loved it. When I went to make the frosting I realized I only had 1 1/2 cups of cream so I had to cut the frosting in half :( Still really good. Hubby even went back for another piece later in the night, which isn't something he does with cake. Fantastic recipe! Thanks MrsFisher0729 :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-20T01:35:08.823Z",
                "reviewBody": "Delicious! I couldn't find a 18.25oz cake mix, so I used a 16oz mix, keeping the other ingredient amounts the same. The cake turned out perfect. Once I mixed all the milks together, it looked like it was way too much, but the cake managed to soak it all in. I ended up whipping the cream a bit too long and it was more of a mousse, but still tasty! I made this for a party and it disappeared in no time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "France C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/francecevallos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-13T22:25:49.517Z",
                "reviewBody": "DELICIOUS! I love the reg. version of Tres Leches Cake, so I knew this would go over well, and it did! I shared some w/ my mom and dad and they loved it too. I also could not find swiss chocolate cake mix, so I used devil's food. To make my life a bit easier, for the icing, I just beat together 2 cups of heavy whipping cream and a box of chocolate instant pudding, until thick, and spread that over top...perfect. This is a definite keeper~YUM! Thanks for sharing. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-14T10:05:20.94Z",
                "reviewBody": "The \"One Bowl Chocolate Cake III\" on this website is the cake mix I use to make this recipe! Also, for those not in America, I found a substitute for half and half: If you have heavy whipping cream and milk, you can make half and half by combining four parts whole milk with one part heavy cream. If you only have light whipping cream, use three parts whole milk and one part light whipping cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rgej",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4090316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-29T18:20:15.06Z",
                "reviewBody": "Everyone was \"wow\"-ed by this at our party.  Used the recipe off the back of the Hershey's Cocoa can for the dry ingredients instead of a boxed cake mix.  Left out the expresso powder, but did add 1T Kahlua to the milks.  Instead of half-and-half, just used the whole can of evap milk.  Cake texture and taste were GREAT.  Frosting great too and super easy/quick to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARNKITTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/177428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-16T21:22:54.13Z",
                "reviewBody": "I've made this for dinner parties three times and twice for my family. It's a delicious hit! Our friends and grandchildren beg for this divine cake (our daughters are always dieting but they always have a piece anyway). The only change I made was using a stick of melted butter in place of the canola oil (we like our butter around here). Sorry gotta go -- just getting another one of these cakes out of the oven for a party on Friday.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DeniseKantner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2886148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-01T13:15:15.027Z",
                "reviewBody": "I made this recipe for my husband who is from Guanajuato, Mexico, so he is our resident Latin cuisine expert. I make tres leches quite a bit and I wanted to try something a bit different. I couldn't find an 18 oz. box of ANY cake mix, so I went with a 16.5 oz. box of a fudge cake. I left all other ingredients the same. The cake came out good and the icing came out good. The ONLY thing that I will change for next time is the amount of liquid I pour over the cake. Normally, I put more, but I wanted to follow the recipe at least the first time. So, I did and my husband and I both agree that it definitely needed more liquid. Tres leches, typically, are not that dry. They are supposed to be a pretty wet cake. So, all I got was a moist cake, not a tres leches. Overall, a pretty good recipe. I will just need to adjust the amount of liquid.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MamaSanchez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12798615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-25T17:11:08.96Z",
                "reviewBody": "It was beyond delicious. I had made this for a food day in spanish class and it was a hit. The consistancy was unique but just added to the experience. The bottom was really moist and the milk congregated down there then the middle was cake texture the top was that moist cakey texture and the frosting tasted like chocolate mousse. YUM! Absolutley making it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SchrodingersCat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9072739/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-13T02:20:14.3Z",
                "reviewBody": "I tried this recipe for my Mom for mothers day because two of her favorite things are chocolate and tres leches and it was a big hit. I added a little bit of extra espresso and then some shaved dark chocolate on top to really add some flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pdavidson34",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11379207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-02T21:17:47.72Z",
                "reviewBody": "I gave this 3 stars because of the boxed cake mix it really took away from the delicious taste of the leches. Next time I will make my own batter and give it 5 stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8128830/"
                }
            }
        ]
    }
]