[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/472/main-dish/beef/corned-beef/",
                    "name": "Corned Beef Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/231030/braised-corned-beef-brisket/",
        "name": "Braised Corned Beef Brisket",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F03%2F10%2F995620.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-06-06T23:52:42.000Z",
        "description": "You have never had corned beef like this and if you try it, I truly believe you will never go back to the traditionally 'boiled' beef. This recipe was given to my mother-in-law during WWII by her Jewish boarding house owner and it has become a treasured family recipe. Unlike the commonly boiled corned beef, this is a slow braise that is tender, flavorful, and has a caramelized surface when it's done. I serve it with colcannon, steamed cabbage wedges, braised carrots, and parsnips. It is our favorite St. Patrick's/Jewish dinner, but we love it so much that I cook it year around.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT6H15M",
        "totalTime": "P0DT6H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (5 pound) flat-cut corned beef brisket",
            "1 tablespoon browning sauce (such as Kitchen Bouquet®), or as desired",
            "1 tablespoon vegetable oil",
            "1 onion, sliced",
            "6 cloves garlic, sliced",
            "2 tablespoons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 275 degrees F (135 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Discard any flavoring packet from corned beef. Brush brisket with browning sauce on both sides. Heat vegetable oil in a large skillet over medium-high heat and brown brisket on both sides in the hot oil, 5 to 8 minutes per side.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place brisket on a rack set in a roasting pan. Scatter onion and garlic slices over brisket and add water to roasting pan. Cover pan tightly with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast in the preheated oven until meat is tender, about 6 hours.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Corned Beef Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mauigirl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.823466092572659,
            "ratingCount": 929,
            "itemReviewed": "Braised Corned Beef Brisket",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "455.1 calories",
            "carbohydrateContent": "5.4 g",
            "cholesterolContent": "162 mg",
            "fatContent": "33.7 g",
            "fiberContent": "0.7 g",
            "proteinContent": "30.6 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "1877.4 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2017-03-20T01:06:48.917Z",
                "reviewBody": "I am the submitter and I wanted to give a few important tips here.....cover tightly or wrap the brisket tightly with foil and do not be tempted to check the status during the long braise.  You will lose too much steam and your brisket will dry out.There is very little water in this recipe because corned beef briskets are brined and have soaked in alot of water which will release during the cooking process. I cook a smaller brisket for at least five hours with the same terrific results. Another tip for those who find their brisket salty. Corned beef briskets are brined in salt water by the meat producers. The brining can vary depending on the salt solution and the length of time the brisket sits in the brine.  I have been fortunate to not find a too salty corned beef, but to be safe, you could soak the brisket in fresh water (refrigerated) for a couple days to extract some of that salt. Finally, for those who question the term braise and the small amount of liquid here......https://www.merriam-webster.com/dictionary/braise  I hope you enjoy this as much as we do. Luck o' the Irish to you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-27T20:47:35.88Z",
                "reviewBody": "Awesome recipe - Easy and so delicious! Thank you Mauigirl. This is a keeper for sure. After searing I placed the corned beef on a rack above the little bit of water - followed the instructions as stated - the wonderful aroma of this braising was not to be believed. I offered to set some aside for my daughter to take home to her corned beef hating husband and he absolutely loved it. I will have to make more tomorrow. Thank you! UPDATE I made this again last night. I got a really nice flat cut corned beef at Costco - very lean. I used about a tablespoon of the browning sauce. I triple wrapped the corned beef in heavy aluminium foil on a baking sheet. It cooked for about 5 hours at 275. We ate some for dinner and then I used a slicer to thin slice the rest for sandwiches. Perfection!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-08T22:43:02.463Z",
                "reviewBody": "Out o' Sight brisket recipe, Jules! I copycatted your menu exactly and oh what a treat! Like Baking Nana, I bought my flat cut brisket at Costco, followed your directions to a \"T\" with one tiny addition of more sliced garlic and onion just because onions and garlic are in their own food group at Cathy Myers' house! Flavorful, fork tender - the very best we've ever had! I will NEVER return to yukky boiled meat again! I found myself cutting off  chunks of the leftovers for a protein snack! Couldn't help myself! Randy got his Reuban sammie fix that's for certain! Thanks again for sharing, Julie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Myers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2079610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-17T03:14:12.963Z",
                "reviewBody": "Very delish recipe. I've never made a corned beef with this technique before. And it turned out soo well. I followed threw with braising and then utlizing my crockpot to bake in, only for the simple fact, I needed to bake other things at a higher temp then this recipe in my oven and didn't want to complicate matters. The crockpot worked out very well. The only thing I did slightly different and it wasn't really much. After braising the meat in the pan on the cooktop, I took the water and deglazed the pan and then added that deglazed mixture to the crock pot over the corned beef and followed threw with the rest of the directions. Added a head of cabbage during the last hour and a half, it was very flavorful. My beef was extra tender and was falling apart ;-) Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-25T16:37:45.583Z",
                "reviewBody": "OMG 10 stars! The best corned beef I have ever made. My husband who has had ALOT of corned beef in his life said it was hands down the best he ever had. My brisket was 3.25lbs and it was fork tender after 5 hours cooking. I love how it looked after browning it. I just used lots of pepper instead of the browning sauce. I cooked it fat side up and scraped the fat layer off and let it rest for about an hour before slicing. Still was piping hot. I put the slices back in the juices and served with my version of colcannon. Hubby said it was the best dinner he had in a long time. Thank you so much mauigirl for sharing this fabulous recipe. I don't understand the reviews that still prefer the boiling method. I can't wait for ruebens tomorrow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Missy Kitty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/missykitty/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-06T03:52:44.78Z",
                "reviewBody": "We sat down to eat, my husband took a bite and said \"yummmmm\". Then he looked at me and asked \"corned beef isn't usually this tender, or tasty\". He didn't even put mustard on it! Simple very tasty way to cook corned beef. I made a colcannon with saute cabbage as the side. I didn't have any kitchen bouquet, so I just lightly peppered it. I have another corned beef in the fridge, this is how I will cook corned beef from now on. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Flying A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2433553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-24T03:58:00.8Z",
                "reviewBody": "I added about a half cup of water to the pan before sealing tightly. After cooking, I removed corned beef and added several red potatoes, sliced in half to the pan drippings, covered with the foil and cooked until tender, about 45:minutes.  I sauteed my cabbage in butter and a little water until tender, then added the potatoes and drippings to the cabbage  and served with the corned beef.  Best corned beef and cabbage I ever cooked!  I was amazed how lean and tender the corned beef was.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sharonreason",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6629574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-12T17:06:27.177Z",
                "reviewBody": "This is a wonderful method for corned beef. I cooked the corned beef the day before then crusted it with dijon mustard & Brown sugar and put it back in the low oven just to warm it through and set the crust. It was perfection. Thank you for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GeoCarter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9748248/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-26T00:21:46.103Z",
                "reviewBody": "I rinsed and patted dry the flat cut corned beef brisket and coated it in Kitchen Bouquet, browned on both sides for 5 minutes each side.  I laid a sheet of heavy duty foil out flat and then placed another sheet crosswise.  I laid the browned brisket on top and added the onion, garlic, and 2 T. of water on the fat side. Making sure to keep the fat side facing upwards,  I closed the foil tightly and placed another piece of foil over the top of the brisket.  I placed on the rack of my preheated roaster oven and roasted for 6 hours.  Did not peek, turned oven off and allowed the corned beef brisket to sit for 30 minutes. Lifted the rack out - not a drop of the broth leaked out.  Delicious, moist and fork tender.  Loved it and very deserving of 5 stars.  I will never ever buy deli corned beef again!  Thank you, Mauigirl for sharing this keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JimmyandNancy Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shearone/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-21T16:38:15.820Z",
                "reviewBody": "Made two corned beef roasts for a family dinner - one traditional boiled, and this one.  Everyone preferred the taste of the traditionally cooked beef, and this one was a little dry - even though I watched and checked it regularly while cooking.  I agree with another reviewer that 2-3 tablespoons is too little water for \"braising\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Poirot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3698043/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Braised Corned Beef Brisket",
            "description": "Perfect corned beef brisket is super simple to make at home.",
            "uploadDate": "2015-07-16T20:33:55.259Z",
            "duration": "PT54.254S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6b63d476-3fea-41f0-9746-de91255f0639%2F8443f0c0-eae9-40a2-9cc5-ba953dee4d76%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4358618001001"
        }
    }
]