[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
                    "name": "Rice Side Dish Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17482/side-dish/rice/spanish-rice/",
                    "name": "Spanish Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/263330/instant-pot-mexican-rice/",
        "name": "Instant Pot&reg; Mexican Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5773272.jpg",
            "width": 3249,
            "height": 2885
        },
        "datePublished": "2019-06-07T07:52:37.000Z",
        "description": "This Instant Pot&reg; rice is a wonderful side dish for any Mexican meal.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon avocado oil, or more as needed",
            "½ medium onion, finely chopped",
            "2 large cloves garlic, minced",
            "1 cup long-grain rice",
            "1 ½ cups low-sodium chicken stock",
            "½ cup tomato sauce",
            "1 teaspoon salt",
            "¼ teaspoon ground cumin",
            "1 pinch cayenne pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Turn on a multi-functional pressure cooker (such as Instant Pot&reg;); select Saute function and adjust to medium. Cover the bottom of the pot with avocado oil. Cook and stir onion until soft, 4 to 5 minutes. Add garlic and cook until fragrant, about 30 seconds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add rice to the pot and mix until coated with oil and lightly browned. Pour in chicken stock; stir any browned bits off the bottom of the pot. Mix in tomato sauce, salt, cumin, and cayenne pepper. Close and lock the lid. Seal the vent and select high pressure function. Set timer for 7 minutes; allow 10 to 15 minutes for pressure to build.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Stir rice before serving.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Rice Side Dish Recipes",
            "Spanish Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Bren"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.235955056179775,
            "ratingCount": 89,
            "itemReviewed": "Instant Pot&reg; Mexican Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "224.6 calories",
            "carbohydrateContent": "41.1 g",
            "cholesterolContent": "1.5 mg",
            "fatContent": "4.1 g",
            "fiberContent": "1.4 g",
            "proteinContent": "5.2 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "787.7 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-09-10T09:03:03.13Z",
                "reviewBody": "I’ve made this recipe at least 10-15 times since May with success! Truly delicious go to for us. My husband even says it is one of the best Mex. Rice I’ve ever made and I agree…full of more flavor than I expected using the Instant Pot (IP)! I’ve subbed taco seasoning when out of cumin and have made this exactly as written too. Here are some tips for some who might be new to the IP as I was. #1 Rinse your rice. #2 Do not stir in the tomato sauce—recipe doesn’t say to do so, but you might be tempted out of habit. When I stirred, IP did not come to pressure and some rice was uncooked. I fired up pot for 3 additional minutes, but ended up with a very thin burned layer of rice on bottom of pot. No big deal, just remove the pot and cover it with foil. Cooked rice will lift off fine and some like the crisp part anyway. Barely any rice wasted from my own newbie error. You’ll just have to soak the pot a little to wash out what’s left…easy peasy. #3 Do not try to do natural release because you’re busy with other dishes. Texture change noted…still good though. #4 Chunky/Thick salsas do not seem to work as a sub. #5 If rice done and you think too much moisture, just leave it on keep warm and excess moisture will be absorbed by rice or evaporate lending to perfect fluffy and delicious Mexican Rice. End of story, make exactly as recipe instructs and you won’t be disappointed! Yum! Thanks again, Bren—I’ve been converted to making your rice in the IP! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SZYQ1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/szyq11/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-05-26T02:23:43.647Z",
                "reviewBody": "I am the submitter of this recipe and would like to address the issue that Adela had with the recipe. The \"Burn\" warning seems to be prevalent to the newer models and there are several possible causes. 1. The pot is too hot from sauteing,  should this happen in the future simply turn off the unit and wait a few minutes  2. The gasket in improperly inserted 3. There are bits stuck to the bottom of the pot 3. The pressure relief valve is stuck and releasing steam....I am sorry that this recipe didn't work for you, best of luck with future recipes:)\nI am responding to a question about the pressure on this recipe, there is an error in the instructions that I didn't catch...it should be high pressure, not low.  I'm sorry that this didn't work for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9292325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-03T09:14:10.467Z",
                "reviewBody": "This is the best Mexican rice recipe I've tried so far...outstanding! I should note, however, that I didn't have the chicken stock on hand. Instead, I replaced the 1 1/2 Cups of chicken broth with 2 Teaspoons of \"Better Than Bouillon\" dissolved into 1 1/2 Cups warm water. Also added 1 whole diced Serrano pepper. This is my go to Mexican rice recipe from here on out. The ingredient proportions and cook time were spot on, and I did NOT experience any burn issues whatsoever. To clarify one thing, I waited exactly 5 minutes AFTER engaging the  pressure release mechanism before opening the lid...flawless rice. Seriously. Release the pressure immediately after the 7 minute cook time, and then wait the 5 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Randy Frazee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17253807/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-11-27T08:54:54.507Z",
                "reviewBody": "I think the instructions are unclear.  Mine also came out with the burn message.  I was able to salvage it and put it on the stove.  I mixed in the tomato sauce when I was making it.  According to an IP troubleshooting blog I read, and another reviewer noted not to mix the sauce, don't mix the sauce because the liquid at the bottom needs to be thin.  What that means is that after you have mixed everything, pour the tomato sauce on top and don't mix it in, just let it float there, so the liquid on the bottom stays thin.  Next, I am unclear whether I cook on high pressure or low pressure?  I don't know.  I think the flavors are great, but the instructions are unclear for those of us who are not used to using an IP.  Mine is the newer model.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24641207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-12-30T05:09:39.433Z",
                "reviewBody": "This is a great recipe! I've made it multiple times now and the whole family loves it. For anyone who wants to use brown rice, the only change is to increase the pressure cook time to 28 minutes. I recommend letting the pot cool a couple of minutes after sauteing the onions and garlic to avoid the dreaded burn warning.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paul Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26544915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-08-08T10:57:38.063Z",
                "reviewBody": "I made this recipe according to the instructions the first time around. The base recipe was decent, but it was too wet and didn't have as much flavor as I hoped. \nMy grandmother is from mexico and used to make rice all the time. I took the base recipe and tweaked it a bit. \nI slightly browned the rice on the saute setting before adding the broth/sauce. I used bullion instead of chicken broth and reduced the amount of water by 1/2 cup. I added a tablespoon of onion powder and followed the rest of the recipe! Came out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "A.ma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25958180/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-09-21T07:00:30.87Z",
                "reviewBody": "This was perfect! The kids raved about this and asked for seconds. I did double it so we would have leftovers. It's a really mild flavor which is appealing since it didn't overpower what I served it with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sanzoe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sanzoe/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-11-25T07:45:12.587Z",
                "reviewBody": "I followed the recipe and the rice came out delicious. I will use it again. Took it over to the relatives as a side dish to their Mexican dinner they cooked and everyone loved it. As I recall it makes a lot of servings. Possibly if you're not cooking for lots of people cut it in half. Thank you Bren for such a great Mexican dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Silver Surfer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12968761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-05T06:06:01.003Z",
                "reviewBody": "While the rice was sauteing, I whisked all the other ingredients in a small bowl.  When the rice and onions  were golden, I added a half cup of drained canned pinto beans (all I had on hand, will use black next time) before adding the rest of the mixed ingredients. When I took the lid off I added a half cup of frozen corn with the chopped jalapeno in it from Presidents Choice. Stirred it up  and put the lid back on and by the time I had my salsa and sour cream out, it was ready.  Served with  beef fajitas.  Family approved and went back for seconds.  Will definitely make this again. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/messymudder/"
                }
            }
        ]
    }
]