[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
                    "name": "Beans and Peas",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/222667/dal-makhani-indian-lentils/",
        "name": "Dal Makhani (Indian Lentils)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1257894.jpg",
            "width": 1700,
            "height": 1502
        },
        "datePublished": "2019-06-17T22:11:10.000Z",
        "description": "Ever go to an Indian restaurant and wonder how they make those lentils? I hated lentils before I discovered Indian food. Then I scoured the internet to figure out how they achieved them, and through mixing and matching recipes and methods on videos, I've arrived at this recipe, which I think is pretty close. This version is very rich, but you can leave out the cream to make it lighter. Kasuri methi (fenugreek leaves) is almost impossible to find in the U.S., even in NYC, but it gives this dish something very special.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT4H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup lentils",
            "¼ cup dry kidney beans",
            "water to cover",
            "5 cups water",
            "salt to taste",
            "2 tablespoons vegetable oil",
            "1 tablespoon cumin seeds",
            "4 cardamom pods",
            "1 cinnamon stick, broken",
            "4 bay leaves",
            "6 whole cloves",
            "1 ½ tablespoons ginger paste",
            "1 ½ tablespoons garlic paste",
            "½ teaspoon ground turmeric",
            "1 pinch cayenne pepper, or more to taste",
            "1 cup canned tomato puree, or more to taste",
            "1 tablespoon chili powder",
            "2 tablespoons ground coriander",
            "¼ cup butter",
            "2 tablespoons dried fenugreek leaves",
            "½ cup cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place lentils and kidney beans in a large bowl; cover with plenty of water. Soak for at least 2 hours or overnight. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook lentils, kidney beans, 5 cups water, and salt in a pot over medium heat until tender, stirring occasionally, about 1 hour. Remove from heat and set aside. Keep the lentils, kidney beans, and any excess cooking water in the pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a saucepan over medium-high heat. Cook cumin seeds in the hot oil until they begin to pop, 1 to 2 minutes. Add cardamom pods, cinnamon stick, bay leaves, and cloves; cook until bay leaves turn brown, about 1 minute. Reduce heat to medium-low; add ginger paste, garlic paste, turmeric, and cayenne pepper. Stir to coat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir tomato puree into spice mixture; cook over medium heat until slightly reduced, about 5 minutes. Add chili powder, coriander, and butter; cook and stir until butter is melted.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir lentils, kidney beans and any leftover cooking water into tomato mixture; bring to a boil, reduce heat to low. Stir fenugreek into lentil mixture. Cover saucepan and simmer until heated through, stirring occasionally, about 45 minutes. Add cream and cook until heated through, 2 to 4 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Beans and Peas"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SOGOLONDJATA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5375,
            "ratingCount": 80,
            "itemReviewed": "Dal Makhani (Indian Lentils)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "389.6 calories",
            "carbohydrateContent": "37.1 g",
            "cholesterolContent": "47.5 mg",
            "fatContent": "21.5 g",
            "fiberContent": "15.6 g",
            "proteinContent": "13.2 g",
            "saturatedFatContent": "10.4 g",
            "servingSize": null,
            "sodiumContent": "420.2 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-05-20T15:34:48.03Z",
                "reviewBody": "My husband and I have made many different types of dal over the years, that were all great, but we will be making this dal makhani for now on.  It's absolutely delicious!!!  In fact my husband loved it so much he had leftover dal and brown rice for breakfast this morning, lol!\nI did make some minor changes to the recipe.  Instead of 2 Tbsp salt, I only added 1 tsp of salt and it was plenty enough, I may consider adding even less the next time I make it.  Also, in place of the butter and heavy cream, I used 2 Tbsp trans-fat free margarine and fat-free half and half.  And lastly, SOGOLONDJATA is right, fenugreek leaves are close to impossible to find state side.  I added 1 Tbsp fenugreek seeds in place of the leaves; the flavor is much more intense in the seeds, but they are much easier to find in an Indian spice market.  \nBe sure to remove the bay leaves, cloves, cinnamon (I left it whole; its easier to fetch out) and black cardamom before eating, especially if your serving to children.  Another thought ~ after toasting the spices, it would be fairly easy to wrap them in cheese cloth.\nThank you so very much for posting this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Shumway-Khan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1633587/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-31T00:53:20.943Z",
                "reviewBody": "I have to agree with cengelberg the recipe shown is far too salty. I made the recipe for 6 people and it called for 2 tablespoons of salt but change that to 2 teaspoons and you'll be fine. I also used canned kidney beans instead of dry so if you go my way be sure to drain the excess water after cooking the lentils and beans or you'll end up with dal makhani soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "takelondon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10846878/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-29T06:16:14.1Z",
                "reviewBody": "I think the recipe would have turned out great if much less salt was used. I adjusted the recipe for 16 people and it called for 1/3 cup salt. It was extremely salty. Tried to reduce salt by adding potatoes with minimal results. I would recommend at least halving the salt content and work up from there.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline Gelber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6606200/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-06T01:50:04.49Z",
                "reviewBody": "I also cut the salt - 2tsp works great.  I have most of these spices in my cupboard, but I was missing a few - didn't matter.  I also used ghee instead of butter, which is the magic answer for me.  Get it at Indian grocers, Trader Joe's, or make some clarified butter yourself.  It's worth it. Very rich and warm - and delicious with basmati rice.  Note:  I removed the bay leaves before eating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maria Baldridge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1517377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-10-01T22:18:34.313Z",
                "reviewBody": "My girlfriend made this for dinner after  a long day and mistakenly followed the recipe which calls for 2 tablespoons of salt. This recipe should be corrected or taken down. Recipes like this are why I refer to this site as the craigslist list of cooking. I blame this site, and it's users (Yeah I am talkin' to you AL, who gave this recipe 5 stars). If this site functioned properly it would allow users to moderate recipes so this type of error wouldn't occur.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Cameron Macfarlane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24306517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-26T22:22:36.177Z",
                "reviewBody": "Warning to anyone who wants to try this recipe: use 2 TEASPOONS salt - or even less and add as needed. The dish smelled and looked amazing and was absolutely delicious except for the extreme saltiness. Unfortunately I couldn't fix the doubled recipe and decided to dump the entire thing out. Will definitely try again some time soon with MUCH less salt - and will probably use kosher instead or regular salt. I had read the previous reviews and reduced the amount of salt but didn't realize by how much I should have reduced it by. I'm sure my next attempt will turn out great!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bhmnrhpsdy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13018637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-12T00:26:42.39Z",
                "reviewBody": "This dal makhani is awesome!!!  Of course, the salt in the recipe was just an oversight.  I used about 1 teaspoon and didn't miss it at all.  I didn't have any kidney beans, so I just used a few more lentils.  Also, I took note of another reviewer and added in one diced yellow onion that I browned and cooked with the cumin seeds.  \nOverall, I have a feeling that this will be a weekly favorite in my household.  It's very easy with tons of dynamic flavor.  Thanks for the new family favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wellgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12345167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-21T20:59:57.987Z",
                "reviewBody": "While it isnt the best indian recipe its by far the worlds best lentil recipe but I didnt use much salt.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Ann McFadden-Bogantes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14406061/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-25T00:43:33.067Z",
                "reviewBody": "This recipe was tried by my family during Phase 1 of South Beach. We did not use any of the optional ingredients and omitted the butter. We did add some butter flavor. We salt our meals at the table so I cannot remember how much salt we added. This is authentic Indian food with the raw form of spices. Chew carefully to keep from biting a clove etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Davisfam08",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10993594/"
                }
            }
        ]
    }
]