[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
                    "name": "Wraps and Rolls",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23954/korean-sushi/",
        "name": "Korean Sushi",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7217666.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-07-09T22:24:08.000Z",
        "description": "This is a Korean-inspired version of sushi that uses minced beef and canned tuna instead of raw fish. It's mouthwateringly delicious, but may take some practice.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "24 sushi pieces",
        "recipeIngredient": [
            "2 cups uncooked short-grain white rice",
            "2 cups water",
            "2 tablespoons cider vinegar",
            "2 leaves chard",
            "2 eggs, well beaten",
            "2 tablespoons soy sauce, divided",
            "3 tablespoons water",
            "1 onion, diced",
            "1 tablespoon vegetable oil",
            "¾ pound beef tenderloin, minced",
            "1 (5 ounce) can tuna, drained",
            "1 carrot, julienned",
            "1 cucumber, julienned",
            "6 sheets nori (dry seaweed)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan bring 2 cups water and cider vinegar to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes, until rice grains are sticky and soft.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, place chard in enough water to cover. Bring to a boil, and cook until tender. Cut into thin strips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk the eggs with soy sauce and 3 tablespoons water. Pour into a medium skillet over medium heat. Cook until thickened. Remove from heat and cut into strips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a medium saucepan over medium high heat. Slowly cook and stir the onion until tender. Mix in the beef and 1 tablespoon soy sauce, and cook until evenly brown. Drain and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Place the nori sheets on a medium baking sheet, and heat in the preheated oven 1 to 2 minutes, until slightly crisp.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the nori sheets, one at a time , on a bamboo rolling mat. Line the nori sheets evenly with approximately 3/4 inch (2 cm) depth of rice, taking care not to let the rice cover the edges of the nori. Beginning at one end of the nori sheet, top the rice with a stick of carrot, a line of tuna, chard, egg, a cucumber slice, and a line of beef. Repeat until the food reaches approximately the middle of the nori sheet. Roll the sheets carefully and tightly. Seal with a grain or two of the sticky rice. Slice each roll into approximately 4 pieces and serve.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Wraps and Rolls"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "sassyangelkiwi Donna-Maree Aus"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.157894736842105,
            "ratingCount": 19,
            "itemReviewed": "Korean Sushi",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "491.7 calories",
            "carbohydrateContent": "58 g",
            "cholesterolContent": "108.5 mg",
            "fatContent": "17.6 g",
            "fiberContent": "2.9 g",
            "proteinContent": "23.1 g",
            "saturatedFatContent": "6.3 g",
            "servingSize": null,
            "sodiumContent": "409 mg",
            "sugarContent": "2.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-14T16:47:57.123Z",
                "reviewBody": "This is not a very authentic recipe and the instructions are more complicated than they need to be. There is no purpose to baking the sheets of seaweed until slightly crisp since dry seaweed is already crisp. Just use the seaweek \"as is\" from the package and it will work fine. In addition to the cucumber you can use a yellow picked radish called dan mu ji (which you can easily find at any Asian grocery store but if you can't find this pickles are a good substitute). This ingredient is what gives the most flavor to the kim bap (seaweed rice) as it it traditionally called. If you don't add vinegar to the rice you can mix the already cooked rice with sesame oil and soy sauce to make it sticky. Finally you really should roll these with a bamboo mat (they're really cheap and can be bought at most grocery stores in the international food section) to get them really tight so they won't fall apart. These are one of my favorite things to eat but my husband hates them so we don't get many chances to make them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/213392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-28T00:02:23.39Z",
                "reviewBody": "Thank you Donna for this recipe!! It brings back fond memories of my mom, aunts, and me making these as a child. JAMIE IS INCORRECT.. THIS RECIPE IS INDEED AUNTHENTIC!!! My mother is Korean and her sisters and every household makes them all differently. She uses spinach instead of chard and seasons the rice with sesame oil and salt and sometimes vinegar, depending on her mood. The seaweed (Gheem) is sometimes placed over the burner to make them more green and crispy. They were rolled like \"California Rolls\". She also added a yellow colored radish called \"Da Kuan\" which were cut into strips. I will post a picture soon. Thank you again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LucyDelRey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1349933/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-27T14:26:16.423Z",
                "reviewBody": "Like many dishes in Korea each family does their own thing.  We like to put strips of fried egg, spam, fish cake, etc.  We do put the radish in it every now and then.  I particularly do not like the pickled radish, because it is such a strong flavor.  I have put in carrots and beef.  I use spinach instead of the chard as well.  I do not bake the seaweed (Kim), and I do not use it directly from the package.  I find it not crispy rather more chewy that way.  I like to brush a little sesame oil on the leaves and just heat is over a burner until it's cripy, but not too crispy so you wouldn't be able to roll it.  Also, the bamboo mat is a must have tool when making kim bap. This is a favorite dish for my 9 year old.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mia Somerville Honaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/970458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-04T10:19:41.25Z",
                "reviewBody": "Oh my goodness! This dish is absolutely authentic and regular pickles are not a good substitute for pickled radish. I'm half Korean and this is exactly how my mom would make it except for some of the ingredients and baking the sea weed sheets. My mom and her friends would trade off making Kim-bab because it is time consuming to make and they all made it differently. They usually make 25-50 rolls at a time and made it an all day event talking away in the kitchen sometimes. You can change up some of the ingredients or use the ingredients in this recipe as well. Mom usually uses cucumber fish cake spinach carrots eggs pickled radish AND SPAM. Most people never think of spam to go in this but it's great and you would never know spam is there. Some of her friends used hotdog Bul-gogi or imitation crab as well. You don't have to use the pickled radish but it really does add to the recipe and flavor. For some though it's an acquired taste. Instead of the Chard leaves you can substitute spinach and drizzle sesame oil salt pepper sesame seed garlic powder to season it. I don't care for when she makes the rice with vinegar but instead drizzle sesame oil and sprinkle sesame seeds and fold the rice. With the remaining pickled radish you can add cucumbers splashed with vinegar a little sugar and red pepper flakes and make a pickled radish kim-chi to eat with your Kim-bab.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~~~CateringCook~~~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1812144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-20T20:19:46.24Z",
                "reviewBody": "I'm full Korean - born and raised in America - and this is not very authentic. Canned Tuna Or usually any kind of tuna is not used in Korean sushi and baking is not necessary for the Nori using as is out of the package is fine. Other than that everything else would be great except using chard usually we use spinach. Other than that an average sushi dish. Wouldn't recommend it though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Ashley Choi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2805215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-21T18:27:23.87Z",
                "reviewBody": "This recipe was given me by my dear friend Sunyoung (spelling) who was an exchange student from Korea who taught me how to make it. So i can honestly say that this recipe IS AUTHENTIC!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyangelkiwi Donna-Maree Aus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/70062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-27T18:24:10.943Z",
                "reviewBody": "I have lived in Korea for 3 years. Right now I eat tuna kimbop almost every day for lunch and it DOES have canned tuna in it. In all the restaurants. So to the full Korean who was born in America you need to visit Korea before criticizing the writer of the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4247749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-18T20:51:28.807Z",
                "reviewBody": "My mom brushes sesame oil lightly salts then toasts the nori sheets over a gas burner. The toasted sheets were then quartered into small sheets and eaten as a \"side\". This process really brings out the flavor (sort of like toasting nuts). Her rolls are made with untoasted nori bulgogi egg fish cake spinach salad pickled radish and sometimes julienned carrots or korean cucumber salad... I think the ingredients vary depending upon what is on hand or in season. This is a recipe that can be modified to suit your taste and to use up leftovers... Very versatile.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DekalbEpicurean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3088023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-02T23:03:56.64Z",
                "reviewBody": "This is pretty close to the kim bop my exchange student made for us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Catherine Garretson-Bilnoski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1113886/"
                }
            }
        ]
    }
]