[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17187/main-dish/chicken/chicken-piccata/",
                    "name": "Chicken Piccata Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8853/chicken-piccata-ii/",
        "name": "Chicken Piccata II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F362075.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-04-24T19:08:06.000Z",
        "description": "Lemony flavored chicken with a heavenly coating. Prepare this dish and get ready to have your tummy 'touched by an angel'!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breasts",
            "1 egg",
            "3 tablespoons lemon juice",
            "¼ cup all-purpose flour",
            "⅛ teaspoon garlic powder",
            "⅛ teaspoon paprika",
            "¼ cup butter",
            "2 teaspoons chicken bouillon powder",
            "½ cup boiling water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, beat the egg together with 1 tablespoon of the lemon juice. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a shallow bowl or dish mix together the flour, garlic powder and paprika. Dip the chicken in the egg/lemon mixture, then in the seasoned flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, melt butter/margarine and brown the coated chicken pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve the bouillon in the boiling water, then add the remaining 2 tablespoons of lemon juice. Pour liquid into skillet. Cover and let simmer for 20 minutes, turning chicken pieces after 10 minutes, until chicken is tender. Garnish as desired and serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Chicken",
            "Chicken Piccata Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TERRY C"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4118507681053405,
            "ratingCount": 1367,
            "itemReviewed": "Chicken Piccata II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "276.3 calories",
            "carbohydrateContent": "7.6 g",
            "cholesterolContent": "138.5 mg",
            "fatContent": "15.4 g",
            "fiberContent": "0.3 g",
            "proteinContent": "25.9 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "539.3 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-25T23:34:23.243Z",
                "reviewBody": "This was Terrific!  I made a few changes based on other reviews: Pounded the chicken, then floured it lightly (with plain flour), dipped it in the egg mixture then dipped it into the flour mixture.  I browned the chicken in butter and olive oil until done and placed them on a cookie sheet in the oven (250 degrees to keep warm) when they were done.  While they were in the oven, I made the sauce.  I doubled the recipe, brought it all to a boil (I added a little sugar, 1 tsp... helps cut the sour of the lemon), then added a little bit of cornstarch mixed with water to help thicken it.  I added the chicken right before serving... just long enough to coat it.  That way the breading didn't get soggy.  Everyone raved... it tasted like the one I order at my favorite restaurant!  Thank you Terry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cristy Basso Short",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2233136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-26T14:48:35.467Z",
                "reviewBody": "The first bite my wife took she looked at me and said ‘oh, you will be making this again’!  This came out just fine.  I modified the original some however.  I added lemon zest to the flour mixture.  I fried the chicken medallions (I cut the breasts in half) in olive oil and butter.  I also decided to use low sodium chicken broth instead of the bullion granules. I added 1 cup of white wine (doubled the sauce recipe) to the broth as well.  After adding the sauce mixture to the chicken, I used a bulb baster to siphon some of the sauce/broth off so the chicken was not completely submerged.  I simmered this extra sauce in a separate pan, also adding some lemon zest and cornstarch to thicken it (remember to mix the cornstarch in a small bowl w/cold water before adding to the hot liquids – otherwise the cornstarch will just pill/ball up and not dissolve).  I also added some to the chicken pan as well.  I added some capers to both the chicken pan and the saucepot too.  Finally, before serving I sprinkled some lemon zest on each of the medallions.  It was just great!  Many of my modifications were from other suggestions found here.  This is a great recipe to try.  Since you are zesting the lemon, try to use the fresh squeezed lemon juice.  Nothing compares!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UZIMIKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/195891/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-28T11:31:45.493Z",
                "reviewBody": "Just a quibble, but the dipping in egg first makes this dish \"chicken franciais\" and not \"chicken piccata\".  It's a minor change, but hey - it's cooking.  Chicken piccata is dredged in flour - no egg.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Deirdre Wingell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2249469/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-28T12:59:48.457Z",
                "reviewBody": "This is a good recipe, but, it would have been better if a Pinot Grigio wine was used with a good chicken stock and 2 tablespoons of capers were added. Chicken should be removed from pan and kept warm, then added back to sauce until thickened.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kris Sanders",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2227837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-01T20:11:49.28Z",
                "reviewBody": "This was a basis for a great meal and with the suggestions of many others it came out a five-star meal!  I doubled the flour mixture and dipped in the dry mixture, then wet and dry; fried the chicken in olive oil; added a half cup of white cooking wine to the broth mixture; and then added about 2 tbl. of capers while simmering.  I also used the reduced sodium chicken bouillon powder to cut down on the salt.  Absolutely fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HUCKABUCK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/812958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-28T00:33:06.703Z",
                "reviewBody": "I thought this was great and will definitely make it again.  I too refrigerated the chicken in the breading for about a half hour as some suggested it helps the chicken keep it's coating.  I also added fresh chopped basil to the top as a garnish and it really helped the flavor.  I put in a clove of garlic into the sauce and doubled the sauce to poor over the pasta.  The dish was a bit bland, but still very good.  May try some other variations next time.  Awesome on angel hair pasta!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janet Dufour",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/377747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-21T18:15:19.45Z",
                "reviewBody": "The reviews for this recipe were very helpful, and the final product was delicious. I pounded the chicken breasts, then floured lightly with AP flour, dipped in the egg mixture, then in the flour mixture before sauteeing, After the chicken was cooked, I kept the breasts warm in a 250 degree oven. I doubled the sauce recipe as others suggested, and added 1 tsp. sugar, and 1 tbsp water mixed with 1 tsp cornstarch to the sauce. I added the warm chicken to the sauce in the skillet just before serving - not soggy at all. Good recipe, great reviewer suggestions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb A.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2377088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-02T21:51:51.827Z",
                "reviewBody": "OH MY!! YUM!! I made this for dinner last night and my boyfriend and I LOVED it! I am not a big chicken breast lover but these came out so tender! I used the chicken bouillon (some have tried the broth but I had it in my kitchen) but almost tripled the sauce recipe because I served it with angel hair on the side. I double coated the chicken with the flour as others suggested and even added slivers of fresh garlic to the pan while the chicken cooked (omitting capers because not a fan). To make the dish a little healthier I cut down on the butter and used some cooking spray. To keep the chicken from sticking I gradually spooned the sauce to the pan. This dinner was light easy and YUM!! I am definitely making this again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RELLAESQUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/463663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-23T21:20:17.717Z",
                "reviewBody": "Super yum! This was FANTASTIC. As far as piccata goes, this is probably the BEST I've ever made! Having said this, I did make a few \"tweaks\" which I feel enhanced the outcome. To start, I generously seasoned each chicken cutlet (I used thin cutlets instead of breasts) with s&p. In addition to the seasoned flour called for, I first dredged my chicken in plain flour, then dipped it in the egg / lemon wash and finally in the seasoned flour. I sauteed my chicken in a couple T of EVOO on medium-high heat and then set it aside (no oven) while I made the sauce. I deglazed my pan with 1/4 c. Pinot Grigio and to this, I added the juice of 2 lemons (FYI, a medium-sized lemon yields ~ 2-3 T juice - I used 5 T total), 2 T (drained) capers, 1/2 c. chicken broth and 2 T unsalted butter. To finish, I added my chicken, covered my pan and simmered on low for 20 minutes as directed (NOTE: the floured breading will help thicken your sauce, but you need to get past the ever so slightly soggy texture to allow it to work it's magic). Looking back, my only regret is not doubling the sauce. It was SOOOO incredible!!! I was literally lickikng my plate, hoping more would magically appear. :) Served with oven roasted red potatoes (Donna Lasater) and crusty Italian bread, this was an AWESOME meal. Thanks for sharing, TERRY! :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            }
        ]
    }
]