[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
                    "name": "Lemon Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11569/lemon-meltaways/",
        "name": "Lemon Meltaways",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F649153.jpg",
            "width": 3872,
            "height": 2592
        },
        "datePublished": "1999-05-07T03:41:24.000Z",
        "description": "These frosted lemon cookies are a delicious refrigerator cookie, and they are quick and easy to make.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "¾ cup butter, softened",
            "⅓ cup confectioners' sugar",
            "1 tablespoon lemon juice",
            "1 teaspoon lemon zest",
            "1 ¼ cups all-purpose flour",
            "½ cup cornstarch",
            "¾ cup confectioners' sugar",
            "¼ cup butter, softened",
            "1 teaspoon lemon juice",
            "1 teaspoon lemon zest"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together 3/4 cup butter and 1/3 cup confectioners' sugar until smooth. Stir in 1 tablespoon lemon juice and 1 teaspoon lemon zest. Combine the flour and corn starch, and blend into the lemon mixture to form a soft dough. Divide dough in half, roll each half into a log about 8 inches long and 1 inch in diameter. Wrap in plastic wrap and refrigerate for 2 hours, or until firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Cut each roll into 1/4 inch slices and place onto the cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 8 to 12 minutes, or until set. Cool completely before frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, blend together 3/4 cup confectioners' sugar, 1/4 cup butter, 1 teaspoon lemon juice, and 1 teaspoon lemon zest with an electric mixer until smooth. Frost cookies and allow to dry before serving or storing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Lemon Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan Lewis"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8714285714285714,
            "ratingCount": 70,
            "itemReviewed": "Lemon Meltaways",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "61.5 calories",
            "carbohydrateContent": "6.5 g",
            "cholesterolContent": "10.2 mg",
            "fatContent": "3.9 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.4 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "27.5 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-14T20:11:17.06Z",
                "reviewBody": "These are my all-time favorite cookie and I've probably made 30+ batches of them over the years, always to rave reviews and requests for the recipe (which I forgot today so I'm on the site printing a copy).  I do make a few minor recipe modifications.  Ingredients: use FRESH lemon juice and up the amount of lemon zest in the dough.   This provides extra lemon flavor.  The icing also requires 1 Tablespoon of FRESH lemon juice (and more zest) and some additional confectioners’ sugar to obtain the right consistency / taste.  How much additional will vary based on the humidity in the air, but start with 2 additional tablespoons and go from there.  (I made these yesterday while it was pouring rain and it required 4+ additional tablespoons)  Technique:  For the dough, beat the butter very well by itself before adding the additional ingredients. The cookies are extremely delicate when hot but firm up nicely as they cool.  I leave them on the cookie sheet for a few minutes before moving to the cooling rack and have no problems with crumbling.  It should be noted that these cookies will not brown as most cookies do - if you wait for browning, the cookies will be overcooked / burnt.  For easier transporting, frost cookies and leave on the cooling rack overnight.  The icing firms up and you can pack them with wax paper between layers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alt243",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2462501/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T22:55:18.937Z",
                "reviewBody": "I have made these three times now. The first time I followed the recipe and thought \"I'll never make these again!\" They were awful! The icing tasted like pure butter. I made then a 2nd time though doubling the recipe so I could make larger cookies. I used a simple powdered sugar milk and lemon extract icing that I painted on the cookies. Much better. Today I made them again but I rolled the dough \"logs\" in sugar before refrigerating and used no other icing. They turned out very good and were easier since there was no icing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KGAVEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/528317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-05T21:39:25.04Z",
                "reviewBody": "These are excellent cookies!  Tender, melt in your mouth citrusy bursts of flavor that dance on your tongue... and an EASY recipe.\nWe favor lime over lemon, so I made with lime instead.  I adjusted the recipe for 65 via the calculator and the only other change I made was to add 4 drops of lime oil to the dough, and to add 2 drops lime oil and 1/4 tsp coconut extract to the frosting.  Per PP, I added ALL the zest from 1 lime to the dough.\nI see a lot of folks had trouble with cookies crumbling.  Be sure you sift your flour before measuring as that alone can make a big difference in the outcome.  I also bake all my cookies on parchment paper, which I then transfer, paper and all, to the cooling rack after allowing them to cool on the cookie sheet for 10 minutes.  While the recipe was adjusted for 65 cookies, it actually  made 25.  But that is fine for me, if I made more then I would eat all of those too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "goodfood4ursoul",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3010792/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T14:09:32.373Z",
                "reviewBody": "These were TERRIBLE!!!!!!!  They break into a miilion pieces when taken off the cookie sheet--and I was very careful with them!!  Then, they tasted TERRIBLE!!--like lemon juice mixed with cornstarch--YUCK!!  I understand they are to be like a shortbread-type-texture, but I've NEVER had cookies or shortbread break into a million pieces like that before!!!!! AWFUL!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "STREETANGEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/679875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-08T19:39:27.003Z",
                "reviewBody": "I read all the reviews about how hard they were to make because of the crumbling. So when I made mine I was very careful when rollign the dough to ensure no cracks or air pockets. chilled slightly then rolled again (used the plastic wrap when rolling both times). I was also very careful when baking. I used the air-insulated cookie sheet and baked 10 minutes. Waited a minute or two before using a thin metal spatula to carefully transfer to the cooling rack. No problems at all with breakage. I added a little extra sugar to the dough. I did use a tad extra lemon zest and fresh lemon is a must for the juice and zest. I also sprinkled some zest onto the top of the frosted cookies. Taste was amazing. A 1.5\" roll makes a good sized cookie (1-2 bites). One batch made 40 cookies and when I took them to a meeting people couldn't keep away--6 of us polished them all off by noon. Will make again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara Peterson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2450132/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-20T21:46:47.153Z",
                "reviewBody": "These are among my family's favorite cookies. They taste best when made with organic ingredients. There is a huge difference in taste between organic lemons and cornstarch and regular versions of these ingredients. Also I put the frosting in a plastic bag then cut of the tip and pipe a little dab on the top of each cookie. It's much easier than frosting them and looks nicer too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ASHLEY_S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/897131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-21T17:47:01.397Z",
                "reviewBody": "These are really delicious! No problem with crumbling if you let them sit on the baking sheet for a few minutes before moving them to a cooling rack - also, don't overcook them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jackson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1819845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-14T12:30:31.23Z",
                "reviewBody": "These are very tasaty and simple enough to make. The dough does get very firm when refrigerated. As a result, I ended up cutting the cookies a little thicker than suggested to keep them from crumbling. DH and I enjoyed these very much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-09T03:12:43.22Z",
                "reviewBody": "I made the cookies as written and they were pretty plain tasting on their own which was fine because of the addition of icing. Left them to cool completely on the cookie sheets and then crumbling was not a problem at all. I don't care for buttercream icing however so I made a lemon icing using tbsp lemon juice 3/4 cup icing sugar and 1-2tbsp milk until I got a runny texture. It was quite tangy (which I wanted) and hardened up perfectly! We'll make more for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linds",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825479/"
                }
            }
        ]
    }
]