[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
                    "name": "Seafood Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13297/main-dish/seafood/halibut/",
                    "name": "Halibut",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15409/almond-crusted-halibut-crystal-symphony/",
        "name": "Almond-Crusted Halibut Crystal Symphony",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4520458.jpg",
            "width": 3024,
            "height": 3341
        },
        "datePublished": "1999-12-30T22:23:36.000Z",
        "description": "When you're done this halibut dish melts in your mouth! The credit goes to my future mother-in-law! If you can find creme fraiche you may substitute it for the heavy cream.  Each filet should be between 3/4 and 1 inch thick.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "⅓ cup dry white wine",
            "2 tablespoons cider vinegar",
            "2 tablespoons minced shallots",
            "1 sprig fresh thyme",
            "1 bay leaf",
            "⅓ cup heavy cream",
            "10 tablespoons unsalted butter - chilled, cut into tablespoon-size pieces",
            "3 tablespoons chopped fresh chives",
            "2 teaspoons fresh lemon juice",
            "salt and pepper to taste",
            "6 (6 ounce) fillets halibut",
            "2 tablespoons vegetable oil",
            "1 tablespoon unsalted butter",
            "¼ cup fresh bread crumbs",
            "⅔ cup minced blanched almonds",
            "1 tablespoon unsalted butter, melted",
            "1 egg, lightly beaten"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Make beurre blanc: In a small saucepan over medium heat, combine wine, vinegar, shallots, thyme and bay leaf. Boil until liquid has evaporated. Stir in cream, and boil until liquid is reduced by half; decrease heat to low. Whisk in butter, 1 piece at a time, adding each new piece before previous one has melted completely. Do not allow sauce to simmer, or it may separate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain sauce through a fine sieve into a heatproof bowl. Stir in chives, lemon juice, salt and pepper. Keep warm by setting bowl in a larger container of hot water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven on broiler setting. Pat fillets dry, and season with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil and 1 tablespoon butter in a large skillet over medium-high heat. Saute halibut fillets for 2 to 3 minutes on each side, or until lightly browned, and just cooked through. Transfer to a baking sheet, and cool 5 minutes. In a small bowl, stir together bread crumbs, almonds and 1 tablespoon melted butter. Brush tops of fillets with egg, and spread with almond mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Broil fillets 1 to 2 minutes, or until browned (watch closely - every broiler has its own personality!). Place fillets on individual plates, and spoon beurre blanc around it.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Halibut"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan W."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.771929824561403,
            "ratingCount": 456,
            "itemReviewed": "Almond-Crusted Halibut Crystal Symphony",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "612.7 calories",
            "carbohydrateContent": "8.1 g",
            "cholesterolContent": "164 mg",
            "fatContent": "45.6 g",
            "fiberContent": "2 g",
            "proteinContent": "40.9 g",
            "saturatedFatContent": "19.7 g",
            "servingSize": null,
            "sodiumContent": "149.2 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-11T15:35:32.95Z",
                "reviewBody": "I love this receipe and play with it each time I make it. My suggestions: (1)Timing is everything so I have all sauce ingredients pre-measured in small dishs ready to go. (2) Use more heavy cream in the sauce. Don't think you can use too much. (3) Use very fresh chives. (4) I prefer to finish the fish on the grill, versus the broiler. To do so, this is a 2 person receipe, so the fish and sauce finish at about the same time. (5) I'm partial to Jasmine rice on dishes with great sauces and it works well here. Just be sure to add some other vegetables for serving \"color\" to balance the appearance of the plate. Finally, don't worry about fat and calories. I do a long workout the next day everytime I make this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GUYCHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-04T07:27:20.903Z",
                "reviewBody": "I used fat free half and half because I had a little left in the fridge that I didn't want to go to waste. Delicious!!! Looking over the recipe I was a little intimidated but it really was pretty easy. What I did to make it easier for myself was to separate out the ingredients. In one section were the ingredients to make the sauce then in another section were the ingredients to finish the sauce and in the last section were the ingredients to bread/crust the fish. Working through the recipe in sections like this made it way easier... Also before turning any stoves or broilers on or even before taking anything out of the fridge - mince your almonds and shallots. Oh and follow the part where it says only one or two minutes in the broiler.. I left mine in longer and burned some of the breading.:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rocks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1764721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-21T11:41:57.14Z",
                "reviewBody": "To be honest, I couldn't figure out what all the fuss was about when I read this recipe - it seemed pretty bland. Well, I made it tonight and my husband and I could not believe how incredible it was. I used Chilean Sea Bass and served it with rice pilaf and steamed cauliflower. Next time, I will double the sauce to serve over top of the vegetables although that will send the caloric content of this one over the top. But it will be worth it! DO TRY THIS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BDEGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-15T23:50:36.78Z",
                "reviewBody": "Wow. YUMMY recipe! I'm glad I read the other reviews simply to know to double the sauce and to have all the ingredients prepped (it helps IMMENSELY). I also changed the recipe a tad to make it more \"diet friendly\" by using fat free half and half instead of heavy cream used only the egg white for brushing the halibut and I substitued Brummel and Brown spread for the butter (I also cut the 10T down to 5T for the sauce). While I don't know what the original recipe tastes like my husband daughter and I all loved this with the exchanges! PS it's also EXCELLENT when prepared with chicken if you're not a big fish eater.... Bon Apetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHAYESMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/237993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T19:52:42.16Z",
                "reviewBody": "Presentation is nicer than this actually tastes. Was very easy to make. Toughest part was spooning the almond mixture on top; and that wasn't a big deal at all. It took an hour and 10 minutes; start to finish. I will make again. However will definitely use half the shallots 1/2 the vinegar and 1/2 of the butter. The shallots were overwhelming the sauce had sour undertones from the vinegar and I really don't think all 10 TBSPS butter was necessary either. Will BRUSH ON the oil/butter mixture and BROIL the fish (to save cleaning another pan) without the crumb topping and use the same pan to finish with the crumb topping. I think this is worth trying again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-13T02:55:51.2Z",
                "reviewBody": "Incredible! As per other's advice I used Tilapia instead of Halibut ( 6.99 per pound versus 16.99 per pound for the Halibut)and saved a bunch without sacraficing any taste. Watch out - the sauce is incredibly time consuming but well worth it in the end. You'll probably need an extra pair of hands (like your hubby) to pull this one off. I served this over white rice from the rice cooker and balsamic asparagus. Give 30 minutes to make the sauce counting on starting the fish with your \"extra hands\" after about 25 minutes. Definitely keep the sauce in a bowl surrounded by hot water - this trick really worked. DOUBLE THE SAUCE RECIPE!!!! You'll regret it if you don't - the recipe doesn't make much and you'll especially want more if you serve with rice. I made this for 5 people doubled the sauce and used it all. Thank you so much for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LWYANCEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1126346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-04T00:47:53.34Z",
                "reviewBody": "FIVE STAR RECIPE IT DID NOT TAKE THAT LONG TO PREPARE EITHER I THINK THE KEY IS TO HAVE ALL OF THE INGREDINENTS READY TO GO BEFORE YOU START COOKING. MY HUSBAND AND I LOVED THIS..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AGENTROCKWELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/193782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T20:11:39.147Z",
                "reviewBody": "Fantastic flavors. To lighten the sauce I added only 4 tbls of butter. Next time I will add less shallots (maybe 1 tbls) to help lighten the onion flavor since using less butter made the flavor very pronounced. We still liked it but some people might find it overwhelming. I think I will add a little more cream as well to help extend the sauce. I happened to have some chive cider vinegar that I used in place of chopped chives. I left out the lemon juice since some other reviewers had mentioned it was tangy enough without it and I agree with them. I don't think the sauce needed it. I didn't have any bread crumbs so I just used the minced almonds and egg for the topping. This worked fine. I really liked how the topping hardened and helped keep the fish moist while it broiled. It took about 7 minutes for my topping to brown and I had been concerned that my fish would be overdone. Not to worry the topping did the trick. The fish was perfect. Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATIEVIVIAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/923002/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-12T22:25:17.89Z",
                "reviewBody": "This is the best recipe I have ever used. Tasted like a 5 star french resturaunt. A little time consuming but worth it. Excellent!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOPFEUFFER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/573686/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Almond Crusted Halibut Crystal Symphony",
            "description": "29 JUN - ALmond Crusted Halibut Crystal Symphony - APPROVED",
            "uploadDate": "2013-07-19T19:25:10.953Z",
            "duration": "PT3M12.208S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe6cd9107-05db-4172-ac93-a0842901dcc3%2F6d48f0f2-3a4c-47ad-8fb0-d8721ba96388%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2555474376001"
        }
    }
]