[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17931/jesse-and-steves-fresh-strawberry-cake/",
        "name": "Jesse and Steve's Fresh Strawberry Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F617903.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-05-10T22:56:19.000Z",
        "description": "This moist, not-too-sweet strawberry cake is covered with tart lemon icing and sprinkled with toasted slivered almonds.  I served it after dinner with fresh coffee, and it my friends went wild for it.  I like to use turbinado (raw) sugar because it is more flavorful and less processed than white sugar, but white sugar should work fine, too.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "½ cup butter, softened",
            "1 ¼ cups turbinado sugar",
            "2 eggs",
            "1 ½ teaspoons vanilla extract",
            "½ teaspoon salt",
            "4 tablespoons sour cream",
            "1 teaspoon baking soda",
            "1 cup mashed strawberries",
            "1 ½ cups all-purpose flour",
            "2 tablespoons butter, softened",
            "1 cup confectioners' sugar",
            "1 tablespoon milk",
            "1 tablespoon fresh lemon juice",
            "1 teaspoon grated lemon zest",
            "¼ cup toasted slivered almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together 1/2 cup butter and the turbinado sugar. Add the eggs, and beat for 1 minute. Stir in the vanilla and salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together the sour cream and the baking soda until the baking soda has dissolved. Add the sour cream mixture and the flour to the egg mixture. Beat well, then stir in the mashed strawberries.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the batter into the prepared pan. Bake in preheated oven for 30 minutes, or until top springs back when lightly touched.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While cake is cooling, make the icing:  Cream together 2 tablespoons butter and confectioners' sugar.  Add the milk, lemon juice, and lemon zest, and beat until smooth. Spread icing on warm (not hot!) cake, and sprinkle with slivered almonds.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KUNGFUKAREN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3630573248407645,
            "ratingCount": 157,
            "itemReviewed": "Jesse and Steve's Fresh Strawberry Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "151.8 calories",
            "carbohydrateContent": "22.1 g",
            "cholesterolContent": "25.4 mg",
            "fatContent": "6.5 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "146.9 mg",
            "sugarContent": "15.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-17T17:41:12.21Z",
                "reviewBody": "I made this for my boyfriend's birthday this past weekend, and it turned out great!  The only reason I gave it four stars rather than five is that I made a few changes to the recipe that I think made it better.\r\n\r\nAcknowledging some of the previous reviews, I increased the ingredients by half by scaling the recipe to yield 36 servings instead of 24.  With the increased amount of batter, I was able to make a layer cake.  I also used strawberry yogurt instead of sour cream and added the juice from the bags of frozen strawberries I used.  I chopped the berries rather than mashing them.  I also used about half a small bottle of strawberry extract.  The flavor was still subtle, so I'm glad I added that.  I added a little extra flour to compensate for the extra liquid.\r\n\r\nI also used 2 parts baking soda and 1 part baking powder for a lighter texture.  Also, be sure to beat the batter well to make the cake nice and fluffy.  We used cream cheese frosting and it was great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KATERINAJB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/818319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-08T22:43:18.427Z",
                "reviewBody": "I went looking for a strawberry cake for my husband's birthday and found this recipe.  It looked easy and I liked the fact that it did not use gelatin or packaged cake mix.  The only change I made to the recipe was to use chopped strawberries instead of mashed and making two 9\" cakes instead of a sheet cake.  It was a hit; several guests came back for seconds.  The texture was great - dense but not too rich.  And the taste of the lemon glaze was perfectly suited to the strawberry cake.  My husband has declared this cake his new favorite. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TXN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2340846/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-20T01:24:36.013Z",
                "reviewBody": "Delicious cake - moist fragrant tasty just sweet enough ( I used 3/4 cup of fine white sugar to make it.) In spite of my miscalculations (I baked it in a 7-inch springform pan which required 15 minutes more baking time than the recipe says) the cake rose to the top of the pan and came out fine at least I think so. I did not frost it but served each slice with a scoop of vanilla ice cream and puréed fresh strawberries. After refrigerating what was left we found out that the cake was very nice when warmed up for a few second in the microwave: the fragrance of the strawberries comes out beautifully. I'll surely make it everytime strawberries are in season.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mimosa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/835110/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T22:03:51.967Z",
                "reviewBody": "I made this for a New Year's get-together with some friends and it was a big hit. The coloring that turbinado sugar made it resemble something like strawberry bread. It was very moist and not too sweet. I wanted to make a 2 layer cake so I applied what little geometry I remembered to see how much cake batter I would need for 2 9-inch round pans with 1.5\" depth. I added 50% to the batter ingredients and it was just about perfect. I also wanted to use a real frosting on it so I made the Buttercream Icing recipe from this site. I added in approximately 1/2 cup of non-sweetened strawberry puree (a defrosted 20 oz. bag of frozen strawberries makes about 1.5 cups of puree). That did thin the frosting up a bit but not too much--I guess I could have added a little more confectioner's sugar to thicken it but it was still okay for frosting the 2 layers. All in all I was very pleased (especially considering this was my first cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BICHON22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/828180/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-20T13:26:19.107Z",
                "reviewBody": "What a great recipe! We made it for friends after a big dinner and it was an immediate hit. Everyone wanted the recipe. We cut the sugar back to 1 cup (and could have cut it a little more). The one thing we found was that there was not enough icing. We doubled the recipe and that made plenty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ryan Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-14T06:50:58.607Z",
                "reviewBody": "This is great You don't know how hard it is to find a REAL strawberry cake recipie one that does not call for a cake mix or strawberry geletin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ASSUMPTA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/681829/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-20T13:27:12.013Z",
                "reviewBody": "I've made this cake 3 times. My husband really likes this cake made with fresh strawberries. The only problem is that the cake is somewhat dense/heavy. Next time I make it I will try adding baking powder to see if that makes a difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JORIERAINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/330400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-12T00:09:26.06Z",
                "reviewBody": "Very very disappointed in this recipe. I chose it because I DID NOT want a strawberry cake made with white cake mix and gelatin. I followed the directions except for adding some chopped strawberries along with the mashed strawberries to give it more strawberry flavor. After the 30 minutes of cooking the whole cake was very brown but not done in the middle. So I had 2 choices - one let the cake burn to get the center cooked or take it out then and have the center not be completely cooked. So now that the cake has cooled the center has dropped. And as you know the cake is not more than an inch thick to begin with so this cake will NEVER make it to the picnic I had been planning on taking it to. I am not an amateur cook so I know how to adjust things but this one was a complete disaster. If I could just frost it then it would be fine but the center of the cake is not even 1/2\" thick. I had decided ahead of time not to make the glaze because of reviews about it. Very sad that this did not turn out like most of the reviews had said it would.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Modemom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2370066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-30T21:01:28.573Z",
                "reviewBody": "I halved this recipe and made them into cupcakes. I also used white sugar and creamcheese frosting. They came out moist and delicious I'll definitely make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa F.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2699481/"
                }
            }
        ]
    }
]