[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20350/moong-dal/",
        "name": "Moong Dal",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F111568.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-05-13T19:44:26.000Z",
        "description": "I actually learned this in the kitchen of this lovely Indian woman! Serve hot in soup bowls, or over rice.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 ½ cups moong dal (split husked mung beans)",
            "2 ½ cups water",
            "1 ½ teaspoons salt",
            "½ teaspoon grated fresh ginger root",
            "1 teaspoon diced jalapeno chile pepper",
            "½ cup diced tomatoes",
            "3 teaspoons lemon juice",
            "½ teaspoon ground turmeric",
            "2 teaspoons vegetable oil",
            "1 teaspoon cumin seed",
            "½ dried red chile pepper",
            "1 pinch Asafoetida",
            "2 cloves garlic, finely chopped",
            "¼ cup chopped fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse the dal, checking for any debris; add to saucepan with 2 1/2 cups water. Allow to soak for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring dal, water, and salt to a boil. Reduce heat to medium-low and cook until beans are very tender and mixture has thickened, 15 to 20 minutes.  Add more water, if necessary, to prevent drying out. Stir in ginger, jalapeno pepper, tomato, lemon juice, and turmeric.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a small saucepan and add cumin seed and red chile pepper. When pepper is heated, add Asafoetida powder and garlic. Stir mixture into split peas and add cilantro; mix well.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Pyromommy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.157303370786517,
            "ratingCount": 89,
            "itemReviewed": "Moong Dal",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "329.9 calories",
            "carbohydrateContent": "57.1 g",
            "cholesterolContent": null,
            "fatContent": "3 g",
            "fiberContent": "14.5 g",
            "proteinContent": "21.1 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "667.3 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-11T20:56:32.327Z",
                "reviewBody": "I'd like to chime in about the aesofetida. It is also labeled \"Hing\" and you can find it in most ethnic stores. My Indian buddies tell me that lots of Indians won't even have the stuff in the house (It's really kind of overwhelming). I don't particularly like it, so, be warned and go easy on it, it stinks to high heaven. Substituting onion powder (with a little garlic powder thrown in) is a great idea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Olive Lankin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1269323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-23T03:32:59.677Z",
                "reviewBody": "A great basic dahl recipe. It can also be enhanced with all manner of vegetable matter to round out your diet: diced broccoli, sweet corn kernels, red/green/yellow bell pepper, chopped fennel, plus more. We call it the enthusiastic dahl--because we can put everything we've got into it. \n\nAdding garam masala towards the end of cooking increases flavour without heat. Lightly toasting dry chilli powder at the start in oil likewise increases flavour without increasing the heat factor as much as adding it later would. \n\nAdding a small can of coconut milk during cooking will enrich the flavour for festive occasions and/or provide much-needed fats for (thinner) vegetarians. The dahl can also be garnished with lime juice and tabasco sauce as well as some chopped cilantro. Chapatti fried in butter makes a nice accompaniment and alternative to the basmati rice or brown rice standard.\n\nHing can be stored in a well sealing jar--such as that used for premium instant coffees. Even if you do not drink coffee, it's a small price to pay for a practical solution to the Hing smell issue.\nN.B. Hing seems to work well with the flavour of cardamom seeds and makes a killer red lentil dahl.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ednicious",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2502334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T19:51:36.687Z",
                "reviewBody": "Just FYI - If the dried yellow split peas are round they're \"chana dal\". Moong dal is smaller and more oval-shaped.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SHAMMI EDWARDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/966046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-30T00:27:52.04Z",
                "reviewBody": "I took my cue from the cocmments by Ednicious and viewed it as an \"enthusiastic\" dahl - and I made it a bit differently but it came out great!  I soaked the split yellow peas for a few hours, which both softens them and helps to reduce gassy side-effects for people not used to eating them.  For the people who said they take much longer to cook, perhaps they are using a different kind of pea.  I found mine in the ethnic food aisle of my supermarket, and it was marked Mung Dal.  \n\nI sauteed an onion, cubanelle pepper, some carrots, roma tomatoes (all chopped up in my mini food processor) in some olive oil, added some frozen corn kernels, and let them soften.  I added a couple of garlic cloves, let them cook a bit, and then added my spices: about a teaspoon of chili powder I had toasted prior, 1 ts of ground ginger (didn't have fresh), 1/2 ts of coriander, 1 ts of cumin, and a couple of bay leaves and some salt.  I let that sautee with the veggies a little and added the drained peas (2 cups).  Then I added 4 cups of chicken broth and let it cook for 20 minutes while I cooked some jasmine rice.  It was super yummy.  My point is that you really can make it your own and develop it according to your tastes if you don't have the exact recipe components on hand.  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MELISDC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-26T00:34:59.76Z",
                "reviewBody": "I concur -- this is \"Yummy\". It helps that I already love Indian food. What I learned from this recipe:\n- substitutions work well: I used the limes of 4 whole limes (3 TB) not lemon\n- I did not use asafoejida or anything to substitute for it\n- I used coconut oil to make this makers-diet-friendly, but it probably added to the flavor, and finally\n- the one part of this recipe that made this dish more \"Indian\" in the sense of \"like the Indian restaurants I frequent\" was adding cumin to the oil. When I did that, it was instantly flavored and scented like I imagines it should be.\nBon Appetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GlutenFreeLightbearer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2180248/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-13T05:49:52.297Z",
                "reviewBody": "After reading all the reviews here I tried making this with different proportions. I also soaked the moong beans for about 2 hours and it STILL took well over an hour to cook and continual additions of water. In the end though this came out delicious! 2 cups moong beans 2 cups water 1 t salt 1 T grated fresh ginger root 1 diced jalapeno pepper (seeded) 1 cup diced tomatoes Juice of 1 lime T ground turmeric 3 T vegetable oil 1 t cumin seed 1 dried red chile pepper 1 pinch onion/garlic powder 4 cloves garlic finely chopped cup chopped fresh cilantro",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "|E|E|",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2455040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-29T21:20:24.61Z",
                "reviewBody": "Loved it!.. My sister in-law made this the last time we were there and I really enjoyed it! Having found the recipe on here I decided to try to make it too. I was happy with the results! I added about 5 cups water in the pot with the peas. I brought the peas to a boil then turned off the stove to let them soak until I was ready to make. Then I cooked the peas about 45 minutes. I left out the asafoetida after reading reviews. I also substituted finely chopped carrot and onion for the tomatoes which I cooked in margarine along with the spices. I used 1/2 tsp of cayenne for the heat. I forgot the garlic but it wasn't lacking flavor! I will use it next time. Served over basmati rice along with chicken kebabs and nan bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Traci-in-Cali",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/traciskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-28T17:46:40.35Z",
                "reviewBody": "Very good, easy recipe.  I omitted the \"1 pinch Asafoetida\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SRDOEBLING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/316226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-28T17:46:42.083Z",
                "reviewBody": "There's one word to describe this dish: PHENOMENAL!!! Thank you Pyromommy for a wonderful tasty and above all EASY recipe! (I did find it a bit on the mild side for my taste but that's a plus for the first time one makes any dish as you can punch it up next go round by increasing the jalapeno to your taste.) Bravo Pyromommy! And thanks again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHERYLAP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/405715/"
                }
            }
        ]
    }
]