[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/412/seafood/shellfish/",
                    "name": "Shellfish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/438/seafood/shellfish/scallops/",
                    "name": "Scallops",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20872/seared-sea-scallops/",
        "name": "Seared Sea Scallops",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F706237.jpg",
            "width": 3321,
            "height": 2921
        },
        "datePublished": "2000-09-06T19:11:29.000Z",
        "description": "Seared on the outside with a light crust and tender on the inside. You may vary the amounts of all seasonings to suit your taste.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ cup all-purpose flour",
            "2 teaspoons seasoning salt",
            "½ teaspoon dried oregano",
            "½ teaspoon dried thyme",
            "2 tablespoons lemon pepper",
            "16 sea scallops, rinsed and drained",
            "2 tablespoons olive oil",
            "4 tablespoons chopped fresh parsley, divided",
            "4 teaspoons lemon juice, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together flour, salt, oregano, thyme and lemon pepper. Roll scallops in flour mixture until lightly coated on all sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a skillet or frying pan over high heat. Add 4 scallops to the pan and sear on all sides (about 2 minutes for each side). After turning scallops, add 1 tablespoon parsley and 1 teaspoon lemon juice. Remove scallops from pan and place on a plate in the oven to keep warm until ready to serve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Repeat until remaining scallops are cooked, tossing each batch with parsley and lemon juice.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Shellfish",
            "Scallops"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CHRISADAMS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.271428571428571,
            "ratingCount": 350,
            "itemReviewed": "Seared Sea Scallops",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "179.1 calories",
            "carbohydrateContent": "15.4 g",
            "cholesterolContent": "19.8 mg",
            "fatContent": "7.5 g",
            "fiberContent": "0.9 g",
            "proteinContent": "12 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "1250.8 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-26T23:35:40.967Z",
                "reviewBody": "Instead of flouring them since many people complained it fell off while cooking, I just tossed the scallops directly in the seasonings.  Instead of garnishing with Parmesan cheese, I added it to the seasonings.  To make sure your scallops don't get tough, undercook the first bunch so they don't overcook in the oven while waiting for the second batch to cook.  I added wine and butter to the pan juices to make a lovely sauce.  I served it all over fettunci.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-02T18:23:16.577Z",
                "reviewBody": "The flour mix totally fell off in the oil. What did stick was not crispy but soggy. Next time I'll try to use the flour mixture on the scallops but maybe bake or broil them. *Update* I've tried this a couple dif ways and have had great success. First, leave out the flour-you don't need it. I put all the seasonings in a ziploc bag with enough olive oil and lemon juice to make a marinade. I used the seasonings called for plus, minced garlic, garlic powder, onion powder, parmesan cheese and old bay seasoning. Just put whatever amount looks good to you in the bag. Marinate it for several hours in the fridge, turning occasionally. I broiled the scallops, about 5 min per side and I tried some more in a nonstick pan with Pam instead of oil over med heat. Both ways turned out great! Just don't overload your pan in the oven or on top. I only cooked 8 or 10 at a time in a 9 x 13 foil covered dish sprayed with Pam and probably the same amount on the stove. I did get a little smoke in the oven towards the end but that was from the scorching juices and reuse of the same foil. I'm sure if you used fresh foil you wouldn't have a problem. I just threw away the foil! No mess at all! These have been scrumptious! I cooked the rest of my shrimp the same way. Even better! They are the huge 13-15 count that I found on sale at a local supermarket. They are the kind that come with the shell on but have been deveined so it is cut on the back and really easy to take off. Very nice and meaty texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShannonS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/815346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-28T01:50:50.903Z",
                "reviewBody": "My husband loved this.   After cooking the scallops and setting them aside, I mixed a 1/2 cup of wine in with the lemon juice and parsley and added it to the juices left in the pan.  I then added 2 tablespoons of butter and a tiny bit of the flour mixture.  I let it reduce and thicken.  I spread rice on a platter, put the scallops on top, and drizzled on the wine mixture.  It was delicious and very pretty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Margie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1590299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-05T20:53:59.88Z",
                "reviewBody": "Delicious!  I followed some suggestions on here and had a fantastic, restaurant quality dinner.  I added parmesan to the mix, and did not have lemon pepper.  I added lemon juice to the olive oil I cooked them in on the stovetop instead.  I \"breaded\" the scallops in a ziplock, which was perfect to coat them, but not cake them up.  By placing the scallops in the pan and really letting them get toasty before manually turning them, I got a beautiful browned effect with the perfect cooked texture.\n\nI also added in some butter and white wine after I took out the scallops to make a delicious sauce.  I served them in a pool of sauce with some French peasant bread slices and a green salad.  It was sooo good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Downeast Erika",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2131898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-07T17:50:18.923Z",
                "reviewBody": "Only average, even after adjusting the herbs to our liking.  If a person was to use the amount of herbs and lemon pepper recommended I think they'd be very disappointed as it would be overpowering.  Also, scallops should be seared over medium high heat, not high heat.  Once they crust and release themselves from the surface of the pan, in about a minute or two, turn and finish on the other side for another minute or two.  Finally, using oregano and thyme on scallops was an experiment for me out of curiosity, but now that we've tried them we know oregano and thyme is not the best choice for the delicately flavored scallops.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-20T18:20:54.14Z",
                "reviewBody": "This is a very simple and delicous recipie in which to prepare Sea Scallops. Be careful with the lemon pepper however as it is overpowering if you use the reccomended amount in the recipie. I reduced the amount by more than half and was very pleased with the results. Serve with a pasta dish...YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FELLNER593",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/499227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-18T17:41:10.49Z",
                "reviewBody": "This is THE BEST scallops recipe.  The most important thing about scallops is to get them as dry as possible before searing.  I defrosted mine, then placed them on top of 3 paper towels, and wrapped them with a couple of kitchen towels.  After an hour or so, I then put the flour and seasonings into a Ziploc bag, and shook about 1/3 of the scallops at a time.  The frying pan I used is a ceramic-lined Cuisinart frying pan - it's really important to have a good non-stick pan.  I heated the olive oil until very hot, then placed some of the scallops into it, being sure to leave some breathing room between scallops.  When those were nice and brown on each side, I took them out and placed them on a plate.  I then seared the 2nd and 3rd batches the same way.  When all of the scallops were seared, I poured about 1/3 cup of white wine into the pan, then 1/4 cup of butter and some lemon juice.  After pouring that delicious sauce over the scallops, I served them over fettuccine.  We sopped up the rest of the juices with some ciabatta roles.  Fantastic!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JKSFITZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1031521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-09T14:34:18.45Z",
                "reviewBody": "This tasted sooooo delicious, my whole family couldn't get enough of it!!! Would make a great appetizer at my next party! I sprinkled parmesan cheese over it at the end, and that was yummy. Sweet and succulent. Squeeze with a small squirt of lemon/lime for that extra zing of flavor (it will make a difference, trust me!) YUUUUMMMMMMMYYYYY!!!!! Definitely make this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "2Yung2Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396551/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-01T22:59:12.81Z",
                "reviewBody": "This was very easy and good for the first time I've ever cooked with scallops. I didn't have lemon pepper, so I soaked the scallops in lemon juice, used regular pepper in the coating mix. I also added Old Bay as someone else suggested. I think this would be a hard recipe to screw up, as long as you don't overcook the scallops. They cook so fast.\n\nMy family really liked this. I served it with scalloped potatoes and wild green salad with walnuts, blue cheese crumbles and raspberry vinagrette. Very fancy but easy. I'll make this again. (PS- My 4 year old and 18 month old even liked them).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KELDO78",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316668/"
                }
            }
        ]
    }
]