[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25309/seans-falafel-and-cucumber-sauce/",
        "name": "Sean's Falafel and Cucumber Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F200866.jpg",
            "width": 3072,
            "height": 2048
        },
        "datePublished": "2019-07-10T06:52:44.000Z",
        "description": "This is a great recipe for falafel. Everyone that I have made it for loves it. Yum!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (6 ounce) container plain yogurt",
            "½ cucumber - peeled, seeded, and finely chopped",
            "1 teaspoon dried dill weed",
            "salt and pepper to taste",
            "1 tablespoon mayonnaise",
            "1 (15 ounce) can chickpeas (garbanzo beans), drained",
            "1 onion, chopped",
            "½ cup fresh parsley",
            "2 cloves garlic, chopped",
            "1 egg",
            "2 teaspoons ground cumin",
            "1 teaspoon ground coriander",
            "1 teaspoon salt",
            "1 dash pepper",
            "1 pinch cayenne pepper",
            "1 teaspoon lemon juice",
            "1 teaspoon baking powder",
            "1 tablespoon olive oil",
            "1 cup dry bread crumbs",
            "oil for frying",
            "2 pita breads, cut in half",
            "1 cup chopped tomatoes"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl combine yogurt, cucumber, dill, salt, pepper and mayonnaise and mix well. Chill for at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl mash chickpeas until thick and pasty; don't use a blender, as the consistency will be too thin. In a blender, process onion, parsley and garlic until smooth. Stir into mashed chickpeas.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl combine egg, cumin, coriander, salt, pepper, cayenne, lemon juice and baking powder. Stir into chickpea mixture along with olive oil.  Slowly add bread crumbs until mixture is not sticky but will hold together; add more or less bread crumbs, as needed. Form 8 balls and then flatten into patties.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 inch of oil in a large skillet over medium-high heat. Fry patties in hot oil until brown on both sides. Serve two falafels in each pita half topped with chopped tomatoes and cucumber sauce.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sean"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.585620915032679,
            "ratingCount": 1530,
            "itemReviewed": "Sean's Falafel and Cucumber Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "586 calories",
            "carbohydrateContent": "59.5 g",
            "cholesterolContent": "50.3 mg",
            "fatContent": "33.1 g",
            "fiberContent": "6.7 g",
            "proteinContent": "14.7 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "1580.1 mg",
            "sugarContent": "8.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-31T04:53:07.64Z",
                "reviewBody": "So yummy and very easy to make! Instead of frying, I baked them in the oven. Preheat the oven at 400 degrees F. Spray the baking sheet and then the falafels with vegetable oil cooking spray. BAke 10 minutes, flip and spray again, then another 10 minutes. Then broil each side for 2 minutes. So good and much healthier! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEAVENSNT86",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1062777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-17T19:46:18.81Z",
                "reviewBody": "I like the fact that this uses canned chickpeas.. as it's easy to prepare.  However, both times I've made it, the falafels have fallen apart in the oil. I recommend doing a test falafel... and if it falls apart, just add another egg. I would use very little bread crumbs, if any.\n\nAnother scary problem is that the baking powder (which may be a typo.. as every other falafel recipe I know uses baking soda), cause the oil to bubble up/foam... one batch it foamed over creating a fire hazard on my stove.\n\nAs for the sauce, I didn't use the dill, but I added two cloves of finely chopped garlic. The second time I left out the mayo and didn't miss it at all.\n\nAll in all, this is a good base... but be wary of the falling apart and foaming issues.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "muslim mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1740488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-17T12:49:01.36Z",
                "reviewBody": "Wonderful recipe!\r\n\r\nI didn't have any coriander or enough parsley, but it still turned out great.\r\n\r\nI suggest, as others have, that you make the cucumber sauce first so that the flavors can mix well.  The sauce tasted great, but, a tad too sweet for me.  So, I added in some more salt to even it out.  Plan on using the sauce for salads in the future!\r\n\r\nI mashed the chickpeas without a blender, as the recipe says, and the texture was nice.  This is really laborious, so if you're short on time, just use a blender on a gentle setting.\r\n\r\nI also made the following preparation changes:\r\n\r\n1) After forming the falafel balls, I covered them in bread crumbs.  This creates a nice texture.  Form the patties after this.\r\n\r\n2) To make less fatty, baked the falafel patties in an oven instead of deep frying.  I covered an oven pan with aluminum foil (easy cleanup!) then very lightly greased it with olive oil.  Bake the patties at 425F  for 20 minutes then turn over and baked for another 8-10 minutes.  They brown well and turn out great.\r\n\r\nEnjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MALANDIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1051458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-02T23:34:08.607Z",
                "reviewBody": "I had to make a few alterations... this recipe would best be used as a \"guide\" for making falafel.  \n\nFirst - DOUBLE the recipe!  The mixture will hold for a few days in the refrigerator and also freezes well - especially important for busy individuals/families.\n\nMashing the chickpeas by hand is very important for texture/consistency.  I used 2 (15 oz) cans of chickpeas and it took less than 5 minutes to mash by hand - so it's not as laborious as others have stated.  \n\nMy best recommendation:  Use a generous handful each of fresh parsley and cilantro for great flavor.  The seasoning measurements are perfect.  DO NOT use egg or breadcrumbs, use flour instead.  You will need approximate 4-8 tablespoons - start with 4 T and add additional flour as needed until you are able to form a small ball and it doesn't stick to your hands.  I recommend test frying one ball (or disk); if it falls apart you must add more flour.  It is also highly recommended to refrigerate the mixture for a few hours to allow the flavors to mingle.  I typically make the mixture the night before or the morning of - and fry in the evening for a quick fix meal.  These can be baked but are must tastier fried!  Fry in 2-3 inches of oil at 375 degrees.  Traditionally falafel is served with a tahina sauce - but I much prefer using homemade Tzatziki instead (made with strained yogurt, strained shredded cucumber, olive oil, lemon juice, salt, pepper, and dill).  MMMM delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-12T04:17:12.34Z",
                "reviewBody": "What a great recipe! I completely disagree that it's laborious to crush chickpeas - I used canned organic ones and it was the easiest part. I would say the whole thing is a bit labor-intensive so do it on a slow night, but TOTALLY worth it.  I can't cook at all and I still managed to make this perfectly.  I followed the first reviewer's great suggestions to roll the balls in bread crumbs and to bake (at 425 degrees, 20 minutes then flip then another 8 minutes) instead of fry.  I also replaced the baking powder with baking soda.  Finally, I skipped the dill weed and used a sprinkle of coriander on the cucumber sauce and it turned out delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2646769/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-26T14:49:29.153Z",
                "reviewBody": "Both my husband & I like falafels, and thought this was a good recipe. I made a few changes, most note worthy would be warming the beans in the microwave for a minute 1st so they mash quicker and only using 2/3 cup of bread crumbs. I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KAREN28",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/245471/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-10T16:00:11.2Z",
                "reviewBody": "This was good with a few changes. I left out the egg used 3 cloves of garlic fresh cilantro and add hot sauce. To cut back on the fat and time i also baked my falafels. For all thoses that found that it made it dry heres what i do: I soak some stale bread in some milk squeeze out the excess and then kneed into the mix. then let it sit for an hour or until i get home from work. With damp hands shape into balls and put on a sheet brushed with olives oil. I bake at 425 for 15 minutes on one side and 10 on the other the outside was crispy and the inside was moist. Tasty healthy easy and quick to make!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sienna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1515867/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-20T19:07:53.467Z",
                "reviewBody": "Best falafel ever!!! Very tasty... I just made another batch. This time I omitted the  salt since the canned chickpeas already have enough salt in them. The prepared mixture keeps well in the frigde for a few days, so you don't have to fry it all at once. To cut back on the mess and the fat, I used the George Foreman grill instead of the deep fryer. Just use some of the spray oil, and the patties still come out moist and golden brown. Thanks for sharing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VICKY9999",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/961256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-12T15:55:56.467Z",
                "reviewBody": "Great Falafel recipe! To cut down on the fat, I used Egg Beaters, only 2 TSP olive oil, browned the patties in a skillet with Olive Oil Flavored PAM and then baked them at 400 for 30 minutes. For the sauce, I used fat free sour cream and eliminated the mayo. Thank you for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARKLES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/668810/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Sean's Falafel and Cucumber Sauce",
            "description": "Simple and quick recipe to prepare that delivers lots of Mediterranean flavors.",
            "uploadDate": "2014-11-10T20:51:57.769Z",
            "duration": "PT3M20.734S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2f396dc8-a61a-40b2-867f-c678cb0cd40b%2F2d9da42d-1731-4ab6-ac77-071753e34cf2%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3884828968001"
        }
    }
]