[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/222/side-dish/casseroles/",
                    "name": "Casseroles",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/50801/russian-eggplant/",
        "name": "Russian Eggplant",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F352074.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-07-10T06:53:38.000Z",
        "description": "This is an easy and sumptuous recipe of eggplant layered with tomatoes and onions, then smothered with sour cream. It bakes up to yield a delicious sauce.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 large eggplant, peeled and sliced into 1/3 inch rounds",
            "1 tablespoon fresh lemon juice",
            "1 cup water",
            "3 large tomatoes, thinly sliced",
            "2 onions, thinly sliced",
            "2 tablespoons all-purpose flour",
            "1 ¼ cups sour cream",
            "1 clove garlic, minced",
            "1 ½ teaspoons salt",
            "¼ teaspoon black pepper",
            "paprika to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine the lemon juice and water. Place the eggplant slices into the lemon water to soak while you bring a saucepan of lightly salted water to a boil. Drain and rinse the eggplant slices, then place them into the boiling water. Cook for 8 minutes, or until barely tender. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 2 quart casserole dish. Layer the eggplant slices, tomatoes and onion in the dish, sprinkling each layer with a little flour as you go. In a medium bowl, stir together the sour cream, garlic, salt and pepper. Spread this over the top of the casserole. Sprinkle generously with paprika.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 45 minutes in the preheated oven, until the top is nicely browned and there is a bubbly sauce.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Casseroles"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Alexis"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.6666666666666665,
            "ratingCount": 48,
            "itemReviewed": "Russian Eggplant",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "248 calories",
            "carbohydrateContent": "24.2 g",
            "cholesterolContent": "31.6 mg",
            "fatContent": "15.8 g",
            "fiberContent": "5.5 g",
            "proteinContent": "5.9 g",
            "saturatedFatContent": "9.5 g",
            "servingSize": null,
            "sodiumContent": "1052.2 mg",
            "sugarContent": "10.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-28T18:44:07.45Z",
                "reviewBody": "The concept was great and I only adapted it a little bit. I took the advice of another review and sauteed the onions in olive oil with oregano and salt until they were soft. I also rather than use just tomatoes I simmered the tomatoes with oregano garlic and the paprika that was mentioned. I did not boil the eggplant rather used a covered casserole dish and left the entire thing in for a hour. I served it with rice and it was far from bland and VERY good. A super healthy dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kerry Rodriguez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1872563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-21T18:23:48.06Z",
                "reviewBody": "Sooo delicious. I had this same dish or one very like it at a restaurant in Russia and have been trying to recreate it since. I made sure my onions were sliced very thin so that they would be sufficiently cooked in the oven but still have some of the oomph which would be lost by sauteeing. This is definitely going into a regular rotation in my kitchen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Beth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1692923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-31T18:50:47.487Z",
                "reviewBody": "I was somewhat surprised by how this dish turned out. When I first cooked it it seemed somewhat bland. I am not sure what but there was something about the flavor that was odd not really full and savory but not really unpleasant. As suggested by other reviewers I sauteed the onion and instead of boiling the eggplant I simply put it in the casserole raw covered the dish and cooked it for a little over an hour. (I don't like the idea of boiling veggies when other means of cooking exist because I want to preserve their nutrients and flavors as much as possible.) Otherwise I made no other modifications. I think what surprises me the most is how I really like it a lot more after being reheated in the microwave. This seems unusual to me. There is still something missing IMO about the taste. I am not sure what to suggest other than the flavors seem to come out underdeveloped. I think this could be fantastic if the flavors were a little richer and full. Perhaps seasoning the eggplant with pepper and cumin or coriander prior to putting them in the casserole might help. I like the creaminess of the sauce combined with the subtleties of the onion and tomato I just wish there was more of a savory accent to draw it all together.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacquie Garel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2901995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-26T16:33:44.863Z",
                "reviewBody": "I also sauteed onions in olive oil with spices, then did the same with tomatoes. Turned out great! Family loved it. \n\nIt's a very famous recipe called \"under the coat\" or with literal translation \"under the fur coat\" (pod shoo-boy). You can cook many dishes under the coat (of sour cream or mayo). \n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHATScooking4DINNER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2603126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-14T01:25:54.153Z",
                "reviewBody": "So good! I made three of each layer and due to others comments on blandness and not enough sauce I used about 1 3/4 cups sour cream 2 tsp salt and 3 cloves of roasted garlic. I added some evaporated milk to stretch the sauce too but it didn't need it it was a little watery (I forgot to sprinkle layers with flour per the recipe I think that would've helped too). But it was savory and delicious even people who didn't like eggplant or onions loved it and asked for the recipe. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROBORG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/975663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-23T20:11:17.433Z",
                "reviewBody": "For the most part I agree with the others...rather bland. However I am sitting here eating it for lunch and served it over a plate of spinach bulgar and pine nuts. Much tastier. If I made this again I'd actually bake it with a layer of spinach and maybe a sprinkling of parm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1521913/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-22T00:04:26.09Z",
                "reviewBody": "We eat alot of tzitziki at our house. And sometimes I make it with sour cream instead of yogurt. I was looking for recipes that used sour cream and came across this one. So I used tzitzikti I made from sour cream in this recipe instead of just plain sour cream. I drizzled a little bit of olive oil on the bottom and on each layer. Also I sprinkled each layer with  some chopped up fresh parsley and crumbled feta. It was really good! If you like everything with a greek flare, you will love this. Also I did not boil my eggplant. I just cooked 20 mins longer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Penny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2777933/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-17T05:22:47.103Z",
                "reviewBody": "this recipe was great. The first time I boild my eggplant and sauteed onions in olive oil next time I steamed onions and eggplant i used a can of italian stewed tomatoes both times and at each stage of steaming put garlic across teh top. i was generous wth the paprika on top of the whole thing too. it was far from bland. i also used cottage cheese in with the sour cream as i was low on the sour cream the and didnt wish to run to teh store. i am rating it a four because it does not say to steam or boil the veggies and i feel it should.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Morgiana Gillfillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2850988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-21T00:27:44.577Z",
                "reviewBody": "we really enjoy this simple dish so much so that i make it on a regular basis. i never parboil the eggplant; i just layer the ingredients and season with salt and pepper on every layer. i add the lemon juice to the sour cream and about four cloves or a big tablespoon of garlic to the sour cream. super simple creamy and not all that bad for you. bake it for about an hour or until the top is bubbly and golden. i really enjoy it over calrose.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Rinke-Hammel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8945122/"
                }
            }
        ]
    }
]