[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/412/seafood/shellfish/",
                    "name": "Shellfish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/438/seafood/shellfish/scallops/",
                    "name": "Scallops",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/53382/basil-pan-seared-scallops-over-pasta/",
        "name": "Basil Pan-Seared Scallops over Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1031168.jpg",
            "width": 1632,
            "height": 1224
        },
        "datePublished": "2019-07-10T06:53:42.000Z",
        "description": "This dish is so easy to make, but tastes like you slaved away in the kitchen. When purchasing the scallops, be sure to look for a subtle pink or creme color. Stark white scallops have been soaked in water to add extra weight. Other pastas such as rotini, shells, or penne can be substituted for the farfalle. Makes an excellent main course, or add spinach or asparagus to turn it into a meal in itself. My pookie likes to have this dish served with antipasto of buffalo mozzarella, artichoke hearts, and fire roasted tomatoes.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (16 ounce) package farfalle (bow tie) pasta",
            "24 scallops, rinsed and drained",
            "¾ cup olive oil",
            "¼ cup lemon juice",
            "1 ½ teaspoons dried minced garlic",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "2 tablespoons dried basil",
            "9 tablespoons whipped butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil. Cook pasta in boiling water for 8 to 10 minutes, or until al dente. Drain, rinse, and transfer to a large serving bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, place scallops in a large bowl. In a small bowl, mix together 1/4 cup olive oil, lemon juice, 1 teaspoon garlic, 1/2 teaspoon salt, and the black pepper. Pour mixture over scallops. Arrange scallops in a single layer in a large baking dish or plate. Sprinkle 1 tablespoon dried basil over scallops so that only one side is sparsely coated with basil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high, and melt one tablespoon of butter in the pan. Place 12 scallops basil-side down, and cook for about 3 to 4 minutes until dark golden brown. Turn scallops,  and cook the other side. Cook the remaining 12 scallops the same way.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small saucepan, melt remaining butter with 1/2 cup olive oil, 1 tablespoon basil, 1/2 teaspoon garlic, and 1/2 teaspoon salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Toss pasta with butter and olive oil mixture. Divide pasta onto plates, and top with scallops.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Shellfish",
            "Scallops"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Grace"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.151515151515151,
            "ratingCount": 99,
            "itemReviewed": "Basil Pan-Seared Scallops over Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "521.6 calories",
            "carbohydrateContent": "45.8 g",
            "cholesterolContent": "38 mg",
            "fatContent": "30.5 g",
            "fiberContent": "2.9 g",
            "proteinContent": "16.1 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "453 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-06T22:57:35.01Z",
                "reviewBody": "I'm on Weight Watchers, so to make this a little more diet friendly, I made a few changes.  I only used 2T butter total, 2T olive oil, and divided it between the skillet and the sauce. I made the sauce with 1 T butter, 1T olive oil, lemon juice, basil, garlic, and chicken broth. I also added in asparagus and fresh tomatoes.  And - I used whole wheat pasta. All in all, very tasty. This recipe was a great jumping off point and I still stayed on WW. 1 serving was 6 points.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Pitaniello",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/396291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-18T21:38:10.22Z",
                "reviewBody": "Good recipe. My 3 & 6 yr old girls LOVED this dish! I did a few things different. I skipped the step of placing the scallops on the plate to cover w/ basil. I added Basil to the mixture in before mixing w/ the scallops. I transferred the scallops first to the skillet and began to brown them. After a minute or so I added the remaining mixture where the scallops were. Once completely browned I added fresh Asparagus tips. I didn't use as much butter and used extra garlic & basil. I am so excited that my kids loved it! I am certainly going to keep this recipe and play around with other ingredients to add.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JDME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2350450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-23T02:03:03.327Z",
                "reviewBody": "This was good. The butter garlic and lemon combination is very tasty. I used fresh basil instead of dried but otherwise followed the recipe as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHIE71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-18T22:22:44.877Z",
                "reviewBody": "Okay I made quite a few different changes. First off I totally omitted the oil and I only used 6 tbsp butter. I cooked the scallops in the juice of one orange and one lime (I hate the taste of fishiness). Once those had cooked about 3-5 mins I drained all but about 1 tbsp of the juices off the scallops (just eyeball it) put it back on the stove and then put your basil and I added 1 tsp of garlic powder and onion powder. Let the rest of the juice cook off and then add the butter sauce. Once that is coated I add about 2 1/2 cups of broccoli. (It is wonderful with this dish and I always use fresh ingredients where possible) but then you cover and let simmer for about 5-8 mins or until the broccoli is done but not wilted. I also prepare an alfredo sauce while this is simmering. I think it cuts down the greasiness and adds a little something extra. (you can make low fat sauce as well just use no fat milk and the healthy butter if there really is one:) ) but once it is all done I have the pasta in the same pot as the scallops/broccoli and add the sauce to the pot. It is most definitely a huge hit with my husband and he eats until he is miserable and has done that each of the four times I have made this dish. I know this is long but I hope that someone enjoys this as much as my family and I have.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LuvnSamranor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1952780/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-14T19:55:39.12Z",
                "reviewBody": "Well, there was no way I was going to waste the scallop marinade. So, I thawed out a 10 oz box of frozen chopped spinach and squeezed it dry.  After searing the scallops, I deglazed the pan with a half cup of dry white wine and let it reduce, then added 4 tbsp butter, the remaining basil and garlic, and sauteed the spinach. Then I added the scallop marinade, and let it cook at high heat to kill any bacteria and reduce...checked for seasonings, then added two ladlefuls of pasta water to make a sauce.  Returned the scallops to the sauce to make sure they were cooked through, then mixed with hot pasta and topped with parmesan cheese. Excellent! With the use of the pasta water I did not use more than 1/4 c of olive oil and 4 tbsp butter.  Very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elisabeth Grenier Shoupp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/830502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-31T03:40:19.277Z",
                "reviewBody": "I tried this recipe tonight.Thought it was terrific. I had planned it for two but we had unexpected company for dinner. Only had enough scallops for 2 so I had to supplement with shrimp. Other than that I followed the recipe almost to the \"T\".I sauteed spinach in the pan I cooked the scallops and shrimp in an added that to the pasta.Will definitly use this recipe again with maybe a bit more garlic (just our pesonal taste)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2545688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-13T19:17:23.327Z",
                "reviewBody": "The flavor of the scallops was very bold or as my husband said \"The scallops really pack a whallop!\". We like liked the contrast with the more bland tasting pasta. Next time I will not add the full amount of butter/oil. I felt it was too much. I also used fresh basil and garlic and spaghettini noodles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alison S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1560932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-28T15:58:16.42Z",
                "reviewBody": "a little bland but very good. i added more basil and garlic and would add artichoke hearts next time. overall pretty good",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Haley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1908557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-02T16:43:30.083Z",
                "reviewBody": "This was very yummy! I used small scallops that we gathered ourselves during scalloping season. I also used spiral noodles and fresh garlic instead. This for me was wonderful and simple and tasted like something I would order at a resturaunt. A must try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lilygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2415389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T18:03:18.43Z",
                "reviewBody": "I think that this recipe uses great ingredients however 9 tablespoons of butter is an absolutely ridiculous amount of butter that no one on a diet or not should be eating in one serving. I would completely delete it from the recipe and substitute it with EVOO and if you crave a little bit of savory calories add a touch of cream to give it a bit of a different texture and look that can fool the biggest butter lover.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Dvachon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6381563/"
                }
            }
        ]
    }
]