[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/65637/tofu-fish-fillet-sandwiches/",
        "name": "Tofu 'Fish' Fillet Sandwiches",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F65241.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-07-10T06:53:59.000Z",
        "description": "If you are a vegetarian who doesn't eat fish, yet still have that hankering for a juicy fish sandwich, these bread crumb-crusted tofu 'fish' sandwiches will blow your mind!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (12 ounce) package firm tofu - drained, patted dry, and sliced into 4 slices",
            "1 cup bread crumbs",
            "1 teaspoon kelp powder",
            "¼ teaspoon garlic powder",
            "¼ teaspoon paprika",
            "¼ teaspoon onion powder or flakes",
            "1 teaspoon salt",
            "olive oil, as needed",
            "½ cup mayonnaise",
            "¼ cup dill pickle relish",
            "1 tablespoon fresh lemon juice",
            "4 whole wheat hamburger buns, split"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, toss bread crumbs together with kelp powder, garlic powder, paprika, onion powder, and salt. Dip tofu slices into olive oil, then bread crumb mixture, patting lightly to coat well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake on a cookie sheet in preheated oven for 30 minutes. When first side is golden brown and slightly crispy, turn over, and finish baking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, mix together mayonnaise, relish, and lemon juice until well-blended. When tofu is nearly done baking, brush each bun half with olive oil, and toast in the oven. Serve with tartar sauce and your favorite sandwich condiments.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DESANDTRAV"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0212765957446805,
            "ratingCount": 47,
            "itemReviewed": "Tofu 'Fish' Fillet Sandwiches",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "621.8 calories",
            "carbohydrateContent": "43.7 g",
            "cholesterolContent": "10.6 mg",
            "fatContent": "41.6 g",
            "fiberContent": "5.1 g",
            "proteinContent": "21.4 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "1331.9 mg",
            "sugarContent": "4.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-24T21:16:40.17Z",
                "reviewBody": "ATTENTION: If you want your \"fish\" patties to turn out with more of a meat texture, purchase firm or extra firm tofu and freeze it before using.  Then, thaw it in a colander and squeeze ALL the liquid out of it before you slice it. If you do not squeeze out the liquid, you will end up with a patty that is mushy and the breading WILL NOT STICK. If you are using the traditional block of tofu, slicing it into 5 or 6 slices also helps.  Kelp powder is made from ocean kelp and adds lots of nutrients plus gives it more of a \"fish\" flavor.  If you don't use it, its still good, but don't expect too much of a \"fish\" flavor.  Excellent recipe if you use these tips!  Thanks for a great recipe for vegetarians!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SusieQP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-05T14:47:11.857Z",
                "reviewBody": "I pan fried this in a little olive oil. I topped it with red onion pickles and mayo. My wife really liked it (and she did NOT like the idea of tofu-anything). She agreed that we'll have this one or two times a month!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DVDAPEX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1218927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-09T13:55:36.607Z",
                "reviewBody": "Great recipe. I added a little extra garlic powder and paprika to the bread crumb mixture.  Pan fried the 'filets' in olive oil instead of baking and used store bought mayonnaiserelish spread.  My husband likes warm condiments and cheese so I put the sandwhich in the toaster oven with a slice of cheddar cheese.  We are both big fans of tofu, really enjoyed this recipe and will definitely make again, Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hope062503",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1112856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-16T13:58:57.08Z",
                "reviewBody": "I think this recipe has potential but there is just one thing that really turned me off about it. The tofu slices were just way too thick for my tastes. I did three slices as directed but sliced the fourth one in half. Those thinner ones came out super crispy and much more appetizing. I didn't have kelp powder but I added some Old Bay to give it a little seafood flavor. The tartar sauce was yummy. Thanks for sharing:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinBug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookinbug/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T19:37:47.867Z",
                "reviewBody": "I'm rating this 5 stars but only with a 1 major change in the recipe... fry fry fry it!! I used lemon pepper old bay seasoning rather than the hard-to-find kelp powder and i also used seasoned bread crumbs. it came out a tad bit too salty but crispy fishy and yummy! one more suggestion: open the tofu a few hours before cooking and use paper towels and a weight to dry it out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2802732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-31T19:03:21.84Z",
                "reviewBody": "This was my choice as my birthday dinner this year (really fancy I know) and it was so simple that even my boyfriend could make it! I did advise him to fry it however which really made the tofu firm up a little and crisped the breading. I think this would satisfy any vegan/vegetarian or fish-eater! Loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAVACHICK86",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1150454/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-20T16:20:37.853Z",
                "reviewBody": "This was okay - followed recipe exactly except on preparing tofu. I found the crumb mixture a little too salty. Next time will not add any salt and not pat as much bread mixture onto the slices. Also not much \"fish\" flavor however I still ate the whole thing as I love tofu. As others may have mentioned prepare tofu by freezing it - I always throw my plastic tubs of tofu into the freezer when I buy them as I like my tofu to have a meaty texture when cooked. Then thaw in the fridge. When it's thawed cut into slices and press between absorbent paper (you can really put a lot of pressure to extract the water without tofu crumbling when it's been in the freezer). You can then cook it however you want to -I won't prepare tofu any other way no matter what recipe I use. I also buy the extra firm tofu. No problems ever with the plastic tub bursting open in the freezer either. Bottom line I give this recipe 3 stars as it wasn't anything I thought was super delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Patricia Pascale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3610169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-16T17:26:28.91Z",
                "reviewBody": "Fantastic! Instead of a 1 cup break crumbs I added 3/4 Cup Bread Crumbs and 1/4 cup Nutritional Yeast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "D.s.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2388148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-12T17:11:19.69Z",
                "reviewBody": "I gave this recipe a 5 star rating after I made one change. I couldn't find kelp powder only kelp granules which I now use as a very good salt alternative. The first batch with the kelp granules was ok but didn't taste much like fish to me (likely because of the granules vs. the powder) although the texture was good and the taste was ok. For my second batch I crumpled up almost to powder form 2 sheets of nori (seaweed sheets used for making sushi) and they were much much better. I put the crumpled/powdered nori sheets in the same bowl with the olive oil. After swirling it around in the oil and nori mixture I then put it through the breadcrumb mixture. I baked mine to save some fat and calories and they came out just great! A couple of my coworkers tried some of what I brought for lunch and they loved it. After the addition of the nori for more \"fish\" flavor this recipe is definitely a keeper and has become a part of my regular menu! Extra firm tofu works best and you must be sure to drain the tofu before handling. I followed the advice of a tofu chef I saw online who recommended to place the brick of tofu on a plate lined with paper towels and place a cutting board with two canned goods on top of the tofu to press out the extra water. I did this for 15 minutes and the tofu was perfect. But you can only do this with firm or extra firm tofu otherwise you'll squish it flat! ENJOY!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Grace Scarlett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2920949/"
                }
            }
        ]
    }
]