[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/68868/chicken-florentine-casserole/",
        "name": "Chicken Florentine Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F814302.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2019-07-10T06:54:03.000Z",
        "description": "Chicken Florentine casserole, which can also be adapted with either fish or shrimp, lies on a bed of spinach leaves and mushrooms, has a creamy white sauce mixed with garlic, Parmesan cheese, and Italian seasonings, and is topped with baked mozzarella.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "¼ cup butter",
            "3 teaspoons minced garlic",
            "1 tablespoon lemon juice",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 tablespoon Italian seasoning",
            "½ cup half-and-half",
            "½ cup grated Parmesan cheese",
            "2 (13.5 ounce) cans spinach, drained",
            "4 ounces fresh mushrooms, sliced",
            "⅔ cup bacon bits",
            "2 cups shredded mozzarella cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Place the chicken breast halves on a baking sheet; bake 20 to 30 minutes, until no longer pink and juices run clear. Remove from heat, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Increase the oven temperature to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a medium saucepan over medium heat. Stirring constantly, mix in the garlic, lemon juice, cream of mushroom soup, Italian seasoning, half-and-half, and Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the spinach over the bottom of a 9x9 inch baking dish. Cover the spinach with the mushrooms. Pour half the mixture from the saucepan over the mushrooms. Arrange chicken breasts in the dish, and cover with the remaining sauce mixture. Sprinkle with bacon bits, and top with mozzarella cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 20 to 25 minutes in the 400 degrees F (200 degrees C) oven, until bubbly and lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BRYAN0320"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.435483870967742,
            "ratingCount": 2728,
            "itemReviewed": "Chicken Florentine Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "646.7 calories",
            "carbohydrateContent": "17.6 g",
            "cholesterolContent": "168.4 mg",
            "fatContent": "38 g",
            "fiberContent": "5.4 g",
            "proteinContent": "61.6 g",
            "saturatedFatContent": "19.9 g",
            "servingSize": null,
            "sodiumContent": "1805.7 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-17T11:59:07.937Z",
                "reviewBody": "This was good but I thought it could be much better (and faster) if you skipped the first step. Baking the chicken on a baking sheet makes it dry and bland. I made it again last night and it was so much better (5 star). I sautéed the spinach and mushrooms in a little butter and placed in bottom of dish then placed the uncooked chicken on top, added the sauce and topped it off with real crumbled bacon and baked for 25 minutes at 350.  Removed from oven and topped with 1 cup mozzarella and continued baking for 10 minutes at 350 (not 400). It was so moist and flavorful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VICSGARDEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/840181/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-17T17:36:42.56Z",
                "reviewBody": "THIS IS DELICIOUS!!!  I did modify.  As others suggested I sauted (I used a bag and a half) of baby spinach leaves with (I used sliced portabella) mushrooms. I added a splash of white cooking wine and a teaspoon of garlic to the baby spinach/mushroom mix.  I sauted as long as I could without burning to get rid of as much moisture as possible then put mixture over bottom of baking dish. Meanwhile, I boiled my chicken then cut into cubes.  I then mixed and simmered my white sauce in the pan I sauted the spinach/mushroom ingredients, to take up the flavor. I stirred the cubed chicken in with the white sauce. I then poured the entire chicken/white sauce mixture over the layer of spinach and mushrooms.  I crushed up cooked real bacon I had on hand and sprinkled over top then finished with the mozza cheese. It baked beautifully! YUMMY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOXFIRE2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/964449/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T20:46:51.517Z",
                "reviewBody": "This is a 5-star recipes using the techniques described by a previous reviewer. \"Skip the first step. Then sauté the spinach and mushrooms in a little butter and place in bottom of dish. Then place the uncooked chicken on top, add the sauce and top it off with real crumbled bacon and bake for 25 minutes at 350. Remove from oven and top with 1 cup mozzarella and continue baking for 10 minutes at 350.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ericsgirl51987",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2627056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-29T22:11:23.093Z",
                "reviewBody": "This is now one of my favorite dishes!  I do make quite a few changes based on reviews, but it comes out as an incomparably excellent dish that I would be proud to serve to company! My hubby stated it tastes like a meal at one of those \"fancy restaurants\". :)  My changes were as follows: 1. I fried 4 pieces of bacon on the stove. 2. In the bacon grease, I sauteed the chicken which I had cut into bite-sized pieces and the garlic. I added half of the chicken chunks in with the sauce and the other half I laid on top of the spinach and mushrooms and poured the sauce over. 3. In the bacon/chicken juice, I sauteed fresh spinach leaves (1 bag of prewashed) and the mushrooms. 4.  I used 1% milk instead of half and half.  5. I put 1 cup of Mozz. in the sauce and 1 cup on top of the casserole.  6. I baked at 350 for about 30 mins and put the last cup of cheese on the last 10 mins.  I baked in a covered casserole dish until about 10 mins were left.  When I added the cheese, I left the casserole uncovered.  Lastly, I served over angel hair pasta with \"Summerly Squash\" w/ veggies from my veggie garden, and it was a nice compliment to the entree. This was a PERFECTLY delicious meal, and I'm so excited about the leftovers! ;) Thanks for the great recipe! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allyson Hester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-13T21:56:57.933Z",
                "reviewBody": "Oh my goodness this recipe is GREAT! The different flavors meshed wonderfully together. I saved myself a lot of time and stress changing just a few things. Those changes were: 1.) cut up chicken into chunks 2.) cooked chicken and minced garlic together in a pan with a few tablespoons of olive oil 3.) After chicken was cooked, I added the soup, milk instead half-and-half, 6 oz. shredded mozzarella, and lemon juice. 4.) Stired it all up on medium heat til creamy and then poured the entire mix on top of the spinach (I used frozen; turned out just fine) and mushroom layer as stated in the recipe. I then crumbled real bacon on the top and baked for 25 minutes. We ate it on top of bowtie pasta. This is DEFINITELY a keeper!!! So easy to make and so delicious! Thanks =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lonnarific",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-12T21:20:24.827Z",
                "reviewBody": "Made a few changes with what I had on hand...I used milk instead of the half and half.  I made my own bacon bits and sauteed the chicken in the bacon grease, just a few minutes on each side.  Then, put that off to the side and added the mushrooms and the garlic to the pan with just a little butter and olive oil.  I deglazed the pan with a splash of white wine and added the soup milk mixture.  I forgot all about the lemon juice and reduced the seasonings to 1/2 because of the comments from other reviewers.  Baked this for 20 minutes and then added the cheese for another 10 minutes at 350.  Served it with Roasted Garlic Wild Rice and it was delicious.  Definately a keeper.  Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-10T00:05:42.763Z",
                "reviewBody": "Just made this for dinner tonight and my husband and I loved it. I cut the chicken into bite size pieces and sauteed them in a little olive oil and minced garlic until cooked thru. Removed the chicken and wilted some fresh spinach in the chicken juice that was left in the pan. Removed and squeezed dry. I did not use butter or lemon juice. Just mixed together mushroom soup fat free half and half parmesan and 1 tsp of Italian seasoning. Stirred chicken and spinach into the soup mixture poured into a pie plate and just sprinkled a little additional parmesan cheese on top. Served over angel hair spaghetti. The sauce is wonderful! To cut way down on the fat in this recipe I omitted the butter bacon bits and mozzarella cheese and used fat free half and half and it still tasted delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FITZYBAKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/476507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-08T16:31:40.297Z",
                "reviewBody": "I doubled this recipe for a casual dinner party with my college friends and they loved it. Of course, anything home-cooked is better than the food they serve at the campus cafeteria, but this recipe was easy and delicious.\n\nI took some advice from fellow reviewers and cut up the chicken into bite-size pieces and cooked it on the stove top with some onion and a pinch of salt.\n\nFor the sauce, I put all of the cheese in the pot (instead of sprinkling on top) and I used 3/4 cup 2% milk instead of a whole cup so it wouldn't be too runny. I also only added one tablespoon each of the garlic and Italian seasoning (again, I doubled the recipe). Either way though, I think that if I made 4 servings, I'd still use a little less Italian seasoning, because 1 tbsp was plenty.\n\nIn the end, I sprayed the pan and put cooked penne on the bottom, topped that with chopped up broccoli, then the chicken. Since it was already done, I put it, uncovered, in a 350 degree oven for 15 min. just to heat it through.\n\nServed with the Cheddar Bay Biscuits from this site...awesome!\n\nGreat recipe; thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1519113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-31T16:07:47.75Z",
                "reviewBody": "Pretty good overall.  I saute the chicken rather than bake, as baking can tend to dry out the chicken.  Also, I use about 1/2 a bag of fresh (washed and dried) spinach spread out evenly on the bottom of the pan.  I also add a splash of white wine. This has a \"sophisticated\" taste that is good enough for company.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1578327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T17:39:31.71Z",
                "reviewBody": "I love rich creamy dishes and expected to love this one. Oddly enough it was too rich for me. (I didn't know this was possible.) I followed the recipe pretty closely except I used frozen spinach instead of canned (thawed with excess moisture squeezed out) I did not pre-bake the chicken and I used whole milk instead of half-and-half. I may make this again with half the cheese or with some chicken broth added to dilute the sauce a little. I loved the flavor it was just too heavy for me somehow.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Bake Until Golden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3697042/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Florentine Casserole",
            "description": "See how to make a quick-and-easy, creamy chicken casserole.",
            "uploadDate": "2012-05-04T21:09:19.862Z",
            "duration": "PT2M51.004S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F94bd7557-b807-4be6-83aa-83adfa564716%2F70faa1c6-a799-401f-a941-0930690dd232%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1622160864001"
        }
    }
]