[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/88108/amazing-italian-lemon-butter-chicken/",
        "name": "Amazing Italian Lemon Butter Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F223009.jpg",
            "width": 2496,
            "height": 2479
        },
        "datePublished": "2019-07-10T06:54:59.000Z",
        "description": "About eight years ago, a dear Italian woman introduced me to this dish. She has since passed away and taken her recipes with her, as she had nothing written down. This is the closest of all my attempts to duplicate her dish. It is delicious and easier to make than it looks.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "¼ cup white wine",
            "5 tablespoons fresh lemon juice",
            "5 tablespoons heavy cream",
            "1 cup butter, chilled",
            "salt and pepper to taste",
            "½ pound dry farfalle (bow tie) pasta",
            "4 skinless, boneless chicken breast halves - pounded to 1/4 inch thickness",
            "1 tablespoon olive oil",
            "1 tablespoon butter",
            "¼ cup all-purpose flour",
            "salt and pepper to taste",
            "4 ounces bacon",
            "6 ounces mushrooms, sliced",
            "6 ounces artichoke hearts, drained and halved",
            "2 teaspoons capers, drained",
            "chopped fresh parsley for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make the sauce, pour the wine and lemon juice into a saucepan over medium heat. Cook at a low boil until the liquid is reduced by 1/3. Stir in cream, and simmer until it thickens. Gradually add the butter 1 tablespoon at a time to the sauce, stirring until completely incorporated. Season with salt and pepper. Remove from heat, and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to boil. Add pasta, and cook until al dente, about 8 to 10 minutes. Drain, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the chicken, heat oil and 2 tablespoons butter in a large skillet over medium heat. In a bowl, stir together flour, salt, and pepper. Lightly coat chicken with flour mixture. Without crowding, carefully place chicken in hot oil. (If necessary, cook in batches.) Fry until cooked through and golden brown on both sides. Remove the chicken to paper towels. Stir the bacon, mushrooms, artichokes, and capers into the oil; cook until the mushrooms are soft.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the chicken breasts into bite-size strips, and return them to the skillet. Stir half of the lemon butter sauce into the chicken mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, place pasta in a large bowl. Stir the chicken mixture into the pasta. Taste, and adjust seasonings. Stir in additional lemon butter sauce as desired. Toss well, and garnish with parsley.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "URBANCHICK"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3040238450074515,
            "ratingCount": 671,
            "itemReviewed": "Amazing Italian Lemon Butter Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "659.6 calories",
            "carbohydrateContent": "37.4 g",
            "cholesterolContent": "155 mg",
            "fatContent": "44.9 g",
            "fiberContent": "2.9 g",
            "proteinContent": "26.8 g",
            "saturatedFatContent": "25.4 g",
            "servingSize": null,
            "sodiumContent": "660.3 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-18T03:39:55.027Z",
                "reviewBody": "The recipe is excellent but can be streamlined considerably: (1) Heat water for pasta. (2) Prep your raw and canned ingredients. Substitute 6 oz. canned sliced mushrooms drained and rinsed. Drain and rinse canned artichoke hearts and cut into pieces (or use hearts of palm which have a milder more lemony flavor.) Slice the bacon strips into 1-inch pieces. Keep everything in separate prep bowls and set aside. (3) Cook sauce exactly as directed to keep it creamy. Once the last pat of butter is mixed in immediately remove the pan from heat and keep warm (or place on a very low heat and stir occasionally.) Do not keep or reheat on medium or high heat as the cream sauce will separate and become greasy. (4) Slice the raw chicken breasts with the grain into inch strips. Cook in one layer in a non-stick pan on medium heat with 1 Tbs. olive oil until the edges are cooked; then flip the strips and cook for about 2 more minutes until no longer pink and cooked through. Immediately remove from heat place in a bowl and cover with foil to keep the strips warm and tender do not leave them on the burner as overcooking will make the chicken tough and rubbery. (5) While the pasta cooks cook bacon a bit over medium heat; add mushrooms and cook 3-5 minutes; add the artichokes or hearts of palm last heating through about 2 minutes to preserve their soft texture and keep them from becoming mushy. (6) Return chicken strips to the skillet and continue as directed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Claudia Triana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2361582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-18T23:52:39.7Z",
                "reviewBody": "I have a love/hate relationship with this recipe. It has so many delicious ingredients and the final product after significant recipe alteration is yummy but let me start by saying no way is this recipe ready after 30 minutes. No. Way. Impossible. Second the recipe does not specify whether the bacon should be cooked when you put it in or raw. I opted for mostly cooked in my microwave before I dumped it in the pan-- thank goodness or either it would have been raw or everything else would be toast. Third if you make it as the recipe describes it will be ridiculously greasy. I used about half of the butter and one less T of cream and drained and wiped out the pan not only after cooking the chicken but after cooking the mushroom mixture as well but it was STILL greasy! I can only imagine what it would have been like. After all that it was good much like the restaurant recipe I think it's trying to replicate (despite the story about the old lady)... It wasn't any harder to make than it sounded but I could tell it was not a half-hour recipe. Well... I hope that this long recipe review was helpful. The end product was good but the recipe needs major revisions for it to be tasty and/or match the cooking time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "elaffint",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/606967/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-16T17:26:03.7Z",
                "reviewBody": "This is a \"to die for\" recipe but with these ingredients that could be literal.  LOL.  I followed the recipe verbatim and it was one of the BEST things I have ever tasted. And my dinner guests agreed. I salivate just thinking of it.  It is well worth the effort and I did everything in the early afternoon except boiling the farfalle. So when my guests arrived I just added the chicken to the mushrooms, etc. and tossed it until it warmed up.  Reheated the lemon butter sauce.  and boiled the noodles.  Served it with a light, leafy salad with italian dressing and a hot loaf of french bread.  It doesn't get better than this in any ***** restaurant. Thank you for sharing it with us.  And may the wonderful italian woman rest in peace knowing she left a delicious legacy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Penny Newman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1332477/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-20T17:03:30.427Z",
                "reviewBody": "Let me first say this...Lemon Butter Chicken...The name say's it all.If you don't like lemon and butter pass on this recipe.I think the sauce is key here having said that make it last. I followed the recipe exactly and by the time the pasta and chicken was done the sauce had seperated and you are left with alot of butter un-incorperated with the cream.It's much easier to keep the chicken warm then the sauce.The longer the sauce sits the more it breaks down.You can add alot of things to the final dish ie. tomatoes,parmesan cheese or what ever you like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LISA 1212",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/763540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-31T00:47:54.66Z",
                "reviewBody": "This dish was heavenly! I used fat free 1/2 and 1/2 instead of the heavy cream and light margarine instead of the butter and it was delicious! I'm sure the sauce would have been thicker had I used the original ingredients but it was definitely worth cutting some fat. We will definitely be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susie Ginther Brauns",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/850948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-30T18:59:02.91Z",
                "reviewBody": "This was outstanding! I am still getting requests for the recipe. I cooked this for a group of 20 people. I cooked the chicken the night before and purchased chicken tenders to make it easier for prep. I sliced the chicken and bagged it. I cooked the bacon after that and bagged it with paper towels to keep it crisp and reserved some bacon grease for the following day. The next day I cooked the sauce in one pot and cooked the remaining ingredients together and added some bacon grease to the mixture for a little more flavor. I combined the ingredients with the chicken until the chicken was heated through. Before I put the chicken in a chafing dish I added the sauce to the mixture and tossed. It was absolutely delicious! I think if I made it again I would try using procuitto. But this is fabulous! A And GREAT for a buffet!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Geanine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/423187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-06T01:33:27.36Z",
                "reviewBody": "This recipe turned out delicious! My husband said it was better than a restaurant dish. I changed the proportions for the sauce. I mixed 1/4 cup of wine and half 1/4 cup of lemon juice and let reduce. Then I melted a half stick of butter in the sauce and stirred until it melt completely. Then I added 1 cup of heavy cream and a bunch of fresh parsley. I read on another site a trick to keep the sauce from separating is to keep it on low heat and whisk for a long time after adding cream (6-8 min).It came out perfect. Also the dish tastes great with some sprinkled parmesan cheese on the top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1822472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-08T17:00:31.31Z",
                "reviewBody": "This recipe got a \"please make this one again\" from my family. I omitted the mushrooms used flour instead of heavy cream doubled the artichokes and only used half the butter. It was delicious and I would definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "devbriel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2892697/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-15T16:51:55.983Z",
                "reviewBody": "This is a wonderful recipe that everyone in my family loved. I doubled the recipe but tripled the liquids in the sauce. I used several lemons because we all love the flavor and subbed with fat free half and half which worked out very well. Rigatoni with the ridges held the sauce nicely. Thank you so much for a great Sunday evening dinner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Amazing Italian Lemon Butter Chicken",
            "description": "An elegant, easy recipe fit for company!",
            "uploadDate": "2017-12-14T18:25:53.642Z",
            "duration": "PT1M39.266S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F1fee29c9-c9f9-4daf-8b46-d44c1bc823b2%2Feeb40a74-761b-4def-a616-682e59804a88%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5680337044001"
        }
    }
]