[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/135543/porcini-braised-boar-with-artichoke-and-fennel/",
        "name": "Porcini-Braised Boar with Artichoke and Fennel",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Porcini-Braised Boar with Artichoke and Fennel"
        },
        "datePublished": "2019-07-10T06:59:14.000Z",
        "description": "Pop the cork on a good bottle of wine, and get the family together for a feast!  This is stick-to-your-ribs food, Italian style; large pieces of Tuscan wild boar (cinghiale) are braised with cannellini beans and fresh porcini mushrooms, then served family-style with a spicy and tangy vegetable saute.",
        "prepTime": "P0DT0H50M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT11H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 cups dry cannellini beans",
            "1 quart chicken or pork stock",
            "2 cups water",
            "4 pounds wild boar (cinghiale) roast, cut into serving-size pieces",
            "¼ cup olive oil",
            "8 ounces fresh porcini, chanterelles or stemmed shiitake mushrooms, thickly sliced",
            "¼ cup chopped garlic",
            "¼ cup minced fresh rosemary",
            "sea salt and ground black pepper to taste",
            "8 large artichoke hearts, cut into eighths",
            "2 large fennel bulbs, cored and thinly sliced",
            "¼ cup olive oil",
            "2 tablespoons minced garlic",
            "½ teaspoon crushed red pepper flakes",
            "½ cup white wine",
            "¼ cup freshly squeezed lemon juice",
            "extra-virgin olive oil for drizzling",
            "½ cup grated pecorino Toscano (or pecorino Romano) cheese",
            "½ cup chopped Italian flat leaf parsley",
            "1 lemon, zested"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak beans in ample cold water overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain cannellini beans and pour into a large Dutch oven along with chicken stock and water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer for 1 hour, skimming any foam that forms. Remove boar from the refrigerator and allow to rest at room temperature during this time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1/4-cup olive oil in a large skillet over high heat until it begins to smoke. Add boar pieces, and sear until browned on all sides. Remove seared boar, and place into the pot, on top of the gently simmering beans. Heat the skillet until smoking once again, then stir in porcini mushrooms and cook for 2 minutes to soften. Add 1/4 cup garlic and continue cooking until the garlic has turned golden brown. Sprinkle with chopped rosemary and cook for 30 seconds more before adding the mushrooms to the boar and beans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and continue simmering the boar and beans until both are tender, adding additional water if needed, about 1 1/2 hours. Once ready, season lightly to taste with sea salt and freshly ground pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the beans are nearly ready, place the artichoke hearts into a large skillet with some water. Cover, and steam over high heat until just tender, about 2 minutes; then add the sliced fennel, and steam for 1 minute more.  Drain in a colander, and return skillet to the stove.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce heat to medium-high and pour in 1/4 cup of olive oil and 2 tablespoons of minced garlic. Cook, stirring frequently, until the garlic turns golden, then sprinkle with red pepper flakes and add the drained vegetables. Stir and cook until the vegetables are tender and golden, about 2 minutes. Pour in white wine, cook until nearly evaporated, then season with lemon juice, salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, mound vegetables into the center of a large platter and place the pieces of boar on top. Spoon the beans around the vegetables, drizzle liberally with extra-virgin olive oil, and sprinkle with pecorino Toscano cheese, parsley, and strands of lemon zest.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "eat!"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.333333333333333,
            "ratingCount": 3,
            "itemReviewed": "Porcini-Braised Boar with Artichoke and Fennel",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "820 calories",
            "carbohydrateContent": "74.2 g",
            "cholesterolContent": "118.5 mg",
            "fatContent": "30.3 g",
            "fiberContent": "13 g",
            "proteinContent": "64.7 g",
            "saturatedFatContent": "6.2 g",
            "servingSize": null,
            "sodiumContent": "480.7 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-07-14T17:05:43.887Z",
                "reviewBody": "Very good hard to find wild boar.. but worth it. Make this on a Sunday cause you will need some time. I will make again for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey08",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2593342/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-26T16:18:06.937Z",
                "reviewBody": "This is quite good though I did change some thing. I cut the recipe in half. I used canned cannellini (a.k.a white kidney) beans instead of dried simply to save time so I skipped the first two steps until it came time to add the pork. I cut the roast into large cubes and rubbed with my own version of all-purpose spice mix then browned and placed in the pot with the simmering beans. Next I sliced button mushrooms (was on a tight budget...) along an onion and let it cook down then added the garlic and rosemary. Tossed that into the pot. I didn't steam the fennel or artichokes- Fresh artichokes were unavailable the canned ones were costly so I opted to use the marinated kind which I rinsed thoroughly and diced. Also diced the fennel cooked it down a bit in the skillet then added both veggies to the both. Made the garlic-chili oil then added to the pot (I went a little crazy with flakes so it came out a bit too spicy next time I'll stick to what the recipe asks for). I didn't have any wine but opted to use some Ouzo to replace it as it is an an excellent pairing with fennel (due to the licorice flavour they both share) and chose this moment to add that and the lemon juice to the pot and let it all cook for 2 hours on low. I made the topping described subbing some of the parsley for fennel fronds. It seemed quite soup-y not like a stir-fry as described in the heading of the recipe. So I added 1/2 cup of pearl barley and it thickened nicely. Served with biscuits.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            }
        ]
    }
]