[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/215/salad/pasta-salad/",
                    "name": "Pasta Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16186/salad/pasta-salad/chicken-pasta-salad/",
                    "name": "Chicken Pasta Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/141991/rosemary-chicken-couscous-salad/",
        "name": "Rosemary Chicken Couscous Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2132477.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-07-10T06:59:53.000Z",
        "description": "This is a wonderful summer salad. Fresh herbs keep the salad light, while the chicken and feta cheese make it hearty enough to serve for a main meal. Use as a side dish by omitting the chicken and adding chopped artichoke hearts. The salad also works wonderfully with grilled salmon or chicken.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 cups chicken broth",
            "1 (10 ounce) box couscous ",
            "¾ cup olive oil",
            "¼ cup fresh lemon juice",
            "2 tablespoons white balsamic vinegar",
            "¼ cup chopped fresh rosemary leaves",
            "salt and ground black pepper to taste",
            "2 large cooked skinless, boneless chicken breast halves, cut into bite-size pieces",
            "1 cup chopped English cucumber",
            "½ cup chopped sun-dried tomatoes",
            "½ cup chopped pitted kalamata olives",
            "½ cup crumbled feta cheese",
            "⅓ cup chopped fresh Italian parsley",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken stock in a saucepan and bring to a boil over medium-high heat. Stir in couscous. Remove pan from the heat; cover, and let stand for 5 minutes. Fluff couscous with a fork. Cool for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, make the dressing by combining the olive oil, lemon juice, and vinegar in the bowl of a blender or food processor; mix on low until mixture thickens. Stir in rosemary. Season to taste with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the chicken, cucumber, sun-dried tomatoes, and olives in a large bowl. Stir in the couscous, Feta cheese, and parsley. Season to taste with salt and pepper. Toss the salad with half the dressing. Taste, and add more dressing as desired, or, if making the salad in advance, add additional dressing just before serving.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Pasta Salad",
            "Chicken Pasta Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Shayna"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6477272727272725,
            "ratingCount": 88,
            "itemReviewed": "Rosemary Chicken Couscous Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "645.7 calories",
            "carbohydrateContent": "44 g",
            "cholesterolContent": "68.1 mg",
            "fatContent": "38.8 g",
            "fiberContent": "3.4 g",
            "proteinContent": "29.5 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "911.4 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-29T18:17:03.133Z",
                "reviewBody": "This was a delicious recipe!  Great combination of flavors - I was tempted to leave out the olives but I'm glad I added them - the kalamata's added a delicious, subtle taste.  To make it a little lighter, I used much less oil and whole wheat couscous.  You can also used reduced fat feta to cut out some more fat.  I also sauteed the chicken in a balsamic marinade to give it extra flavor. The second time I made this I used fig flavored white balsamic which was delish!\r\n\r\nUpdate - made again replacing sundried tomatoes and olives with dried cranberries and chickpeas. Also used a honey flavored rotisserie chicken.  It worked great for a sweeter option (can also use goat cheese instead of feta)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cigall Daboosh Goldman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cigall/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-16T20:10:39.46Z",
                "reviewBody": "This is an interesting tasty recipe; I'm so glad I tried it! I made it last night because the ingredient mix was not a familiar taste combination to me. Also I wanted to make enough to share with a neighbor who had been very helpful to me during some recent medical problems and now had some of her own. I made the recipe as written though I used extra virgin olive oil (2/3rds cup) 1 1/2 Tbs regular balsamic vinegar and added a bit more lime juice (didn't have lemon) after tasting. In my mind this is not a big change to the recipe. Used the fresh herbs rather than dried as listed. The dressing tasted a bit odd but other reviewers said to try it. I cut up two boneless skinless chicken breasts into fairly small slivers rather than chunks then pan fried a few minutes added some water covered and cooked through. Drained the juice (saved for my cats) then refrigerated the chicken. Julienned English cucumber with a small V-Slicer Plus mandoline (available from BB&B) chopped the kalamatas and chopped some oil-packed sundried tomatoes. Made 1 cup couscous in only 1 cup water with some butter and Herb-Ox dried chicken bouillon powder. Turned out fine. Mixed it all up and tasted. Needed some more salt and pepper. Then added about a cup of chopped oil-packed artichoke hearts and tasted again. Great! Served over chopped lettuce. My neighbor and her husband really enjoyed it wanted the recipe for herself and my husband wanted seconds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sylvia S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2108569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-10T05:00:27.373Z",
                "reviewBody": "Great for a summer meal. Friends loved it and asked for the recipe. I would cut down on the vinegar next time though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "L Kelley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2423057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-14T17:34:44.087Z",
                "reviewBody": "This was just awesome! I made it as written since this was my first cooking experience with couscous and my first time with a Mediterranean style dish. I will make this often but I will definitely cut way back on the olive oil and I'll use fresh tomatoes and cucumbers out of my garden instead of sun-dried tomatoes and English cucumbers. Probably going to use black olives next time just from an expense standpoint too. I'll also thoroughly cool the couscous before adding the cucumbers since the cucumbers became slightly less crispy because of the warmth. The flavor was unbelievably good and I'm trying to think of other uses for the dressing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3180988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-26T23:36:53.35Z",
                "reviewBody": "Great refreshing salad! I did make a few changes though...didn't have sun-dried tomatoes so used roasted red and yellow peppers. Also this recipe makes WAY too much dressing. It had a good flavor (I used a 1/2 C evoo and a 1/2 C lemon juice 2 T. regular balsamic and the rosemary S&P) but I only used a few tablespoons to dress the salad. Maybe just put it out on the table so your guests can put as much or as little as they want on their salad. Addictive!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "back2kristal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5101973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-20T18:06:25.977Z",
                "reviewBody": "Really delicious. I only used about 3/4 of the salad dressing and there could be less olive oil and I didn't use white balsamic. I added dried cranberries as well as the sun dried tomatoes because it definitely needed some colour however next time I make it I will use the cranberries and omit the sun dried. I will also like to add some artichokes next time. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kati Stroh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3693976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-02T14:43:37.307Z",
                "reviewBody": "DIDN'T LIKE AT ALL",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DebbieReboin15",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chloesherwood15/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-30T23:45:09.683Z",
                "reviewBody": "I made this recipe with orzo instead of couscous because I had it in the pantry and it was delicious. I cooked the orzo and prepared the dressing the night before added several Tbsps of dressing to the orzo and chilled overnight. I wanted the orzo to incorporate the dressing flavors. I chopped all of the other ingredients the next morning and put the salad together. Took it to a picnic and received several compliments. My only other change was to use chopped grape tomatoes instead of sundried. I felt there were several strong flavors (Feta olives rosemary) and maybe the sundried would be one too many.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tinlizzie70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6964230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-23T22:44:23.23Z",
                "reviewBody": "Very tasty stuff quite full of flavor. It makes a lot more than I expected so it definitely needs to be cut in half if you aren't preparing for a whole family or party. It's also a lot of prep for a salad but it makes a great summer main dish. I followed suggestions for cutting down the oil added garlic yellow pepper and purple onion. I also used a veggie stock instead of chicken so that vegetarians could pick the chicken out. The fresh rosemary is interesting--definitely needs to be chopped up a bit since it has a tough texture that reminds me of pine needles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellorgast",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3251394/"
                }
            }
        ]
    }
]