[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/215/salad/pasta-salad/",
                    "name": "Pasta Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16191/salad/pasta-salad/seafood-pasta-salad/",
                    "name": "Seafood Pasta Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16193/salad/pasta-salad/seafood-pasta-salad/shrimp-pasta-salad/",
                    "name": "Shrimp Pasta Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/144948/fresh-dill-pasta-salad/",
        "name": "Fresh Dill Pasta Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9271365.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-07-10T07:00:14.000Z",
        "description": "A nice twist to your standard shrimp salad. I made this recipe when I had tons of dill in my garden and needed something to do with it. Enjoy!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "6 cups",
        "recipeIngredient": [
            "1 (8 ounce) package seashell pasta",
            "1 cup mayonnaise",
            "¼ cup sour cream",
            "1 ½ tablespoons lemon juice",
            "1 ½ tablespoons Dijon mustard",
            "¼ cup chopped fresh dill weed",
            "¼ teaspoon ground black pepper",
            "2 (4 ounce) cans small shrimp, drained",
            "½ cup chopped celery",
            "½ cup chopped seeded cucumber",
            "2 tomatoes, diced",
            "3 tablespoons minced shallot",
            "salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook until tender, about 8 minutes. Drain and rinse under cold running water to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a serving bowl, combine the mayonnaise, sour cream, lemon juice, mustard, dill and black pepper. Gently stir in the pasta, shrimp, celery, cucumber, tomato and shallots. Mix in salt to taste and refrigerate for at least 2 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Pasta Salad",
            "Seafood Pasta Salad Recipes",
            "Shrimp Pasta Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Krazykhat"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.404255319148936,
            "ratingCount": 47,
            "itemReviewed": "Fresh Dill Pasta Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "241.1 calories",
            "carbohydrateContent": "16.8 g",
            "cholesterolContent": "41.4 mg",
            "fatContent": "16.4 g",
            "fiberContent": "1 g",
            "proteinContent": "7.5 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "192 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-06T20:06:53.57Z",
                "reviewBody": "Between reading the reviews and my own experience I found this clearly is a recipe that needs to be worked with to get it to suit your tastes - and I guess I \"worked\" with it a lot. For me I found it a tad heavy on the mayonnaise and light on the seasoning. I added Jane's Krazy Mixed Up Salt Penzey's Fox Point Seasoning and a fair amount of salt and pepper which definitely helped brighten the flavor. As for the too much mayo issue I'm hoping it might be better tomorrow after it has a chance to set overnight and absorb some of the excess. Further I agree with other reviewers on a couple of points - one that the tomato isn't a good choice particularly if this is going to be made ahead of time so I left it out - but I threw in some frozen peas instead which I feel is a far better choice. I also agree that farfalle (pasta in the shape of bow ties) is a nice choice so I used that instead of the seashell pasta not that it wouldn't have been good too. Canned shrimp is kind of salty and mushy so I used frozen pre-cooked shrimp instead. I used fresh green onion instead of the shallots because I believe the taste and bite of the shallots would have been overpowering. The recipe on its own is perhaps a good base recipe or if left as it stands fairly nondescript and ordinary. Four stars with changes like mine or your own that appeal to you and your tastebuds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T18:12:38.803Z",
                "reviewBody": "This is good recipe but use frozen shrimp not canned! If possible, AVOID shrimp that has been peeled and deveined before freezing. It may cause a loss of flavor and texture (the shells help to protect the meat of the shrimp). I used an entire bag of U36/40 sized shrimp b/c I like a bigger shrimp in my salads.  I adjusted the quantities of the veggies in the recipe to 1 c. of celery, 1 c. of cucumber, 4 small tomatoes (which I seeded) and 5 TBS of shallots. I would recommend Farfalle (bow tie) pasta instead of shells and I used more like 12 oz. Shells just seems to trap dressing which can be good or bad depending on your sensibilities. I adjusted the dressing too by adding a TBS of Worchestershire sauce and more dill but quantity wise there was plenty of dressing even with the increases in veggies and pasta.  This salad needs generous amounts of salt and pepper but all in all it's very tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LeBlond",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2821706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-04T17:26:21.99Z",
                "reviewBody": "My FIL brought up shrimp salad last week and when he brought it up it sounded so good to me. It used to be my favorite dish. We bought the ingredients and they cost about 22.00 however we have a slew of fresh produce and pasta left over for another meal. Considering the spaghetti dish the other night cost much more at the store I was happy. My husband demands Miracle Whip so we did not use the mayo. I added another can of shrimp cut back on the lemon used dried dill (1/2 Tb) and only used 1 tomato and 1 medium cuke. It's a nice medley of taste and texture. I could have added more dill but know that the dish will age over the next two hours and the 1/2 Tb will be sufficient. Thanks for sharing this recipe and I hope to find many more recipes to try...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dwieberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dwieberg/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-29T15:23:01.64Z",
                "reviewBody": "I made this salad for our branding and everyone wants me to bring it to theirs. I make it with the Bow Tie noodles. I make the salad a day ahead of time and make extra dressing because it absorbs into the salad.  I also add the tomatoes the next day. I use the big frozen shrimp instead of canned. I thought it needed a little something and all that was some celery salt! It just gets better and better the longer it sets so I am thinking about making it a couple days ahead of time! There is not too much of anything so I don't know what anyone is complaining about....must not like mayo! Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "laceygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4851039/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-10T22:09:48.84Z",
                "reviewBody": "This was excellent! I used 1/2 c. fat free plain yogurt and 1/2 c. low fat mayo instead of 1 c. mayo. I used the larger frozen shrimp and cut them in 1/2. Next time I'll use grape tomatoes cut in half. Thanks for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "C.H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-07T23:13:26.47Z",
                "reviewBody": "I used fresh everything from my greenhouse (dill cukes tomatoes onions) and made this for an annual BBQ at my home. FANTASTIC flavor. I used LOTS of bigger shrimp instead of canned ones. Also the amount of dressing was perfect for a batch and a half (my box of pasta was 13oz).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "patty crocker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/295707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-15T16:23:08.68Z",
                "reviewBody": "I made this as written but next time I would change a few things. I would double the pasta double the dressing double the shrimp and double everything else because you just want more and more! Thanks for the fabulous recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5405421/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-05T17:13:04.997Z",
                "reviewBody": "This was pretty good. Not as good as the deli near my house though. I used the small canned shrimp as per recipe and they were miniscule. I would definitely go with a larger shrimp next time. Also when I was making the dressing I thought a cup of mayo was going to be too much so I started with a half a cup (left everything else the same) and it was perfect. I also ommited the tomatoes because I didn't think they'd last well in the salad after the first day. One last thing I'm not sure how much I liked the lemon in this. I love lemon but if you plan to eat the salad right away the lemon is over-powering. After a day or two it's much better. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Wiley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2405207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-27T16:48:53.93Z",
                "reviewBody": "I made this in a hurry and let it chill for a couple hours and with a couple alterations it was pretty good. I used tuna instead of shrimp as it was what I had on hand. Also skipped the cucumber and tomato. Otherwise followed it and everyone was really happy. I likely used double the dill as I wasn't using a measuring cup but more dill is so so good!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyndsayjoy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3057699/"
                }
            }
        ]
    }
]