[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1227/everyday-cooking/vegan/",
                    "name": "Vegan",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/148509/vegan-friendly-falafel/",
        "name": "Vegan-Friendly Falafel",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1119027.jpg",
            "width": 1656,
            "height": 1936
        },
        "datePublished": "2019-07-10T07:00:25.000Z",
        "description": "This is an easy vegan falafel using dried garbanzo beans and ingredients you already have in your cupboard. No eggs or bread crumbs either as filler--just tasty falafel! Serve with tzatziki and typical falafel fare such as lettuce, tomato, and cucumber. It's not much more work than using canned beans, but the taste is phenomenal and authentic.",
        "prepTime": "P0DT0H25M",
        "cookTime": null,
        "totalTime": "P1DT2H25M",
        "recipeYield": "30 servings",
        "recipeIngredient": [
            "1 pound dry garbanzo beans",
            "1 onion, quartered",
            "1 potato, peeled and quartered",
            "4 cloves garlic, minced",
            "½ cup cilantro leaves, chopped",
            "1 teaspoon ground coriander",
            "1 teaspoon ground cumin",
            "2 teaspoons salt",
            "½ teaspoon ground black pepper",
            "½ teaspoon cayenne pepper",
            "2 teaspoons fresh lemon juice",
            "1 tablespoon olive oil",
            "1 tablespoon all-purpose flour",
            "2 teaspoons baking soda",
            "2 cups canola oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse the garbanzo beans under cold water and discard any bad ones. Place in a large pot, and cover with water. Let soak 24 hours, and rinse again.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the garbanzo beans, onion, and potato in the bowl of a food processor. Cover, and process until finely chopped. Leaving about 1 cup of the garbanzo bean mixture in the food processor bowl, pour the rest into a mixing bowl. Add the garlic, cilantro, coriander, cumin, salt, pepper, and cayenne pepper to the garbanzo bean mixture in the food processor bowl; process on low to blend thoroughly. Return the reserved garbanzo bean mixture to the food processor bowl, and add the lemon juice, olive oil, and flour; process on low into a coarse meal. Cover, and refrigerate 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the baking soda into the garbanzo bean mixture until evenly blended. Using damp hands, form the mixture into 1 1/2  inch diameter balls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the canola oil into a wok 1 to 2 inches deep, and heat over medium-high heat. Cook the falafel balls, turning so all sides are evenly browned, about 5 minutes. Remove falafel from oil, and drain on paper towels. Repeat to cook remaining falafel balls.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegan"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marian"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5396825396825395,
            "ratingCount": 63,
            "itemReviewed": "Vegan-Friendly Falafel",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "244.5 calories",
            "carbohydrateContent": "33.8 g",
            "cholesterolContent": null,
            "fatContent": "8.7 g",
            "fiberContent": "8.9 g",
            "proteinContent": "9.6 g",
            "saturatedFatContent": "0.8 g",
            "servingSize": null,
            "sodiumContent": "731.2 mg",
            "sugarContent": "5.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-21T18:56:42.593Z",
                "reviewBody": "Finally a recipe submitted using dry chickpeas instead of canned.  You have to do it right to get authentic falafel. You don't cook the chickpeas, only soak overnight and then grind, this makes a real difference in the outcome. I have made with and w/o potato, no difference.  I am not familiar with cilantro in falafel (so I didn't try it), we only use fresh parsley in the middle east,  and another teaspoon of cumin was needed for our tastes. I also use an additional 2 tablespoons of flour to help it hold together well. And all falafel here is served with a tasty tahina (sesame seed paste) sauce.  Here it goes: 1 small clove garlic, crushed with a mortar and pestle (or forget the mortar like I do and just squash it up in the bowl with the pestle)1/2 of a juicy lemon, about 1/4 cup tahina (you can find tahina in the specialty aisle) 1/4 teaspoon salt or to taste and a couple of tablespoons of room temp water.  Whisk together, adding more water if needed until it is a drizzling consistency. Drizzle over falafel or use in falafel sandwiches. Enjoy and thank you for a good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Noor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1416920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-06T01:38:37.863Z",
                "reviewBody": "These are great and very easy.  I couldn't see where the recipe said to add the flour, so I added it when I added the baking soda.  I have used another recipe for years, but it always had a raw bean flavor which this recipe doesn't have.  I baked these instead of frying.  I dropped them from a rounded teaspoon onto a parchment lined baking pan, covered with foil and baked for 15 minutes at 350 degrees.  I then uncovered and turned them, and returned them to the oven uncovered for another 15 minutes.  Very tasty wrapped in an untraditional tortilla with sprouts and tomatoes and cucumbers and a vegan thousand island too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DABDAB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1322808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-10T06:47:30.19Z",
                "reviewBody": "Loved this!  I've been trying to make falafel like this for years with no success.  I baked mine rather than frying and it came out perfectly.  It won't be long before I can recite this recipe by heart.  Thanks very much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GeorgieGirlNZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2971220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-01T19:37:39.707Z",
                "reviewBody": "This is my go-to recipe because I believe in authenticity and not using fillers like bread crumbs, eggs and the like. In the Middle East, they use parsley (not cilantro) and use dried beans soaked overnight, so that's how I make it. You can also bake these in the oven like others suggest: I preheat to 400F or 200C, oil the sheet, spoon and shape then bake 10-15 min on each side (depends on the oven). Don't be scared off by the vegan label. It's the best falafel recipe on this website, and it's the only one I use.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2338944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-12T22:32:17.503Z",
                "reviewBody": "Maybe \"vegan\" in the recipe name scares people, hence so few reviews? This is easily the best falafel recipe I've ever tried. I leave out the potato and double the garlic, cilantro, cumin, and coriander. With shredded drained cucumbers mixed in plain yogurt with a little cayenne, some good chopped tomatoes, cabbage, and maybe some more fresh cilantro, oh my!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PISKURG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1419723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-13T23:46:19.713Z",
                "reviewBody": "These falafels were phenomenal! I didn't know how much a pound of dry garbanzo beans were (I buy in bulk and don't have a food scale) so I just used two cups of dry beans. I kept everything else in the recipe the same except I added an extra teaspoon of cumin and only added one teaspoon salt I used parsley instead of cilantro and I omitted the potato. I didn't have any flour in the house so I used cornmeal instead. I fried them up in my cast iron skillet and they were great. I tried baking some too but frying them definitely tastes better. I also kept them in the fridge for a day and a half instead of the two hours (I was going to make them earlier but got too busy so made them the next day). The great thing about that is that you can prepare these ahead of time and they still turn out great! My boyfriend also loved them and said it was better than the falafel at this Lebanese restaurant we frequent! This recipe is definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "smallwhiteflower",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5200807/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-10T03:16:42.473Z",
                "reviewBody": "Very good. Needed to add more flour because it was to wet. I think I used to large of a potato. The taste and texture were great. Baked instead of fried 20-30 min. at 350",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VickyBeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2337309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-29T19:32:01.92Z",
                "reviewBody": "I loved this - it's so cheap to make and still really delicious. I hate cilantro so I used parsley per another reviewer's suggestion. The potato seemed to make the mix pretty watery so for the first batch I felt like I added quite a bit of flour but then I let it sit in the fridge overnight and it seemed less watery the next day. I served it with an improvised version of tzatziki sauce which went really well with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TDCROFT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1033628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-31T05:58:22.64Z",
                "reviewBody": "These were so good! I used canned garbanzo beans but otherwise kept ingredients the same. I prefer to bake vs. fry for health reasons so they were baked at 375 until golden brown about 20 minutes. I salted some zucchini til it was soft rinsed and dried...then wrapped the falafels with the zucchini and some tomato chutney tastiness!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vanessa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/eaturheartout/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-07T00:19:30.833Z",
                "reviewBody": "End product is pretty good but there are some major problems with the amounts of ingredients called for. The garbanzos potato and onion makes a huge amount of falafel but the recipe only calls for 1 tsp. of cumin? I quadrupled the amount of cumin and doubled most of the other spices (except the salt; it was plenty). Also doubled the flour and added bread crumbs and it was still quite loose. I baked though and the end product consistency was good. Would probably be four stars otherwise but as is the recipe has flaws that must be addressed when making.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "vacax",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3665387/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Vegan-Friendly Falafel",
            "description": "See how to make a delicious vegan falafel.",
            "uploadDate": "2013-03-04T22:04:49.709Z",
            "duration": "PT5M31.665S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe8447981-35a5-4af1-a0b8-1213e39b391f%2F169a5f77-fd24-4fc4-9f6c-08704ac0dab2%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2203319770001"
        }
    }
]