[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/202/meat-and-poultry/game-meats/",
                    "name": "Game Meats",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/665/meat-and-poultry/game-meats/duck/",
                    "name": "Duck",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212667/adams-family-duck/",
        "name": "Adams Family Duck",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F925045.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-07-10T07:02:00.000Z",
        "description": "This is a special treat I prepare for my family.  The fruity stuffing makes the duck doubly delicious, and the preparation is fairly lean for such a normally fatty meat.  Pretty sophisticated stuff, but not expensive to prepare. We truly enjoy it and hope you will, too :) I recommend serving this with the following: wild rice with mushrooms and walnuts for starch, a slice or two of whole-grain (preferably homemade) wheat bread, rutabaga, sauteed whole green beans and a spinach or beet salad.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H15M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 roasted duck",
        "recipeIngredient": [
            "1 (5 pound) whole duck, neck and giblets reserved",
            "1 (6 ounce) can orange juice concentrate, thawed, divided",
            "1 teaspoon minced garlic",
            "salt and freshly ground black pepper to taste",
            "1 onion, coarsely chopped, divided",
            "1 cup raisins",
            "1 apple - peeled, cored, and cut into chunks",
            "1 large carrot, thickly sliced",
            "½ cup chicken broth",
            "¼ cup lemon juice (see Cook's Note)",
            "salt and freshly ground black pepper to taste",
            "1 tablespoon olive oil",
            "1 onion, coarsely chopped",
            "2 cloves garlic, minced",
            "1 carrot, thickly sliced",
            "1 cup chicken broth",
            "½ cup lemon juice (see Cook's Note)",
            "1 cup orange juice",
            "1 sprig fresh parsley, chopped",
            "salt and freshly ground black pepper to taste",
            "1 tablespoon sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Rinse the duck, remove any pieces of excess fat from around the cavity, and prick the duck's skin all over with a fork or sharp skewer, being careful not to puncture the meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rub the skin of the duck and inside the duck cavity with 1 tablespoon of orange juice concentrate. Rub 1 teaspoon  of minced garlic inside and outside the duck, and sprinkle the duck, inside and outside, with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together about 2 tablespoons of chopped onion, the raisins, and apple in a bowl, and lightly stuff the cavity of the duck with the raisin mixture. Truss the duck, and place it onto a rack set in a roasting pan. Scatter the remaining chopped onion and slices of large carrot in the roasting pan around the duck.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make basting mixture, whisk together remaining orange juice concentrate, 1/2 cup of chicken broth, 1/4 cup lemon juice, and salt and pepper in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast the duck in the preheated oven for 1 hour, basting occasionally with the basting mixture. After 1 hour, pour off the rendered fat, and roast, basting occasionally, until no longer pink at the bone and the juices run clear, about 1 more hour. An instant-read thermometer inserted into the thickest part of the thigh should read 165 degrees F ( 74 degrees C).  Reserve any left-over basting mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the duck is roasting, prepare duck stock. Heat olive oil in a saucepan, and brown the reserved neck and giblets over medium heat. Stir in 1 onion, 2 garlic cloves, and 1 carrot, and cook and stir until the onion is translucent, about 5 minutes. Stir in 1 cup chicken broth, 1/2 cup lemon juice, orange juice, parsley, and salt and pepper, bring to a boil, and cover. Reduce heat and simmer for 1 hour; strain the stock and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the duck from the oven and place on a warm platter. Arrange cooked vegetables around the duck, if desired. Remove stuffing to a serving bowl. Let the duck rest about 15 minutes before carving.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the duck is resting, finish the sauce. Skim fat out of the roasting pan, and pour reserved basting mixture into the pan, stirring and scraping to dissolve the brown bits of flavor from the bottom of the pan. Bring the mixture to a boil over medium heat, and stir in the reserved duck stock. Bring back to a boil, and cook the sauce down by about half, stirring constantly to prevent burning, about 10 minutes. Whisk in sour cream to make a smooth, glossy sauce. Pour the sauce over the carved duck to serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Game Meats",
            "Duck"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "The Magpie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.481481481481482,
            "ratingCount": 27,
            "itemReviewed": "Adams Family Duck",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "747.1 calories",
            "carbohydrateContent": "74.1 g",
            "cholesterolContent": "220.5 mg",
            "fatContent": "26.7 g",
            "fiberContent": "5.1 g",
            "proteinContent": "55.8 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "251.5 mg",
            "sugarContent": "55.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-02-01T18:48:44.277Z",
                "reviewBody": "Duck was good. Recipe was complex. I used cranberries instead of raisens.  The only thing I would change is the carrots. They where hard. I believe mushrooms would of cooked better. I added fresh Tyme to my stock. Served with potatoes and applesauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3467515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T18:41:08.717Z",
                "reviewBody": "This duck was AMAZING! Of course starting with good products helps but this recipe resulted in a juicy well-prepared duck and a wonderful sauce/gravy! I would definitely recommend the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Lynne Lautrup",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5162353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-26T19:01:23.057Z",
                "reviewBody": "Awesome awesome awesome!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katmarcoux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3627637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-26T19:13:29.883Z",
                "reviewBody": "I made this duck for Christmas and everyone loved it.  I made two ducks, and I doubled the stuffing mixture, plus I added about 1/2 cup of fresh cranberries.  I read the reviews, but I decided to add the carrots to the pan, and next time I would add more carrots and onions to serve with the dinner-they were delicious! \nWhen I was chopping the onion, I chopped it a little small for the stuffing, and then chopped some larger onion for the pan. Next time I would chop all of the onion somewhat larger.\nI made 1 1/2 times the basting sauce (and used white cranberry juice instead of lemon juice) and stock, but it makes a lot of sauce. Next time I would not increase the stock or basting sauce recipe for two ducks. (The sauce was delicious and definitely worth the effort!).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10610375/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-21T17:05:07.26Z",
                "reviewBody": "I used Mary's organic duck. I splashed some dry sherry inside and let it sit for 30 min while prepairing the rest. Used more apples and no carrots following an advise of previous user. Didnit use a lemon juice but sherry for basting....I added some nutmeg clove orange zest few haselnuts walnuts and also few pitted sour cherries to stuffing of apples sweet onion and raisins. Baked duck together with apples in the roasting pan. It came out ABSOLUTELY AMAZING! It was tasting as old world game! Served with rosmary mash pottoes...yammm!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cleola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10352815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-26T01:03:06.587Z",
                "reviewBody": "We had never roasted duck before.  For a Christmas dinner for six, we roasted two six-pound ducks following this recipe with only a few changes.  Our ducks were already heavily browned after a half hour, so we lowered them in the oven and covered them with foil.  We removed them from the oven after two hours when the thermometer read 172 degrees F.  In retrospect, we probably should have cooked them longer because the flesh around the bone, though warm, was still reddish pink.  Our stuffing included cranberries, and we sauteed the onions.  Everyone raved over the recipe, which we joined with sauteed brussels sprouts, sauteed spinach, garlic mashed potatoes, red wine, and flan.\n\nAnother change we made was to add a second sauce made from a reduction of about one-third cup of balsamic vinegar, one-third cup of raspberry preserves, a splash of red wine, and a splash of chicken stock with salt, pepper, and cinnamon.  (Next time I would probably thicken with cornstarch.)  Boil, then reduce the heat and strain the mixture to remove the seeds.  Our guests preferred this more pungent sauce for the duck.\n\nThank you Adams Family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "REOlsen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3417174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-03T07:42:49.593Z",
                "reviewBody": "I really enjoyed this recipe as it was my first time trying out duck. However I wasn't a big fan having fruit for the stuffing. I found the fruit inside to taste different than I really thought it would have been.  Other than that I love the taste of the meat. Very flavorful, I would recommend having some red wine!\n\nI also found that duck can really feed only 2. There isn't a lot of meat on duck.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Loud Duck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10668792/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-24T06:27:29.74Z",
                "reviewBody": "Made this for a large family Christmas dinner along with a ham for those who said they didn't like duck. After dinner we all agreed that... Next year we have 2 ducks and NO HAM! -for this ham lov'in bunch...that's big! Thanks Adams family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol Bradley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3700915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-12T14:23:12.277Z",
                "reviewBody": "I definitely plan on using this duck recipe again :) It was actually my first time making and eating duck! The only thing I did different was make stuffing with the raisin mixture. I was in a hurry shopping  and grabbed cranberry juice infused raisins (never even heard of that) and it tastes even better. I might even make this for every holiday:) it's a little time consuming so, next time I'll debone the duck so it cooks faster. Seriously, anyone reading this you have to use this recipe! It's so simple especially if you like to cook!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elise Jardine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14884548/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-21T04:50:29.577Z",
                "reviewBody": "I added marmalade to the stock and thickened the sauce with a little cornstarch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Collier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14282882/"
                }
            }
        ]
    }
]