[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/235/world-cuisine/middle-eastern/",
                    "name": "Middle Eastern",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1824/world-cuisine/middle-eastern/lebanese/",
                    "name": "Lebanese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214029/lamb-shawarma/",
        "name": "Lamb Shawarma",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9325729.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-07-10T07:02:11.000Z",
        "description": "This is a wonderful Middle Eastern dish that I was introduced to by a friend of mine from Lebanon. This recipe yields an absolutely amazing tasting and tender final product. Shawarma can be used in pitas, be put on fattoush, on hommus, or eaten plain.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT12H50M",
        "recipeYield": "8 shawarmas",
        "recipeIngredient": [
            "½ cup plain yogurt",
            "¼ cup water",
            "2 tablespoons fresh lemon juice",
            "1 tablespoon distilled white vinegar",
            "1 tablespoon olive oil",
            "½ cup chopped onion",
            "2 cloves garlic, minced",
            "1 tablespoon salt",
            "½ teaspoon ground black pepper",
            "½ teaspoon ground cumin",
            "⅛ teaspoon ground nutmeg",
            "⅛ teaspoon ground cloves",
            "¾ teaspoon ground mace",
            "1 teaspoon cayenne pepper",
            "5 pounds boneless lamb shoulder, cut into 1/4-inch-thick strips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the yogurt, water, lemon juice, vinegar, olive oil, onion, and garlic into a large mixing bowl. Whisk in the salt, black pepper, cumin, nutmeg, clove, mace, and cayenne pepper until evenly blended. Mix in the lamb strips to coat. Cover the bowl with plastic wrap, and marinate in the refrigerator 12 to 24 hours (the longer the better).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over high heat. Cook the lamb strips in a single layer in batches until the fat melts and the meat has browned and is no longer pink on the inside, about 5 minutes, turning occasionally.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Middle Eastern",
            "Lebanese"
        ],
        "recipeCuisine": [
            "Middle Eastern",
            "Lebanese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "jwagner"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6440677966101696,
            "ratingCount": 59,
            "itemReviewed": "Lamb Shawarma",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "375.7 calories",
            "carbohydrateContent": "3 g",
            "cholesterolContent": "115 mg",
            "fatContent": "26.8 g",
            "fiberContent": "0.4 g",
            "proteinContent": "29 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "966 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-08-04T20:51:36.09Z",
                "reviewBody": "I was hesitant to make this recipe cause it wasnt reveiwed by anyone yet and i never cooked lamb before but i was so glad i tried it. It was soooo good. I had to make the marinade twice cause the first time i made it, it was way to hot and i actually like to eat hot things. So the second time i made it i reduced the cayanne pepper to 1/8tsp and it was perfect. I also tried the lamb 12hrs in the marinade and then 24 and definately the 24hrs was best.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lizzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1854400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-12T00:58:33.787Z",
                "reviewBody": "Made the full recipe for the sauce with the addition of 1/4tsp. allspice. However only used 1lb of Dall Sheep (game meat) cut into bite sized pieces. It was lovely.\nThe yogurt, like buttermilk, tenderized the meat, seasoning imparted great flavor. It was not overpowering like some spice blends. Made it into gyro-like sandwiches, but would be great in couscous, chopped salads, or as Kebabs!\n\nOther reviewers have noted to cut back on cayenne if you aren't  into \"hot.\" I'd agree. Only used 1/2 tsp of cayenne and it was just the perfect amount of spicy without inducing tears and sweat.\nThanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "meg kohler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5289519/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-17T10:47:01.96Z",
                "reviewBody": "The flavor is to die for! However I do have some suggestions. I would double the recipe for this much meat. It was barely enough to coat 2 1/2# of meat and I still had to add some water after a few hours because the top layer of meat was drying out. Also I would cut the salt in half or delete it altogether. I used 1 tsp. for 2 1/2# of meat and it was still too salty. I doubled the garlic as I didn't think I'd be able to taste it at the suggested amount and it was perfect. I also used Thai hot peppers instead of cayenne substituting 4 peppers per teaspoon -- I chopped them up with the garlic and onion. It was pretty warm but I like that! With the recipe doubled for the amount of meat the spices were just right very fragrant and the meat was so tender from the yogurt. I marinaded for 12 hours and it was terrific. The last comment I have is that I might try grilling the meat next time because in the skillet when the marinade boils the yogurt curdles. Overall I think this recipe is flexible and forgiving and the flavor combination is exotic and thoroughly enjoyable!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen Isabell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2564877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-04T23:18:07.377Z",
                "reviewBody": "I made this yesterday and it was divine! I was attracted to this recipe because of the many spices/herbs. And the smell of the marinating meat was a great indicator of how it was going to taste. I only had half a pound of lamb but I did not scale down the sauce to a tenth -- I like sauces with my food. Also: I did not use a tablespoon of salt -- I used just a teaspoon and it was fine. If I had 5 lbs of meat I probably would use more. Finally I only had whole spices. I guessed on the conversions and tossed them all in the grinder. And because my lamb was very thinly sliced (paper thin) I only left this in the marinade for about 3 hours. My cayenne was probably old -- I used a full teaspoon and the dish was not hot.. I'm sure if I let it sit overnight the flavors would be intense but I was hungry and did not have the foresight to refrigerate this the night before. I did not have this as a shawarma but as a dish of meat and sauce over bulgur. If I do decide to have shawarma I might just scrape off the extra marinade before I grill this. This dish was superb!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "janele",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6493994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-29T03:59:12.23Z",
                "reviewBody": "Loved it! I fed it to my roommates and friends and everyone ate seconds and thirds. I didn't have lamb so I used steaks instead and it turned out great. Thanks for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paige Lallatin Leutze",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6699829/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-23T00:40:51.397Z",
                "reviewBody": "this was really different for us but delicious and super-easy. i followed the directions exactly and wouldnt change a thing. served it with \"shirazi salad\" from this site which was a great combination.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "peachybean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5757793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-04T00:19:44.883Z",
                "reviewBody": "Smelled exactly like I remember shawarma smelling when I lived in the Middle East! And I was very happy to find that there are no obscure ingredients in this recipe. It was fun making this at home but it's hard to slice the meat thinly and lamb is SO expensive... I think we'll stick to the professionals when we want shawarma.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Samantha Li",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1745024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-30T22:41:44.713Z",
                "reviewBody": "Great flavor. We made this and had it in a pita with tomatoes spinach yogert and feta cheese. My husband said this was an exciting dinner with great flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lcollins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3730824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-02T13:50:33.78Z",
                "reviewBody": "This is my first time preparing lamb and I decided to use this recipe to prepare it. The lamb came out great and the flavor was superb!!! I love how you marinaded the lamb in sauce overnight to enrichen the flavor. I marinade mine 18 hours prior to cooking(prepared saturday night). I had 4 pieces of lamb shoulders and decided to grilled 2 pieces of lamb on stovetop (do not have a outside grill) and I decided to bake the other 2 in the oven at 350 degrees for 45 minutes and both methods came out great!! This is going to be one of my frequent dishes to prepare for dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sabray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sabray/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-04-30T19:55:32.207Z",
                "reviewBody": "I added the tablespoon of salt without thinking and immediately regretted it. But I have to say the end result was not overly salty. The recipe is good but next time I would cut the lamb into chunks and grill them on skewers. I made the pieces to flat and they were immediately overcooked. Plus it grilling would have preventing them from almost steaming in the grease that came out of them as they sat cooking in the pan. I would also cut back the salt to 1 teaspoon. Not sure why the salt content is so high unless it's for tenderizing which didn't work for me since I overcooked the pork. I'd try it again tho",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ezwriter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479319/"
                }
            }
        ]
    }
]