[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1977/meat-and-poultry/chicken/chicken-breasts/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215386/chicken-breasts-in-a-date-caper-and-mascarpone-sauce-with-couscous/",
        "name": "Chicken Breasts in a Date, Caper, and Mascarpone Sauce with Couscous",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2140515.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2019-07-10T07:02:23.000Z",
        "description": "A recipe I created for one of the leading hotels of the world. It includes a marvel of flavors, and is a nice approach to an Arabian fusion cuisine. I am sure you will enjoy this...",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "1 skinless, boneless chicken breast half",
            "½ cup couscous ",
            "½ cup water",
            "1 tablespoon unsalted butter",
            "1 pinch salt",
            "1 tablespoon salted butter",
            "¼ cup capers, drained",
            "3 dates, pitted and chopped",
            "¼ cup mascarpone cheese",
            "¼ cup heavy cream",
            "1 pinch salt and ground black pepper to taste",
            "1 date, pitted and chopped",
            "¼ cucumber, diced",
            "½ tomato, diced",
            "1 teaspoon lemon juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for medium heat, and lightly oil the grate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grill the chicken breast until the meat is no longer pink inside and shows well-defined grill marks, 5 to 8 minutes per side. Cut the chicken breast in half, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring the water, unsalted butter, and a pinch of salt to a boil in a saucepan over high heat. Remove from the heat, and stir in the couscous. Cover and let stand for 10 minutes, then fluff with a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the salted butter in a skillet over medium heat, and gently stir in the capers and 3 dates. Stir a few times to heat the capers and dates, then stir in the mascarpone cheese and cream, stirring until the cheese and cream have melted together. Allow the mixture to simmer for about 3 minutes to reduce slightly, then season to taste with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the couscous on a serving platter, and sprinkle with a chopped date. Arrange the 2 pieces of chicken breast onto the couscous, and cover with the mascarpone sauce. Sprinkle the dish with diced cucumber and tomato, and drizzle lemon juice over the top to serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Wickedchef"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.666666666666667,
            "ratingCount": 39,
            "itemReviewed": "Chicken Breasts in a Date, Caper, and Mascarpone Sauce with Couscous",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "615.6 calories",
            "carbohydrateContent": "50.6 g",
            "cholesterolContent": "139.9 mg",
            "fatContent": "37.5 g",
            "fiberContent": "4.7 g",
            "proteinContent": "21.9 g",
            "saturatedFatContent": "21.7 g",
            "servingSize": null,
            "sodiumContent": "616 mg",
            "sugarContent": "12.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-12-04T21:08:27.95Z",
                "reviewBody": "Thanks for all the comments I am glad you enjoyed it . Now some comments I added to times back but I guess it went under a adapted version .. so did not show up ...\"Well actually I never wrote the chicken should be grilled when I transmitted the recipe, the Editor here at allrecipes.com took a few liberties i don't agree with . I would either poach the chicken or finish it in the oven i it gets to dry otherwise . And I would keep the chicken off the Couscous and don't sprinkle Dates on the CousCous ( gets to sweet.. ) and then the sauce needs to go on the chicken as well on the tomatoes and cucumbers ... ( Please see picture ) Just my original instructions , but you are free to try the editors way of doing it :-)\"\n\nFor the sweetness it is important to top it with the lime juice and as I said to season it , it should be a fine balance between sweet sour and savory flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wickedchef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wickedchef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-13T22:05:34.143Z",
                "reviewBody": "What a delightful dish to heck with Cholesterol! Easy to make and loved by all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maddy Leitch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2954030/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T17:54:03.1Z",
                "reviewBody": "My husband does not like capers. My husband does not like dates. My husband took a couple of bites of this dish and announced that I could put it on the weekly rota and he would happily eat it. And then he gobbled it all up! The only change I made was I used 1/2 & 1/2 instead of heavy cream because I had that in the fridge and it was cold and rainy and I didn't want to go out. I did neglect the sauce a bit and when I returned it had separated in a terrible gloppy mess but I just added some more 1/2 & 1/2 and stirred vigorously and it all settled down. Disaster averted! Served with a boxed Roasted Garlic and Olive Oil couscous and for veggie I followed recommendation and put my own twist: I sauteed green beans then 5 minutes before finishing I tossed in a handful of tomatoes cucumbers sliced Kalamta lives and some Spice Isalnds Greek Seasoning (great all-purpose spice for the pantry shelf) And for those who think cooked cucumbers sound yucky you haven't lived until you've had braised cucumbers but's that's another recipe. I highly recommend this recipe. Yum! (In fact I just had the leftovers from my plate---there were none from Husband's and Son's---for lunch. Nukes well!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "da1bee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2156009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T17:33:03.29Z",
                "reviewBody": "Made this for ten people at a dinner party and served it over couscous with a Greek vegetable salad (tomatoes olives cucumber bell peppers with a little oil and balsamic). It was such a hit! The sauce was a little thick and I wanted to ensure there was enough to go around so I ended up adding a little 2% milk. The combination of the rich mascarpone tart capers and sweet dates is decadent beyond measure. Everyone loved the sauce so much - even my vegetarian friend (we spooned it over eggplant meatballs for him). Try this one out!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kheil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4853489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-01T16:49:47.383Z",
                "reviewBody": "I joined All Recipes to review this dish (eventhough I have been using allrecipes.com for years now). Delicious beyond measure! The sweetness was devine and original and perfectly paired with chicken. I made this exactly as directed by the chef and it was beautiful in presentation and very tasty. The reason I didn't give it 5 stars is because of the sweet sauce paired with the couscous. Too much sweetness. It would be better just over chicken with something on the side that is slightly salty like veggies or pasta. I baked the chicken with a little salt pepper and olive oil on it and that made the contrast between salty chicken and sweet sauce delicious! Also for those of you with a thick sauce. The recipe is perfect but you are letting it sit too long. Make sure it is on medium heat (no more) and just let the cheese melt into it. After it has melted wait maybe a half a minute to ensure it is hot then pour it over the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jluksetich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7129461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-25T21:43:04.207Z",
                "reviewBody": "Very good! Sauce was a bit thick so next time would take on the suggestion to add some milk. Surprisingly nice combination. The caper and dates go so well together!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Klijn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5559607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-17T17:57:58.03Z",
                "reviewBody": "This is a really fantastic recipe. I swapped the couscous for Orzo (I was just in the mood) and ended up having to bake my chicken because my grill was broken. Also I substituted thighs for the breasts because that's what I had on hand. The sauce is really sweet but was it scrumptious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6359646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-18T18:47:48.097Z",
                "reviewBody": "The flavors blended very nicely together. I do have a few tips that I would suggest however. First I think there needs to be either more chicken or less of everything else. I would say double the chicken for this recipe. Also it begins to get too sweet and needs some side like a pasta salad of some sort as suggested in earlier reviews... something salty. Otherwise it's like eating too many cookies with no milk. Other than that it's a pretty interesting blend of flavors worth trying. I might make this every now and again but not often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CrissyCK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2246125/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-27T17:45:37.663Z",
                "reviewBody": "This is one of my favorite recipes. I don't make it often because of all the calories but whenever I do everyone loves it! I usually end up using more cream and cheese than what the recipe calls for",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bvelo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3918135/"
                }
            }
        ]
    }
]