[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219043/cheesy-broccoli-chicken-casserole/",
        "name": "Cheesy Broccoli Chicken Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1556350.jpg",
            "width": 2745,
            "height": 2554
        },
        "datePublished": "2019-07-10T07:02:55.000Z",
        "description": "All-in-one casserole with Cheddar cheese, rice, cooked chicken and fresh broccoli.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "3 skinless, boneless chicken breast halves",
            "salt and ground black pepper to taste",
            "1 teaspoon salt-free seasoning blend",
            "2 large heads  broccoli, cut into small florets",
            "½ sweet onion, chopped",
            "3 ½ cups water",
            "2 tablespoons margarine",
            "2 (5.4 ounce) packages herb and butter-flavored rice side dish (such as Knorr® Herb & Butter Rice Sides)",
            "1 (10.75 ounce) can  condensed cream of chicken soup",
            "1 cup mayonnaise",
            "2 cups shredded Cheddar cheese",
            "1 tablespoon chopped fresh parsley",
            "2 teaspoons salt-free seasoning blend",
            "2 teaspoons garlic powder",
            "¼ teaspoon curry powder",
            "1 tablespoon lemon juice",
            "2 teaspoons Dijon mustard",
            "½ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2-quart casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a skillet over medium heat. Sprinkle the chicken breasts with salt, black pepper, and 1 teaspoon of salt-free seasoning, and pan-fry in the hot oil until lightly browned on both sides, about 10 minutes per side. Cut the chicken breasts into bite-size pieces, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil. Place the broccoli florets and sweet onion into the steamer basket, cover pan, and steam until broccoli turns bright green and is barely tender, about 3 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan, bring 3 1/2 cups of water to a boil, and stir in the margarine until it melts. Pour in the contents of the two packages of rice side dish, and reduce heat to a simmer. Cover and cook until rice is tender, 7 to 10 minutes; turn off heat, and allow to stand covered for 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer cooked rice into a large mixing bowl, and stir in the chicken, broccoli, and onion. Mix in the cream of chicken soup, mayonnaise, 2 cups of Cheddar cheese, parsley, 2 teaspoons of salt-free seasoning, garlic powder, curry powder, lemon juice, and Dijon mustard until thoroughly combined. Adjust salt and black pepper. Spoon the mixture into the prepared casserole dish, and sprinkle 1/2 cup of Cheddar cheese over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until the casserole is bubbling and lightly browned, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Frenchy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.469879518072289,
            "ratingCount": 83,
            "itemReviewed": "Cheesy Broccoli Chicken Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "647.9 calories",
            "carbohydrateContent": "20.5 g",
            "cholesterolContent": "77.6 mg",
            "fatContent": "45.1 g",
            "fiberContent": "4.8 g",
            "proteinContent": "25.4 g",
            "saturatedFatContent": "20.2 g",
            "servingSize": null,
            "sodiumContent": "762 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-22T15:38:57.677Z",
                "reviewBody": "Very good and easy dish to make.  I did not add any lemon juice (didn't have any) and I also cut back on the mayo per other reviews.  I also felt that steaming the broccoli and onion before was a waste of time so I just added it to the dish when you combined all the ingredients.  Broccoli came out cooked perfectly (not mushy).  Overall, I will definitely make this dish again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Charmaine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1702339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-15T15:37:21.293Z",
                "reviewBody": "This is a kid pleasing recipe and the taste is very good!  The reason for the 3 stars is because of all the changes I will make when I fix this again.  1 bag of rice will be plenty.  I also used frozen broccoli (I had it on hand).  I don't like my veggies very mushy, so the broccoli was frozen when I put this in the oven...that was just right!  Since next time I will be cutting the rice in half, it might be a good idea to reduce the mayo by 1/2 too.  I did not add the curry powder because my family doesn't really care for it and the taste was still very good!  I would also reduce the browning time for the chicken to 6-8 minutes on each side, then bake everything for 30.  I also did not cut up the chicken.  My hubby is watching his carbs, so I left the chicken whole so he wouldn't have to eat a lot of rice to get chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Marcy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4046172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-08T21:22:07.67Z",
                "reviewBody": "I ended up having to substitute a couple of the ingredients, but this is the best Cheesy Broccoli Chicken Casserole I have ever had.  It was tangy, cheesy, buttery, and savory.  You have to try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Hines Severson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8779940/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-21T03:17:49.34Z",
                "reviewBody": "A few years ago I decided to never again eat microwave dinners. However one of my favorite ones was a cheesy chicken broccoli casserole by a certain lady named Marie who's last name shall go unmentioned. Anyways I really wanted to recreate that meal so I found this recipe. Just like the other reviews I made a few changes to suite my tastes. First, I grilled my chicken on my famous boxer grill with salt, garlic powder & pepper. Once cooked I cut it up in small pieces. I'm not a fan of boiled meat. Second I also used frozen broccoli as others have done. Third, I used a box of Near East garlic & herb wild rice (one box) prepared per the directions on the box. lastly, I substituted the mayo for sour cream. Maybe its just me but mayo belongs on turkey sandwiches not in casseroles. I also left out the curry powder. Anyhow it turned out great & tasted better than the microwave dinner I was trying to recreate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jon Steele",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10123217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-12T00:48:00.92Z",
                "reviewBody": "This is delicious. My husband raved over it. I used knorrs creole butter rice and instead of mayo I used 2 big spoonfuls of sour cream. Didn't use curry powder. Used Cajun seasoning and red pepper. I didn't want to use all of those pans so I used leftover chicken and didn't cook the broccoli or onions just put them in the mixture of everything raw and it was cooked perfectly. It did make a whole lot. I filled my largest cassarole dish and filled a gallon sized ziplock about 3/4 full. I think I'm just going to freeze the leftovers since its just me and my husband and we still have half a pan left. Great recipe! Update**** I defrosted the leftovers in the fridge then baked as I did before and it tasted the same as it did the first time around. I wrote the instructions on the ziplock and I wouldn't try to eat it after 6 months according to stilltasty.com. I ate it at almost exactly 6 months.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Wathen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4563268/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-30T20:55:59.017Z",
                "reviewBody": "to those of you who give a recipe a lower rating  because of the changes you made:  WHY???? You did not make THIS recipe so how can you make all these changes and rate it low. You made something entirely different, which is fine, but don't blame the writer of the recipe for your taste buds.  The recipe, as written, is exactly what the submitter wanted it to be.  I don't rate at all if I make changes without trying it this way first.  To someone who said they don't like curry and they didn't cut up the chicken and they didn't have lemon juice and all the other changes to fit your taste, you have no business rating a recipe if you tried something else!  I would not make a recipe for cherry pie and make it with apples!  Wow, the self-absorption of some people is beyond me.  \n\nThat said, this recipe is very good.   I did find it to be a bit less flavorful than I expected so the next time I made changes to fit my taste, which made it perfect for me, but overall it was good as written!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mjk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3598938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-16T03:45:08.707Z",
                "reviewBody": "I didn't follow the recipe to a T,and made so many modifications I probably shouldn't post a review, but I am going to do it anyway, so take this review with a grain of salt. \r\n\r\nI made a double batch and had to use what I had on hand. I used previously cooked and shredded chicken that I had in the freezer. About 4+ cups of it. I used one head of cauliflower and 2 bunches of broccoli. I cooked white rice in water with chicken bouillon and used 5 cups of that once it cooked (the extra rice was just to bulk it up). I did 2 cans condensed chicken soup, 1 cup mayo, and 1 cup fat free sour cream. I subbed 1 tsp dried parsley for the 2 tsp fresh, used just shy of 4 tsp of tony cachere's cajun seasoning in lieu of the salt free seasoning blend, used all the garlic powder, omitted the curry since we don't have/like it, and added a dash of onion powder since I didn't have any sweet onions on hand to cook with my other veggies. \r\n\r\nI probably only mixed 2-3 cups of shredded colby jack (it was all I had on hand) into it. It filled a 9 x 13 as well as 2 deep foil 8\" round pans. Topped with more cheese, baked, and fell in love. It was creamy, erred on the side of being more saucy than dry (which is always good in my book) and all in all was a nice comfort food casserole. Even my picky kids ate it and my husband seemed really impressed. Glad I have more in the freezer for an easy week night meal. \r\n\r\nBottom line - it's a forgiving recipe, great to modify for your needs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Whitney Owens Hemsath",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6852384/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-20T10:49:14.497Z",
                "reviewBody": "Cheesy Broccoli Chicken Casserole Haiku: \"Looked like too much work. Found some steps that could be skipped. End result was great!\" Made mine a \"make-ahead-meal\" w/ canned Kirkland chicken from Costco, leftover basmati rice (and 1 c. cooked), and didn't see any need to steam the broccoli and onion; just mixed everything together, although I did lightly-sautee the onion in butter to avoid raw crunchy bites of that. Other than drastically reducing the mayo, every other ingredient went in the same, and it tasted super; loved the lemon juice and curry powder, and just cheese on top, rather than other recipes that use breadcrumbs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rock_lobster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rocklobster/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-16T00:34:39.467Z",
                "reviewBody": "This was really tasty. I made a few changes. I used 2 cups of plain cooked rice in place of the seasoned rice and there was plenty of flavor with the other seasonings. Used a cajun seasoning for the \"salt free seasoning blend. Used fresh lemon juice. It takes some time as there are a lot of ingredients but it was worth it. Very rich so I think for us it was a lot more than 8 servings with a side salad to compliment the meal. Took a little longer to cook than 30 minutes. I think I left it in for almost an hour but until the cheese was darkening and bubbly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "syb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11091013/"
                }
            }
        ]
    }
]