[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220265/creamy-asparagus-and-peas-pasta/",
        "name": "Creamy Asparagus and Peas Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F797046.jpg",
            "width": 1024,
            "height": 768
        },
        "datePublished": "2019-07-10T07:03:03.000Z",
        "description": "This recipe is inspired by both Jaime Oliver's Creamy Shells and Peas recipe and a local restaurant's version. However, I've never been tempted to make Jaime's; I'm sure it tastes awesome but I decided to tweak it to my heart's content. Mine is very fast to make and very fresh tasting.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "5 slices bacon, cut into 1/2-inch pieces",
            "1 pound fresh asparagus, trimmed and cut into 1-inch pieces",
            "½ pound fresh peas",
            "1 onion, chopped",
            "½ lemon, juiced",
            "salt and ground black pepper to taste",
            "1 pound fresh fettuccine pasta",
            "3 tablespoons heavy cream",
            "5 ounces shredded Italian three-cheese blend"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place bacon in a large saucepan and cook over medium-high heat until bacon is evenly browned, about 10 minutes. Stir occasionally while cooking. Drain the bacon grease from the pan, and transfer bacon to a paper towel-lined plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil and stir in asparagus and peas; stir occasionally and cook until the vegetables are slightly softened but still bright green, about 5 minutes. Drain and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook and stir onion until translucent over medium heat in the same pan as bacon, about 5 minutes; stir in asparagus, peas, and bacon pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Squeeze lemon juice over the asparagus mixture; season with salt and black pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of salted water to a boil and stir in the fettuccine; cook, stirring often, until fettuccine are tender, about 5 minutes. Drain well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir hot fettuccine into the pan with asparagus mixture over medium-low heat and toss gently to combine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in cream and bring mixture to a simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle cheese blend over the mixture and allow to stand until the cheese melts, about 5 minutes; stir cheese lightly into the fettuccine and vegetables to serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Judy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0588235294117645,
            "ratingCount": 17,
            "itemReviewed": "Creamy Asparagus and Peas Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "423.2 calories",
            "carbohydrateContent": "54.6 g",
            "cholesterolContent": "91.1 mg",
            "fatContent": "14 g",
            "fiberContent": "6.8 g",
            "proteinContent": "20.8 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "435.2 mg",
            "sugarContent": "5.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-02-27T02:11:15.827Z",
                "reviewBody": "Wow - I am honored to be the first review and first picture of this recipe. This is a taste of Spring. Please excuse the long review. This is a keeper for sure and very forgiving. First use either 1/2 lb pasta or double the sauce. If you can get fresh peas you are blessed. (I did manage to score fresh peas) If you don't have fresh peas use frozen but do not blanch them with the asparagus. Which brings me to blanching. I brought a large pot of water to a boil - added salt and added the peas - scooped them out and into ice water - then added the asparagus except for the tips - cooked those to bright green and into the cold water. Cook the pasta in the same water that was used to blanch the vegetables. I cooked the bacon - removed and de-glazed the pan with the lemon juice - which wasn't enough so I added 1/4 cup white wine to de-glaze (you could also use pasta water or more lemon juice or both) I did not add the bacon back in as I don't like soggy bacon. Add the vegetables and the tips of the asparagus. Add the cooked pasta - straight from the pot with some of the pasta water. Add the cream - then add the bacon just before serving. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-01T05:27:16.53Z",
                "reviewBody": "This was good and would make it again! I didn't blanch the veggies - added the stem pieces with the onion along with some garlic and lemon zest to up the lemon flavor and then added the tips and peas near end just to eat through. I also followed bn's advice and added the bacon at the end so it stayed crisp. For company I'd blanch the stem pieces to keep them greener.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HeidiS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/696690/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-09T13:20:34.54Z",
                "reviewBody": "Recipe Group Selection: 03 March '12 We enjoyed the ingredients in this pasta dish but it lacked flavor. We thought it needed more of the sauce and maybe a few more spices. We are having the leftovers tonight and I'm going to make a light fettuccine sauce to add the creaminess that we feel is missing. Might also add some red pepper flakes. I added the bacon right at the end to ensure it's crunchiness. Not a fan of soggy bacon. I think this dish has great potential as the ingredients are very good but for us I need to play with the sauce a little bit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-06T00:42:04.56Z",
                "reviewBody": "I made this for Recipe Group and I guess I'm in the minority here but while this was ok it wasn't great for us...I ended up roasting my asparagus b/c we love it that way. I used more of everything called for but felt that it still lacked in the flavor department. I did add in some parm. cheese which made it a little tastier. I also used bowtie pasta in place of the fettuccine. I don't know for us it was just bland. I'm still glad I got to try this recipe...Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-10T22:05:28.64Z",
                "reviewBody": "This was quite good- I made it for Recipe Group. I did need to make a few changes based on what I had. I did not have fresh pasta so I used dried and frozen peas instead of fresh. Also I didn't want to buy heavy cream just for 3 T so I used a little sour cream instead. This was very good. I simply sauteed the veggies in the bacon fat rather than boiling and I think that really added great flavor. I think the heavy cream would have been much better but we really enjoyed it this way too. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HuskerGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3624785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-09T22:00:04.143Z",
                "reviewBody": "Recipe Group selection 3/3/12. I omitted the bacon so we could eat this on Friday in Lent so I knew I needed to add a bit of flavor back in. I did this by sauteing my peas and asparagus in EVO with my onion and 3 minced cloves of garlic. When my pasta was almost ready I added the cheese and cream to the veggies and stirred til evenly melted. I felt it needed more cream so all in all I probably used about 1/2 cup of cream. I stirred the pasta into this and tossed to combine and served with shaved parmesan and freshly ground pepper on top. We never missed the bacon. Thanks this is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-05T15:07:54.773Z",
                "reviewBody": "We all liked this - especially my 2 year old. I only used 1/2 lb of fettuccine & asparagus but put a lot more cream in the sauce (next time I want to try using some of the pasta water instead of extra cream to save on calories & make it a little less rich). I used parm mozzarella (next time I will only use parm - the mozz made it stringy). I also omitted the peas. I cooked the bacon in the microwave (a couple extra pieces of bacon wouldn't have hurt;) & sauteed the veggies in 2 tbsp of butter. I was worried about the asparagus since it was still pretty raw after 5 min boiling (which I then put in a bowl of ice water). But I just made sure to saute it long enough with the onions (I also added a fresh minced clove of garlic right before adding the cream). Very simple & relatively quick dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hartsellem",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4034917/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-07T17:28:05.47Z",
                "reviewBody": "Basic side dish that didn't offer much of a blended taste of ingrediants. I used turkey bacon which at times I think helps some dishes in its own way but it didn't here. The parmesan gave it the most flavor as I always add a tad more. I used frozen peas and did not blanch with the asparagus. I preferred doing each veggie on its own. Wont make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "AuntE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7758077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-26T01:07:02.273Z",
                "reviewBody": "Pretty good starter recipe. I had cooked spaghetti and cooked bacon on hand so I crisped up the bacon removed it sauteed the onions some garlic and the asparagus in the grease added a chopped tomato seasoned it all with salt and pepper and let it wilt. I squeezed lemon in. When the veggies were ready I added maybe a 1/3 cup of sour cream (I didn't have any whipping cream) a 1/4 cup of grated Parmesan and the noodles let it all warm through. Pretty darn good and quick for a weeknight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LaurenVan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4413901/"
                }
            }
        ]
    }
]