[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228984/pearl-couscous-with-lentils-carrots-spinach-and-corn/",
        "name": "Pearl Couscous with Lentils, Carrots, Spinach, and Corn",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2526461.jpg",
            "width": 2000,
            "height": 3008
        },
        "datePublished": "2019-07-10T07:03:50.000Z",
        "description": "This is a recipe that is great as a side or even as a meal. It's so hearty! It's great served warm or cold. I sometimes substitute chickpeas for the lentils, but  be aware that they have a slightly stronger flavor. The white wine is used for flavor but can be left out if desired. Reduced-sodium chicken broth can be used. This recipe keeps well in the fridge and can be served warm or cold.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon sesame oil",
            "1 small onion, diced",
            "3 cloves garlic, minced",
            "1 cup canned lentils, drained and rinsed",
            "1 cup diced carrots",
            "¾ cup corn kernels",
            "2 tablespoons dry white wine",
            "2 tablespoons chicken broth",
            "2 cups chicken broth",
            "¼ cup dry white wine",
            "1 (10 ounce) box pearl (Israeli) couscous",
            "2 tablespoons chicken broth",
            "2 tablespoons dry white wine",
            "2 cups baby spinach leaves, stems removed",
            "1 ½ tablespoons lemon juice, or to taste",
            "1 teaspoon ground black pepper, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat sesame oil in a large skillet over medium heat; cook and stir onion until it turns translucent, about 5 minutes. Stir in garlic and cook until garlic starts to brown, about 5 to 8 more minutes. Mix in the lentils and cook 3 to 4 minutes to blend flavors, stirring lightly. Stir carrots and corn kernels into the mixture. Reduce heat to low. Pour in 2 tablespoons white wine and 2 tablespoons chicken broth; let the mixture simmer, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring 2 cups chicken broth and 1/4 cup white wine to a boil in a saucepan; stir in couscous and reduce heat to low. Simmer couscous until the liquid has been absorbed and the couscous pearls are tender, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir 2 more tablespoons each of chicken broth and white wine into lentil mixture and lightly toss baby spinach leaves into the vegetables in the skillet until wilted, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer cooked couscous to a serving bowl and gently stir the spinach-lentil mixture into couscous until thoroughly combined. Drizzle with lemon juice, sprinkle with black pepper, and lightly stir again.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Caitlin685"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2,
            "ratingCount": 5,
            "itemReviewed": "Pearl Couscous with Lentils, Carrots, Spinach, and Corn",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "174 calories",
            "carbohydrateContent": "30.4 g",
            "cholesterolContent": "0.2 mg",
            "fatContent": "2.1 g",
            "fiberContent": "4.2 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "83.6 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-05-15T17:42:04.667Z",
                "reviewBody": "I know what it's like to have a great recipe to share but no photo so I thought I would give this a try based solely on how it sounded and I am glad I did. This dish is really delicious but there are a couple of changes I suggest. First the amount of time needed to brown the garlic is way too long...it only takes a couple of minutes. Anymore than that and it starts to burn. Second and this is really minor but it makes a difference in how well the mixture blends is that it helps to chop the spinach before adding it to the recipe. That being said I made a couple of changes due to taste and necessity as well. I like corn but by itself and tend to dislike it added to this type of recipe so I eliminated the corn. That was a matter of taste. Second in my area the only lentils available in a can are in lentil soup. The only other lentils here are dried. Since dark lentils take longer to cook and this recipe didn't specify what lentils to use green black orange or red and since orange lentils cook really quickly (and I actually prefer orange and red ones anyway) I used dried orange lentils and mixed them in with the broth. Since they don't plump like other dried beans I still used a cup. Other than those changes I made this as directed and really enjoyed it. The best thing is that it was yummy both warm right after cooking and cold as a light lunch the next day. I wish I had taken a picture to post but I will do this next time if no one else posts one. Good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kymbrown1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5901832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-13T17:38:57.1Z",
                "reviewBody": "This is a very good recipe. I liked it. I left out the wine. I used whole wheat pearl couscous and black lentils.. any color lentils would work and dried/ cooked lentils would be fine in this as well... and cheaper. I do think this needed a bit more spice for my tastes. I had this both hot and cold and it is good both ways",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-08-23T13:50:46.667Z",
                "reviewBody": "A very light tasty and easy to make salad. I agree with a previous reviewer that it was a bit bland so I added an extra 2 tbsps of fresh lemon juice at the end. Next time I may try to spice it up a bit more with something like cumin. I used a red onion for extra colour and a diced green onion for more flavour (and colour.) I may leave out the spinach next time and add some other vegetables maybe zucchini or yellow/green beans...anything summery. I did also use some white wine not sure if it added much to the recipe but I enjoyed drinking the leftovers while making the salad:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5374077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-26T15:57:40.693Z",
                "reviewBody": "Nice but needs some kind of dressing on it afterwards as it is a little bland for my taste (I did not use wine). Fantastic with a little chilli oil and a squeeze of lime.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "louisa1612",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21800827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-12T07:11:11.42Z",
                "reviewBody": "I made this tonight since I m trying to eat more meatless meals. I also had some Trader Joe s Harvest Grains blend to use up and wasn t sure how to use it. I cooked the Harvest Grains as directed. I then followed the recipe as written using chickpeas instead of lentils and omitting the corn. I also used a cup of frozen baby spinach since I didn t have white wine and I figured that would add the liquid needed. It came out very good. I know it s good when my husband puts some in a dish to take for lunch. I will make it again maybe next time I ll use lentils.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ham",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4860388/"
                }
            }
        ]
    }
]