[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17279/trusted-brands-recipes-and-tips/the-bison-council/",
                    "name": "The Bison Council",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/233861/greek-stuffed-bison-steak/",
        "name": "Greek Stuffed Bison Steak",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1037643.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-07-10T07:04:47.000Z",
        "description": "Filled with a mixture of spinach, feta cheese, and kalamata olives, marinated bison flank steak is roasted or grilled in this Greek-inspired preparation.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT3H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (1 pound) bison flank steak",
            "3 tablespoons olive oil",
            "3 tablespoons fresh lemon juice",
            "2 cloves garlic, minced",
            "1 tablespoon chopped fresh oregano",
            "2 teaspoons olive oil",
            "2 cloves garlic, minced",
            "1 (6 ounce) package fresh baby spinach",
            "⅓ cup crumbled feta cheese",
            "¼ cup chopped pitted kalamata olives"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Score bison flank steak on both sides by making shallow cuts at 1-inch intervals diagonally across the steak in a diamond pattern. Place bison flank steak between two pieces of plastic wrap. Using the flat side of a meat mallet, pound bison flank steak lightly into a 8x10-inch rectangle about 1/2 inch thick. Discard plastic wrap. Place bison flank steak in a resealable plastic bag set in a shallow bowl. For marinade, combine the 3 tablespoons oil, the lemon juice, the 2 cloves minced garlic, and the oregano in a medium bowl. Pour marinade over bison flank steak. Seal bag; turn to coat bison flank steak. Marinate in the refrigerator for 2 to 4 hours, turning bag occasionally\n"
            },
            {
                "@type": "HowToStep",
                "text": "For filling, heat the 2 teaspoons oil over medium heat in a large skillet. Cook the 2 cloves garlic in hot oil for 1 minute. Add spinach; cook and stir for 1 to 2 minutes or until spinach begins to wilt. Drain spinach in a colander, pressing out any excess liquid with the back of a spoon. Coarsely chop spinach. Stir in feta cheese and kalamata olives; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain bison flank steak; discard marinade. Spread filling mixture evenly over bison flank steak to within 1 inch of edges. Starting from long edge, roll up bison flank steak into a spiral, making sure the ends stay tucked in. Using heavy 100-percent-cotton kitchen string, tie bison roll at 1-inch intervals. Place bison roll on a rack in a shallow roasting pan. Insert an oven-going meat thermometer into the center of the bison roll.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast, uncovered, for 35 to 40 minutes or until internal temperature registers 135 degrees F. Cover with foil; let stand for 10 minutes before slicing. Slice bison roll into 3/4-inch-thick slices.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "The Bison Council"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "The Bison Council"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.333333333333333,
            "ratingCount": 6,
            "itemReviewed": "Greek Stuffed Bison Steak",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "286.5 calories",
            "carbohydrateContent": "5 g",
            "cholesterolContent": "69.1 mg",
            "fatContent": "19.3 g",
            "fiberContent": "1.1 g",
            "proteinContent": "23.5 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "351.9 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-09-09T11:55:09.487Z",
                "reviewBody": "Whenever I ve cooked flank steak on the grill or in a stir fry instructions have always said to slice on the bias for tenderness. Unfortunately you can t do that with this recipe. I have to wonder if a flank steak whether bison or beef is the best cut of meat for this recipe particularly since bison is so incredibly lean. The recipe says to cook for 35-40 minutes but has no cooking temperature indicated. I looked up stuffed beef tenderloin on this site and all recipes said to cook at 425 degrees F so that s what I did. Took the meat out at 25 minutes and it was just slightly pink overcooked for us contributing to the chewiness. Probably 5 minutes less would have been better as far as doneness goes. The flavor of the bison was sweet and the filling was good but unfortunately the meat itself was tough. From an eye appeal point of view I also think it would have benefitted from slightly browning the meat on the stovetop before going into the oven as visually it did not develop a nice browned crust. This is my first time cooking bison and I did like the flavor of this recipe but I m not sure this is the best way to cook bison flank steak.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-18T14:06:09.417Z",
                "reviewBody": "So I totally blanked and forgot to marinate this and it was still awesome! My piece of bison was really thick so I cut it in half length-wise and THEN flattened my two pieces. I skipped chopping the spinach and added the feta cheese directly to the meat and spinach. I also left out the olives because we're not a fan in our house. The oregano in this recipe had me skeptical but I really liked it (and I had to use dried.) It gave it a really nice flavor that went well with the feta cheese. I sprinkled some lemon juice on it before it went in the oven to try to make up for my mistake of not marinating it. I cooked it for probably 25 - 28 minutes (one of my pieces was smaller so I took it out) and then let them rest for 5 - 7 minutes before cutting. My husband and I both really enjoyed it and it was quick enough for a weeknight meal (but nice enough that I would totally serve it to company.) Fantastic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Justice Yost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nashvillenosher/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-02T23:46:26.74Z",
                "reviewBody": "The flank steak turned out really chewy for me. Otherwise it was a decent recipe. I'm with another reviewer; I think a different cut would be a lot better. I'm happy to have tried bison but I'd like to experiment with it with different recipes other than this one. Thanks for the fun idea though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lin-duh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-29T13:00:58.057Z",
                "reviewBody": "The first time I used bison... AWESOME. The second time I made this recipe with beef flank steak... STILL AWESOME. I'm not a fan of olives so the third time I replaced the olives with bacon. That's right I said bacon. It changes the flavor drastically from awesome to EPIC!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JnE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12729002/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-03-06T11:26:43.723Z",
                "reviewBody": "Awesome !!!  I was unprepared ingredient- wise, so substituted Beef for the bison, used Garlic Powder and Frozen Spinach instead of fresh, yet it was still Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Collette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26750726/"
                }
            }
        ]
    }
]