[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236509/flemish-frites-belgian-fries-with-andalouse-sauce/",
        "name": "Flemish Frites - Belgian Fries with Andalouse Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1949129.jpg",
            "width": 2157,
            "height": 2157
        },
        "datePublished": "2019-07-10T07:05:12.000Z",
        "description": "Belgian fries are cooked twice for a soft middle and crisp outside and served with a mayo sauce called 'Andalouse' that can be best described as vaguely similar to Thousand Island dressing. The sauce makes a great chip dip or vegetable dip as well. We go through so much of it, I double it! My husband's family is Belgian, Flemish to be exact. I am told Flemish is equated with quality. This is a snack that is worth the time and effort! Since this is all about quality, be sure to use firm, fresh potatoes. Bring the sauce to room temperature before serving.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT9H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup mayonnaise",
            "2 tablespoons tomato paste",
            "2 tablespoons minced red onion",
            "1 tablespoon minced green bell pepper",
            "1 tablespoon minced red bell pepper",
            "1 tablespoon fresh lemon juice",
            "¼ teaspoon salt",
            "3 pounds russet potatoes, peeled and cut into 1/4-inch strips",
            "4 cups olive oil for frying, or as needed",
            "salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir mayonnaise, tomato paste, red onion, green bell pepper, red bell pepper, lemon juice, and salt together in a bowl. Cover the Andalouse sauce with plastic wrap and refrigerate 8 hours to overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer or large saucepan to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Submerge potato strips in a bowl of ice water; rinse potatoes in several changes of cold water until water in the bowl is clear. Drain potatoes and pat dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working in batches, fry potatoes in the hot oil until just cooked through but still white, about 5 minutes. Transfer fries to a paper-towel lined plate to drain. Bring oil back to temperature between batches. Cool potatoes to room temperature, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Increase oil temperature to 375 degrees F (190 degrees C). Working in batches, fry the potatoes again until deep golden, 5 to 10 minutes more. Transfer fries to a paper-towel lined plate to drain. Season fries with salt and serve with Andalouse sauce.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "6kids3cats"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 8,
            "itemReviewed": "Flemish Frites - Belgian Fries with Andalouse Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "579.3 calories",
            "carbohydrateContent": "43.9 g",
            "cholesterolContent": "13.9 mg",
            "fatContent": "44 g",
            "fiberContent": "3.3 g",
            "proteinContent": "5.5 g",
            "saturatedFatContent": "6.3 g",
            "servingSize": null,
            "sodiumContent": "322.1 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-03-09T16:11:22.703Z",
                "reviewBody": "My Maman was from Belgium & taught me to make fries this way.  Only difference, she used peanut oil because it is lighter tasting & you can crisp better & quicker because you can fry with peanut oil at a higher temperature.  Peanuts originally come from India and peanut oil (a mono-saturate & therefore healthy) is the oil of choice for woks & other frying & sautéing in Asia & Belgium & France (don't know about other countries).  My Maman always used Planters as some of the off-brands can small/taste rancid.  While living in the South, I found the LouAna brand to be just as good.  My Maman used peanut oil to make her own mayo, salad dressings & anything else that calls for veggie oil. In Belgium you can buy paper cones of Frites from stands on the street like you can get hot dogs in NYC.  You have your choice of several sauces -- myself, I preferred Piccalillie so here at home, I usually use French's yellow mustard.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mimi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3888880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-15T01:20:11.02Z",
                "reviewBody": "OMG - so good! A little bit of work but totally worth it. I made the sauce in the morning and let the flavors blend until dinner time. It is delicious! Even my husband commented on how good the sauce was and he HATES creamy sauces. The only change I made was to fry in mixture of vegetable and corn oil to use up what I had on hand. Fabulous recipe - thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim's Cooking Now",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kimscookingnow/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-03-17T04:37:21.49Z",
                "reviewBody": "I use to live in Belgium and this was used even as a main dish at times with some wine of course. I have been so desperate and almost purchased a jar of andalose off the Begium Shop to just get some of these. This sauce is truly one of a kind and if this recipe taste just like their original sauce I will be making it all the time. I miss their fries as well and the beer Kriek which maybe your husband can tell you how to make that beer. It is also a belgium beer and they use real cherry's in the beer. I think I may need to order that online cause brewing probably is a bit hard. I can't wait to make this sauce tonight. Thank you for the receip.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber Winegardner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23795649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-28T11:57:00.54Z",
                "reviewBody": "I've always wanted to make Belgian fries ever since I lived near Namur and often visited Antwerp in 1986. I stayed with an old retired pair who showed me their way of making fries - double dipping and flavoring the oil with garlic. This holiday I received a T-Fal deep fryer and decided to give this recipe a go and try it on my kids and invited company. Remembering to flavor vegetable oil with some garlic cloves this recipe hit the spot! The results were delicious especially the sauce. Note: used veg. oil not olive oil; my prep time was about 4 hours and the sauce was fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ebina2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21992518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-05-07T08:38:27.91Z",
                "reviewBody": "Don’t be afraid to try making this with authentic French mayonnaise versus the bland American stuff. I did and it was extra delicious! I always make my French mayonnaise based off the “French Cooking Academy” channel on YouTube.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gregory Bauer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27490943/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-07-28T06:06:55.387Z",
                "reviewBody": "We made baked potato wedges instead of frying but I made the dip exactly as written and it was delicious! It had only been in the fridge for a few hours but the flavor was still great! I'm sure it'll be even better tomorrow. My husband loved it too and I'm sure we'll be making it again as it's easy and tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie Nicole Hemphill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5341683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-05-16T05:34:04.483Z",
                "reviewBody": "Good recipe but nothing Flemish about these fries. They are just that, Belgian Fries whether from the Flanders, Brussels or Wallonia!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "buckdany",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27540139/"
                }
            }
        ]
    }
]