[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/153/breakfast-and-brunch/eggs/quiche/",
                    "name": "Quiche",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/273436/bacon-cheese-and-caramelized-onion-quiche/",
        "name": "Bacon, Cheese, and Caramelized Onion Quiche",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6649948.jpg",
            "width": 3456,
            "height": 3456
        },
        "datePublished": "2019-07-17T03:34:55.000Z",
        "description": "My husband said this is the best quiche he's ever tried! The combination of caramelized onion, bacon, and Cheddar cheese is perfect.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H45M",
        "totalTime": "P0DT2H25M",
        "recipeYield": "1 9-inch quiche",
        "recipeIngredient": [
            "4 slices bacon",
            "1 (9 inch) unbaked pie crust",
            "¼ cup butter",
            "1 medium onion, finely chopped",
            "1 egg, beaten",
            "2 eggs",
            "1 ¼ cups sour cream",
            "¼ cup cream cheese, softened",
            "¼ teaspoon salt",
            "⅛ teaspoon ground black pepper",
            "1 cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry bacon in a large skillet over medium-high heat, turning occasionally, until crispy, about 10 minutes. Drain bacon slices on paper towels. Let cool 10 minutes. Crumble and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out pastry crust into a circle using a lightly floured rolling pin. Line a 9-inch pie pan with crust. Prick holes into the base of the dough using a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake crust in the preheated oven on the middle rack for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pastry crust from the oven. Brush crust with beaten egg. Return crust to the oven and bake 5 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat butter in a pan over medium heat and stir in onion. Cook and stir until onion has softened and turned translucent, about 5 minutes. Reduce heat to low and continue cooking and stirring until onion is very tender and dark brown, about 40 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk 2 eggs together in a bowl using a fork. Add sour cream and cream cheese and beat using an electric mixer until well combined. Beat in salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread caramelized onions with remaining butter onto pastry crust. Sprinkle with 1/2 the Cheddar cheese. Place crumbled bacon evenly over the top. Pour egg mixture over bacon. Top with remaining Cheddar cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake quiche in the preheated oven until golden and fluffy, about 30 minutes. Let cool 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs",
            "Quiche"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.594594594594595,
            "ratingCount": 37,
            "itemReviewed": "Bacon, Cheese, and Caramelized Onion Quiche",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "389.8 calories",
            "carbohydrateContent": "13.7 g",
            "cholesterolContent": "123.5 mg",
            "fatContent": "32.5 g",
            "fiberContent": "1.1 g",
            "proteinContent": "11.3 g",
            "saturatedFatContent": "16.6 g",
            "servingSize": null,
            "sodiumContent": "505.6 mg",
            "sugarContent": "0.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2019-05-18T02:03:52.31Z",
                "reviewBody": "5.17.19  I was hoping the stars of this quiche would  be the caramelized onions and the bacon, but what you taste more than anything is the sour cream.  Texture is a bit soft and different than any quiche I’ve ever had.  After 15 minutes of pre-baking the pie shell, the edges already were pretty browned, so I did cover them before adding the filling and then back to the oven.  For my taste, I would have preferred either swiss or gruyere instead of cheddar, but that’s simply a matter of personal preference.  To give it a bit more eye appeal, I garnished with some sliced green onion and reserved bacon.  This was pretty good, although I’m not sure I’ll make it again.  Karen, thanks for sharing your recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-07-17T03:36:03.79Z",
                "reviewBody": "Reduced the sour cream after reading another review.  I made 2-one with bacon and one without for my vegetarian daughter.  Added fresh spinach to hers and it was good. Also used frozen 9-in pie crusts to cut some time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Edwards",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25324563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-09T09:40:02.193Z",
                "reviewBody": "I made the recipe exactly, except I didn't count the strips of bacon. I probably used more than 4, I'd estimate at least 6.  I was nervous about this meal because my family doesn't have a lot of experience with quiche and my husband is squeamish about anything involving too many onions, but this was a hit!  Hubby and kids all had seconds, and there was not a bit left at the end of the meal. They even asked me to make it again. I will!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "busygal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4940611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-06-15T06:57:45.72Z",
                "reviewBody": "Great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jean stewart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25298739/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-09T08:12:30.127Z",
                "reviewBody": "I made this today and served for dinner with boiled golden potatoes.  The sour cream tasted wonderful.  I didn't think it was too strong.  It was a huge hit at my house and will certainly serve it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pat t",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6500017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-12-27T02:39:47.297Z",
                "reviewBody": "I thought this was delicious!  I was nervous about other reviewers saying that it was too sour creamy tasting and it did seem odd that I'd only use 2 eggs.  But I have to say - it was creamy, fluffy and delicious - I loved the texture of it.  The only thing I think I did differently was used a frozen 9 inch pie crust from the store.  I also cooked mine for 10 minutes longer than the recipe stated.  It did puff up nicely during that last ten minutes.  The flavor was amazing. I actually LOVE sour cream and so I couldn't even taste it.  My daughter, who likes sour cream okay, said she could taste it but she really loved the quiche.  I would say this - if you hate sour cream, this might not be your recipe. If you like or love it, definitely give it a try! The only other feedback I'd have is that I'd maybe start with the onions as step 1 and as they cook, go into pre-baking the crust and bacon. Since the onions take a long time and only get better as they cook, I'd start there.  For me personally, I also prefer the use of baking my bacon in the oven over the skillet.  The only time skillet-frying bacon is a good idea for me is when I need to use the bacon grease later in the recipe.  In this case, I should have cooked the bacon in the oven - it's the best way imo.  Put bacon on a parchment lined baking sheet; into a COLD (un-preheated) oven at 400 degrees and cook for 25 minutes.  Perfectly crisp bacon every time, no fuss.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda MM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23030597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-09-29T00:29:47.367Z",
                "reviewBody": "I have made a lot of quiches, and I have never pre-baked my crust, and I didn't with this one either.  Just followed the recipe to a T (except for the pre-baking), baked at 350 for more than the time called for, probably for 45-50 minutes, keeping an eye on its progress through the glass window of the oven.   Watched it puff up and deflate and waited to see it start to brown on top.  Tested it for doneness and when it looked like a very pretty quiche, took it out of the oven.  It was a very long ten minute cooling time, because it looked so good and smelled even better, so we maybe only waited 8 or 9 minutes before we cut and served.  DELICIOUS.  All agreed.  It has all the best ingredients a quiche could have, and it will be my go-to selection from now on.  I think it was those wonderful caramelized onions.   Or maybe the sour cream/cream cheese combo.  Or the bacon.  Or maybe the sharp cheese.  Anyway, there wasn't a crumb left.  So now I must make another, because it just tasted like more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pearl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10507921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-06T02:15:02.477Z",
                "reviewBody": "this was fantastic!!  my kids...who hate onions..ate this up and asked for me!!  by far one of the best quiches I've ever had!! I added a little more cheese than the recipe called for, but I like it cheesy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca Oster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16733045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-03-30T03:23:18.83Z",
                "reviewBody": "Took a bit longer to cook to golden brown. It was worth the time to fix. I used Colby jack cheese instead of cheedar cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doris Simmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27218363/"
                }
            }
        ]
    }
]