[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/364/desserts/frozen-desserts/",
                    "name": "Frozen Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16190/desserts/frozen-desserts/ice-cream-cake/",
                    "name": "Ice Cream Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19005/chocolate-chip-cookie-ice-cream-cake/",
        "name": "Chocolate Chip Cookie Ice Cream Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F450406.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2000-06-17T11:43:59.000Z",
        "description": "Vary this dessert by using different flavors of ice cream.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT5H0M",
        "recipeYield": "1 9-inch round cake",
        "recipeIngredient": [
            "1 (18 ounce) package small chocolate chip cookies",
            "¼ cup margarine, melted",
            "1 cup hot fudge topping",
            "2 quarts vanilla ice cream",
            "1 cup whipped cream",
            "12 cherries cherries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Crush half the cookies (about 20) to make crumbs.  Combine crumbs with melted margarine and press into the bottom of a 9-inch springform pan or pie plate.  Stand remaining cookies around edge of pan.  Spread 3/4 cup fudge topping over crust.  Freeze 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, soften 1 quart of ice cream in microwave or on countertop.  After crust has chilled, spread softened ice cream over fudge layer.  Freeze 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scoop remaining quart of ice cream into balls and arrange over spread ice cream layer.  Freeze until firm, 4 hours or overnight.  To serve, garnish with remainder of fudge topping, whipped cream and cherries.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frozen Dessert Recipes",
            "Ice Cream Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ARVILLALAR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.809651474530831,
            "ratingCount": 373,
            "itemReviewed": "Chocolate Chip Cookie Ice Cream Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "532.6 calories",
            "carbohydrateContent": "66.5 g",
            "cholesterolContent": "42.5 mg",
            "fatContent": "28.2 g",
            "fiberContent": "2.7 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "12 g",
            "servingSize": null,
            "sodiumContent": "316.3 mg",
            "sugarContent": "46.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-23T04:29:03.513Z",
                "reviewBody": "I made this cake as a birthday cake for my mother. Her favorite ice cream flavor is Black Rap\\spberry and her favorite cookie is an Oreo. I used a 10-inch springform pan to make this recipe. This is how I adjusted the recipe:\r\n\r\n1 (1lb 4 oz.)pkg. oreo cookies\r\n6 tbsp. butter\r\n2 pints Edy's Dreamery ice cream (black raspberry avalanche)\r\n1 qt. edy's vanilla bean ice cream\r\n1/2 cup hot fudge\r\n\r\nI used 30 crushed Oreos and the butter to press into the bottom of the pan and froze it for 10 minutes. I then spread room temp. hot fugde over the bottom and lined up whole oreos around the edge of the pan. I froze 15 minutes and then spread the Dreamery icecream into the pan over the crust. I froze 30 minutes. I then added a layer of the vanilla and smoothed the top. I had 3 remaining Oreos and so I crushed them very finely and spread them over the top of the cake. I think added hot fudge and cherries and whip cream would have made the cake way too sweet. It was just perfect like this.\r\n\r\nThis is a very flexible recipe and I will use it again with ingredients tailored for the recipient! I will probably make it for my husband's birthday in March with Pecan Sandies, caramel sauce and Butter Pecan ice cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BROOKIEGOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/220568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-21T13:29:09.403Z",
                "reviewBody": "Great, simple recipe! I did two layers of ice cream instead of scoops and then put a layer of whipped cream on top (Cool Whip tasted great!). I also put a layer of some remaining cookie crumbs and other full 11.5 oz bottle of fudge between the two ice cream layers. Just a suggestion...nuke the fudge. That way you can just pour it on instead of spread, which tends to bring the cookie crumbs up. I made it for my boyfriend's birthday, and he said it was the best ice cream he's ever had. It's so easy and delicious! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SarahF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T09:40:40.513Z",
                "reviewBody": "I made this for my husband's birthday lastnight. I have 7 kids and they said it was the best ice cream cake ever!! I used a deep dish glass pie plate. I used vanilla ice cream and regular sized chips a hoy cookies. I didn't make the last addition of ice cream into balls, I just did it like the first one--smooth.This is a recipe you can really be creative with.--by changing the type of cookie, adding Twix,recees etc around the side, sprinkiing m&m's on top....changing the flavor of ice cream etc. when we have company over, I thought I'd double the recipe and make it in a longer pan etc. You can't really go wrong with this recipe. I kept it covered while it was freezing to avoid the ice cream tasting like the freezer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CTR7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/493613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-28T14:31:00.153Z",
                "reviewBody": "Thank you Arvilla for such a wonderful recipe!  I made this for my son's 18th birthday and it turned out better than anything you would get in a five star restaurant!!!  I used Oreo cookies (my son's favorite) instead of chocolate chip, and I used cookies-n-cream ice cream for the bottom layer, and Häagen-Dazs vanilla for the little scoops on the top!  I re-froze the cake after each layer, and softened the ice cream for the scoops.  For the middle layer, I used more hot fudge mixed with crushed Oreo cookies, and then a thin layer of Cool Whip, then topped it with little mini scoops of Häagen-Dazs vanilla and decorated with mini Oreo cookies!  It literately turned out picture perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. Chef Esh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mschefesh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-21T13:31:53.42Z",
                "reviewBody": "The only problem I had with this is that the bottom layer stuck to the pan... I think because the fudge layer did not \"lay on top of\" the cookie layer.  It got mixed in.  I think this could have been avoided with an added freezing period before putting on the fudge layer.  Eveyone loved the taste and presentation of the cake however, and I would definitely try it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GAIL-K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/638666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-02T01:23:05.543Z",
                "reviewBody": "Impressive presentation for my son's l6th birthday!  I used a deep dish pie pan and would\r\nsuggest spraying it with Pam.  Pouring hot margarine over crushed Famous Amos chocolate chip cookies made a wonderful chocolate crust, but it took more than 20 small cookies to soak up the margarine.  I softened both the caramel and hot fudge for a minute in the microwave and used coffee and cookie dough ice creams with the caramel between; freezing between layers.  For the top layer, I used a melon ball scoop and covered the whole pie with little cookie dough balls, then a pastry tube filled with Cool Whip piped over the entire top.  Used softened hot fudge to write \"Happy Birthday\" over the Cool Whip, then lined up maraschino cherries with stems around the edge. It was an awesome \"birthday cake\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINMOM2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-28T19:14:44.967Z",
                "reviewBody": "This is such a great recipe!  After reading other's reviews, I knew exactly how to customize this cake for my son's 12th b-day. For the crust; I crushed a 12oz pkg of chocolate covered mint square cookies, I used another pkg to ring the cake sides then into freezer for 20 min.  I smoothed in creamy soft mint ice cream creating a 1/2\" layer, then froze for 30 minutes.  I crushed a pkg of Pepperidge mint sevilles and pressed onto the ice cream layer, then into the freezer for 15 min.  For the the topping: I spread 3/4 of a 16oz container of thawed cool whip then drizzled chocolate syrup over the top.  I pulled a toothpick through the syrup to create a heart design. Finally, I sprinkled chocolate mint sprinkles over the top, wrapped with foil and froze. until the next day.  I precut slices hour's before serving at my son's b-day bbq.  Using a springform pan gave such a beautiful presentation---this is easy to do and everyone will love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stella Blue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1962526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T04:30:09.34Z",
                "reviewBody": "This was really fun to make and cost a lot less than a store bought ice cream cake. I substituted a brownie crust instead of crushed cookies. I used a boxed brownie mix for a 13x9 pan and baked part of it in the springform pan and part in a bundt cake pan. After the brownie had cooled, I spread the jar of fudge on the springform brownie and cut up the bundt brownie into pretty wedges and formed the \"edge\" of the cake with them by placing them into the fudge and froze the cake overnight. The next day in the morning I filled half of the cake with Coffee Heath Bar ice cream and half cookies and cream, putting the pretty full scoops of ice cream on top and froze it again until my daughter's party. the cake was a huge success and everyone wants me to make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUNNINNUTDEB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/477230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T04:29:46.06Z",
                "reviewBody": "A+++ recipe.  I used chocolate creme filled Oreos and bought Dairy Queen soft serve for the 2 quarts of ice cream.  I family declared the cake was better than Dairy Queen's....not to mention about $10 cheaper!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOMZRIGHT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/528470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-29T02:58:17.28Z",
                "reviewBody": "I now know why it is suggested to make this with different flavors of ice cream. If using just vanilla ice cream it can be boring. \"It was like a dish of ice cream with \"some\" cookie crumbs.\" Please try different combinations that suit your taste. Do not worry that it will become too sweet. The people I served were just being polite and telling me it was delicious. I knew better. I had them add more topping on their individual slices. I will make again but with ALOT more FLAVOR. Very presentable. The results are very impressive. Worth the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "GORNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/829509/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chocolate Chip Cookie Ice Cream Cake",
            "description": "It’s ice cream on a cookie crust topped with whipped cream, fudge, and cherries!",
            "uploadDate": "2013-06-10T23:54:22.884Z",
            "duration": "PT3M47.31S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F5c4dc11e-83cc-4596-89dd-e31627e91331%2Fc49a870c-14e6-4ba6-bebd-04bd2258df27%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2469870715001"
        }
    }
]