[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/818/desserts/pies/pie-crusts/",
                    "name": "Pie Crusts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17716/desserts/pies/pie-crusts/pastry-crusts/",
                    "name": "Pastry Crusts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24094/butter-flaky-pie-crust/",
        "name": "Butter Flaky Pie Crust",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F25%2F24094-buttery-flaky-pie-crust-lindsey-hayes-2x1-1.jpg",
            "width": 2000,
            "height": 1000
        },
        "datePublished": "2000-11-14T12:40:43.000Z",
        "description": "Butter makes this buttery flaky recipe the perfect crust for your pie!",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT4H15M",
        "recipeYield": "1 single crust pie",
        "recipeIngredient": [
            "1 ¼ cups all-purpose flour",
            "¼ teaspoon salt",
            "½ cup butter, chilled and diced",
            "¼ cup ice water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine flour and salt. Cut in butter until mixture resembles coarse crumbs. Stir in water, a tablespoon at a time, until mixture forms a ball. Wrap in plastic and refrigerate for 4 hours or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough out to fit a 9 inch pie plate. Place crust in pie plate. Press the dough evenly into the bottom and sides of the pie plate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Pie Crusts",
            "Pastry Crusts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dana"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.669467787114846,
            "ratingCount": 2142,
            "itemReviewed": "Butter Flaky Pie Crust",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "172.8 calories",
            "carbohydrateContent": "14.9 g",
            "cholesterolContent": "30.5 mg",
            "fatContent": "11.7 g",
            "fiberContent": "0.5 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "7.3 g",
            "servingSize": null,
            "sodiumContent": "155 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-28T23:13:40.093Z",
                "reviewBody": "Excellent crust! I've made this crust many times, and I finally mastered the techniques to make it flaky (not recipe's fault but b/c inexperience). Previously, I over-worked the dough, used too much water, and/or didn't keep the dough cold enough, which made the crust tough and soggy. Tips: keep it cold & work it sparingly. Chill water in the freezer until ice crystals begin to form. Cut very cold UNSALTED butter into cubes & cut it in the flour & salt with a pastry blender (or pulse in food processor) until it resembles coarse crumbs. Transfer to large bowl & gently toss water into crumbs 1 tsp at a time with a fork. Do not use food processor to incorporate water - it's too easy to overwork the dough. The dough should have small bits of butter - this makes the crust flaky. Cool off hands under cold water, pat dry, gather the crumbs into a flattened ball, wrap in plastic, and refrigerate. Refrigeration is necessary b/c it allows the gluten to relax and prevent shrinkage.  You may need to roll out the dough twice. First roll out is usually crumbly, uneven, and has large breaks. Gently gather in edges to form another ball, flip it smooth side up, and roll out again. Smooth, round, even crust should be easier the second roll out. See pics of the process.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-21T13:23:46.173Z",
                "reviewBody": "SO flaky and tender. TIP: if you don't have a food processor or pastry cutter, try freezing the block of butter, and then grating it. I even put my grated butter back in the freezer, so the little bits FOR SURE stay solid and cold when I'm working the dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Samantha Li",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1745024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-25T13:42:42.627Z",
                "reviewBody": "Ok I love this recipe and as I was reading the reviews I noticed alot of people were having problems with the water and salt and coldness. Well as a professional Pastry chef I can tell you that when dealing with flour you can never put an exact amount of water because the moisture content of your flour is different than mine I live in the desert so it's going to take more water for my flour than someone who lives in Seattle. As for the salt all baking recipes are intended to use unsalted butter if all you have is salted then remove the salt from the recipe. And the coldness Freeze everything for 5 minutes before starting the process. Work quickly and also before I add the water I throw the flour butter mix back in the freezer for a few more minutes. Another tip before you get ready to roll out your dough, fill a few ziploc bags with ice and put on your counter where you will be rolling leave for about 10 minutes. Then roll your way to buttery flakiness. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mellymel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3323500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-10T07:11:56.77Z",
                "reviewBody": "This is THE tastiest crust ever!!! I used to be a dedicated shortening user, but because since moving to Finland from the USA, I have been unable to find it anywhere. I am no longer lamenting my misfortunes, though! This is the best butter crust I've ever tasted, and the only recipe for such that I have ever enjoyed perfect results and consistent success with. Every time I make this it turns out beautifully... I have made just simple pie crusts with it, as well as have used it to do more intricately decorated ones; braided and woven top crusts, have made flowers, fruits and leaves to garnish tarts with, etc., and the pie dough NEVER looses it's shape, even with the most intricate of sculpted details: No melting in the oven. Yippy! I have been using this crust religiously for nigh on a year, and even if I could get Crisco here, I wouldn't even bother using it for pie crusts because this is my crust recipe for all eternity. Oh, I thought I would mention, too, that in a pinch this morning I had to use baking margarine, as I didn't have enough butter for a double-crust, and it still turned out great... ofcourse not as divinely rich and yummy, but still as flaky and tender as always. Thanks for posting the absolute best pie recipe on earth! :P",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "eiskyjente",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2329658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-18T20:43:08.327Z",
                "reviewBody": "I used less water than called for -- I think it was 2 tablespoons.  I did not refrigerate at all - just rolled it out and popped it on my pot pie.  When it came out of the oven it was flaky and tender - very yummy!  (and btw, I'm GLAD you published this recipe - who cares if it's similar to another!  I was happy to find it when I searched for \"butter pie crust\".)  Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AggieFan92",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1104445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-17T23:47:51.387Z",
                "reviewBody": "I was very satisfied with this crust. I usually make the Betty Crocker pie crust with shortening. However, I had forgotten to put the shortening in the refrigerator so I looked for a butter recipe. This one is excellent. I did double the salt since I was using unsalted butter. I think it could have used even more. I did put my flour in the refrigerator. For those new at making pie crusts, it is best to use all cold ingredients. The only other change I made was time in the refrigerator. I only put mine in the refrigerator for 40 minutes. I just didn't have the time to wait for 4 hours. I was also concerned that it would be too difficult to roll out. Before I used the rolling pin, I patted down the ball with my hands and worked the dough with my hands for awhile, until it seemed to be willing to stay together. I then proceeded with rolling it. I like to roll the crust over my rolling pin when done. It makes it easy to unroll it right into your pie pan. I also always brush the crust with a beaten egg white. This seems to help keep the crust from getting soggy. I made a coconut custard pie with this crust and it did not get soggy. Good luck to all who try this recipe. I did find it quite easy to make and very flaky, which is the true test of a good crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARY DOMAZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/278426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-23T23:40:40.187Z",
                "reviewBody": "This crust was delicious!  I blended the butter/salt/flour combo in the processor until crumbly (it doesn't take long).  Then, slowly mix in the water little by little while kneading...I've made this many times and it never took the entire amount of water.  After chilling the dough, it will initially be tough, but don't let that discourage you.  Work it with a rolling pin, and in no time at all you'll have a beautifully shaped crust.  This is a versatile crust, it can be made with sweet and savory dishes alike.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/213044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-30T00:24:11.613Z",
                "reviewBody": "This is the perfect pie crust! I used this pie crust for a dessert pie as well as a chicken pot pie, both came out flaky and full of flavor. Buttery, flaky, wonderful! Always keep all your ingredients cold! Chill your flour in the freezer overnight. Use ICED water, not just really-cold tap water. Work your ingredients together as fast as possible. I usually get all the ingredients together with a quick mix in the cuisinart, and then I finish it off with a pastry cutter right in the cuisinart bowl to break up any big pieces of butter. It will look like a heap of white  reindeer poop. Plop the poop pellets in some plastic wrap, form it into a ball, and refrigerate for at least 4 hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chester Copperpot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2307452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-29T20:44:05.54Z",
                "reviewBody": "Buttery rich and delicious, light and, yes...flaky!  Supposedly only crusts made with lard or shortening will give you a flaky crust, but not so with this recipe. I mixed it up, exactly as written, and used it for \"Apple Crumb Pie,\" also from this site. I did use cold butter, but didn't even bother to chill the dough and it still rolled out like a dream. I scaled the recipe down to four servings, which turned out to be the perfect amount of pastry for two, individual pies. Not only was this surprisingly good, it was probably one of the easiest pie crusts I've ever worked with. A real pleasant surprise all the way around.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-29T23:41:32.547Z",
                "reviewBody": "This wasn't the best crust I've ever had. I had high expectations though given all of the raving comments. I do love how simple it is, plus I would much rather use butter than lard. Next time I will use less water because that may be the reason that it wasn't very flaky. I didn't even use the full 1/4 cup that it called for anyway! I made sure to keep the butter, water, dough, and my hands very cold. I refrigerated it over night. It was pretty easy to roll out (another reason I think I used too much water!) This makes a 9-inch single layer crust (that isn't mentioned in the recipe). I will probably try it again to see if it turns out better next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Evans",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3062241/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Butter Flaky Pie Crust",
            "description": "This buttery crust is ideal for any kind of pie.",
            "uploadDate": "2012-06-28T00:47:54.094Z",
            "duration": "PT3M24.454S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff159f07a-df66-4d13-a0ba-cd5bb1f248ba%2F19932e85-3456-44d1-8d59-27239d115e3f%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1709915777001"
        }
    }
]