[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1316/breakfast-and-brunch/waffles/",
                    "name": "Waffle Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/110926/almond-flour-waffles/",
        "name": "Almond Flour Waffles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4546539.jpg",
            "width": 1704,
            "height": 1704
        },
        "datePublished": "2020-06-16T05:13:01.000Z",
        "description": "Quick and easy! And so yummmy! I always put yogurt and fruit on mine!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup almond flour",
            "1 pinch salt",
            "1 teaspoon baking soda",
            "4 eggs",
            "¼ cup honey",
            "1 teaspoon vanilla extract",
            "cooking spray"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat waffle iron.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine almond flour, salt, and baking soda in a large bowl. In a separate bowl, whisk together the eggs, honey, and vanilla. Stir the flour mixture into the egg mixture. Grease preheated waffle iron with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon batter onto hot waffle iron. Cook until golden; serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Waffle Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "nmyers11"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.008333333333334,
            "ratingCount": 120,
            "itemReviewed": "Almond Flour Waffles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "213.7 calories",
            "carbohydrateContent": "16.4 g",
            "cholesterolContent": "124 mg",
            "fatContent": "13.6 g",
            "fiberContent": "2.2 g",
            "proteinContent": "8.6 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "283.5 mg",
            "sugarContent": "12.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-14T21:40:08.677Z",
                "reviewBody": "These waffles definitely do not have a waffle texture.  As other reviewers stated, they are soft and flimsy and I would say almost rubbery.   But.. the flavor is absolutely amazing.  I made these for my children who are on a dairy/soy/gluten/sugar free diet.  And if it were up to them they would eat them all day long!  We don't put anything on them, they are very sweet themselves.  But I'm sure they would be great with some fresh fruit.    NOTE:  I have recently read that the brand of Almond Meal/Flour can make a big difference in the consistency of the waffles!  So experimenting with different brands might be an option.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaci",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2883623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-12T15:21:28.42Z",
                "reviewBody": "Suggestion for improving the texture of this batter:\n\nIf due to allergies you cannot add a different flour with more gluten (which would be one way to make these more waffley), then I suggest separating the egg whites.\n\nWe do this when making wheat waffles to add lift and fluffiness, and it should work here.\n\nJust make the recipe as directed but before adding the eggs, separate the egg whites.  Then whisk the egg whites to stiff peaks before very gently folding them back into the batter.\n\nWhisking to stiff peaks is tough - I suggest using electric mixers and you may need a stablizer such as cream of tarter.  But this should help the texture tremendously!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VitaMeataVegamin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7822850/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-24T18:51:49.323Z",
                "reviewBody": "I try to make a recipe as written to see how it works out, & most important, to see if my family likes it.   Unfortunately, this recipe was not well recieved by my family. The eggs, baking soda, & honey called for was too much for a single cup of almond flour & I should have caught that.  My results following the recipe was soft, almost flabby waffles. \n\n I re-made the waffles with changes suggested by my celiac friend >> 3/4 cup almond flour, 1/8th teaspoon salt, 1/4 tsp baking soda, 2 large eggs,  1 1/2 tablespoons honey & dollop or two of buttermilk if needed.  Had much better sucess the second time around.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3234923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-23T15:21:58.63Z",
                "reviewBody": "This recipe has some potential. My husband and I are fairly strict paleo eaters and so I did reduce the honey and added cinnamon to make up for the flavor. Like many of the reviewers I did not think these were crispy at all. I ended up baking my waffles for a few minutes at 350 to give them more crunch. It seems like there is too much moisture in the recipe-- perhaps one less egg next time. I also used coconut oil to grease my waffle iron.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hatcherooni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3431695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-15T01:20:06.063Z",
                "reviewBody": "Since it's been mentioned that the almond meal/flour used can make a difference I will say that I used 'Bob's Red Mill Almond meal' to make these. I wasn't too sure about the lack of oil or milk but I get plenty of both in my diet & I was surprised at how runny the batter was. WARNING These cook up FAST!!! My DH (the waffle chef at our house) burned the first one because they cook so fast. As others have noted they do not crisp up like a good waffle should. Also previously noted they are more \"eggy\" than a normal waffle (it reminded me of the \"egginess\" of a french twist donut). These two things combined equal 1 star lost in rating. Still tasty & worth adding to my personal recipie collection but not over-the-top all-out to-die-for delicious. I liked the heartier texture & the light sweetness. Even better with a sprinkle of cinnamon in the batter. I also liked these better plain than I did with butter which never happens for me. Syrup is definitely not needed. I didn't add fruit or yoghurt as suggested but may next time - I can see where they would compliment the taste & texture. I also think I might try subbing almond extract for the vanilla. These are a pleasant change of pace that I will make again & I really love the natural ingredients that allows most of the people I know with health/dietary restrictions to enjoy these with me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Megasuss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2014250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-17T18:31:59.24Z",
                "reviewBody": "This recipe will go straight to my collection! Ok these have an amazing flavor and bite to them. They are a bit on the sweet side so they would go great with a simple fresh fruit topping and some plain old-fashion whipped cream. One thing I would like to mention is that they do not have the crispness or cakeyness of waffles; they have more of a pancake texture. That said I would still make them in the waffle iron as they shape up beautifully. Thanks nmyers11!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariah Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1488109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-03T01:51:23.753Z",
                "reviewBody": "This recipe saved my life! I can't eat sugar nor white flour and I absolutely loved these waffles. I uploaded a picture after my second try at them. The only change I made was substituting honey with agave syrup. I also added some raspberries before putting the batter in the waffle iron but putting them on top of the waffles is also delightful! Thank you for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "markmetom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4542405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-12T19:33:26.35Z",
                "reviewBody": "The taste of this recipe is very yummy, texture is kind of soft but it is still good.  One suggestion that I have for the people who are trying to follow the paleo diet is using unsweetened apple sauce instead of honey and maybe using half coconut flour and half almond flour and use sea salt.  This will add the sweetness without the honey and will be paleo.  Although, I am not sure if this recipe is supposed to be paleo but if you wanted to make it paloe thats what I would do.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ashley Moore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4829124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-22T00:03:08.13Z",
                "reviewBody": "Heavenly!  I am allergic to wheat and gluten so this is great!  I woke up this morning and wondered what to make for breakfast, luckily I checked my email first and found this recipe.  It's a keeper! I took some mixed berries from the freezer and microwaved them with a little Splenda to serve over them and broke out the yogurt as you suggested.Yummm! Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NellyBear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2594907/"
                }
            }
        ]
    }
]