[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13954/addictive-sweet-potato-burritos/",
        "name": "Addictive Sweet Potato Burritos",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8245563.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-07-31T17:42:29.000Z",
        "description": "Once you've had one, you'll want another. The recipe is a little different from most burrito recipes, but I've had many, many requests for it. Serve these with sour cream, chopped green onions, and salsa.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "12 burritos",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "1 onion, chopped",
            "4 cloves garlic, minced",
            "6 cups canned kidney beans, drained",
            "2 cups water",
            "3 tablespoons chili powder",
            "4 teaspoons prepared mustard",
            "2 teaspoons ground cumin",
            "1 pinch cayenne pepper, or to taste",
            "3 tablespoons soy sauce",
            "4 cups mashed cooked sweet potatoes",
            "12 (10 inch) flour tortillas, warmed",
            "8 ounces shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a medium skillet and saute onion and garlic until soft. Mash beans into the onion mixture. Gradually stir in water; heat until warm, 2 to 3 minutes. Remove from heat and stir in the soy sauce, chili powder, mustard, cumin, and cayenne pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide bean mixture and mashed sweet potatoes evenly between the tortillas; top with cheese. Fold tortillas burrito-style around the fillings and place on a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until warmed through, about 12 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Karena"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.277558348294434,
            "ratingCount": 2785,
            "itemReviewed": "Addictive Sweet Potato Burritos",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "504.6 calories",
            "carbohydrateContent": "76.6 g",
            "cholesterolContent": "19.8 mg",
            "fatContent": "8.5 g",
            "fiberContent": "13.4 g",
            "proteinContent": "20 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "1028.5 mg",
            "sugarContent": "5.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-08T23:03:45.56Z",
                "reviewBody": "I debated trying these for a long time before I finally did it.  I was almost positive they were going to be too weird for us!  I give this a 4 instead of a 5 because I made half with black beans and half with kidney beans and the black beans were much better!  Also, mashing the beans after they're in the skillet is a real pain.  Next time I'll mash them first.  I was worried that it was going to be too much cumin and chili powder, but used all the spices just as the recipe suggested and it was the perfect contrast against the subtle sweetness of the potatoes.  Next time I'll use a little more cheese in each burrito.  Served with sour cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "dagny21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-03T13:53:02.62Z",
                "reviewBody": "We loved these & thought they were far from bland. I didn't exactly follow the recipe though. Some spices, particularly curry, cumin & chile powder, need to be sauteed a bit to help release their flavors. So I sauteed my onion for a few minutes, added the garlic (didn't want to cook it too long as it turns bitter), then a  couple of minutes later, added the cumin, chile & cayenne....allowing them to heat for a minute or two. Thsi really pulls the flavor out & makes a big difference.  I used black beans (rinsed & drained & only mashed enough to beak up the beans) instead of kidney beans & I used vegetable broth instead of water, only adding enough to make it the consistency that I wanted.  I used a mexican blend cheese, dark brown spicy mustard & just mixed my mashed sweet potatoes into the bean mixture instead of loading them separately into the burritos. Once assembled, I gave the burritos a light spray w/ olive oil cooking spray, just enough to fake them out & make them think they had been fried. ;o) Served them w/ fresh mango slices & avocado slizes, sprinkled w/ lime & salt. Brigadiero's (from this site) for dessert. I froze the leftovers on a cookie sheet. I'll wrap them separately in plastic wrap & then put them in a freezer bag.  Thansk for a wonderful recipe Karena!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-17T14:40:41.833Z",
                "reviewBody": "I recently became a vegetarian and I was looking for a good pre-race meal that would provide my body with the energy needed during a triathlon.  This recipe fits the bill!  As the recipe makes 8-10 depending on what size tortilla you use, I have shared these with several of my cycling and triathlete friends and EVERYONE of them has asked for the recipe.  I only made a few changes to this recipe.  I used 1 can black beans, 1 can pinto beans and 1 cup frozen corn as my bean mixture.  Mash the beans with a potato masher prior to adding the corn for better texture.  I also substituted 8in multigrain low carb tortillas for the flour tortillas, as well as 2% sharp cheddar cheese instead of mild cheddar.  Last, but not least, I put a tablespoon of light sour cream on my burrito after it is heated and ready to eat.  These burritos keep very well.  After cooking them in the oven, I let them cool then wrap each one in a paper towel and freeze in a zip lock bag.  To reheat, just remove from bag, leave in paper towel, and heat in microwave for 2 minutes.  These are just fabulious!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Toni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1844694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-19T18:53:43.267Z",
                "reviewBody": "Very good and very healthy. Flavours were just right. Like other reviewers, I used black beans in place of kidney beans and left them quite chunky when I mashed them. I baked the sweet potatoes and scooped them out and mashed them very smooth with salt and pepper. I used reduced fat old cheddar and whole wheat tortillas. Served with shredded lettuce and chopped tomatoes, green onions and green peppers and light sour cream. We both loved them. They are quite large, I couldn't finish mine; next time I may make them in the 6-inch tortillas. I froze ten of them, and both my boyfriend and I are looking forward to taking them for lunches! Many thanks for the recipe!\n\n\n*UPDATE*\nJust a quick note on reheating the frozen burritos...It works perfectly in the oven from frozen. 30 mins wrapped in foil at 350, them 15 mins unwrapped to crisp them up. Better than when I first made them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KEANSOR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1330992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-15T07:10:37.2Z",
                "reviewBody": "This was surprisingly good!!  I made it into a baked casserole, layering corn tortillas, bean mixture, yams, cheese. I used black beans and jalapeno jack cheese, added green bell peppers, increased the spices, and garnished w/ sour cream and green onions. My family LOVED it. Do reduce the liquid by half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/357400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-20T17:55:04.067Z",
                "reviewBody": "5 Star Concept - 3 Star Execution. There is no place for water in this recipe and including  it wrecked it for the unwitting as reported in their reviews. The correct way to make this recipe is to cook kidney beans from dry goods. 1 lb. makes 6 cups. They will be perfect and ready without mashing or water. 3 large yams skinned, cooked (13 minutes in microwave in Pyrex pot with water) should make 6 cups – mash in a big stock pot on low heat. Make seasoning as a sauce by using exact ingredients plus 2 squirts of Sriracha and 2 tbls of sweet chili sauce and one tbls safflower oil. The end result will be mildly spicy by American standards. To make spicier, add more chili powder, cayenne, and Sriracha sauce in suggested proportions. Pour the sauce evenly on top of the beans in the skillet and stir. 4 tbls high heat safflower is best oil for this recipe. Also, 12 oz of cheese is required. Type of Cheddar is not called out. Sharp is best for this recipe – Mexican blend will work. This recipe will produce exactly the stated dozen 10” burritos. Thus, it will produce (10) 12” burritos (12” flour tortillas are the best value at Costco). If you prepare dish to these specs you will have a fab meal and leftovers while realizing the full potential of the concept, which is excellent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BlackEye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6082725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-15T18:38:29.327Z",
                "reviewBody": "I make this recipe all the time - it's become a staple in my household. Wonderful!  I would recommend using a potato masher to mash the beans, as this is the most time-consuming part. I also scale the recipe down to make 5 burritos (1 can beans, 1 can sweet potatos, 1/4 onion).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "solemn chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/617318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T20:51:42.97Z",
                "reviewBody": "Thank you Karena for sharing this recipe.  I made it as per the recipe, except, I cut the ingredients in half, as this makes a large amount.  The spice level for me was just right, as I like to taste the other ingredients in the recipe and not overpower them with heavy spices.  As my tastes are not the same as yours, I will probably make a few changes, the next time I make this and there will be a next time.  Possibly a different type of bean and try a different cheese, like pepper jack for a kick. I don't normally write reviews for the recipes on here, but I finally felt like voicing my opinion.  I feel that some of the reviews, on this site, not just on this recipe, would be better left off.  Especially the ones that totally re-write a recipe.  My advise to all members, is to keep in mind a quote that I read from Chef Michael Smith.  He wrote \" Recipes are how one cook shares ideas with another cook! They're just words on paper; a guideline, a starting point from which to improvise\"   These words are absolutely true.  Every recipe on this site, will have alterations done to it, to suit each persons own tastes.  A few tweaks mentioned are good, but if your are going to re-write it...submit your own. Thanks again Karena, and to all the other cooks that have the guts to submit their recipes for us to enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandy Hull",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2654622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-09T21:18:09.14Z",
                "reviewBody": "Awesome, but I would used refried beans next time so avoid the hassle of mashing the kidney beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMR4EVA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460545/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Addictive Sweet Potato Burritos",
            "description": "These vegetarian burritos have a slightly spicy and utterly addictive flavor.",
            "uploadDate": "2012-08-21T23:02:41.282Z",
            "duration": "PT5M16.274S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3a0444d8-59e2-416d-a0ce-cc728061fbbb%2F04ac75e5-90df-40f8-8a58-73bc2df1120b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1797607088001"
        }
    }
]