[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6717/beer-bread-i/",
        "name": "Beer Bread I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6998353.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "1998-05-25T00:56:48.000Z",
        "description": "Beer Bread is a quick bread to make to accompany any beef dish.  The type of beer you use will change the taste.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "1 (12 fluid ounce) can or bottle beer",
            "3 cups self-rising flour",
            "3 tablespoons white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the sugar and flour. Add beer and continue to mix, first using a wooden spoon, then your hands.  Batter will be sticky.  Pour into a 9 x 5 inch greased loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees ) for 50 for 60 minutes.  The top will be crunchy, and the insides will be soft.  Serve topped with butter or cheese spread.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jodi Regan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.517396184062851,
            "ratingCount": 891,
            "itemReviewed": "Beer Bread I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "135.5 calories",
            "carbohydrateContent": "27.4 g",
            "cholesterolContent": null,
            "fatContent": "0.3 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "398.1 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-08-10T00:54:16.313Z",
                "reviewBody": "I'm a prolific caterer and I've added this bread recipe to my repertoire because of its quick and easy preparation, and because my clients give it two enthusiastic thumbs up.  One thing I do which no one else had addressed, is divide the batter between two small loaf pans, and then let it sit about a half-hour.  It rises to about double its bulk, forms a crown, and produces a lighter, product ---- to die for!  The 1/3 cup sugar addition others have mentioned is perfect and I add a handful of mexican-blend cheddar and jack cheeses (mix cheese with flour before adding beer.)  Brush with butter and sprinkle with garlic salt half-way through baking, and repeat after removing from over.  Perfect.  Absolutely perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef in Blairsville",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1528792/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-17T23:49:58.94Z",
                "reviewBody": "My family has recently become addicted to Tastefully Simple's Beer Bread. At $5 a loaf, it's getting pricy so I tried this and WOW! My family loved it and my son said he like it BETTER! I did add 1/3 cup sugar as another suggested and it was great. I also made the self rising flour that someone posted (1 cup flour, 1 tsp baking powder and 1/2 tsp salt). Thanks for saving me some $$$",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CREATIVEWAYSTOSAVE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1118330/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T16:27:35.747Z",
                "reviewBody": "I love beer bread.  It is super fast and couldn't be easier to make.  \r\nI don't usually have self rising flour on hand so make my own.\r\n1 c flour, 1 t baking powder and 1/2 t salt\r\nI have used all types of beer, everything from plain bud to hard cider.  Cider is my favorite, it gives your bread a sweeter fruity taste.  The only type I won't use again is Corona (no flavor).  I recently added cheese and peppers to my bread and it was wonderful.  \r\nI have also seen beer bread recipes that call for about a 1/4 cup of melted butter to be poored over the top before baking.  I have done it both ways.  If you use the butter I would decrease to about 2 Tablespoons, that is more than enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-15T22:45:37.937Z",
                "reviewBody": "I didn't have self-rising flour, but I used regular flour and added 1 tsp. salt and 1 T baking powder to the recipe and it worked perfectly!  I wouldn't add more sugar, but I also really don't like this with a strong, dark beer after doing that once.  \"Cheap\" and basic brands taste better to me.  Now, I make this every time we have a party and there's leftover beer!  Thankfully, I did not need to use my hands to mix it.   I just sifted everything dry, used a whisk to mix it together, added the beer, and then stirred with a wooden spoon.  This was way too sticky to use my hand. I also used a buttery-crust tip I learned elsewhere -- it baked at 375 for 50-55 minutes. Then I pulled it out, ran a butter stick over the top of the loaf, then put it back in for 5 more minutes.  Perfect crust!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Medea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1590400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-10T19:35:52.953Z",
                "reviewBody": "If you savor the buttery, crunchy crust bake your bread in a 9x13 pan and pour melted butter over the top before baking. If you like the soft delicious middle bake it in a medium saucepan for a round loaf (my fave). Try 12-ounce cans of soda pop; they will turn the bread colors! I like orange soda in the bread with coarse sugar sprinkled on top before baking. I made it with diet cola and it was excellent! I made it with beer but didn't care for the \"beery\" taste. I made this recipe along with an identical loaf that was made with the Tastefully Simple Bountiful Beer Bread mix. My hubby couldn't tell which one was the TS mix. He finally decided he liked this recipe better. BTW, I used SIFTED all-purpose flour, 4 tsp baking powder & 1 tsp salt rather than the self-rising flour. Absolutely excellent!  No yeast, no bother, easy, great for savory or sweet.  This recipe will be a staple at our house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRADYSMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/832683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-27T16:10:17.51Z",
                "reviewBody": "I have been making this bread for a couple of years now.  It is very versatile.  You can add some Italian herbs.  I usually use 1/4 cup of sugar.  Sometimes I use brown sugar or both white and brown.  Light beer makes a very fresh, white bread taste, but I like to use honey lagers for a little richness and depth.  You may also want to note that this bread is much better served fresh.  Toasting the lefovers and eating it with butter or honey is great.  I have also made garlic bread out of it.  I alway have self-rising flour on hand because I make this bread so often.  It can go with so many dips and spreads.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Masty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1675051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T14:08:51.993Z",
                "reviewBody": "Excellent! I let mine sit for 30-60 min before baking (while in the pan). The tips to make your own self-rising flour are so helpful works great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Margaux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1899804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-15T02:24:03.983Z",
                "reviewBody": "This is an excellent recipe.  It tastes just like the \"popular expensive\" recipe that I have purchased in the past.  2 things you have to remember though, you need to use at least 1/3 C. of sugar and if you do not have self-rising flour and you are using all-purpose flour use 3 tsp. of baking powder and 1 1/2 tsp. of salt.  Also, as the boxed recipe calls for, only mix together until moist.  Do not overmix.  I served 2 loaves at a Superbowl party and no one would have known the difference had I not told them.  Thank you for such a Wonderful, inexpensive recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joaniestwin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/463972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T17:59:30.077Z",
                "reviewBody": "Haven't ever fixed this that everyone didn't absolutely love it.  I was trying to find a recipe to make that would be cheaper than the Tastefully Simple mix so I increased the sugar in this to 1/3 cup and drizzled 3 T. of melted butter over the top before baking.  You CANNOT tell the difference between this and their mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RICA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/109738/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-15T22:34:30.91Z",
                "reviewBody": "Although the bread did taste great. The recipe itself is not concise in the directions. Like is it baked at 350 degrees or 175 degrees? Also what about after you put your hands in the batter? Do you need to knead it a certain number of times. I was not very happy with the outcome the top was indeed crunchy perhaps a little to crunchy as well as the sides and bottom. I baked it at 350 for 45 min in a teflon loaf pan (same as I bake other breads in) and it was more than done. Not sure I will make this again or not at least not without some refining of the directions. Sorry but in my opinion this is not one of the better recipes offered on this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DCLEWIEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/987481/"
                }
            }
        ]
    }
]