[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6739/sweet-potato-rolls/",
        "name": "Sweet Potato Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F741383.jpg",
            "width": 1816,
            "height": 1512
        },
        "datePublished": "1998-06-08T22:05:32.000Z",
        "description": "A flavorful roll, good with hearty soups and stews.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 1/2 dozen rolls",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "4 tablespoons white sugar",
            "½ cup canned sweet potato puree",
            "½ cup warm water (110 degrees F/45 degrees C)",
            "3 tablespoons margarine, softened",
            "1 teaspoon salt",
            "2 eggs",
            "3 ½ cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast, warm water, and 1 tablespoon sugar in a mixing bowl.  Let stand 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add remaining sugar, sweet potato, butter or margarine, salt, and slightly beaten eggs.  Stir to mix well.  Stir in 3 cups of flour.  Turn out on a lightly floured surface.  Knead  2 to 3 minutes, adding just enough of remaining flour to  prevent sticking.   Do not knead too heavily; when smooth, shape into a ball.  Place in an oiled bowl, and turn to coat the surface.  Cover, and let raise about 1 hour or longer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down, and allow dough to rest for 2 minutes.  Divide into 16 to 20 balls, and place on a greased cookie sheet or in a 9x13 inch pan.  Allow to rise until doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 375 degrees F (190 degrees C) for 12 to 20 minutes.  Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHERLIE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.595238095238095,
            "ratingCount": 252,
            "itemReviewed": "Sweet Potato Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "132.5 calories",
            "carbohydrateContent": "23.2 g",
            "cholesterolContent": "20.7 mg",
            "fatContent": "2.7 g",
            "fiberContent": "0.9 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "168.7 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-14T03:43:10.67Z",
                "reviewBody": "My sister-in-law gave me this same recipe and it is fantastic.  The only difference is after the punching down and resting step, I then divide the dough into 3 equal size balls.  Roll these balls out into a fairly thin circular shape, use a pizza cutter and cut in 12 equal wedges.  Roll the wedges up from the longer side down to the point, let them double in size, about 40 mins., and then bake as directed.  Because they make so many, I put them in smaller freezer bags after I've baked them.  When I want to use them, simply let them defrost for approximately an hour, place on a lightly greased cookie sheet and bake for about 10 mins. at 300º.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BABSKITCHEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/584321/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-08T16:31:18.967Z",
                "reviewBody": "I made this in my bread machine. The only change I made was 3 Tbsp brown sugar and 1 Tbsp white, and I added 1 tsp. ground nutmeg. I used sweet potaots I grew in my garden. I think those who said they were not as orange colored as they anticipated maybe used canned sweet potatos. Mine were very orange, absolutely gorgeous!\nI served with honey butter. This is a wonderful recipe and a great use for sweet potatos.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Elane Berry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/susandon/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-28T23:11:35.793Z",
                "reviewBody": "Very easy recipe to make. You will use more flour than needed because the dough is very sticky. The taste is wonderful. What could possibly be better than homemade rolls. I did use regular sweet potatos and not canned. It takes about 3 small ones to equal the 1-1/2cups canned. I too added some brown sugar to the potatos about 2T next time I think I'll add about 1/4cup. My rolls were about the size of normal dinner rolls and so this recipe made 24 good size rolls for me. I would not recommend skipping the step on oiling the pan even if your pan is nonstick. It really needs the oil. This recipe has a wonderful taste. The aroma of the bread rising and baking is out of this world but I think that on all homemade breads. I paired this with Angels Beef Stew recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DACMLYMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1336037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-25T18:43:46.123Z",
                "reviewBody": "I used 3 fresh sweet potatoes that had been baked and mashed. The color of these rolls was beautiful. My family is avowed sweet potato haters so I didn't tell them what kind of rolls they were scarfing down at Thanksgiving dinner. It was thumbs up all around the table for the soft tasty rolls with none of them realizing they were eating the hated sweet potato. The recipe did require more flour..perhaps as much as a cup. I didn't measure..just added until I had a firm but still sticky dough. Also added 2 T of brown sugar. Used Pam on my hands while forming the rolls so the dough wouldn't stick. They rose perfectly and were gorgeous after they baked. Thanks Sherlie loved this recipe and plan to use it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEYNOW1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1280462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-22T20:48:36.683Z",
                "reviewBody": "Yes these rolls are tender moist & the color is pretty but if you are expecting a little more flavor (like perhaps sweet potato) then you may be disappointed. I too used almost 5 cups of flour instead of 3. If you are short on prep time when you go ingredient shopping substitue \"Rapid Rise\" yeast... Basically you'll mix all your dry ingredients together (including the yeast) and put the margarine in your saucepan with the water as you heat it (using this method you heat the water to 120-130 degrees). In the meantime I pureed my cooked sweet potatoes & the eggs together in my blender. Once your water has reached the proper temp add it to the dry ingredients and then add your blended potato mixture. Once it's all incorporated knead for about 5 minutes then cover for 10 minutes and let rest. Then you're ready to shape your rolls. Of course they need to rise before baking but you've just saved yourself an hour because you didn't have to wait for it to rise the first time then punch down then shape then rise again etc etc. They are quite tasty but \"subtle\" is the word of the day. What this recipe needs is sweet potato concentrate. Hmmm...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1607149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T22:01:02.827Z",
                "reviewBody": "Wonderful recipe!  I used yams (cooked and mashed) and I substituded 2 c. whole wheat flour for 2 c. of the white flour.  I threw it all in my bread machine without too much trouble.  Works fine for a loaf of bread too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PLUMMERJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795098/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-24T12:13:18.24Z",
                "reviewBody": "We loved these rolls and will make them every Thanksgiving from now on. My one year old could not get enough. Very moist and great flavor. I used 1/2 cup extra sweet potato (fresh).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ATHENE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/434460/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-08T02:14:27.793Z",
                "reviewBody": "I loved these rolls. The texture is so tender and they have a delicate flavor--not too sweet. I had 3 small sweet potatoes so I cooked & mashed those instead of canned. I tried something different--I subbed eggnog for the water and took a tip from EVILBEE and used brown sugar and about 1/2 teaspoon of nutmeg. I did add another three cups of flour (1/2 cup of WW) and still had to keep my finger tips floured while pinching off the dough. I got 27 nice sized rolls and a loaf of bread! Great idea for dinner rolls Sherlie--thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANNYLOOHOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/953764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-06T20:51:35.6Z",
                "reviewBody": "I used fresh cooked sweet potatoes instead of canned. Absolutely fabulous rolls! Ate them with some Honeybaked Ham for breakfast. I will definitely make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JTWILES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1451580/"
                }
            }
        ]
    }
]