[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1537/bread/yeast-bread/bagels/",
                    "name": "Bagel Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6849/boiled-bagels/",
        "name": "Boiled Bagels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3697747.jpg",
            "width": 1920,
            "height": 1080
        },
        "datePublished": "1998-08-12T15:23:40.000Z",
        "description": "Bagels that are boiled before being baked.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "1 dozen",
        "recipeIngredient": [
            "4 ¼ cups all-purpose flour, or as needed",
            "2 (.25 ounce) packages active dry yeast",
            "1 ½ cups warm water (110 degrees F/45 degrees C)",
            "3 tablespoons white sugar",
            "1 tablespoon salt",
            "1 tablespoon white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In large bowl, combine 1 1/2 cups flour and yeast. Mix water, 3 tablespoons sugar and salt together, and add to the dry ingredients. Beat with a mixer for half a minute at a low speed, scraping the sides of the bowl clean. Beat at a higher speed for 3 minutes. Then, by hand, mix in enough flour to make a moderately stiff dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn out onto a lightly floured surface and knead until smooth and elastic (8-10 minutes). Cover, let rest for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut into 12 portions, shape into smooth balls. Poke a hole in the center with your finger, and gently enlarge the hole while working the bagel into a uniform shape. Cover, let rise 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, start a gallon of water boiling. Put 1 tablespoon of sugar in it, mix it around a bit. Reduce to simmering.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the bagels are ready, put 4 or 5 bagels into the water, and cook 7 minutes, turning once. Drain them. Place on a greased baking sheet, and bake at 375 degrees F (190 degrees C) for 30 to 35 minutes. Remove from oven, eat hot or cold.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Broiling option: For a glossier surface, place raised bagels on an ungreased baking sheet prior to boiling them. Broil them five inches from heat for 1 to 1 1/2 minutes on each side. Then put them into the hot water to be boiled as above. Note: do not bake broiled bagels as long as non-broiled ones, 25 minutes should be long enough.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Bagel Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jandl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.42436974789916,
            "ratingCount": 476,
            "itemReviewed": "Boiled Bagels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "180.7 calories",
            "carbohydrateContent": "38.4 g",
            "cholesterolContent": null,
            "fatContent": "0.5 g",
            "fiberContent": "1.4 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "583.7 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-04T00:20:57.763Z",
                "reviewBody": "HEy, im just 16 and I was bored so I decided to try making bagels and it has turned into kind of a hobby I have tried a lot of different recipes and some have come   out pretty good what I did with this is I made 8 jumbo bagels andI REALY LIKE THIS RECIPE BECASUE WHEN I USE ONE TABEL SPOON OR MORE OF MOLASSES IN MY BOILING WATER !!!!!! (no offence) it gives me the real new york water bagel surface I have been trying forever to obtain  it is shint and hard and it gets little cracks in it when you bend it so I liked everything about them they came out like a bagel should hard and shiny and soft and chewy  oh..... and jumbo ( I let them rise a little longer great recipe thanks later",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HYDROMONKEY10",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/733661/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-17T15:27:36.577Z",
                "reviewBody": "Perfect, perfect!  I subbed 1 1/2 C whole wheat flour and baked them on a pizza stone sprinkled with cornmeal.  I could only bake 6 at a time, so due to my fussy baby I accidentally let the second half of the batch rise for 1 hour on a floured board under a damp towel after they were formed instead of the twenty minutes the recipe called for, and the second batch was SPECTACULAR- light and fluffy on the inside, crisp on the outside.  I also only needed no bake them for half as long as the recipe called for- good thing I kept an eye on them the first time- not sure if my oven is off or what, but just watch them closely the first time to see what they do.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAMIELYNN1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1075972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-19T23:29:01.89Z",
                "reviewBody": "This was my first attempt at making homemade bagels! They came out fantastic!! It is a process... easy, but a bit time consuming, like anything baked using yeast.I didn't change anything except I used the suggestions from others, I let them rise for 30 minutes and made 8 larger bagels instead of the 12...and they are a perfect size! I also used maybe a quarter cup of whole wheat flour as well. I made them everything bagels by dipping the bagel in a bowl with poppy seeds, onion flakes, garlic flakes, some sesame seeds, and one batch had some coarse sea salt added. One bagel I coated with some honey and sprinkled some oats on it..just to see.I dipped them in it after I boiled them before baking. I also lightly oiled the baking sheet and sprinkled some corn meal. I must say, they taste wonderful, my boyfriend loved them!! Thanks for the recipe...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Victoria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2430724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-17T01:39:14.827Z",
                "reviewBody": "I make a lot of breads and this was so easy!!!  Make sure your dough rises regardless of the amount of time stated and make sure  your water is not too hot when you add it to the yeast and flour.  That may be why some of your bagels sank.  After you have shaped the bagels and they have risen, make sure you don't knock them down before you put them into the boiling water.  GREAT RECIPE!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "monicabush",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1488506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-02T18:57:56.633Z",
                "reviewBody": "Great recipe! I worked at a bagel shop while in college and we did the traditional boiled bagel and this come pretty close. \n\nSome notes:\nProofing the bagels - After I shaped the bagels (forming the dough into a small ball and poking a hole in the middle is genius!), I put them on a cookie sheet, let them rise a bit (about 15mins or so) and placed them in the refrigerator for about 45mins. This allows them to proof the rest of the way and helps them retain their shape once you put the bagel into the boiling water. \n\nBoiling the bagels - Depending on how you like the texture will determine how long you let the bagel boil. For mine, I only let the bagel boil for about 30-45 seconds which will give it a thin crispy crust and a softer texture inside. I've never heard of letting a bagel boil in water for 7mins., from my experience (baking bagels at 3am - sometimes hungover and having this happen), boiling bagels too long causes them to become water-logged and hard to handle (but if you had success, then I've learned something new!). Also, it's important to keep the water at a very high boil. I dropped one bagel in at a time so the temp wouldn't drop. \n\nSeriously, not sure if I'm going to pay $10+ for a dozen bagels around here anymore especially since this recipe was so good! Thanks for posting!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/593437/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-27T04:43:50.857Z",
                "reviewBody": "This was not my first time making bagels, but this was by far this is the easiest recipe to follow. In order to form a semi-perfect bagel, after letting the dough rest for 15 minutes, I rolled them into 12 smooth balls, and then let it rise for 30 minutes. I also made an oatmeal bagel with 1 cup white flour, 2 cups wheat flour, and 1 1/2 of ground oatmeal. I added 4 tablespoons of honey, and they came out scrumptious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1782601/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-15T14:52:05.733Z",
                "reviewBody": "My kids had a blast making these with me, and they came out like Real Bagels!\n\nI made a couple small modifications to the recipe:\nTo get commercial sized bagels, we made 8 with this recipe instead of 12.\nI let the yeast rest with the salt and sugar in the hot water for a few moments before adding it to the other dry ingredients - years of making dough has taught me this is the way I get them to rise better.\nI let the formed bagels rise in warm oven (oven turned on for two minutes while forming bagels and then turned off) and sprayed the pan they were on with PAM so I could peel them off easier to get them a'boiling. (Used a shortening-greased pan to bake, however).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RustedDesigns.Etsy.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2741695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-06T17:58:50.52Z",
                "reviewBody": "These bagels are very delicious, but this was my very first attempt at making bagels.  Anyone new to making bagels should note that the instructions should mention that the bagels must be placed in the oven immediately after boiling.  I didn't have a big enough pot to boil all the bagels at once, so I had to boil them in two separate batches.  The first batch that I boiled then left to sit and wait for the second batch came out of the oven very dense and rubbery.  However, the batch that went directly from the boiling water into the oven came out wonderfully!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Karri-ann Flater",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1048042/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-26T21:25:56.123Z",
                "reviewBody": "I have made this recipe 6 times in 2 weeks time, and they have been excellent every time.  Here are a few tips I've discovered through testing and experience:  I have tried substituting brown sugar for white sugar in this entire recipe, including the boil, and they taste equally good but a little different (my wife thinks they are better).  7 minutes of boiling is pointless, as I've done many experiments with these and found that 1:30 each side is the max needed -- nothing longer than that will make it any chewier.  Boil with a ROLLING boil, not a simmer as per the recipe.  The temp will drop when you add the dough anyhow, so a rolling boil keeps things boiling when the bagels go in.  Bake them at 400F for about 20-25 minutes, turning the cookie sheet around halfway through so it bakes evenly.  The chewy texture is best achieved through letting them cool and staying out all day (or overnight) before bagging.  They will taste less yeasty and more dense and chewy after sitting out.  Also, this recipe will yield very small bagels if you make 12 so I suggest doing 7-8 for a regular-sized bagel.  Brush them with egg before baking for a glossy surface and save yourself the whole broiling step.  If you prefer not to use vegetable oil you can sprinkle yellow cornmeal on the cookie sheet instead.  It won't stick and it adds a little bonus flavor underneath.  Lastly, I have gotten excellent results using 1 tsp. less yeast (so a total 3.5tsp).  Happy bagel making!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "scottandtiffany",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7699934/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-26T22:47:42.900Z",
                "reviewBody": "I am not happy with the way these bagels turned out. I read all of the five-star reviews before I started and followed the directions to a T, with the exception of making 9 bagels instead of 12. The bagels looked beautiful going into the water bath and beautiful coming out. It was about 30 minutes into baking that I realized these weren't going to be the \"perfect bagels\" I had envisioned. The bottoms were gooey even after 45 minutes in the oven. I flipped them over and baked for another 15 minutes before pulling them out of oven, not wanting to burn them. Though this was my first attempt at homemade bagels, I consider myself an accomplished baker and have never had problems with homemade breads, rolls, pretzels (also boiled), etc. I believe the error in this recipe is in the boiling time. Most other recipes state to boil bagels under 2 minutes total, not seven. I will attempt these bagels one more time, but will decrease the boil time significantly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744615/"
                }
            }
        ]
    }
]