[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/359/bread/quick-bread/fruit-bread/",
                    "name": "Fruit Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6912/orange-loaf/",
        "name": "Orange Loaf",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2384247.jpg",
            "width": 1383,
            "height": 1295
        },
        "datePublished": "1998-08-30T16:18:21.000Z",
        "description": "This quick-bread recipe uses orange zest and fresh orange juice for extra-bright citrus flavors everyone will love.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "½ cup margarine",
            "1 cup white sugar",
            "2 eggs",
            "1 tablespoon grated orange zest",
            "½ cup fresh orange juice",
            "2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "½ teaspoon salt",
            "½ cup chopped walnuts",
            "½ cup orange juice",
            "¼ cup white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir together flour, baking powder, salt, and nuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat together butter or margarine and 1 cup sugar.  Beat in eggs one at a time.  Stir in rind and 1/2 cup juice.  Pour in flour mixture, and stir until moistened.  Turn into a greased 9 x 5 x 3 inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 1 hour, or until done.  Remove loaf from oven, but not from pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1/2 cup orange juice with 1/4 cup sugar in a small saucepan.  Heat and stir to dissolve sugar.  Spoon glaze over hot loaf.   Let stand in pan for 10 minutes before removing loaf to rack to cool.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Fruit Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.402010050251256,
            "ratingCount": 199,
            "itemReviewed": "Orange Loaf",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "277.3 calories",
            "carbohydrateContent": "40 g",
            "cholesterolContent": "31 mg",
            "fatContent": "11.7 g",
            "fiberContent": "1 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "278.2 mg",
            "sugarContent": "22.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-16T14:10:47.61Z",
                "reviewBody": "It's barely the beginning of the fall baking season and I'm already a little weary of the pumpkin, cinnamon, maple and other typical fall baked treats.  This was a refreshing break. As this was baking I already decided it was worth it for the aroma alone - SO fragrant of fresh orange.  It must have been a combination of the recipe itself, my adding two tablespoons of vegetable oil to ensure a moist cake, and cutting back on the baking time by several minutes that I did not experience the dryness other reviewers reported. This cake is soft, with a dense but tender crumb, very light, buttery (I did use butter rather than the margarine called for)  and prominently, pleasantly orange. The term \"glaze\" in the recipe is misleading, as this is really not a glaze at all.  It's actually a flavored simple syrup that soaks into the cake, infusing it with added moisture and flavor and should not be skipped or altered. A delightful change from heavily spiced, heavily frosted or overly sweet treats.  Delicious, satisfying and very pretty too.  Whether or not the the cake would turn out as good and moist without the 2 T. of oil I added, I'm not sure - what I do know is that if you add it, you won't be sorry. And be careful not to overbake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-29T04:01:19.187Z",
                "reviewBody": "Every Christmas for as long as I can remember, my mother makes orange loaves and delivers them to the neighbours.  She was improvising on another loaf recipe, though, and most often the loaves would fall, although they tasted great!  I took her recipe, and came on-line.  Lo and behold if this orange loaf isn't EXACTLY the same as mom's, except for a bit of extra flour, which is all that was needed to keep it nice and rounded on the top.  I emailed mom with the recipe, which she used this year.  Thanks for helping improve on one of my favourite Christmas traditions!  As for the glaze, Mom's loaf only called for half of this one, and I thought the amounts listed here would make way too much.  I made 2 loaves at once---one with only half the glaze(like mom's), and one as this recipe calls for.  I liked this one the best.  It made the loaf nice and moist.  Just be sure to let the loaf sit as required to let the glaze soak in.  Thanks again-- this is a great loaf, and I've made 8 of them to give away in the last \r\nmonth, following in my mother's footsteps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TWEET2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/435482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-13T15:41:11.127Z",
                "reviewBody": "The flavor of this bread was oh so orange! Quite delightful. However, I'm giving it 4 stars because the \"glaze\" was too liquidy to be considered a glaze. I followed the recipe exactly and it made so much that I think it calls for reducing the \"sugared juice\" in the pan to thicken it into a glaze. Otherwise it was very good!\nUpdate: Made it again and this time simmered the glaze until it redused to about half and then removed the bread from pan and brushed it on. Came out much better! 5 Stars! On a side note, I accidently added only 1/2 cup sugar to the bread and it still came out delightful! Great way to cut back!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pamela Frechette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2437707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T21:31:16.593Z",
                "reviewBody": "This first time I made this, I think I must have accidentally used too much flour, because I felt it was too dry.\r\nI just made it again, but this time I used pineapple juice instead of orange juice, and threw in some pineapple chunks into the batter. I cannot tell you how unbelievably moist and delicious it is. I`m hard pressed not to eat the whole thing myself.\r\nI also poured the batter into two, much smaller sized bread pans and baked them for only 25 minutes at 150 degrees celsius, and they turns out perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/566672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T02:17:57.833Z",
                "reviewBody": "This is one of the best \"breads/cakes\" i've ever made.  I made the recipe just as it reads until I got to the glaze. I added about 6-8oz of orange marmalade in a sauce pan first, then added the orange juice and sugar. I let that simmer for about 3 minutes. I can't image the cake any other way. I totally recommend this recipe and I'm debating making another loaf right now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andi Shaw",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1856824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-09T19:14:40.09Z",
                "reviewBody": "My husband said the bread was good but not \"out of this world.\" I added a little extra orange juice to the bread and halved the sauce/glaze. If I were to make it again I might increase the amount of orange zest.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheri S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1586554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-09T18:51:36.25Z",
                "reviewBody": "Very good. Much like a pound cake which is what I wanted. I used an 8x8 square dish and only baked for 45-50 minutes. The glaze came out fine but I wish I had made it thicker by letting it simmer down stirring constantly until it coats the spoon like thick syrup. As it was it was a bit thin and permeated the cake a little more than I wanted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wonder Wanda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/701788/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-11T09:56:48.71Z",
                "reviewBody": "Thanks for the fantastic recipe for Orange Loaf, Carol~!! I agree that using butter is better for bringing out the orange taste. Besides, I have added an extra of 2T olive oil, as suggested by another reviewer, which made the loaf moistened beautifully. For the \"glaze\", it really helps to bring an additional orange flavor and helps lighten up the surface of the loaf. Great idea for the glaze!! This recipe will be used in the rest of my life, for SURE :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sam1128",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8468620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-10T17:09:02.827Z",
                "reviewBody": "This is a nice loaf. I made it in 3 mini loaf pans and they took about 40 minutes to bake. I added 1/4 teaspoon of orange extract to the batter along with the rind and orange juice. The loaves would be pretty dry without the glaze so I wouldn't recommend skipping it. I thought that 1/4 cup sugar wasn't enough to make a syrupy glaze so I increased it to 1/2. I also added the juice from 1/2 a lemon which made the glaze more tart and citrusy. I didn't use all of it on the loaves because I was afraid to make them too soggy but I think I probably could have used it all without a problem.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-11T17:54:52.807Z",
                "reviewBody": "This needed more orange flavor. I added fresh oranges and extra orange zest still not enough flavor. I was expecting more of a sweet cake but it was somewhat bland.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Vanessa B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2237969/"
                }
            }
        ]
    }
]