[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6916/croissants/",
        "name": "Croissants",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5272365.jpg",
            "width": 1536,
            "height": 1536
        },
        "datePublished": "1998-09-04T02:34:54.000Z",
        "description": "Authentic French croissants.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT11H15M",
        "recipeYield": "1 dozen",
        "recipeIngredient": [
            "1 ¼ teaspoons active dry yeast",
            "3 tablespoons warm water (110 degrees F/45 degrees C)",
            "1 teaspoon white sugar",
            "1 ¾ cups all-purpose flour",
            "2 teaspoons white sugar",
            "1 ½ teaspoons salt",
            "⅔ cup warm milk",
            "2 tablespoons vegetable oil",
            "⅔ cup unsalted butter, chilled",
            "1 egg",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine yeast, warm water, and 1 teaspoon sugar.  Allow to stand until creamy and frothy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Measure flour into a mixing bowl.  Dissolve 2 teaspoons sugar and salt in warm milk.  Blend into flour along with yeast and oil.  Mix well; knead until smooth.  Cover, and let rise until over triple in volume, about 3 hours.  Deflate gently, and let rise again until doubled, about another 3 hours.  Deflate and chill 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Massage butter until pliable, but not soft and oily. Pat dough into a 14x8-inch rectangle. Smear butter over top two thirds, leaving 1/4-inch margin all around. Fold unbuttered third over middle third, and buttered top third down over that. Turn 90 degrees, so that folds are to left and right. Roll out to a 14x6-inch rectangle. Fold in three again. Sprinkle lightly with flour, and put dough in a plastic bag. Refrigerate 2 hours. Unwrap, sprinkle with flour, and deflate gently. Roll to a 14x6-inch rectangle, and fold again. Turn 90 degrees, and repeat. Wrap, and chill 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To shape, roll dough out to a 20x5-inch rectangle. Cut in half crosswise, and chill half while shaping the other half.  Roll out to a 15 x 5 inch rectangle. Cut into three 5 x 5 inch squares.  Cut each square in half diagonally.  Roll each triangle lightly to elongate the point, and make it 7 inches long.  Grab the other 2 points, and stretch them out slightly as you roll it up.  Place on a baking sheet, curving slightly.  Let shaped croissants rise until puffy and light.  In a small bowl, beat together egg and 1 tablespoon water. Glaze croissants with egg wash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated 475 degrees F (245 degrees C) oven for 12 to 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kate"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.166666666666667,
            "ratingCount": 138,
            "itemReviewed": "Croissants",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "195.5 calories",
            "carbohydrateContent": "15.8 g",
            "cholesterolContent": "45.9 mg",
            "fatContent": "13.4 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "7.1 g",
            "servingSize": null,
            "sodiumContent": "303.5 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-08T14:20:32.837Z",
                "reviewBody": "Be careful when selecting your flour.  Higher protein flours (like bread flour)absorb more water.  If you use something with less protein (bleached all-purpose, cake flour...) you'll need to add more flour to keep it from getting soupy.  Use cold butter and work fast so it won't get greasy.  You want a thin blanket of butter beneath each layer of dough to build the flaky layers.  If your butter melts, it will incorporate with the dough and saturate it.  Bon appetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1592828/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-24T14:25:57.26Z",
                "reviewBody": "I made these three days ago and am starting another batch today. I used my bread machine on the dough cycle but added 1/4 cup more flour as the dough was so soft it stayed on top of the paddle and was about to come out of the pan when mixing. The extra flour helped greatly. After the first rise I took the paddle out and let it rise again in the then turned off machine as it was nice and warm inside. My kitchen was very cold that day. I also didn't let the butter get soft enough, so just sliced it and put it on. This worked out great. Being a retired Grandma, I had all day to play with this. I made them quite small. I got 24 total. I made half one day and let the remainder wrapped in plastic for two days in the fridge. Baked the remainder yesterday and they were fabulous. Hubby loved them. WARNING. Do not bake these on a pizza pan with holes. Smoke from burned butter is not a good thing. Excellent recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShirleyAnn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/433807/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-22T02:25:43.757Z",
                "reviewBody": "The first time I tried this recipe I completely messed it up but I decided to give it another try and they turned out perfect and tasted just like real French croissants.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHERRYBUNNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/134664/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-05T07:14:17.607Z",
                "reviewBody": "Well I made Croissants before for my French class my senior year in highschool. I am now a junior in College and felt the urge to make them again. I did and didn't follow this recipe. I was surprised as to how much flour to use..very little. The butter was accurate because Croissants are buttery. I remember heating one in the microwave andit turned into a glob of oil and dough. Nonetheless i took me five hours less by placing my dough in the freezer for a half an hour three times and also letting the dough rise one time instead of twice. I looked on lot of different websites to see not only the technique but the purpose of each ingredient. I semi-froze my butter and than just squeezed it in the palm of my hand it was perfect to place in each the dough. My croissants turned out great!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Darell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1468989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-08T05:26:19.717Z",
                "reviewBody": "I used salted butter and cut the salt in half.  I also used an instant yeast that cut the time needed for rising.  My family loved them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mother O",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2050732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T17:49:39.777Z",
                "reviewBody": "This recipe can be much easier and quicker. Made the dough with KitchenAid using 4 3/4 cups flour and skipping the oil for a DOUBLE batch. Only used 2 tsp salt. This works for me: Follow steps 1 and 2 but skip second rise. Deflate and chill 20 minutes (or overnight). Slice chilled butter into 18 slices with a cheese slicer. Working with half the dough at a time (which is 12 croissants), roll dough into a 8 x 12 inch rectangle. (Put remaining butter and dough in refrigerator to keep cold.) Lay half the butter (9 slices) over top two thirds, leaving 1/2 inch margin all around. Fold unbuttered third over middle third, and buttered top third down over that. Seal edges. **Turn 90°, so that folds are to left and right. Roll out to a long rectangle. Fold in three again. Roll again, and fold again. (That's folding 3 times.)## (Flour surface if dough becomes sticky but excess flour will prevent dough from sticking to itself.) Put dough in a plastic bag. Freeze for 20 min. and refrigerate for 40 min. Unwrap and repeat from ** to ##. Immediately roll and shape dough. Let rise 2-3 hrs, covered, at room temp (it's winter and my kitchen isn't really warm). (Egg wash is important for appearance.) Bake on baking stone for 15 min. at 425°F. Remove to cool. (Croissants will seem doughy until completely cool.) Start to finish 4 hrs 15 min. 1 star recipe as written. OUTSTANDING recipe with some tweaks. Guests didn't know I made them until I told them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Irene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/132657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-29T01:47:50.973Z",
                "reviewBody": "After trying 4 different croissant recipes with no sucess, this one worked!! The croissants were light, flaky and tastes great. I used a little more flour as well used pastry four instead of all-purpose. It made them a little more lighter. I cheated too and made the dough in the bread maker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "angel444",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2184480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-22T16:11:10.013Z",
                "reviewBody": "it doesn't turn out like a croissant!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "FRIKKI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/326066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T12:33:16.67Z",
                "reviewBody": "This is a great recipe! The rolls came out tender and buttery on the inside and crisp and flaky on the outside. I have made these twice now and my family and I love them. It is well woth the work you have to put into them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "keeping_the_faith71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/923428/"
                }
            }
        ]
    }
]