[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6955/mama-ds-italian-bread/",
        "name": "Mama D's Italian Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5714684.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1998-08-22T12:01:58.000Z",
        "description": "This is a basic delicious Italian bread.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "3 loaves",
        "recipeIngredient": [
            "3 cups warm water (110 degrees F/45 degrees C)",
            "1 teaspoon white sugar",
            "1 tablespoon active dry yeast",
            "1 tablespoon salt",
            "7 cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Add the sugar and yeast to the warm water and let proof.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in 4 cups of flour and beat until smooth. Cover and let rest for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat in the salt and then add enough remaining flour to make a stiff dough. Knead until as soft and smooth as a bambino's behind. Turn in a greased bowl, cover, and let double in size. (I put it in the oven with the light on - perfect rising temperature.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once doubled, punch down and divide into three. Place back in the bowl, cover, and let rise.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once doubled again, punch down and form into three fat \"footballs.\" Grease heavy cookie sheets and sprinkle with corn meal. Place the bread on the sheets, cover with a towel, and let rise.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once risen, mist with water and place in a preheated 450 degrees F (230 degrees C) oven. Mist loaves with water and turn occasionally while they bake. Bread is done when golden brown and sounds hollow when tapped on the bottom.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Christine Darrock"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.582089552238806,
            "ratingCount": 603,
            "itemReviewed": "Mama D's Italian Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "89.9 calories",
            "carbohydrateContent": "18.8 g",
            "cholesterolContent": null,
            "fatContent": "0.3 g",
            "fiberContent": "0.7 g",
            "proteinContent": "2.6 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "194.4 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-18T17:55:15.133Z",
                "reviewBody": "I really like this bread I gave it 5 stars for taste but I'm giving it 3 stars for the directions.  I found I had to find my own way through the directions, it states cook time 1 hour, I found that 30 min. is plenty (I am using a baking stone).  Also regarding step 4, when you separate it and place it back in the bowl to rise once again it becomes one round of dough, so why separate it?  The second time I made it I skip the separating part but did punch down and let rise again, then separated it into loaves after the second rising.  Now in step 6, where it says to turn occasionally, I just skipped that step all together because I found that step too awkward and as far as \"done when golden brown\" well after 30 minutes of baking the loaves are closer to dark brown, and I'm only baking it in half the designated time.  I really like the taste of this bread and after playing with this recipe several times I now have no problems but I did the first few times I made it.  It seems others didn’t have any problems but I did, so for what it’s worth these are just some of the problems I encountered.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1223130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-17T17:44:25.117Z",
                "reviewBody": "Good recipe, works well if you add a little italian seasonings in with the ingredients.    As a culinary student I've tried and failed with bread many times before getting some decent results.  Here's what I've found that may help some previous reviewers:  1) Proof your yeast as directed (mixing water, yeast, & sugar)-- if it doesn't start bubbling or frothing after 10 min, throw it out.  Either the yeast is dead (check expiration date) Or you killed it with HOT tap water > 120 degrees F kills yeast.  Optimal temp is LUKE warm around 100F.     2) Mist the bread with water every 3 min for the first 10 min.  Why?  This does 3 things.  Prevents the crust from forming too fast thus restricting the rising process.  It moisens the crust just enough so it doesn't brown/burn at the end of the baking period - you get a golden brown instead of a dark heavy crust.  And it  finally makes the crust crispier.  This is a very important step.  It also helps if you have a bowl of water in the oven to increase the humidity percentage.  Professional ovens have adjustable humidity controls which add moisture in.  Why only 10 min?  You can mist for longer but you'll end up with a thin white crust instead of golden brown.  Once the bread has risen to its full potential (within the 1st 10 min or so depending on the size of the loaf), then you want  it to start becoming golden brown.  UPDATE - Bake until internal temp is 200 F - whatever the shape or size.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rodney Dowdle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1851942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-02T21:22:09.66Z",
                "reviewBody": "OHMYGOD. YUM.\n\nKeep in mind that less handling after rising has started, the better the flavor.  My first loaf was good, but after I read up a bit on proper dough handling, the flavor increased tenfold - it went from good to great bread.\n\nBring the ingredients together and let sit for 15 minutes before you knead to hydrate and relax.  After 15, knead like crazy until smooth like a baby's bottom. Coat with oil, place in a bowl, cover and let rise until doubled. \n\nINSTEAD OF KNEADING THE LIVING TAR OUT OF THE DOUGH, gently but firmly smoosh the dough out, fold in thirds and press with your palm, fold in thirds and press, fold in thirds and press.  Form a ball, coat, cover, and let rise again.  Divide into two or three loaves (we prefer two larger loaves), fold and press again and shape for final rise.  \n\nScore the loaves, spritz 'em with water, and slide 'em on into the oven.  Pour some water into a preheated pan under the loaves for steam and quickly shut the door (no need for opening and spritzing!).  A baking stone REALLY helps with the crust texture.  I also love using those perforated \"professional\" loaf pans (sans cornmeal, of course).\n\nBetter handling DOES equal better flavor! The difference is amazing!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Slone07",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/slone07/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-26T20:41:30.247Z",
                "reviewBody": "This bread is fabulous-o.  I make bread a lot.  For those of you who have read the other complaints about a sticky bread, this is the deal.  The flour for a bread recipe is always a variable.  Depending on the humidity in the weather and protien content in your flour, the flour can fluxuate 2-3 cups.  I put in 9 cups of flour to get it to be a stiff dough. That is what was meant when she said knead it until it is smooth as a baby's bottom.  Italian breads, pizza doughs, and french breads should never be sticky. Stick with this rule and your family will love your bread and your house will smell great. Best of all you will have really super yummy bread for dinner for really cheap!!!  I made all three loaves and they were gone in an evening.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FATMAMMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/756719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-29T01:38:07.973Z",
                "reviewBody": "Bread gets 5+..directions get a 2. This appears to be written for \"bakers\", which I am not. Here's some info the non-bakers might find helpful!  PROOFING YEAST: put water, sugar in bowl. Sprinkle yeast on top. Let it sit 2-3 mins until it gets bubbly and smells like bread. Then proceed as directed. FIRST RISE: this took 1 Hour in my oven with the light on. PUNCH DOWNS: Gently punch down, remove from bowl onto lightly floured surface. Don't knead it again, just get the air bubbles out. Put back in bowl as directed. Again placed back in turned-off oven with light on.  This SECOND RISE took 30 mins. SECOND PUNCH DOWN: same as above, but don't put back in bowl. Form into loaves as directed (I made two). Place cornmeal only under the bread loaves because excess not underneath will burn when you start cooking it. FINAL RISE: loaves covered with towel, again in \"off\" oven.. this took 30 mins or so. Then I put on counter and heated up oven(s) to 450 for baking. It took 20 mins to cook them. Very delicious, crispy crust (not crisp today but still wonderful). Thank you so much for sharing your recipe!! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LDALLAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ldallas/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-02T16:55:15.507Z",
                "reviewBody": "This bread was delicious the first time I made it, but novice bread-makers should be warned: this dough is very sticky and hard to work with if you use anything close to the amount of flour listed. You can add more, of course, but then you don't get a truly authentic texture to your bread. For the lucky people out there with bread machines or a food processor with a dough hook to do the kneading, this problem is fairly easily solved. If you do it by hand, like I did...get ready for some sticky dough! I made a half recipe the first time and made into three small loaves, they disappeared FAST with only 2 people eating them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LLIGETT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/632128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-25T11:59:19.983Z",
                "reviewBody": "What did I do wrong?  I am not a novice at baking bread, have been making different breads for quite some time,but I had a problem with this recipe.  When I shaped into \"footballs\", and let them raise the third time, they expanded, but not height wise, they got bigger but flat.  Help.....C. J.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CAROLYN BROWNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/791106/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-06T23:11:37.717Z",
                "reviewBody": "The taste and texture of this bread is great.  I dusted it with a little flour right before putting it in the oven, and put a pan of water in the oven instead of misting it.  It came out crusty on the outside and chewy on the inside....just the way I had hoped!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WEYAH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/123102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T14:45:27.59Z",
                "reviewBody": "This is the second time I made this bread and I thought I'd try making half the batch into rolls.  I pulled off chunks of the dough, lightly rolled it in my palms to make it smooth, let rise as stated and baked for about 20 minutes, misting every 5. After 10 minutes I turned the rolls upside down to finish baking.  WOW were these every AWESOME as rolls!!!! I will be making these again and again!! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Mc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1496668/"
                }
            }
        ]
    }
]