[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6972/buttermilk-bread-ii/",
        "name": "Buttermilk Bread II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4551664.jpg",
            "width": 2501,
            "height": 2503
        },
        "datePublished": "1998-10-03T04:37:14.000Z",
        "description": "This bread is delicious plain or toasted.  I make it at least once a week.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "1 ½ cups buttermilk",
            "½ cup warm water (110 degrees F/45 degrees C)",
            "½ cup margarine",
            "¼ cup white sugar",
            "½ teaspoon baking soda",
            "2 (.25 ounce) packages active dry yeast",
            "2 teaspoons salt",
            "5 ½ cups bread flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Proof yeast in warm water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the butter or margarine and buttermilk in a small saucepan.  Heat slowly until butter or margarine has melted.  Cool to lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place sugar, salt, baking soda, buttermilk mixture, and yeast in large mixing bowl.  Add 3 cups flour one cup at a time, and mix with the dough hook attachment of an electric mixer.  Gradually add the remaining flour while continuing to mix.   When dough is not sticky, turn out on a lightly floured surface.  Knead for several minutes, until the dough is soft and smooth. Place in a greased bowl, and turn once.  Allow to rise until doubled in size.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough.  Divide, and shape into 2 loaves.  Place in two well greased  8 x 4 inch bread pans.  Allow to rise until dough has risen one inch above pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated 375 degrees F (190 degrees C) oven for 30 to 35 minutes.  Loaves are done when nicely brown and hollow sounding when thumped.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Esther Kenagy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.716867469879518,
            "ratingCount": 166,
            "itemReviewed": "Buttermilk Bread II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "49.3 calories",
            "carbohydrateContent": "3.1 g",
            "cholesterolContent": "0.6 mg",
            "fatContent": "3.9 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "280.3 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-14T14:49:57.1Z",
                "reviewBody": "I like this recipe, but I have made a few changes.  I use 1/2 cup of honey instead of the 1/4 cup of sugar, I love honey sweetened bread.  I also add 2 eggs.  I think they help the texture of the bread, this means you need some additional flour and it will make 3 smaller loaves or two larger ones.  And, I knead the bread for 10 minutes in my mixer before I let it rise. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2117673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-25T02:22:07.423Z",
                "reviewBody": "I'm always looking for recipes to use up buttermilk left from making butter. This turned out excellent! I used butter instead of margarine and being a lazy cook, I dumped all the ingredients into my mixer bowl and used the dough hooks for 8 minutes. Let it rise and made hamburger buns out of it. Let the formed buns rise for another 30 minutes, popped them in the oven for 12 minutes or so and YUM!! They rose nice and tall with a soft texture and were delicious. Thanks for the recipe, it'll be one of my keepers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEYNOW1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1280462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-09T22:00:17.373Z",
                "reviewBody": "This bread was good but a little dry. I halved it and used my bread machine. Next time I will make as directed to see if it is not as dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lupost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-24T03:41:12.393Z",
                "reviewBody": "I cut this recipe in half and used my Kitchen Aid to make this dough. I proofed the yeast in my mixer bowl with the warm water and sugar for ten minutes until it looked creamy then added the \"soured\" milk (I didn't want to take the chance that vinegar soured milk might kill my yeast--I used lemon juice to make sour milk this time.) the melted butter salt and AP flour. (I omitted the baking soda purely by accident I just happened to overlook it when I was making the bread.) This recipe needed no extra flour to get it into a ball. I kneaded it with my dough hook for about five minutes. I let this rise in a greased bowl on a warm heating pad until it doubled then formed the dough into balls and plopped them into greased muffin tins. I then covered it with saran wrap and let them rise in the pan on the warm heating pad. I got nine biggish rolls out of a halved recipe. Very good bread/roll recipe--soft and really airy. It's going to sound weird but it reminds me of italian bread only without the hard crust on the outside if that makes sense. NOTE: I noticed the difference from using soured milk instead of buttermilk I will use the real deal next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-27T13:44:52.107Z",
                "reviewBody": "Did not proof the yeast. Just tossed everything in the bread machine (halved the recipe). The smell while it was baking was devine and it was gobbled up for a late night snack by the kids. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lesley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/992643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:06:31.28Z",
                "reviewBody": "I am usually not a white bread fan but this one is really yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "REXICANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/747388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-29T04:01:46.827Z",
                "reviewBody": "this by far is the best and easiest bread recipe i have used. I have made alot of bread in my life but OH-MY I just can't stop raving about it. This will be a big hit where ever i take it",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KNGROVER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/674799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-21T21:28:57.213Z",
                "reviewBody": "This bread is so delicious! I used salted butter, not margarine for this recipe. I warmed the butter and buttermilk together and added it to the yeast that was proofing in the warm water. Instead of white sugar, I used a 1/2 cup of pure honey. I let it sit a few minutes more while I mixed the dry ingredients together. I used about 1 1/2 tsp of salt since there was already salted butter. Once I mixed everything together by hand, it took the bread an hour to rise up. I halved the dough into 2 loaves. I placed them each into two greased (buttered) loaf pans. It rose again about half hour later. I then brushed the top of the bread with, \"Honey Butter,\" from this website. The smell of the bread baking was so heavenly! They both baked right up in the pans with a nice golden brown color on top. The top of the bread is crusty and has a nice sweet crispness to it. I thought the buttermilk might leave that bit of \"sour tang\" in the bread but it did not. Instead I could smell and taste the buttermilk as well as the honey...Mmmm. The bread is just so moist and sweet especially when eaten warm. The inside texture is so soft I could eat it plain with no butter. My family requested that I make a honey butter to spread all over their bread. It was worth making this bread. This exceeded my expectations and we all loved it! I served this with, \"Hearty Chicken Vegetable Soup I,\" from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-29T04:01:48.45Z",
                "reviewBody": "A keeper recipe for a classic bread. I halved the recipe and used my bread machine. We loved it. I've found that doughs (such as this recipe) with higher moisture content bake up in the bread machine with a denser texture as opposed to a fluffy/spongy consistency---more like old fashioned home made bread. Will try a slice tomorrow for breakfast as toast to accompany a mug of rich hot chocolate. Thanks Esther.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chefjeff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-23T00:12:05.45Z",
                "reviewBody": "It was okay. Even when freshly baked the buttermilk \"tang\" was not pronounced and lessened quickly over time; a couple days after baking it was just a too sweetish white bread. Watch for over-proofing as with two packs of yeast and a quarter cup of sugar there'll be a lot (!!!!) of CO2 released. The both rises happen very quickly. Additionally this is a very dense bread; toast is about what it's good for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JACK19",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/722296/"
                }
            }
        ]
    }
]