[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7011/chinese-steamed-buns/",
        "name": "Chinese Steamed Buns",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1121464.jpg",
            "width": 2272,
            "height": 2272
        },
        "datePublished": "1998-10-25T03:06:27.000Z",
        "description": "Here's some yummy, Chinese dim sum you can make, either plain without meat fillings, or with meat fillings. A wok equipped with a stainless steel steam plate, a plate with holes to allow steam to pass, is required to make these tasty buns. You may use milk in place of the warm water if you wish.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT4H0M",
        "recipeYield": "24 steamed buns",
        "recipeIngredient": [
            "1 tablespoon active dry yeast",
            "1 teaspoon white sugar",
            "¼ cup all-purpose flour",
            "¼ cup water",
            "½ cup warm water",
            "1 ½ cups all-purpose flour",
            "¼ teaspoon salt",
            "2 tablespoons white sugar",
            "1 tablespoon vegetable oil",
            "½ teaspoon baking powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix together yeast, 1 teaspoon sugar, 1/4 cup flour, and 1/4 cup warm water.  Allow to stand for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix in 1/2 cup warm water, flour, salt, 2 tablespoons sugar, and vegetable oil.  Knead until dough surface is smooth and elastic.  Roll over in a greased bowl, and let stand until triple in size, about 2 1/2 to 3 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down dough, and spread out on a floured board.  Sprinkle baking powder evenly on surface, and knead for 5 minutes.  Divide dough into 2 parts, and place the piece you are not working with in a covered bowl.  Divide each half into 12 parts. Shape each part into a ball with smooth surface up. Put each ball on a wax paper square.   Let stand covered until double, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring water to a boil in wok, and reduce heat to medium; the water should still be boiling.  Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate leaving 1 to 2 inches between the buns.  At least 2 inches space should be left between steam-plate and the wok.  Cover wok with lid.  Steam buns over boiling water for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "REMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol chi-wa Chung"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.389473684210526,
            "ratingCount": 190,
            "itemReviewed": "Chinese Steamed Buns",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "44.4 calories",
            "carbohydrateContent": "8.4 g",
            "cholesterolContent": null,
            "fatContent": "0.7 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "35 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-07T21:53:42.96Z",
                "reviewBody": "This recipe gave me the soft, fluffy texture I was looking for. Instead of 1/2 c. of warm water, I substituted 1/2 c. of warm milk which I think helped make the dough even more light and fluffy. I had to add about an extra 1/4 c. of flour because the dough was REALLY sticky and difficult to work with. The only bad thing about this recipe was that after the 3 hours for the 1st rising, I noticed that the dough had a somewhat sour aftertaste, like sourdough bread, which was more noticeable after steaming the bun (I steamed a golf ball sized amount of dough to test for texture and taste before I rolled and steamed the rest of the dough). So I added a pinch of baking SODA to counteract the sour flavor, and an extra 1/2 tsp of sugar because I personally like a sweeter dough. I used my own meat filling recipe to fill the bun. Yummy.\nUPDATE: *Tip*  I've doubled the recipe with no problems -- use the same amount of yeast as in the original recipe (1 TB or approx. 1 envelope dry yeast), but double all the other ingredients. Came out just as good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ivyguppy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2027165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-01T01:42:09Z",
                "reviewBody": "I haven't made these yet, but I just wanted to point out that you can throw leftovers in the freezer and freeze them for long periods of time. When you're ready to eat them, just put them in the refrigerator to thaw at least overnight and steam them for 10-15min. If you only want to eat a couple at a time, just fill a high saucepan with one inch water, put a wire rack at the center and steam the buns directly on the rack, or on a small saucer. DO NOT let the buns touch the water. Another alternative is to fry the leftover buns and serve them with condensed milk - the way traditional Chinese people eat them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Yuki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/yuki/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T18:59:22.497Z",
                "reviewBody": "This is the best steamed bun recipe I've ever tried.  I stuffed it with red bean paste like what I used to eat at home in Singapore and it tastes way better than that.  My picky-eater kids and husband like it too.  I followed the recipe quite closely....except that I put everything into my bread machine to churn and it needed more flour than stated....but then measurements in cups are never really accurate.  But I knew what to look out for and it turned out perfect.  I don't have a bamboo steamer (it will be better in a bamboo steamer becoz of the fragrance from the bamboo), so I used Alton Brown's brilliant idea of poking holes in my disposable pie pan and placing it on top of a metal cookie cutter in a wok.  I didn't line it with paper coz I didn't have that either and it didn't really stick....at least not enough to bother me...and I hate cutting small pieces of squares.  Overall, we LOVE it.  It's definitely a keeper.  Thank you so much for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "julee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1866750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T23:52:42.91Z",
                "reviewBody": "I've tried many dough recipes for steamed buns, and I swear by this recipe!!! All the others I have tried do no produce the same goodness and airy texture as this one. The dough is very sticky and requires additional flour to be added on when kneading (I used about 3/4 cups.) It really various and you just have to play it by ear. Added 1/2 tablespoon of baking soda to the dough to counteract the ''sour'' tasting due to long rise time. I placed my dough in a glass bowl and put the glass bowl in a large pot filled with warm/hot water and covered it. This allowed the dough to triple it's size within 1 1/2 hours (instead of 3...) I stuffed my buns with a meat/veggie mixture and let the buns rise for an extra 25 mins; steamed them in a large steamer and wow!!!!! ^____^ I ate like four buns in one sitting. So airy and light, fluffy. These buns didn't really come out super white (like in stores.) But it's just homemade buns, so I didn't really mind. However, I suggest adding a little bit of vineger to the water when steaming. Also, put some baking powder to your dough. And finally, squirt some lemon juice into your dough. This is produce some extra white buns! Love this recipe. TRY IT OUT!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mukinsvivi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4756903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-19T11:20:31.56Z",
                "reviewBody": "My friend's father used to make this and was not able to get the recipe. Turned out very well and everyone enjoyed this. Remember if you are making the buns with filling, keep the centre thick and thin out the edges",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKERMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1080699/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-12T16:13:51.13Z",
                "reviewBody": "AWESOME RECIPE. The tips left by user Mukinsvivi ROCK & helped me ensure my steamed buns came out ultra tasty. NOTE: the dough does look very odd after first rise & it has a very sticky texture. You can punch it down just like the directions say & Mukinsvivi's advice to add about 3/4 cup xtra flour @ this point is spot on. Didn't utilize the entire 3/4 cup, but I came close. Eye the dough & at some point you know it looks right: the texture is smooth & elastic instead of sticky. To ensure I didn't overdo it, extra flour was added slowly. Adding a bit of lemon juice to the dough & vinegar to the boiling water is also great advice & my buns came out very white accordingly. Didn't use baking soda, but I did use baking powder (it contains baking soda already). My steamed buns came out large & yielded about 12. Prior to steaming I stuffed them w/shredded curry chicken, onions, potatoes, cabbage & bell peppers. My steaming pot is small so it took a while to steam all the buns & they wanted to stick to the steaming plate a bit. Once removed from the steaming plate I found it handy to sit the buns on a simple wrack of bamboo skewers that I placed on top of a plate. This allows bottom of buns to dry nicely.  Sitting them directly on a plate gave me a bun w/ a slightly soggy bottom & placing on paper towel = bun w/ paper towel bits stuck to its bottom.  Next time I make these I may make them w/ fruit stuffed inside just to see what happens!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Miss Pixxxie Pie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7177274/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-27T03:32:36.577Z",
                "reviewBody": "These steamed buns are exactly like the ones I can buy at the chinese supermarket bakeries (T&T). They are slightly chewy and VERY light almost \"airy\". I used half the dough for 12 buns (as per recipe's instructions) and with the other half I made 6 medium sized buns. The larger sized buns were much easier to work with and much tastier. The small buns were harder to fill with meat filling and much too delicate. I think this recipe is more for 12 buns than 24. When making the buns remember to make the edges thinner than the center. Although this recipe is easy and tasty I prefer a chewier denser bun. I will keep looking for my 'perfect' bun recipe but will keep this one as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TEALEAVES10",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1378510/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:38:16.577Z",
                "reviewBody": "I liked it, it's very good with butter when it's warm. Don't be tempted to make more than you actually eat and save in the fridge, when it's not fresh it's uneatable. For the unexperienced, I recommend to start with that recipe before trying to make some filled buns.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TAL_HEVER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/407750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:38:15.827Z",
                "reviewBody": "I scaled this to make 6 rolls (not 24) since I was trying this recipe for the first time and didn't want to end up with too many rolls if I didn't like them. Not sure if this is allrecipe.com's fault or the recipe's fault but I needed to add a LOT more flour than the recipe called for in order to not end up with watery mush... which threw off the balance of the yeast baking soda and sugar. I basically ended up with chewy dinner rolls... the LOOKED like dim sum but they tasted pretty marginal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JESS_VALENTINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/529539/"
                }
            }
        ]
    }
]