[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7010/finnish-pulla/",
        "name": "Finnish Pulla",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8008.jpg",
            "width": 1984,
            "height": 1488
        },
        "datePublished": "1998-10-19T15:50:22.000Z",
        "description": "A unique bread with a sweet flavor that makes a wonderful holiday gift!  It takes about 4 hours to make, so allow yourself plenty of time.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "3 loaves",
        "recipeIngredient": [
            "2 cups milk",
            "½ cup warm water (110 degrees F/45 degrees C)",
            "1 (.25 ounce) package active dry yeast",
            "1 cup white sugar",
            "1 teaspoon salt",
            "1 teaspoon ground cardamom",
            "4 eggs, beaten",
            "9 cups all-purpose flour",
            "½ cup butter, melted",
            "1 egg, beaten",
            "2 tablespoons white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Warm the milk in a small saucepan until it bubbles, then remove from heat.  Let cool until lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve the yeast in the warm water.  Stir in the lukewarm milk, sugar, salt, cardamom, 4 eggs, and enough flour to make a batter (approximately 2 cups).  Beat until the dough is smooth and elastic.  Add about 3 cups of the flour and beat well; the dough should be smooth and glossy in appearance.  Add the melted butter or margarine, and stir well.  Beat again until the dough looks glossy.  Stir in the remaining flour until the dough is stiff.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn out of bowl onto a floured surface, cover with an inverted mixing bowl, and  let rest for 15 minutes.  Knead the dough until smooth and satiny. Place in a lightly greased mixing bowl, and turn the dough to grease the top.  Cover with a clean dishtowel.  Let rise in  a warm place until doubled in bulk, about 1 hour.  Punch down, and let rise again until almost doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn out again on to a floured surface, and divide into 3 parts.  Divide each third into 3 again.  Roll   each piece into a 12 to 16 inch strip.  Braid 3 strips into a loaf.  You should get 3 large braided loaves.  Lift the braids onto greased baking sheets.  Let rise for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush each loaf with egg wash and sprinkle with sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F (205 degrees C) for 25 to 30 minutes.  Check occasionally because the bottom burns easily.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kim B."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.759433962264151,
            "ratingCount": 212,
            "itemReviewed": "Finnish Pulla",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "178 calories",
            "carbohydrateContent": "30.9 g",
            "cholesterolContent": "33.7 mg",
            "fatContent": "3.8 g",
            "fiberContent": "0.9 g",
            "proteinContent": "4.7 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "98.8 mg",
            "sugarContent": "7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-18T20:41:02.687Z",
                "reviewBody": "This is pretty close to the recipe that me and my mom use here in Finland. Here is another tip to make it even more special:\nInstead of dividing the dough into 3 parts for braiding, form it into a one big strip and roll it out into a big rectangle. Then spread soft butter evenly on the dough and sprinkle sugar and cinnamon on top of the butter. I like to use all three generously ;) After this, roll the dough rectrangle into one long roll. You can make some cuts on the loaf if you want (every 2\" for example), this is not necessary but the bread looks nice this way. Brush each loaf with egg wash and sprinkle with sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "evanjunt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1598950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-05T01:54:50.81Z",
                "reviewBody": "Very very excellent!  My husband is Finnish-American and begged me to make this bread for his parents and I was kind of nervous.  They said it tasted the same as the ones they buy at the Finnish bakery!  It was very easy to make. Per my husband's request, I added about a cup of raisins to the batter (I would definitely recommend this, and sprinkled slivered almonds on the top of the egg wash/sugar (before baking) on two of them.  On the third I made a glaze of confectioner's sugar, milk and vanilla extract (which I, personally, liked better).  I also baked the three loaves in a convection oven at 375 for about 30 minutes and just kept checking them... I think 400 would have been too high.  One more thing, i baked them on my pampered chef stones which are known for not allowing things to burn so the bottoms stayed nice and soft.  This bread, though it takes a long time to make, is relatively easy and tastes as wonderful as it looks!  According to my in-laws, it freezes well too (I didn't have any left because they took the remaining two loaves home!)  Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRindell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/917993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T01:38:11.037Z",
                "reviewBody": "I am 50% Finnish and this recipe is as close as I've been able to find for the wonderful Finnish Nisu that my aunt Hulda used to make!  Her Nisu was the standard in the entire family.  \r\nNOTE:  Add 2 teaspoons (not 1) of cardamom (there is never too much cardamom in any thing).\r\nThis bread does not have to be a \"coffee bread\" and it is delicious with orange juice or hot chocolate too.\r\nWhen I was a kid, my aunt would get her Nisu right from out of her freezer (on a  really hot summer day), slice it and put some butter on it and serve it with juice - for any children visiting.  What a memory!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOMWMSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/986308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-25T07:08:06.34Z",
                "reviewBody": "I have always made Pulla rolls at Christmas. My parents are Finnish and my mother taught me this recipe at a young age. I can't imagine Christmas without it. Like I read before roll out butter sugar and cinnamon roll cut and bake. With parchment paper you don't have to worry about the sugar burning on your bake ware and there is less chance of the bottom burning.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leila",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1939263/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T20:31:01.693Z",
                "reviewBody": "My entire family loved this! It's not overly sweet and has a wonderful texture. The only change I made was to bake at 350 for 25-30 minutes (as in the nearly identical recipe for Finnish Nissua). The loaves turned out golden brown and perfect. I'll be making it again for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ISHKABIBBLEMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/260771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-13T00:20:50.497Z",
                "reviewBody": "Thanks for the recipe! I had never had, or even heard of, cardamom before and now I am in love! : )  After reading the reviews of what other people had to say, I gave making this bread a shot. It took forever to make (I am just learning to make bread with yeast from scratch by hand), about 6 hours for me!  After all of the work, I think it was more than worth it.  I added raisins; I took about 1.5 cups of raisins, added enough water to cover them and simmered them on medium until most of the water was gone.  Then I let them drain on a paper towel (all this to keep the bread from getting dry.  I have done this to all of my quick breads that call for dried fruit and it works like a charm).  I added them last.  I made a chocolate sauce and a cream cheese glaze to go over a couple of the loaves.  My favorite way is served cold with butter and a glass of orange juice.  : ) Tip: I used parchment paper to keep the bottoms from sticking and burning.  Also, I took others advice and baked at 350 F for 20-30 minutes.  It turned out PERFECT!  I can't thank you enough,Kim B.!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke Porter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1199766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T20:31:26.21Z",
                "reviewBody": "I've made this bread for years for Christmas and Thanskgiving. It's ideal as it's sweet but not too sweet. We call it Finnish coffee bread (I'm of Finnish descent). Instead of ground cardamom we put the seeds in which for some reason really add WONDERFUL flavor. Each person in our family has modified the original recipe from my great grandmother from Helsinki so that the bread is either chewier and denser on one hand or light and airy on the other. In either case it's great. Enjoy and experiment.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LSAARIO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/123531/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-28T18:38:33.357Z",
                "reviewBody": "I am not familiar with this type of bread but I love cardamom so I wanted to make it. It was easy to make and looked and tasted wonderful. I added a cup of raisins and an additional 1/2 teaspoon of cardomom. Next time I'll double the cardomom. Even with the increased cardomom I could only taste a hint of the flavor. I forgot to sprinkle sugar on the bread before going into the oven so I made a glaze of powdered sugar and orange juice and drizzled it over the loaves and got rave reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNN LUKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/462812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T20:31:42.13Z",
                "reviewBody": "I can't believe how tasty this bread is! I'm not much of a cook okay I'm horrible but this bread is the one thing I really enjoy making and it's tasty to boot. I've gotten rave reviews from friends and colleagues and am always finding people reqesting this delicious bread. Try it you'll LOVE it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EBONNER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/111936/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:26:55.187Z",
                "reviewBody": "I personaly was not happy with the result. It has a great taste but I don't think all the work is worth it. I probably wont make this again. It also browns to fast. I would think about turning down the heat to maybe 375 degrees",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DA3SHELTONS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/760053/"
                }
            }
        ]
    }
]