[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1553/bread/yeast-bread/potato-bread/",
                    "name": "Potato Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7027/potato-bread-iii/",
        "name": "Potato Bread III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1563656.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1998-11-14T00:46:21.000Z",
        "description": "A moist, heavy loaf.  Perfect accompaniment to a rich, thick stew.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "1 potato, peeled and diced",
            "1 ½ cups water",
            "2 (.25 ounce) packages active dry yeast",
            "6 ½ cups all-purpose flour",
            "3 tablespoons white sugar",
            "2 tablespoons shortening",
            "1 tablespoon salt",
            "2 tablespoons all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan cook potato cubes in water for about 12 minutes, or until tender.  Do not drain.  Cool mixture to 110 degrees F (43 degrees C).  Set aside 1/2 cup of the cooking liquid.  Mash potato and remaining liquid; if necessary add warm water to make 2 cups potato mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, sprinkle yeast on reserved 1/2 cup potato water.  Add mashed potato mixture, 2 cups of the flour, sugar, shortening, and salt.  Beat with an electric mixer on low speed  for 1/2 minute, scraping sides of bowl constantly.  Beat 3 minutes at high speed.  Stir in as much of the remaining flour as you can mix in by hand.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough out onto a lightly floured surface.  Knead in enough of the remaining flour to make a moderately stiff dough. Knead for 6 to 8 minutes, or until dough is smooth and elastic.  Place in a lightly greased bowl; turn once to grease surface.  Cover.  Let rise in warm place until doubled in bulk, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down, and turn out onto a lightly floured surface.  Divide dough in half.  Cover, and  let rest for 10 minutes.  Shape each half into a loaf.  Place in greased 8 x 4 x 2 inch loaf pans.  Cover.  Let rise until nearly double, about 35 minutes.  Before baking, brush tops with a little water and dust with additional flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 375 degree F (190 degrees C) for 40 to 45 minutes.  Cover with foil for the last 15 minutes of baking to prevent over-browning.  Remove from pan; cool on wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Potato Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Judy Taubert"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.641304347826087,
            "ratingCount": 92,
            "itemReviewed": "Potato Bread III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "149.7 calories",
            "carbohydrateContent": "29.7 g",
            "cholesterolContent": null,
            "fatContent": "1.4 g",
            "fiberContent": "1.2 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "292.1 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-20T20:57:26.36Z",
                "reviewBody": "I have to give this a 5 star!  I was looking for a recipe that emulated Martin's potato rolls. This didn't, however I loved the texture.  It was light and fluffy, yet had a heavier mouth-feel than I expected.  Very good.  The flavor isn't a strong potato flavor that I was going for, but I was pleasantly surprised.  The texture is also very good as hamburger buns.  My suggestion is to add a little more potato and instead of shortening, add vegetable or canola oil.  I also kneeded it for about a half hour, just because I got lost in thought and realized it when I looked at the clock.  proofed very nicely in a bowl using any pan spray with a damp towel draped across the top. personally, I let my breads proof in a warmed oven, and they rise amazingly well.  I took half of the recipe and made rolls, and the other half made a twist bread out of. (rolled it into an inch thick rectangle, cut the half dough in half, twisted two pieces, and repeated with the other side.   placed them side by side in the loaf pan tucking the ends under.  I'll take a picture before I slice into it.  I also use a double-egg wash.  1 egg with a tablespoon of water while dough is well... dough.  then just before finishing I brush it again.  \n\nAll in all, very well done, and tasty.  I can say it was a LOT easier to make in the kitchenaid mixer with a dough hook than it would have been to make by hand, but hey if you want to, go for it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-27T20:18:23.42Z",
                "reviewBody": "WOW!! This bread is amazing!  Some reviewers said that their bread was dense, but my bread was incredibly light (perhaps because I let them rise a little longer on the second rise).  It is soo tender!  My family really enjoyed this recipe...the bread it produced was my best yet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAKS11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/878079/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T04:11:42.607Z",
                "reviewBody": "I substituted sweet potato and brown sugar. Wow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAFFY128",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/240339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-26T18:17:55.86Z",
                "reviewBody": "This is my favorite bread. I've made it twice in the past two weeks. The first batch I replaced 1/2 cup of the water with milk which I scalded and added butter instead of the oil called for. The second time I used only the water called for. I think using the milk makes a more tender loaf. I got two beautifully risen light and fluffy loaves from this recipe using only about 5 cups of flour. What I like most about this bread is the flavor. The yeast does not overpower the bread's flavor it's more of a back note which I think is perfect. I used the rapid rise yeast and reduced the amount to 3 1/2 tsp. Thanks Judy this will be made again and again my family absolutely loves it...and so do I.. BTW:..Do not expect this bread to taste like potatoes. Potato has a very neutral flavor. It's purpose is to fuel the yeast and add moisture and lightness to the bread. Make sure you use only enough flour to produce a slightly tacky feeling dough if you want the bread to turn out light and fluffy. About 5 /- cups of flour should work. Again feel the dough it should be smooth and tacky not sticky.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2512568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-13T23:24:30.107Z",
                "reviewBody": "Very hearty bread. I used butter instead of shortening and unbleached wheat flour. Very flavorful and espcially good right out of the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SECONDBORN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/532897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-21T20:17:20.78Z",
                "reviewBody": "YUMMY Bread! I've been looking for a potato bread recipe for years and this is it. I made this to go with some Guinness Stew and it was fantastic. I cut back the salt to half and couldn't manage to work in all the flour but the bread was still solid but not heavy and SO delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heatherbee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/352735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-24T03:11:38.357Z",
                "reviewBody": "This was delicious! I made it today to go along with Thanksgiving dinner. Very moist. Would make again. One thing I might mention is that I used only 5 cups of the 6.5 cups of flour called for and even that was stretching it. Not sure why. Maybe because it's so dry out here in West Texas!?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "juicyfruit007",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1948630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-03T00:20:28.44Z",
                "reviewBody": "This is a great bread it's also quite easy to do. I made a change and would make another but a wonderful basic recipe. My Aunt won the Colorado State Fair when she was in high school with a potato bread. I didn't have the recipe available but I remembered that it used dry milk. So I added in 2 Tbsp dry milk and it make it very sweet and smooth. The change that I would make is one suggested by another reader. She let hers rise longer before baking it to make it lighter. I agree you should double the time on the second rise. I made it 50% longer and I wish it was a little more. Also be warned you can only make 2 cups of potato from 1 potato if you have a huge tuber. I had to make up the difference with some emergency instant mashed potatoes. So I would correct it to say 1 very large or 2 medium potatoes. With just a few tweaks you will LOVE this simple bread. It makes great rolls too! (Just make sure to cut baking time down to 20 min).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Meggin Rutherford",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6957748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-10T04:13:01.903Z",
                "reviewBody": "Really tasty. I also tried Daffy128's suggestion with sweet potato and brown sugar...this is wonderful too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Ingram",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/421373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-15T19:10:49.19Z",
                "reviewBody": "Good bread--just a little too thick for my taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Naxxramas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2266185/"
                }
            }
        ]
    }
]