[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7037/angel-biscuit-rolls/",
        "name": "Angel Biscuit Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F184711.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-11-28T22:49:07.000Z",
        "description": "Delicious, easy-to-make biscuits.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "5 cups all-purpose flour",
            "¼ cup white sugar",
            "3 teaspoons baking powder",
            "1 teaspoon baking soda",
            "1 ½ teaspoons salt",
            "1 cup shortening",
            "1 (.25 ounce) package active dry yeast",
            "¼ cup warm water (110 degrees F/45 degrees C)",
            "2 cups buttermilk",
            "2 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast in warm water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together flour, sugar, soda, baking powder, and salt. Add buttermilk and dissolved yeast. Add shortening and stir. Store dough, covered, in the fridge until ready to use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out on a lightly floured surface or shape into balls--these do not need to rise. Brush tops of biscuits with melted butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F (205 degrees C) for 15-20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Laura Owen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.223684210526316,
            "ratingCount": 76,
            "itemReviewed": "Angel Biscuit Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "196.2 calories",
            "carbohydrateContent": "23.2 g",
            "cholesterolContent": "3.4 mg",
            "fatContent": "9.9 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "287.7 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-05-27T20:06:33.077Z",
                "reviewBody": "One reviewer mentioned that the dough was like gloop and it is but this gloopy dough makes great biscuits. In fact the best I've ever made. I wasn't real sure what to do about the shortening - it says to mix it in but after adding liquid in order to \"mix\" it in it would have to be melted and the recipe didn't call for that. I just used half a stick of unsalted butter and half a cup of shortening and cut it into the flour mixture BEFORE adding the yeast water and buttermilk like a traditional biscuit recipe. One thing I would have done differently is warm the milk up a bit cold liquids tend to shock the yeast. I also would have placed these biscuits closer together. They spread out a lot but were still fluffy. I scooped the \"gloopy\" dough onto a liberally floured surface liberally sprinkled more flour on top and pressed the dough out gently with my hands. I cut the biscuits out of that and transferred them quickly to the sheet since they are very pliable. These were great. Someone mentioned more salt I suggest using margarine or salted butter to brush the tops of them when they come out seems to add the perfect touch. Perfect for eating with honey too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ricci Esprit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/680516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-27T19:02:39.7Z",
                "reviewBody": "This recipe is awesome. I love that you do not have to let them rise. I have been baking for over 20 yrs. and I won a blue ribbon for my biscuits in the 5th grade 4H club. Even the teachers wanted my recipe. I made a few adaptations myself. Here's how to make them easy and PERFECT... For starters use self-rising flour and omit the baking soda and baking powder. You just do not need them. Add extra salt more or less to your taste but definitely add more salt. I also added extra sugar 1/2 cup to be exact add to your liking. Warm milk (not HOT) to keep from shocking the yeast. Yeast needs warmth...especially since you don't let these rise. I also used 2 sticks butter (or margarine) instead of the shortening. The difference is that shortening tends to make biscuits a bit lighter than butter but with this recipe you don't have to worry about it. As a matter of fact the butter gives it a better flavor and helps it to hold together better. They are very gloppy as stated so all you have to do is add an extra cup of flour. You will still need to flour your board good. Dough should be wet when you put it on flour. Gently roll adding flour as needed to avoid getting pin or hands all doughy but without overdrying. Dough should be very soft and pliable. Cut with round cutter or shape into 1/2 inch thick biscuits. Place barely touching but make sure they touch. Dough will not spread out if you add the extra flour and make sure they touch. Make sure you us",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Good Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/813901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T23:29:50.69Z",
                "reviewBody": "My family loved these biscuits. I used the ingredients as written but I prepared them a little different. First, cut in the shortening before you add the buttermilk and yeast mixture. Also, warm the buttermilk before you add it. It says it does not need to rest, which may be true, but you will get a lighter biscuit if you allow it to rise, covered in a draft-free place for at least 30 minutes. I allowed mine to rise for 45 minutes. Make sure you place your biscuits slightly touching so they rise in the oven nicely. I also brushed them with melted, salted butter right after they came out of the oven. They turned out wonderful. They also freeze very well. To freeze, before the rise time, put some bisuits on a cookie sheet lined with wax or parchment paper for about 30 minutes. When frozen, store in freezer bags. Whenever you want biscuits for dinner, take out however many you want an hour before baking, then bake at 400* for 10 to 12 minutes. Will make these again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PamMar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2629040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:20:08.403Z",
                "reviewBody": "I wasnt sure if I was doing it right because it ended up so sticky so I put the batter in muffin tins and it worked out great! I used more butter than it called for but I'm a butter fanatic. These biscuits were very easy to make. EDIT Well it's been a while since I first made these but it's my #1 biscuit recipe. I always use butter instead of shortening because I just dont like shortending. It gives these biscuit rolls an excellent buttery flavor! Wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DRKSTDAYS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/137518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-17T23:49:44.607Z",
                "reviewBody": "These biscuits are incredible. I didn t really love biscuits and these have just changed all of that. This recipe makes it easy to make light and fluffy biscuits. I didn t have buttermilk so I used regular milk w/ a tsp of lemon juice and also I used a little more salt as suggested and butter flavored shortening. YUMMY! Thank you so much for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIKIBUGT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/767741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:20:08.7Z",
                "reviewBody": "The biscuits were big and fluffy. I've tried to make biscuits before and they never came out so I was very happy with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELIZABETH BAME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247696/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-01T18:49:29.28Z",
                "reviewBody": "I have been making these biscuits for years. As soon as I add the shortening I get in there with my hands and rub the shortening into the flour by rubbing my hands together. I count off 37 seconds ( a little trick I got from Alton Brown). It is true what they have been saying as far as the dough being 'gloppy'. As soon as the dough looks mixed together I pour the mixture into a zip lock bag and snip the corner off like a pastry bag. I then squeeze biscuit sized portions onto a greased pan and bake. Works perfect every time. The old 'biscuit rule' applies here - You want to handle biscuits as little as possible. Another nice thing about the zip lock method is that you can squeeze out as much as you like and then put the bag back in the fridge for fresh biscuits another day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "angie12210",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5113223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:20:07.967Z",
                "reviewBody": "very good but they needed a little more salt",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ISLANDLVR5889",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/658317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:20:08.937Z",
                "reviewBody": "we needed to add a bit more flour than the recipe called for but they turned out great once we did!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "EJFICKROW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/129379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:20:09.42Z",
                "reviewBody": "The dough is like gloop. It doesn't resemble bread dough or biscuit dough at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINGFANATIC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/54207/"
                }
            }
        ]
    }
]