[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/349/bread/yeast-bread/sourdough-bread/",
                    "name": "Sourdough Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7061/salt-rising-bread/",
        "name": "Salt Rising Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4157171.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1999-01-05T13:30:07.000Z",
        "description": "THIS IS NOT AN EASY BREAD TO MAKE! It is tricky, but worth the effort for one who loves that very different, pungent smell of salt-rising bread. The cornmeal used for the starter must contain the inner germ of the corn and a constant warm temperature must be maintained.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P1DT1H0M",
        "recipeYield": "3 -9x5 inch loaves",
        "recipeIngredient": [
            "1 cup milk",
            "½ cup cornmeal",
            "1 tablespoon white sugar",
            "1 teaspoon salt",
            "2 cups warm water (110 degrees F/45 degrees C)",
            "2 cups all-purpose flour",
            "2 tablespoons white sugar",
            "3 tablespoons shortening",
            "½ teaspoon baking soda",
            "1 tablespoon warm water (110 degrees F/45 degrees C)",
            "6 cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To Make Starter: Heat the milk, and stir in 1 tablespoon of the sugar, the cornmeal and 1 teaspoon of the salt. Place this in a jar in an electric skillet or crock pot with hot water in it. Maintain the temperature around 105 to 115 degrees F (40 to 47 degrees C) for 7-12 hours or until it shows fermentation. You can hear the gas escaping when it has fermented sufficiently. The bubble foam, which forms over the starter, can take as long as 24 hours. Do not go on with the bread-making until the starter responds. As the starter ferments, the unusual salt-rising smell appears.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the starter is bubbly, it is time to make the sponge. Place the starter mixture in a medium-size bowl. Stir in 2 cups of the warm water, 2 tablespoons of the sugar, the shortening and 2 cups of the all-purpose flour. Beat the sponge thoroughly. Put bowl back in the water to maintain an even 105 to 115 degrees F (40 to 47 degrees C) temperature. Cover, and let rise until light and full of bubbles. This will take 2 1/2 to 3 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve the baking soda in 1 tablespoon of the warm water and combine it with the sponge. Stir 5 1/4 cups of the flour into the sponge; knead in more flour as necessary. Knead the dough for 10 minutes or until smooth and manageable. Cut dough into 3 parts. Shape dough and place it in three greased 9x5x3 inch pans. Place covered pans in warm water or uncovered pans in a warm oven with a bowl of hot water, maintaining a temperature of 85 degrees F (30 degrees C). It will take approximately 5 hours for the bread to rise 2 1/2 times the original size. The bread will round to the top of the pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake bread at 375 degrees F (190 degrees C) for 10 minutes. Reduce oven temperature to 350 degrees F (175 degrees C) and bake for an additional 20 minutes or until light golden brown. YOU CAN DRY SALT RISING CULTURE!!! Save 1/4 cup of a successful sponge and pour it  into a saucer, cover with cheesecloth and allow to dry. Store dried flakes in plastic in a cool, dry place or freeze until needed for salt rising bread. When ready to make the bread; dissolve the flakes in the new warm starter and continue with recipe. This will give a flavor boost to your bread.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Sourdough Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Valarie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.666666666666667,
            "ratingCount": 27,
            "itemReviewed": "Salt Rising Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "124.1 calories",
            "carbohydrateContent": "23.9 g",
            "cholesterolContent": "0.5 mg",
            "fatContent": "1.5 g",
            "fiberContent": "0.9 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "86 mg",
            "sugarContent": "1.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:15:43.467Z",
                "reviewBody": "I have been trying to duplicat the salt rising bread my grandmother made back in the 30's for over 25 years. Most tries have been total failures. I tried this recipe yesterday (02/19/00) and the bread was delicious and rose magnificently. I am very happy to have this recipe. It is better than the bread made with King Arthur Salt Rising yeast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dbmr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-28T15:36:37.233Z",
                "reviewBody": "My Mom was born and raised in a Kentucky Ohio river town. She has always loved this bread. We all live in the St. Louis area and cannot find this bread anywhere. She has not had any of this bread for almost 15 years. So I made her 5 loaves for Christmas. She loved it. I did save a loaf for myself. It was not a hard recipe but it does take some time. I recognized the smell during the starter stage. I thank you and my Mother thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BBACK13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/547539/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:15:43.03Z",
                "reviewBody": "I didn't think I would ever find this recipe again. My mother is German and she would make this when I was a child although kids don't usually like it because it's not the normal white bread that they're used to. This is a great recipe for this very \"different\" kind of bread. Try it you'll like it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "craftgal1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/441616/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-27T19:48:45.743Z",
                "reviewBody": "If you had problems with this recipe a likely problem is that you could have used \"degerminated\" corn meal. That happens to be the only kind sold in my local grocery store so I have to go old school and grind actual dried corn for this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leah Marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3013856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-09T18:08:18.64Z",
                "reviewBody": "In the \"Southern Tier\" of Western New York this bread is available in every little restaurant that serves breakfast. It is offered (almost exclusively) as one of the options for toast. It is wonderful as toast and as grilled sandwich bread. It does have a VERY disSTINKtive aroma but it is WONDERFUL bread. Thank you very much for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MELANIE IN BUFFALO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-20T23:30:36.163Z",
                "reviewBody": "3rd Update: I finally got this to work. I tried the starter a 3rd time heated my glass jar in the dishwasher then covered it and left jar of starter on my padio in the Texas heat (where else is it a constant 95-110 degrees?). Whew. Made a great loaf of bread (excellent toast as mentioned my other reviewers!) but I am not sure if I will try this again anytime soon...(: Thanks for the post & letting me try somethign different! Update: So far this has not worked for me. I have started the starter (repetative phrase there!) twice. The 2nd time I got a few bubbles but it wasn't enough to continue with making the bread. I will try again at some point right now I am bummed! ): Original review: I have been wanting to try this bread for several years. Made starter 6-16-08 will update and take pics of progress.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanaquil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1982546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-04T00:13:35.45Z",
                "reviewBody": "I had never made SRB before until I read this recipe. My bread was the best SRB I had ever eaten and I have eaten plenty. Follow the directions and you will have Blue ribbon SRB. I am going to Fl next and have always taken loaves with me from the store but this year its my own.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1756147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-22T22:57:00.257Z",
                "reviewBody": "I followed the recipe to the letter and all went well until time to let the dough rise in the pans ( after kneading). The dough just sat there! nothing ever happened...waited more than 5 hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "graceu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2551992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-13T23:44:29.663Z",
                "reviewBody": "Salt rising bread can be very unpredicatble. As one reviewer reported it never did rise. This is a common problem - one time it comes out beautifully the next it is a total waste. In a spirit similar to making sourdough bread however the successes are so rewarding that the failures are easily overlooked. If you have had a problem with this breead give it another try -- the successful loaf is well worth the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Smokin Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/804421/"
                }
            }
        ]
    }
]