[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7139/ponczki/",
        "name": "Ponczki",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5057840.jpg",
            "width": 4079,
            "height": 2392
        },
        "datePublished": "1999-03-19T00:14:22.000Z",
        "description": "This is the 'traditional' ponczki made by most Polish Grandmothers, like mine.  These take time and patience, but the product is worth it. Preferred, traditional frying method is with lard but oil will work fine.  I usually mix equal portions.  Grandma used a large paper bag, and dropped them in immediately after removing from the fryer.  The bag absorbs a lot of the oil.  Then, she transferred them to another clean bag, added her choice of coating, and shook the bag.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT5H10M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "1 (0.6 ounce) cake compressed fresh yeast",
            "2 cups milk, lukewarm",
            "½ cup raisins, finely chopped",
            "½ cup warm water",
            "4 egg yolks",
            "1 egg",
            "½ cup white sugar",
            "¼ cup butter, melted",
            "½ teaspoon vanilla extract",
            "½ cup orange zest",
            "1 teaspoon salt",
            "6 cups all-purpose flour",
            "2 quarts vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, crumble yeast in lukewarm milk. Add 2 cups flour. Stir well, and allow to rest 1 hour in a warm place.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Soften chopped raisins in warm water for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg, egg yolks, sugar, vanilla, melted butter, salt, and orange zest. Add to yeast sponge. Stir in raisins; add egg mixture and mix until combined. Add 4 cups flour and mix well, forming smooth ball.  Dough will be somewhat soft, but not batter-like. Cover dough, and allow to rise until fully doubled, about 1 1/2 hours. Punch down, let rise until double again, about 45 minutes to an hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, divide dough into quarters. Working with one quarter at a time, divide it into 12 pieces; keep other pieces of dough covered while you work. Roll the pieces into 1/2 inch balls; set aside to rise until doubled in bulk, about 30 minutes. Continue shaping remaining dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop 2 or 3 at a time into hot fat, turn when deep golden brown.  If removed too soon, dough will be under-done inside. When doughnuts are browned, drain briefly on paper towels and dust with confectioners' sugar or cinnamon sugar (see Cook's Note).\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen Gibson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 4,
            "itemReviewed": "Ponczki",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "123.5 calories",
            "carbohydrateContent": "16.2 g",
            "cholesterolContent": "24.3 mg",
            "fatContent": "5.5 g",
            "fiberContent": "0.6 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "62.3 mg",
            "sugarContent": "3.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-23T17:27:12.93Z",
                "reviewBody": "Hi! I'm Polish and this is really spelled \"paczki \" which means \"little packages\" in Polish. The way you have it spelled is kind of the way it's pronounced. It's great to see your recipe up here. It's different from mine. You use raisins which is more common in \"babka.\" Glad you're carrying on the tradition! Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb Rolek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2994514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-28T03:48:21.753Z",
                "reviewBody": "I also know these as \"paczki\", not \"ponczki\". I also know that they are usually filled with a prune filling (traditionally) and they don't usually have raisins directly in the dough. So instead of raisins, I chopped up prunes and added them to the dough; and I also filled some of them with a prune filling I made--a kind of compromise lol. I also used rapid rise yeast instead of a compressed yeast cake (it is difficult for me to find that here). I made the yeast sponge by warming the milk with a little bit of sugar in the microwave until it was warm to the touch. Added in the yeast and flour and let it sit for a bit. Then I creamed together the egg yolks, egg, and sugar in a separate bowl until pale yellow and the sugar had dissolved. Then I mixed in the melted butter, vanilla, orange zest, salt, and prunes to the egg mixture. Also 1/2 cup of orange zest would be way too much--only use a tablespoon or two at most. Then added in the yeast sponge, and the rest of the flour, and followed through with the rising of the dough. It is a sticky dough, but you should still be able to form it into a ball. I also patted the dough out to about 1/2\" thick, and cut out rounds using a 3 inch round cookie cutter before frying. Make sure that your paczki's are no more than a 1/2\" thick or they will not cook all the way in the center (I had that issue with a few). I also baked a few in the oven at 350 for about 25-30 minutes, and they are ridiculously flaky! Overall, very good doughnuts! Thank ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/k-i-m/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-21T09:46:56.183Z",
                "reviewBody": "II enjoyed it very much but I'm not such a sugar tooth and it tasted a little of but overall amazing my kids loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Maka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22985459/"
                }
            }
        ]
    }
]