[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1537/bread/yeast-bread/bagels/",
                    "name": "Bagel Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7178/bread-machine-bagels/",
        "name": "Bread Machine Bagels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6740208.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-07-10T02:26:31.000Z",
        "description": "Quick and easy bagels you can make with your bread machine! You can use whatever topping that you wish, many like poppy seeds.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H25M",
        "totalTime": "P0DT3H55M",
        "recipeYield": "9 bagels",
        "recipeIngredient": [
            "1 cup warm water (110 degrees F/45 degrees C)",
            "1 ½ teaspoons salt",
            "2 tablespoons white sugar",
            "3 cups bread flour",
            "2 ¼ teaspoons active dry yeast",
            "3 quarts boiling water",
            "3 tablespoons white sugar",
            "1 tablespoon cornmeal",
            "1 egg white",
            "3 tablespoons poppy seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place water, salt, sugar, flour and yeast in the bread machine pan in the order recommended by the manufacturer. Select Dough setting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When cycle is complete, let dough rest on a lightly floured surface. Meanwhile, in a large pot bring 3 quarts of water to a boil. Stir in 3 tablespoons of sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut dough into 9 equal pieces, and roll each piece into a small ball. Flatten balls. Poke a hole in the middle of each with your thumb. Twirl the dough on your finger or thumb to enlarge the hole, and to even out the dough around the hole. Cover bagels with a clean cloth, and let rest for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle an ungreased baking sheet with cornmeal. Carefully transfer bagels to boiling water. Boil for 1 minute, turning half way through. Drain briefly on clean towel. Arrange boiled bagels on baking sheet. Glaze tops with egg white, and sprinkle with your choice of toppings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated 375 degree F (190 degrees C) oven for 20 to 25 minutes, until well browned.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Bagel Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cristy Chu"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.715419501133787,
            "ratingCount": 882,
            "itemReviewed": "Bread Machine Bagels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "50.1 calories",
            "carbohydrateContent": "8.8 g",
            "cholesterolContent": null,
            "fatContent": "1.3 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "404.4 mg",
            "sugarContent": "7.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-10-04T19:00:10.757Z",
                "reviewBody": "I used to work in a Jewish Bakery. You should roll out the dough and then pinch to form a circle. Also, let the bagels rise for at least 1-2hrs after forming, this will enable them to take shape and not look so narly. I think 9 bagels for this amt. of dough is too much. Make 6, so they are big. The flavor was good, and its a fun thing to do with your kids, but I will stick to the bakery. Thanks for the recipe though, it was fun:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BajaValle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/812502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-06T13:25:07.89Z",
                "reviewBody": "This recipe is fantastic!  I increased the water to 1 1/8 cups as suggested by other reviewers. We love Panera Asiago Cheese bagels, so I added 1/2 cup shredded asiago cheese to the dough, shaped them, let them rise for 30 minutes (great tip!), boiled them, then topped each with a little more shredded asiago cheese.  My husband said if he didn't know I made them, he would have thought they came from the bagel shop!  Since the original recipe made 9 large bagels, which are pretty big, I made them again, and divided it to make 12.  They were a little smaller, but a better portion for us.  I'll be making this recipe again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWELLSVILLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/739267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-13T06:01:39.657Z",
                "reviewBody": "Revised: These were just like the bagels I used to get in Boston. I always double this recipe which means I have to use my kitchen aid instead of my bread machine. I let the dough rise for a 1/2 an hour, punch it down and repeat. After making the bagels into their shape I let them sit for an hour to make sure they are nice and fluffy. I usually get 9 large bagels. I used 2 tbs of molasses in the water instead of sugar. I also used olive oil glaze because the egg had a funny after taste",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1951701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-07T21:22:14.267Z",
                "reviewBody": "My husband loves these.  I must admit, however, that I can't (or won't) follow directions.  I made whole wheat cinnamon raisin bagels as follows:\nI used 2T of Splenda instead of the sugar in the beginning.  I then tried to make them healthier by using 1 1/2c of whole wheat flour and 1/2c of wheat germ.  I mixed it all in my Kitchenaid.  Once it had all pulled together I added 1c of white bread flour about 1/4 c at a time until the whole cup was mixed in.  I then added 2t of cinnamon and 3/4c of raisins.  I let that all rise in a warm oven (covered) 30 minutes.  I shaped them into balls, stuck a finger in the middle and placed them back in the warm oven (covered) for another 1/2 hour.  I then boiled them in water with 3T blackstrap molasses as someone else recommended.  I think you could probably get away with only 1T.  I'll try that next time.  I boiled them closer to 2 minutes each.  I realized too late I didn't have any cornmeal so I just sprayed the pan real well and it was fine.  I also forgot all about the egg wash which was fine too.  Watch your baking time as mine didn't need 20 to 25 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALEXSMOMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/558025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-16T20:40:34.937Z",
                "reviewBody": "I make these bagels every couple of weeks and they really are easy and delicious.  My only trouble was shaping them, so now I just cut them in even squares and poke a hole in the middle.  They come out a little square but I'm not entering any contest for the roundest bagel.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Harper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2067496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-21T20:22:51.547Z",
                "reviewBody": "Very good!  I tripled the recipe, but only made 18 bagels with it.  They were a great size.  I made them in my KitchenAid mixer (not in a bread machine) like I make all my breads.  Very yummy and chewy.  They were really easy to make, as well.  Just a note:  They do rise in the boiling water and in the oven, so you might want to make the center hole quite large.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ACHOCOCAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/643343/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-21T09:16:41.513Z",
                "reviewBody": "This is the PERFECT bagel recipe! My husband and I could not believe how delicious they were and they tasted better than our local \"Gourmet Bagel\" shop. I made cinnamon raisin bagels by kneading in 1/2 cup of raisins and about 1 tbsp of cinnamon after I took the dough out of the bread machine.  I could not believe how easy these were to make!  We will be making them all the time and will not be wasting money on freezer or grocery store bagels, these are SO much better!  Can't wait to try some with asiago cheese baked in.  Mmmmm!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michigan Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/818228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-02T15:50:35.443Z",
                "reviewBody": "I have made these bagels several times now and they always turn out wonderful.  Like most other people recommended I have increased the water to 1 1/8 cups and halved the quantities of both sugar and salt.  I found that watching the bagel rolling video on YouTube was a great help, but I now cheat and use a medium cookie dough cutter to cut the bagel and then a very small round cutter to cut out the whole in the middle, to almost perfect results.  I do find that the whole process takes a little too long to make from start to finish for breakfast, so I started freezing the dough.  I make the dough as usual and cut in to shape, but before allowing the dough to rise.  I place the bagels on a baking tray and freeze.  Once the bagels have frozen I transfer them to a plastic container, using wax paper in between the layers. (I can usually get 3 layers in my containers). Then I can take out the desired number of bagels and thaw them in the microwave for 50 seconds on full power.  I then let them rise in a warm place for 20 minutes.  (I always heat the oven to 200 degrees for 2 minutes, before turning the oven off and placing the dough inside to rise).  Then continue with the rest of the recipe, I boil each bagel for 1 minute on each side, glaze with the egg white and then cover with Asiago cheese and bake for 20-25 minutes, perfect!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheBritishBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/apple-strudel/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-01T22:58:59.58Z",
                "reviewBody": "These bagels are just as good as Panera or Einstein.  I make 8 and let them rise more like 20 minutes.  My first topping choice was a combo of onion flakes, coarse salt, sesame seeds and poppy seeds.  We added 2t of cinnamon to our second batch and topped with cinnamon sugar.  We're going to try mocha chocolate chip  next.  I may never have a reason to go to the bagel shop again!  Thanks for publishing this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chefsazy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2255577/"
                }
            }
        ]
    }
]