[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/399/desserts/cakes/white-cake/",
                    "name": "White Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7246/aunt-berts-white-cake/",
        "name": "Aunt Bert's White Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F60434.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This is a very old recipe that I got from my deceased friend Holli's Aunt Bert.  Everyone will love it.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 x 13 inch cake",
        "recipeIngredient": [
            "2 cups white sugar",
            "2 cups sifted all-purpose flour",
            "3 egg yolks",
            "1 egg",
            "½ cup buttermilk",
            "1 teaspoon vanilla extract",
            "½ teaspoon salt",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "½ cup shortening",
            "1 cup boiling water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix together the buttermilk with the baking soda.  Set aside.  Cream shortening, sugar, eggs and vanilla. Beat well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add buttermilk and baking soda mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift dry ingredients, and add to creamed mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add boiling water, and mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into a greased and floured 9 x 13 inch pan. Bake at 350 degrees F (175 degrees C) for approximately 35 minutes, or until toothpick comes out clean.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let cool.   I frost with cream cheese frosting.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "White Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tari Weber"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.78,
            "ratingCount": 150,
            "itemReviewed": "Aunt Bert's White Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "203.2 calories",
            "carbohydrateContent": "33.4 g",
            "cholesterolContent": "44.7 mg",
            "fatContent": "6.9 g",
            "fiberContent": "0.4 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "174.3 mg",
            "sugarContent": "22.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-20T19:13:29.967Z",
                "reviewBody": "This cake is great, but there are a couple things that should be changed in the order of the directions.  Don't mix the baking soda and buttermilk to start with.  Cream the shortening, sugar, ect. first.  Then you hold a small bowl with the buttermilk and baking soda over the bowl with the creamed mixture in it and beat as it will foam and may foam over the bowl.  Pour that mixture immediately into the creamed mixture.  Then continue with the directions as stated.  This will make the cake a little more moist for those who think that it is a little bit dry.  This recipe, no doubt, started out with the buttermilk as sourmilk.  You use the same amount of sourmilk as you do buttermilk.  To make sourmilk, use the 1/2 cup regular milk and add 1 tablespoon vinegar and mix well.  Allow to set while creaming your ingredients, then follow the steps above and you will have a more flavorful, moist cake.  These little bits I have given you have been left out as it has been passed around through generations of bakers.  I hope these extra tips help you out.  Thanks.  The recipe was great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKINGBUD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/850088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-14T00:48:40.503Z",
                "reviewBody": "I made this cake after reading all of the comments , good and bad . This is the nicest cake I've tasted in a very long time. I sell cakes from my home and needed a recipe for a \"real\" homeade cake and that's how I found this one. I couldn't wait for it to cool so I could frost and cut it for a taste. I don't know what's been happening to those of you that were disappointed when you tried this recipe, but it turned out excellent for me. I did make a couple changes though, I put in 3 whole eggs and one egg white, and two teaspoons of vanilla . ( my experience has been that cakes made from scratch need more whites than yolks and double flavoring for some odd reason when the recipe calls for water instead of milk. I don't know if these two changes made the differece for me, but it is truly a lovely , light texture cake. Please try at least once and perhaps if you didn't have good results the first time, I'd give it another try . ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bakedbernice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2659857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-02T22:32:52.827Z",
                "reviewBody": "Love this recipe! Of course I made modifications as I almost usually do. I cut the sugar back by half a cup and added a package of french vanilla pudding mix to the dry ingredients. This makes the cake incredibly moist. This may also help take away from the 'cornbread-like' texture that some people are experiencing with their cakes. I also add about 2 T. of canola oil which also adds to the moisture of the cake. I just use two whole eggs to simplify things and not waste any egg. The cake is more yellow then white but I think the flavor is richer and better. To the wet ingredients I also add a tablespoon of fresh lemon zest. Gives the cake a great boost of flavor without being overly 'lemony.' I frost the cake which I bake in 3 8\" pans to make a triple layer sensation with vanilla Rich's BetterCream which you could also add a little lemon extract to as well. I then drizzle with melted chocoate and everyone gobbles it up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Bakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-18T00:24:56.91Z",
                "reviewBody": "Probably one of the best white cakes I've ever tasted anywhere let alone made myself. None of the almost anticipated and dreaded Dry Cake Syndrome! They're also light and fluffy (I made cupcakes) with a softer more open crumb - something I already knew when I took them out of the cupcake tin and found them \"squeezably soft.\" Delicately vanilla flavored so it's suitable for any flavor frosting. Just excellent. I made these as written except I simply added the baking soda to the dry ingredients rather than to the buttermilk. I made half a recipe which made 12 cupcakes and frosted them with \"Waldorf Astoria Cake Frosting \" also from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-25T23:37:37.217Z",
                "reviewBody": "I do lots of baking was searching for different basic cake recipe. I tried this recipe followed the directions to letter. This is a wonderful cake recipe. I have baked this and frosted with homemade creamcheese frosting. And also used this recipe to bake a pineapple upside down cake in bunt pan.Aunt Bert would be proud!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GOGETHER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/623334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-25T23:37:51.297Z",
                "reviewBody": "I have tried 23 other recipes.. I was looking for an old fashioned cake.. this is the BEST cake ever. I served it to three different gentlemen friends and they all raved about it. They all said it was just like the one their grandma or mom made when they were little. This cake is dense and has an excellent taste and texture.. I will NOT look for another recipe.. This is the best.. thanks for sharing it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATSCORNER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/533951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-17T23:21:48.36Z",
                "reviewBody": "This recipe makes a yellow cake--not a white cake--because it uses egg yolks rather than whole eggs. That said the cake was moist and dense but uninspiring. We ate it it was fine but I'll try something else next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "AMOYERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/806613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-25T23:37:47.89Z",
                "reviewBody": "This cake is superb thank you Aunt Bert & Holli (and tari Weber for sharing) surely you must live in cake heaven now. I've made it at least 5 times now. It IS slightly heavy & very moist the antithesis of grocery store cakes these days. Yippee! With buttercream frosting it makes a splendid birthday cake. My only minus is the amount of sugar too much. Best advice - grease the cake pans well. More curious each time I make it who was Holli and who was Aunt Bert? Every time I make this cake I find myself thinking fondly of these two women I will never know wishing to thank them. If Tari wishes to share any info about these people I would be delighted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LORHETTA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/516190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T16:06:47.81Z",
                "reviewBody": "yay finally a cake for pple who hate to bake. So easy to make and yummiyum. the batter is great. tastes gooooooood. Everyone loved it it just disapeared!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IREALLYHATECOOKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641264/"
                }
            }
        ]
    }
]