[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15012/desserts/specialty-desserts/liqueur-desserts/brandy/",
                    "name": "Brandy",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7385/white-chocolate-cheesecake-with-white-chocolate-brandy-sauce/",
        "name": "White Chocolate Cheesecake with White Chocolate Brandy Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F38719.jpg",
            "width": 2304,
            "height": 1728
        },
        "datePublished": "1998-04-22T21:07:00.000Z",
        "description": "This is a dense cheesecake that is very smooth and melts in your mouth. The white chocolate brandy sauce tops it off. I just nap it over the center of the slice of cheesecake on the plate. I garnish it with mint leaves and either raspberries or strawberries.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT10H30M",
        "recipeYield": "1 10-inch cheesecake",
        "recipeIngredient": [
            "4 (1 ounce) squares white chocolate",
            "3 (8 ounce) packages cream cheese, room temperature",
            "¾ cup white sugar",
            "¼ cup all-purpose flour",
            "3 eggs, room temperature",
            "½ cup heavy cream, room temperature",
            "½ teaspoon vanilla extract",
            "2 cups finely chopped white chocolate",
            "1 cup heavy cream",
            "2 fluid ounces brandy"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). Wrap the outside of a 10-inch springform pan with foil. Grease the inside of the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the cream cheese, sugar, and flour in a mixing bowl and cream until light and fluffy. Beat in eggs one at a time, mixing well after each addition. Scrape bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 4 ounces of the white chocolate. With an electric mixer on low speed, mix melted white chocolate into cream cheese mixture. Keeping electric mixer on low, slowly beat in the vanilla and 1/2 cup of heavy cream. Blend well. Pour mixture into the prepared springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place cheesecake pan in a water bath filled with warm water. Bake at 300 degrees F (150 degrees C) for 50 to 60 minutes, or until center of the cheesecake is just firm. Cool at room temperature for 1 hour. Refrigerate until set before removing from pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make White Chocolate Brandy Sauce: place chopped white chocolate in a heat-proof bowl. Pour 1 cup cream into a saucepan and bring it to a boil over medium-high heat. Watch carefully so it doesn't boil over. Pour hot cream over chopped white chocolate; let soften for 2 minutes. Stir with a wooden spoon until melted. Add brandy and continue stirring until incorporated. Pour over chilled cheesecake and serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Brandy"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Judy Wilson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.825454545454545,
            "ratingCount": 275,
            "itemReviewed": "White Chocolate Cheesecake with White Chocolate Brandy Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "596 calories",
            "carbohydrateContent": "39.8 g",
            "cholesterolContent": "157 mg",
            "fatContent": "44.2 g",
            "fiberContent": "0.1 g",
            "proteinContent": "8.9 g",
            "saturatedFatContent": "27 g",
            "servingSize": null,
            "sodiumContent": "229.4 mg",
            "sugarContent": "35.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-09T22:08:41.437Z",
                "reviewBody": "i specialize in baking cheesecakes and this is an exquisite white cheesecake recipe and brought a $125 bid to a recent charity auction; however, I highly recommend a vanilla crust as I remove my cheesecakes from my springform pans to put on a cake board for serving. the sauce delicious (i was tipsy all afternoon after tasting the leftovers in the bowl) but not meant to be a hardened cover but rather a garnish. to make the cake more special, i piped medium sized dollops of sweetened fresh whipped cream around the top adding a fresh raspberry and mint sprig to each dollop; the final touch was a dusting of powdered sugar. humbly, i tell you, it was gorgeous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HERMILLER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/928218/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-05T19:27:32.61Z",
                "reviewBody": "AMAZING! I read through the recommendations and reviews for this recipe and it came out beautifully. I added twice the amount of white chocolate to the cake (not the sauce) added a crushed oreo cookie crust (1/3 cup butter and 2/3 oreo cookie bag) and topped it with strawberries when serving. The most important tip is not to put the springform inside the steam bath but instead to place the steam bath on the rack underneath the cheesecake when baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bhavna Pittas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2479688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-12T01:04:28.64Z",
                "reviewBody": "Of the 3 cheesecakes I've rated 5* so far, this is by far the easiest to make, and I think the best tasting too.  I will definitely make it again.\n\nI didn't have a 10\" springform, so I used a 7\" and an 8\".  The cake ended up a little thinner, but not by much.  (2 7\" pans would have the same area as one 10\" pan.  Sorry about the numbers... I majored in math in university and I can't help it.)\n\nI wanted to transfer the cake to a platter for serving, so I added a standard chocolate cookie crumb crust (3/4c crumbs and 1/4c butter, pressed into pan and baked at 350 for 10 min) to make the transfer easier.  Also, I took everyone's advice and doubled up the white chocolate in the cheesecake batter.  Everything turned out wonderfully.  \n\nBut I'm not sure the cheesecake needed the extra chocolate.  That's because it's the white chocolate brandy sauce that really makes the cake pop.  To quote my wife, \"you could pour the sauce on cardboard and it would taste great.\"  I'd stick with cheesecake though.\n\nFor baking, I put a pan of water on the rack under the springform pans.  The cheesecakes did crack a little, but I think it may be because I overbaked them slightly.\n\nI also added a raspberry sauce (5 oz frozen raspberries, 1 tsp corn starch, 1/4c water, 1/2 tbsp sugar, boil 5 min, strain) for garnish, which I think was a good idea to add some colour to an otherwise very pale dessert.  I served the dessert plated and garnished each slice with a dollop of whipped cream and a raspberry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jimmy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-26T15:55:56.027Z",
                "reviewBody": "This is an amazing recipe. There is one thing that I recommend and that is that you use a good quality white chocolate. The first time I made this I used chocolate from the bulk bin and it was an awful tasting cheesecake. I made it for Christmas this year with good quality white chocolate and took it to a family gathering. Everybody loved it and  wanted the recipe. It really was amazingly good. I had added an oreo cookie crust, about 20 oreo cookies crushed and pressed into the pan. They do not need sugar or butter and hold together nicely. I also changed the sauce and added about 3/4 cup Butter Ripple cream liquor instead of the brandy. It was phenomenal. When I served it, both the sauce and the cheesecake had been sitting in the frige and the sauce was nicely thickend. The recipe for the sauce made quite a large amount of sauce and I may try cutting that in half next time I make it. I sprinkled raspberries and blackberries on the cake to serve and it was a huge hit. I will be making this again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tripthatgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2605155/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-09T22:08:45.34Z",
                "reviewBody": "Just finished eating it this morning in fact. I used a graham cracker crust pressed into the bottom of the pan. It was delicious. We didn't have any brandy on hand so I used a shot of amaretto rum and it worked very well. I would definitely make this again. I don't remember if this was in the recipe but cheesecakes taste better once they've set up overnight in the fridge. Also the sauce would probably be less runny if it is refrigerated and then poured over the cake in the morning. If I were to make it again I would make it in the morning or a day in advance.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SIDEFLY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/799114/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-08T22:02:47.763Z",
                "reviewBody": "To Die For! I omitted the brandy sauce and drizzled it with chocolate syrup instead and my family and guests LOVED it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1912850/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-07T14:55:23.2Z",
                "reviewBody": "this was the easiest and best tasting cheesecake ive ever baked! so thrilled. i doubled the white chocolate but otherwise stuck to the recipe. i made it in four 4.5\" springform pans and did have leftover batter. i used an oreo crust (16 oreos and 2 tbsp melted butter pressed into bottom of pants and put in freezer to set while making filling). i buttered the insides of the pans heavily to prevent cracking while cooling. i did fill a large pan with water and put it on the rack under the cheesecakes while cooking instead of the water back bc thats easier. i cooked them until the centers were still slightly jiggly and let them cool in the oven with the temp off and the door cracked for about 30 min before taking them out. the cheesecakes were cooked perfectly. no cracks not overdone not underdone. i skipped the sauce and used a chocolate sauce instead. (4.5oz of milk chocolate 2tbsp dark corn syrup 1/2 cup of whipping cream. mix together on low heat until chocolate is melted drizzle over cakes.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Pulk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2241005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:00:55.187Z",
                "reviewBody": "This was the first cheesecake I've ever made and it was a success. My husband had a holiday bakeoff at his work and the winner got a day off of work. It won! Since others had said the brandy sauce was really sweet I used only one ounce of brandy and less white chocolate. I also added a rasberry ripple.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUNA1937",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/760960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-22T14:31:29.75Z",
                "reviewBody": "This was my first cheesecake. It came out so good that my boyfriend thought I bought it. I crushed chocolate graham crackers for the base and added a couple more white chocolate squares for an extra chocolate taste. It came out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Magdalena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2037923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-29T17:35:09.893Z",
                "reviewBody": "It was okay but not great. The sauce ended up as the same color as the cheesecake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Marc Minish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2980716/"
                }
            }
        ]
    }
]