[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17095/desserts/cakes/sponge-cake/",
                    "name": "Sponge Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7388/egg-yolk-sponge-cake/",
        "name": "Egg-Yolk Sponge Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1091420.jpg",
            "width": 4912,
            "height": 3264
        },
        "datePublished": "1998-04-21T17:58:15.000Z",
        "description": "This is a moist and tender cake with plenty of orange flavor.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -10 inch tube cake",
        "recipeIngredient": [
            "1 ⅔ cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "½ teaspoon salt",
            "¾ cup egg yolks",
            "1 egg",
            "1 ½ cups white sugar",
            "1 tablespoon orange zest",
            "1 tablespoon orange juice, strained",
            "½ teaspoon lemon extract",
            "¾ cup boiling water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together twice: flour, baking powder, and salt. Pour back into sifter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl beat egg yolks and whole eggs with an electric mixer until thick and lemon colored (about 5 minutes). Gradually add sugar,  beating after each addition. This should take about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold in orange rind, orange juice, and lemon extract. Sift dry ingredients into egg and sugar mixture and fold in. Do not stir or beat. Add boiling water and fold in quickly, just until liquid is blended. Pour batter into one ungreased 10 inch tube pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 325 degrees F (165 degrees C) for 60 to 65 minutes. Turn cake over in pan on a wire rack and let cake hang for 1 hour or until cool. Loosen cake sides from pan with a spatula and shake from pan. Dust top lightly with confectioner's sugar or frost with Orange Butter Frosting.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Sponge Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.27906976744186,
            "ratingCount": 86,
            "itemReviewed": "Egg-Yolk Sponge Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "185.1 calories",
            "carbohydrateContent": "33.6 g",
            "cholesterolContent": "173.9 mg",
            "fatContent": "4 g",
            "fiberContent": "0.5 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "146.9 mg",
            "sugarContent": "21.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-29T20:47:30.78Z",
                "reviewBody": "This cake was a huge hit. It was gone in a flash. I topped it off with a glaze made with fresh squeezed orange juice powdered sugar and butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lila D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/859251/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T18:36:44.967Z",
                "reviewBody": "Moist and great on its own. It really requires no frosting. Also it's a good way to use up egg-yolks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PERIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/302851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-02T19:37:50.67Z",
                "reviewBody": "Very nice recipe. Easy to make and turned out great, the citrus flavours are easily substituted to adapt it to your taste. I've made a pina colada flavour (substituting coconut, rum and pineapple flavours) and a mocha flavour (substituting chocolate and coffee flavours) and they both tasted great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EmpressChristine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/945567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-13T16:24:05.82Z",
                "reviewBody": "Very tasty!! I wouldn't call it moist but it certainly is good. I have left over yolk from making angel food and this is the perfect way to use it it even tasted better than the angel food haha.. FYI I use 11yolks may varied depend on the size of your eggs but i think you'll need around 10-12.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cajoeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-10T23:19:32.133Z",
                "reviewBody": "When I was a kid sponge cake was my favorite. My mom always made one when she made the angel food cake using only yolks. I have looked for this recipe since forever and am so glad I found it. For the one lady in England that does not have a tube pan if you need one take a large pan place a heat proof glass in the center and viola a tube pan. For those who do not like the texture of the cake remember it is called a \"sponge\" cake. I am making one today using only lemon juice and rind. Yum! Thanks so much for this recipe. From the other reviews I am sure I will give this recipe a five star rating. To avoid having problems getting the cake out of the pan line the bottom of pan with ungreased parchment paper. The paper will slide out with the cake and can then be peeled off easily. Just tear off a piece of parchment paper the width of the bottom of the pan take a pencil or pen and draw around the bottom of the pan onto the paper then cut the paper a little smaller than you have drawn and it should fit nicely into the tube pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wynema",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4954741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-03T04:32:40.89Z",
                "reviewBody": "Delicious!!! Very good. I didn't add the orange flavorings though and it still came out excellent. Make sure to whip the egg-yolks and sugar until the mixture is very light and rises or the result will be not as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "clara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1862595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-02T17:36:41.18Z",
                "reviewBody": "I made quite a few changes to this recipe based on the reviews here a sponge cake recipe in a baking book (that explains their rigorous testing methods) my own tastes - but I kept the egg ingredients the same since I wanted to use up a whole lot of yolks! Sorry I'm not posting it as a custom version but I don't want to buy that membership! My cake turned out very well (I'd rate 5 ) & got many positive comments from the eaters. Texture was just right - a bit spongy yet light enough - not too dense. Flavor nice. I think the egg whipping is important see below. Here goes: Total of 1 2/3 c flour but make it up of about 2 parts cake flour and one part all-purpose flour. Same baking powder and salt as recipe same sifting together instructions. Same quantity of eggs but: Separate the whole egg add its yolk to the others. Whip up the egg white to soft peaks set aside. Now spend a LOT of time whipping the yolks like 10 minutes til they're REALLY lovely light and pale colored. Fold in the whipped egg white. Same amount of sugar. Recipe makes it sound like you have to beat yolks and sugar together for 10 minutes - not sure about that need! Same amount of zest orange juice. Gentle but thorough folding is probably important. I substituted orange extract for the lemon extract. I added 2 T Grand Marnier (orange liqueur) and removed 2T from the water quantity. I used room temperature water not boiling water. Tube pan. Check for done-ness at 45 mins. Good luck - Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anita BS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6975126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-25T18:29:24.987Z",
                "reviewBody": "I'm really sorry to leave a negative review but everything about this recipe fails. I went against my better judgement in following a recipe that calls for adding boiling water to beaten egg yolks which \"cooked\" them and killed the leavening agent before it even went into the oven. I followed the recipe exactly (I understand the importance of careful beating and folding.) However the cake didn't rise was beyond spongy (rubbery) had so-so flavor (could have benefited from vanilla or almond in addition to the orange zest and lemon extract.) and was over baked at 60 minutes. I come from a long line of bakers and will stick with the trusted sponge cake recipes handed down from my grandmothers in the future none of which is any more difficult than this. I'm annoyed with myself for wasting all the ingredients on this one. My husband took one bite and said it wasn't worth eating. I ate a small piece and saved a slice for my mom (a professional baker) who guessed just what was wrong without my telling her about the recipe instructions. We both agree this is an inferior sponge cake. The biggest problem is the boiling water dumped into the egg yolks and leavening.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie/Ocala, FL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2609149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-19T22:37:17.217Z",
                "reviewBody": "I baked this in a 9 by 13 inch pan and the texture of the resulting cake was incredible. I didn't even add any orange flavoring. An excellent way to use up extra egg yolks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NADAS6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1424565/"
                }
            }
        ]
    }
]