[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7399/tres-leches-milk-cake/",
        "name": "Tres Leches (Milk Cake)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F26%2FTres-leches.jpg",
            "width": 1244,
            "height": 1244,
            "caption": "Tres Leches (Milk Cake)"
        },
        "datePublished": "1998-04-25T19:41:47.000Z",
        "description": "This cake is made with three layers: Cake, filling, and topping.  There are 4 types of milk in the filling and topping (whole milk, condensed milk, evaporated milk, and heavy cream).  This is an excellent cake for milk lovers!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -9x13 inch cake",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "1 teaspoon baking powder",
            "½ cup unsalted butter",
            "1 cup white sugar",
            "5 eggs",
            "½ teaspoon vanilla extract",
            "2 cups whole milk",
            "1 (14 ounce) can sweetened condensed milk",
            "1 (12 fluid ounce) can evaporated milk",
            "1 ½ cups heavy whipping cream",
            "1 cup white sugar",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift flour and baking powder together and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream butter or margarine and the 1 cup sugar together until fluffy. Add eggs and the 1/2 teaspoon vanilla extract; beat well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the flour mixture to the butter mixture 2 tablespoons at a time; mix until well blended. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 30 minutes. Pierce cake several times with a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the whole milk, condensed milk, and evaporated milk together. Pour over the top of the cooled cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whip whipping cream, the remaining 1 cup of the sugar, and the remaining 1 teaspoon vanilla together until thick. Spread over the top of cake. Be sure and keep cake refrigerated, enjoy!\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie Watts"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.42337807606264,
            "ratingCount": 1788,
            "itemReviewed": "Tres Leches (Milk Cake)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "279.7 calories",
            "carbohydrateContent": "34.6 g",
            "cholesterolContent": "81.5 mg",
            "fatContent": "13.7 g",
            "fiberContent": "0.2 g",
            "proteinContent": "5.5 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "86.8 mg",
            "sugarContent": "28.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-01T20:19:42.443Z",
                "reviewBody": "I made this cake yesterday and it turned out very well.  I live on the Mexican border so I have had this cake many times in restaurants and at parties.    I did make a few changes to lesson the calorie and fat content and it still tasted authentic. First I would tell you to read the directions carefully.  The cake has 3 parts ; batter,filling and topping.  The first 6 ingredients make the batter. Be sure to put only one cup of sugar in the batter not 2. The next 3 ingredients make the 3 milk mixture for the filling hence the name three milk cake.  I chose not to use whole milk but used 1% and used only 1 cup along with the other 2 milks.    I made the cake in a 9x13 pan not a round pan as seen in the picture.  The cake was a little flat but that is ok because as you add the 3 milk mixture it expands .  After the cake was done I pierced the cake many times with a fork , all over the cake. You want to make a lot of holes for the milk to saturate the cake.  After you pour the milk on , you want to cover with foil and refrigerate for several hours.  I chose to use cool whip as the topping instead of the whipping cream-sugar mixture.  That cut down on a lot of the calories and was very good.  After I covered the saturated cake with cool whip I covered with foil again and refrigerated for another several hours. You want it to be very cold when you serve it.  I know this has been long but wanted to share my changes and suggestions on making this cake.  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peggy Ann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2284984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-07T21:26:50.393Z",
                "reviewBody": "I am from Panama and have been making this cake for over 20 years and am constantly making changes to make it even better. This is my favorite cake ever and it is always a hit! A few suggestions:\n1 - The toppings can vary from cherries to coconut to cajeta (caramelized milk).\n2 - I never use regular milk or whipping cream. Instead I use half & half. I also recommend using either eggnog or coconut milk.\n3 - Most of the time, I don't make the cake from scratch - instead I use white cake mix (I don't recommend the butter cake mix for this recipe). When the cake is ready, I cut off the sides and the top to let the cake soak up the milk. \n4 - Always let the cake sit overnight in the fridge...letting the cake soak up the milk makes it even better! Plus this way you can decide whether to take out the milk or leave it in (I like to leave it all in).\n5 - Kahlua and Rum adds a great kick to this cake!!! I've even heard of tequila-lime tres leches. \n\nBasically this is such a versatile recipe with millions of ways to make it your own!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "christine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2115291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-09T23:17:23.903Z",
                "reviewBody": "I love Tres Leches cake but this is not the best recipe.  The eggs need to be separated, and the whites beaten prior to adding them to the batter.  I have done it both ways, and despite the extra work, separating the eggs is well worth the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DICKSIELEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/781742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-22T03:11:56.357Z",
                "reviewBody": "My recipe is nearly identical - except I follow a slightly different method for making the cake portion - beat the butter first, for a few minutes until it is a light yellow color - then add the sugar and beat on high until it is very pale - add eggs one at a time (beating for 20 seconds between each egg); then add vanilla and beat for one more minute.  Add flour mixture a little at a time and mix until batter is smooth (my batter is always a bit thick).  For a slightly better rise in the cake add 1/4 tsp baking soda with the baking powder.  \n\nI like to use 1 cup heavy cream and 1 cup whole milk (essentially half and half) instead of all regular milk... provides a creamier flavor.  \n\nCan be made without the whipped topping if you prefer - it's good with or without it.  \n\nYou will NOT be disappointed in this cake - very very delicious! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T08:12:45.71Z",
                "reviewBody": "This is the second recipe that I have tried for Tres Leches, and it came out perfect.  I read all of the previous reviews, and I must disagree with several of the earlier comments.  This cake does not taste eggy (I used 5 large eggs, maybe the other guy used jumbo).  Using a 13x9 pan, the thickness was just right, about 1-1/4\" high (cake portion).  There was not too much liquid.  I found the amount of liquid to be almost perfect.  The only problem was having to wait a while for it all to soak in.  I did not want to wait any longer, so I had to dump a few ounces, so I could proceed to the frosting stage.  Once I was serving the cake, I found that it was totally moist, but I would have preferred some excess milk mixture at the bottom, which this one did not produce (the amount missing was just about the amount I threw out), so I think the recipe is probably perfect on quantities and perfect on cooking instructions.  Out of 7 people at my dinner party, 6 loved the cake and one was neutral.\r\n\r\nThank you Stephanie for a great recipe\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ARTHURZUNIGA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721850/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-25T16:41:21.783Z",
                "reviewBody": "Overall this is a very good recipe. To ensure you have a good cake, make sure you mix the batter halves exactly.  To get a good rise to the cake, make you you whip the egg whites to merenge-like batter.  Then gently fold in the the flour batter until blended.  Do not overmix or your cake will be flat.  Bake cake until you have a nice brown top where a toohpick comes out clean and cool. (Hint: in a confection oven, I bake this at 325 degrees for 20 minutes.)\n\nAs far as the milk mixture goes, I omit the whole milk and just blend together the three milks (hence the name Tres Leches) heavy cream, evaporated milk, and condensed milk together.  After you have punched holes into the made cake, pour half the milk mixture into the cake.  The cake will absorb the mixture.  Refrigerate at least an hour.\n\nWhen serving, I cut out squares of cake out, not using the cake sides. I place a square cake serving into a small bowl.  I pour milk mixture on top of the cake until it is all the way to the top or half way to the cake.  A small dab of whipped topping and topped with a maraschino cherry and decorate with a tinge of cherry juice over the whipped topping.\n\nBy the time you will serve this, the milk mixture will be absorbed into the cake.\n\nFor my tough family of food critics, this recipe gets rave reviews!\nThank you for shraing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "YTGARCIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/420881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-23T19:13:51.123Z",
                "reviewBody": "Marti,\r\n\r\nYour recipe is wonderful...yours was the second (out of four) recipe I tried and I'm not going any further...I am from Nicaragua, where this cake originated and your recipe came very, very close with the following exceptions:\r\n\r\n1.  Use 2 14-oz cans of condensed milk and\r\n\r\n2.  Use only 10 oz of evaporated milk (2 5-oz cans)\r\n\r\nThank you for your recipe...great start.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IZUNIGA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/340648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-21T16:38:44.44Z",
                "reviewBody": "It truly is a great Tres Leches but here are a few very important steps taught to me by a Honduran friends mom. IMPORTANT!! Take the cake out when done to cool, don't touch it, turn off the oven & set the timer for 5 mins. After 5 mins THEN poke the holes in the cake using the large end of a chopstick making larger holes then fork tines, pour the liquid on the top & RETURN to the off oven for 10 mins. The reasons. 1) the cake is still cooking when you take it out so poking holes at that time reseals them, hence no absorption. 2) the dwindling heat slowly forces the liquid into the cake. Also, I substitute a cup of coconut \"cream\" NOT coconut \"milk\", for whole milk.\nProceed with the topping when cooled. You will be shocked how unbelievably moist but non soupy this turns out when done this way. Enjoy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rob",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15533139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T11:35:22.67Z",
                "reviewBody": "I have made this cake several times.  The last time I made it, I decided to double the cake recipe, because I thought the cake was too thin.  (Although, I have never recvd any complaints from my customers.)  I was told that when I doubled the cake, there were areas where it was too dry and there was not enough of the liquid.  There is no need to fix what is not broke!!  The original recipe is a hit and the best tres leches recipe on the web.  It is very easy and as one of my customers put it, \"simply divine!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRICE OLOOTU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/213484/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Tres Leches Cake",
            "description": "Four kinds of milk give this tres leches cake its richness.",
            "uploadDate": "2012-05-23T02:11:14.503Z",
            "duration": "PT3M27.189S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc55f0a61-dba4-4f28-97a6-ea12efbd507a%2F14f62ef5-6f1e-4d4a-912e-00188455023d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1651444847001"
        }
    }
]