[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7425/red-velvet-cake-i/",
        "name": "Red Velvet Cake I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F821124.jpg",
            "width": 2502,
            "height": 1975
        },
        "datePublished": "1998-05-08T15:51:53.000Z",
        "description": "A family favorite -- great for the Christmas holiday.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 - 2 layer 9 inch cake",
        "recipeIngredient": [
            "2 tablespoons unsweetened cocoa powder",
            "2 ounces red food coloring",
            "1 cup buttermilk",
            "1 teaspoon salt",
            "1 teaspoon vanilla extract",
            "½ cup shortening",
            "1 ½ cups white sugar",
            "2 eggs",
            "2 ½ cups all-purpose flour, sifted",
            "1 ½ teaspoons baking soda",
            "1 teaspoon white vinegar",
            "1 cup milk",
            "5 tablespoons all-purpose flour",
            "1 cup white sugar",
            "1 cup butter",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease two 9 inch round pans. Preheat oven to 350 degrees F (175 degrees C). Make a paste of cocoa and food coloring.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the buttermilk, salt and 1 teaspoon vanilla.  Set aside.  In a large bowl, cream together the shortening and 1 1/2 cups sugar until light and fluffy. Beat in the eggs one at a time, then stir in the cocoa mixture.  Beat in the buttermilk mixture alternately with the flour, mixing just until incorporated.  Stir together baking soda and vinegar, then gently fold into the cake batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into prepared pans. Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool completely before frosting.  Refrigerate until ready to serve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Icing:   In a saucepan, combine the milk and 5 tablespoons flour.  Cook over low heat, stirring constantly, until mixture thickens.  Set aside to cool completely.  Cream together butter, 1 cup sugar and 1 teaspoon vanilla until light and fluffy, then stir in the cooled milk and flour mixture, beating until icing reaches spreading consistency.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JJOHN32"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9018003273322424,
            "ratingCount": 611,
            "itemReviewed": "Red Velvet Cake I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "513.4 calories",
            "carbohydrateContent": "66.6 g",
            "cholesterolContent": "74.1 mg",
            "fatContent": "25.7 g",
            "fiberContent": "1.1 g",
            "proteinContent": "5.8 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "502.5 mg",
            "sugarContent": "43.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-23T18:06:24.107Z",
                "reviewBody": "I made this cake twice yesterday.  The 1st time, I followed all directions and found the cake dry and bland.  Also, there were chocolate swirls in the baked cake even though I mixed the cocoa/food coloring paste well and beat the paste thoroughly into the shortening/sugar/egg mixture. The frosting was nice--I hadn't tried that before and liked it.  The 2nd time, I modifed the recipe based on a suggestion of another reviewer.  I substituted 1 cup oil for 1/2 cup shortening and 2 cups sugar for 1 1/2 cups sugar.  Also, I added 1-2 extra tablespoons of cocoa powder.  What a difference!  The cake was very moist with a stronger flavor (more traditional).  The color was gorgeous.  I split the layers and frosted with a double batch of cream cheese frosting.  Yummy! Everyone went nuts over the 2nd cake.  I have a small dessert business and I received 2 orders (for the holidays)for the 2nd version of the cake after friends/clients tasted it.  Thanks for the suggestions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TLBRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-29T21:44:29.783Z",
                "reviewBody": "I'm astonished and amazed to find an  red velvet cake that actually uses the CORRECT frosting!!!  Not sure why so many think that \"cream cheese frosting\" belongs on a red velvet cake.  I'm so delighted that this cake has no cream cheese frosting -sorry but cream cheese frosting is NOT the traditional frosting on red velvet cake.  Kudos to you for posting a recipe that is *Almost* like my family recipe, ours calls for 3 Tbsp of cocoa, and no vinegar. The vinegar is un-necessary, especially when the recipe contains buttermilk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "thedailygourmet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thedailygourmet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-13T12:37:18.603Z",
                "reviewBody": "I made this cake with the changes other reviewers recommended, and it was fantastic!  I used one cup of oil instead of the shortening, two cups of sugar instead of 1 1/2 cups, and an extra tablespoon of cocoa powder.  Also, I only used 1 ounce of food color because that's all I had and it gave it a nice red color.  I think 2 ounces would be overkill.  I did make the mistake, though, of sifting the cocoa powder together with the flour, and the food dye with the buttermilk, thinking it made more sense to do it that way, but I ended up with some brown swirls.  \nThe second time I made this, I did everything except I made the cocoa powder and food color into a paste like you're supposed to and the color turned out an even red color.  Also, the second time I made it into cupcakes and baked them at 325 degrees for about 25 min.  The frosting is to die for!  I'll be using that on most every cake from now on!  Thanks for a great recipe and all the reviewers' suggestions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jody Campos Dowling",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2137950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-07T22:05:56.177Z",
                "reviewBody": "If you don't have buttermilk on hand, mix 1T vinegar with 1C milk, allow it to set for about 5 minutes. This will allow it to curdle to the point where it is sour in a manner similar to buttermilk, and you can EASILY use THIS as a substitute.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SkerlieBee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/46408/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-27T06:08:54.31Z",
                "reviewBody": "I have this recipe that was deemed \"original\" from a newspaper clipping almost 40 years ago!  This recipe is identical and it is wonderful!  I followed the recipe to the letter.  And please keep trying on the icing.  It is wonderful!  It must be cold, as stated, and to be sure that it isn't grainy, I used powdered sugar instead of granulated.  I cut the 2 layers of cake (9\") in half, and the 4 \"layers\" were beautiful.  (I also doubled the icing recipe and had more than enough).  Absolutely excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy Cantrell Dyck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1339525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-13T18:50:55.427Z",
                "reviewBody": "This is a wonderful traditional Red Velvet Cake recipe and the frosting puts it over the top. Having read through the comments I think this recipe is problematic because people have made modifications that effect the chemistry of the cake. RV cake gets it's rich red color from the baking soda reacting with the Ducth processed cocoa. Vinegar and buttermilk are the acidic ingredients that are the catalyst for the b. Soda. This leavening reaction creates CO2 which effects the cakes volume along with the taste texture and color. Substituting baking powder can cause the cake to be crumbly overbrown and bitter. It's also not recommended to exchange solid fats - shortening with liquid oils. Solid fats when beaten with sugar hold air bubbles making the cake moist.. Oils don't hold the air bubbles this makes the cake dense and dry. The baker's rule only substitute like for like. If you don't want to use shortening then you can sub butter so long as the fat content is at least 80%. For 1/2 cup shortening sub 1/2 cup butter 1 tbsp of water. Also when greasing the pans it's best to use shortening butter or oils can be absorbed into the batter as the cake bakes causing it to stick to the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6267271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-07T10:27:59.233Z",
                "reviewBody": "I really like this cake but only gave it four stars because of all the modifications I had to make.  I took other reviewers' advice and made the following changes:  used 4 tbsp. cocoa which I added to the 1 cup oil instead of shortening; increased sugar to 2 cups; only used 1 oz. of red food coloring which I added to the buttermilk (believe me, it was plenty and my cake was bright red); upped the vanilla to 1.5 tsp and upped the vinegar to 1 tbsp.  I did not use the frosting recipe because I wanted a cream cheese frosting and even though this one is advertised as cream cheese, it does not contain any.  Instead, I used the Cream Cheese Frosting II from this site and it was divine (with modifications).  Thanks for a good bare bones recipe but do make modifications before trying it yourself!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SHCMEOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/313595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-20T01:10:09.42Z",
                "reviewBody": "This is the absolute worst cake recipe I have ever tried in my 3 years of cake baking. Not only was the cake batter thick but the whole mess was overwhelmed by the cocoa taste. The so called frosting was a soupy butter milky sugar-filled slop of pure liquid. I reccomend this recipe to no one. I waster two batches worth of ingredients on it. Both time i followed the instructions exactly. If you're thinking about making a red velvet cake this is not a recipe for it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "derekdm901",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/867047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-28T16:02:13.983Z",
                "reviewBody": "Very Yummy.  And I am not much of a chocolate fan. I added the one cup oil, instead of the shortening.  I also added 2 cups sugar, total. And increased cocoa to 4 TBSPs. I didn't make a cocoa food coloring paste.  I added the food coloring to the buttermilk and the cocoa to the butter sugar mixture.  The color was beautiful, no swirls, and the flavor was amazing. I used a store bought vanilla frosting.  This is one of my favorite cakes.  I think next time I will use 1 TBSP of vinegar, as most other redvelvet cakes call for that amount, even the other one by Eleanor Johnson (who did this recipie too.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon Hewett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/747447/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Red Velvet Cake I",
            "description": "See how to make a stunningly beautiful red velvet cake.",
            "uploadDate": "2012-12-04T20:42:58.398Z",
            "duration": "PT5M33.416S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F114481ab-022c-4770-8493-616d68746a6c%2F24df83cd-6443-4ef7-94b8-fac133f3cd20%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2011328783001"
        }
    }
]