[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/727/world-cuisine/european/swiss/",
                    "name": "Swiss",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7433/baumkuchen/",
        "name": "BaumKuchen",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F05%2F07%2F7433_Baumkuchen_MFS_01-1-2000.jpg",
            "width": 2000,
            "height": 1333
        },
        "datePublished": "1998-05-06T10:47:30.000Z",
        "description": "A true Swiss Baumkuchen is almost impossible to make at home.  It requires a rotating spit, and almost a gallon of batter, and loads of time.  This is a smaller version, although it too takes time.  The results taste a little like a Kit-Kat bar. The many layers will remind you of the famous Dobostorte.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 -9 inch square cake",
        "recipeIngredient": [
            "⅞ cup unsalted butter, softened",
            "1 cup sifted confectioners' sugar",
            "⅞ cup cornstarch",
            "5 ½ ounces almond paste",
            "1 ½ teaspoons vanilla extract",
            "1 pinch salt",
            "2 egg yolks",
            "6 egg whites",
            "¾ cup white sugar",
            "¾ cup all-purpose flour",
            "9 (1 ounce) squares semisweet chocolate",
            "2 ½ teaspoons vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Butter a 9 inch square metal pan.  Place a sheet of parchment paper in the bottom.  Butter the parchment, and flour the whole pan.  Position the rack of the oven to the lowest level, and preheat the broiler.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream the butter or margarine until light and fluffy.  Add in the almond paste in small chunks; beat until smooth.  Add the confectioners' sugar, cornstarch, vanilla, and salt.  Beat in the yolks one at a time, beating well after each addition.  Beat until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another bowl, beat the egg whites to soft peaks.  Add in the sugar slowly while continuing to beat the meringue to stiff, glossy peaks.  Fold the meringue into the yolk mixture.  Sift the flour over this, and fold in.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon a small amount of batter onto the parchment in the baking pan.  With a pastry brush, paint the batter on.  You want to cover the paper completely, but have a thin layer.  Place under the broiler, and cook until light brown; this should take about 1 to 2 minutes.  Brush another layer of the batter over the cake, and place under the broiler.  Continue on in this way until all of the batter is used.  Cool completely.  Turn the cake out of the pan, and trim the edges clean.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a double boiler, combine the chocolate and the oil.  Heat until the chocolate is smooth.  With a pastry brush, brush one side of the trimmed cake with some chocolate.  Don't make it too thick. Allow this to harden.  Turn the cake over, and brush the other side.   Allow the cake to set.  Cut the cake into 6 narrow strips, each about 1-1/2 inches wide.  Brush the sides and top with the glaze, and allow to set.  Store in the refrigerator, but serve at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Swiss"
        ],
        "recipeCuisine": [
            "European",
            "Swiss"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kevin Ryan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.777777777777778,
            "ratingCount": 9,
            "itemReviewed": "BaumKuchen",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "461.7 calories",
            "carbohydrateContent": "55.9 g",
            "cholesterolContent": "69.7 mg",
            "fatContent": "25.6 g",
            "fiberContent": "2.3 g",
            "proteinContent": "5.9 g",
            "saturatedFatContent": "13 g",
            "servingSize": null,
            "sodiumContent": "32.6 mg",
            "sugarContent": "33.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-08T05:51:13.133Z",
                "reviewBody": "Please let me share with you the history of this cake. It was originaly baked in a open fireplace and spooned over the spit that was then turned by hand just a meats used to be cooked on a spit and when the cake was done it had a hole in the center and the outside was not nice and smooth but had the texture of treebark therefore the name Baumkuchen or Treecake.\nA very old receipe still available in german back shops today. Enjoy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2034882/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-14T19:05:21.013Z",
                "reviewBody": "very good. though it doesn't has to take too much time and affort: I used a disposable mini tube pan, and simply pured the batter in thin layers one over the other. when done, and still very warm, i covered the surface with chunks of semisweet chocolate and after they melted simply spread it over, then chilled the whole thing, turned it over took the cake out and coated with chocolate. to make a true swiss baumkuchen just dubble the batter and bake it as suggested above in three 7\" springform pans, \"paste\" the cakes when done with warm apricot jam (adds flavor and color) one on top of the other then cover the whole thing with cocolate frosting. this is originaly a very tall cake as the name suggests: baum = tree.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHALH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1441847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-17T17:04:11.34Z",
                "reviewBody": "If you dont have a rotating spin you can also use a square pan that the japanese use along with a rolled up aluminum foil half an inch big to where it'll fit right in the square pan dont forget to cover the rolled aluminum with oil. Use the same technique that you use to make a tamagoyaki (put this in youtube to see how its done) a rolled up egg dish. you put a thin batter on the square pan let it cook until light brown as mention on #4 then put in the rolled up aluminum on the top carefully use a spatula and roll it down to the bottom. take the battered aluminum out carefully and do the same thing over again with the cooked batter then putting the battered aluminum on the top and roll it to the bottom again. repeat the steps hope this helps i actually saw this on a cooking/romance series",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn Nguyen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4691999/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T20:03:52.217Z",
                "reviewBody": "this is amazing. i'm not swiss but found the recipe looking for swiss recipes for a themed new years dinner party. this looked too interesting to pass up. it's delicious!! very labour intensive but came out worth it in the end. you can not do anything else while you make this. watch it in your oven as it browns in 1 minute!! spongey cake layered with chocolate...how can you go wrong? the only thing i noticed was the amount of chocolate stated for the topping is WAY too much. could have used 1/2 to 3/4 and it would have been plenty. thanks for the great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OldFashionedFoodie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/oldfashionedfoodie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-22T21:46:45.26Z",
                "reviewBody": "This cake is AMAZING. I was searching for a recipe for Baumkuchen after watching a contestant make this on Top Chef. This recipe works perfectly. My only advice: the almond paste is difficult to mix with the butter/cornstarch/powdered sugar mixture so I grated the almond paste first and then mixed it with a pastry blender. Not hard to make at all once you get a sense of how hot your broiler is and how thin to make the layers (and it's fine if the first few are a little too brown because it's all covered up anyway). It's a total wow dessert and absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MichelleK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6947080/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-12T10:08:35.81Z",
                "reviewBody": "A lot of work but worth it. It is a very good and unique dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookin'mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/249327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-05-13T20:10:54.177Z",
                "reviewBody": "I ate a kit kat on last halloween from trick or treating and it was very fun and good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Darian Nasirzadeh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25567137/"
                }
            }
        ]
    }
]