[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7466/deep-chocolate-raspberry-cake/",
        "name": "Deep Chocolate Raspberry Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3578761.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1998-05-11T18:40:59.000Z",
        "description": "Rich chocolate paired with raspberries--this cake is moist and fudgy. For a special treat, garnish it with fresh raspberries!",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H25M",
        "recipeYield": "1 9-inch layer cake",
        "recipeIngredient": [
            "6 (1 ounce) squares semi-sweet chocolate",
            "6 (1 ounce) squares unsweetened chocolate",
            "7 eggs, separated",
            "1 cup all-purpose flour",
            "1 cup butter, room temperature",
            "2 cups white sugar",
            "1 ½ teaspoons vanilla extract",
            "6 (1 ounce) squares semisweet chocolate",
            "¾ cup heavy whipping cream",
            "1 (4 ounce) package frozen raspberries, thawed",
            "3 tablespoons seedless raspberry preserves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). Line bottoms of two 9-inch cake pans with parchment or waxed paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Cake: Melt 6 ounces of semisweet chocolate and 6 ounces of unsweetened chocolate in the top of a double boiler, or in a microwave. Cool, and beat in egg yolks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat butter, 1 1/2 cups sugar, and vanilla until light and fluffy. Add chocolate mixture, and continue beating until smooth. Stir in flour until just combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another bowl, beat egg whites until foamy. Gradually beat in 1/2 cup sugar, and continue beating until the whites hold soft peaks. Fold whites into chocolate batter, in three additions. Pour batter into prepared pans, and smooth tops.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until a toothpick stuck into the centers of the cakes comes out with moist crumbs, about 45 minutes. Cool in pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Frosting: In a saucepan, bring cream just to a boil. Chop 6 ounces semisweet chocolate, and stir into the cream. Remove saucepan from heat, and continue stirring until smooth. Pour frosting into bowl, and press sheet of plastic wrap directly against surface of chocolate to prevent a skin from forming. Refrigerate until thick enough to spread.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Filling: Drain the thawed raspberries, if necessary, and combine with the jam. Sandwich the cake layers with raspberry filling. Spread top and sides with chocolate frosting.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Roz F."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.186206896551724,
            "ratingCount": 145,
            "itemReviewed": "Deep Chocolate Raspberry Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "629.4 calories",
            "carbohydrateContent": "67.9 g",
            "cholesterolContent": "169.5 mg",
            "fatContent": "40.2 g",
            "fiberContent": "5 g",
            "proteinContent": "9.1 g",
            "saturatedFatContent": "23.6 g",
            "servingSize": null,
            "sodiumContent": "159.2 mg",
            "sugarContent": "52.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-26T19:06:43.03Z",
                "reviewBody": "I normally follow the recipe exactly the first time through but this time I was having company and I wanted it to be beautiful. I not only doubled the raspberry filling, but I cooked the berries on top of the stove with sugar, cornstarch and a raspberry liqeuer. This way the cake presented well and didn't get soggy with berry juice. Good cake Roz.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-24T01:09:50.38Z",
                "reviewBody": "This was a fantastic, rich, gooey cake that had every chocolate lover happy.  I made this cake for a friend's birthday and now everyone wants me to make their cakes from now on.  Thanks for the recipe!  DELICIOUS!\n\n**If you don't like dark chocolate, I would suggest using more of the semi-sweet to milk-chocolate squares instead.  It was a little too rich for me, but everyone else loved it.  Also, I used buttercream frosting instead of the frosting listed.  It gave me more room for creativity and evened out the bitterness in the chocolate.  For the raspberry filling, I cooked it with raspberry liquor, doubled the raspberries, raspberry preserves (seedless), and a little cornstarch to make it more of a gel.  I filled the cake and then used the rest for the the top. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina Tellifson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2577459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-26T13:58:44.043Z",
                "reviewBody": "This cake was pretty awesome. A tad bitter for my taste but anyone that likes chocolate would love this. I couldn't swallow it without milk. The baking time is too much. The batter is very thick and brownie like and so I checked it every 5 mins after 25 mins of baking. A lot of people wrote that the cake was too crumbly. That might be because it was over baked or maybe the eggs weren't beat enough. I had to beat my eggs by hand. Also the filling was too little. 4oz is just not enough. I had 6 oz of raspberries. For every ounce of raspberry i added.75 oz jam. If some people want the cake to be sweeter strawberry would probably work. And the frosting. Some people said it was too thick that might be because the cream was boiled too long. And if it was too liquidy maybe it needed to cool more. My cake looked so pretty that I didn't feel like eating it. hehe. And as the title says the cake IS very fudgy...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rosemary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1501168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-20T01:40:30.607Z",
                "reviewBody": "This cake is inferior to most I have had. The raspberry filling is lovely but use that idea with a better cake recipe. The cake comes out with a dry texture and a remarkably plain taste -- frankly the plain chocolate you use in the recipe tastes better than the cake. In addition it's a lot of fat for so little flavor. Furthermore preparation is quite hard especially folding the egg whites into the very heavy chocolate-laden batter. I do not recommend this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ACONTORER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/950943/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-22T17:44:36.01Z",
                "reviewBody": "There are other cakes out there that are easier to \"deal with\" and just as tasty, but if you want to give this cake a try here are a few things that I learned.  1) When whipping your egg whites add your sugar at the very end.  Your whites will form the soft peaks better when there is no sugar. 2) Frost the top of your top layer before assembling.  The raspberry filling oozes out - EVERYWHERE.  3)  If you want A LOT of raspberry filling (like I did) I found out that by making three layers I could make holes in the middle layer by using a small biscuit cutter (about the size of a quarter).  The holes held the filling and the \"leftovers\" make great bite-size cakes.  4) Make extra frosting.  Because of the egg white/meringue added to the batter the cake is crumbly (not dry)therefore making the cake very hard to frost.  With the frosting in liquid form spoon/pour small amount on the cake - spreading gently. You want the frosting to absorb into the cake - you'll have an ugly 1st layer.  Allow the frosting to cool; on the cake and the remaining amount in the bowl (do not put the frosting in the fridge it gets too hard).  Once the frosting no longer drips off your frosting apparatus you are ready for layer two.  HOPE THIS HELPS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2185051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-07T01:20:16.28Z",
                "reviewBody": "7/27/01 I am a chocoholic and love raspberries so for my 40th birthday when my husband asked what cake I'd like I suggested this one. It is the best cake I've ever put in my mouth. My 2l year old daughter says she wants it for her birthday. My younger children thought it was too much chocolate. If you love chocolate you'll love this cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TVENTURA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/406839/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T19:06:30.373Z",
                "reviewBody": "THIS IS AMAZING! If you are looking for the most delicious cake in the world stop right here. I made this for my high school graduation and it definitely eclipsed me as the main event. Worth every penny and every second. Delicious beautiful. My entire family adored it and I'm sure I'll be making it in the future. I also used fresh raspberries which I soaked in Grand Marnier overnight. Consider upping the amount of filling but superb the way it is. I wish I could give it more stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISSA2684",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-15T20:09:33.153Z",
                "reviewBody": "Cake is excellent and worth the effort to make. Very rich and chocolatey. I increased amount of raspberry filling - thought it should have more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOCHDB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/786015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-15T20:10:03.047Z",
                "reviewBody": "This is the best Chocolate Cake I have ever made! It is more like a torte' than a cake. I made it a year ago this Christmas for a friends party and from now on it will be a tradition for me to make it every year or on very special occasions. I loved it and I also received rave reviews from the guests at the party.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SNOOPYT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/761208/"
                }
            }
        ]
    }
]