[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/400/desserts/cakes/yellow-cake/",
                    "name": "Yellow Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7524/seven-up-cake-ii/",
        "name": "Seven-Up&reg; Cake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7371719.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1998-05-20T19:59:48.000Z",
        "description": "This Bundt&reg; cake made with 7-UP&reg; is features only a few ingredients and steps for an easy dessert.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 12 cup bundt cake",
        "recipeIngredient": [
            "1 ½ cups butter",
            "3 cups white sugar",
            "5 eggs",
            "3 cups all-purpose flour",
            "2 teaspoons lemon extract",
            "¾ cup lemon-lime flavored carbonated beverage"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cream together the butter and sugar for 20 minutes.  Add eggs, one at a time.  Add flour, lemon extract and fold in the 7UP &trade;  soft drink.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into a well-greased 12 cup Bundt pan.  Bake at 325 degrees F (165 degrees C) for 60 to 75 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Yellow Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JJOHN32"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.56,
            "ratingCount": 300,
            "itemReviewed": "Seven-Up&reg; Cake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "548.9 calories",
            "carbohydrateContent": "75.7 g",
            "cholesterolContent": "138.5 mg",
            "fatContent": "25.4 g",
            "fiberContent": "0.8 g",
            "proteinContent": "6.1 g",
            "saturatedFatContent": "15.3 g",
            "servingSize": null,
            "sodiumContent": "195.1 mg",
            "sugarContent": "50.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-19T00:52:27.123Z",
                "reviewBody": "This was a very good cake that was easy to make. I followed another reviewer's advice and used 2 tsps of lemon extract and 1 tsp of vanilla extract. If you're not looking for a strong lemon flavor, you're going to want to go easier on the lemon. \r\n\r\nYou also don't need to cream the butter and sugar for 20 minutes. I used a hand mixer on a medium setting for less than 5 minutes. I can only assume Eleanor mixes by hand to warrant 20 minutes. Even then, it seems excessive. Just make sure it's completely blended (aka there is no sugar that bears a striking resemblance to instant potato flakes).\r\n\r\nIt does look like it makes too much batter for one Bundt, I ended up reserving some. Don't. The cake didn't rise enough to warrant my fear.\r\n\r\nMy only real complaint with the cake is that it really needs a glaze or frosting to really make it pop. There are a couple of glazes suggested by other reviewers, be sure to have the ingredients handy as this isn't really a stand alone cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Thalisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/135298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-11T16:13:52.26Z",
                "reviewBody": "I have been using this wonderful recipe for years. It is important to cream the butter and sugar for 20 minutes, otherwise the cake may come out on the heavy side. Also, add your eggs one at a time (beating afterwards). When adding the flour and 7-Up, alternate (a little flour, then a little 7-Up) until gone. You will you have the best results if these directions are followed. Lastly, this cake can be time consuming so it is best if you use a stand mixer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LT X",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2598253/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-29T02:36:59.867Z",
                "reviewBody": "This is like having a piece of sugar heaven!!!.. I have been craving a 7-up cake like my aunt used to  make..This is it!!..I made mine into 6 mini bundt cakes..The only changes I made was I did not beat 20 minutes, I did mine for about 8 minutes..I added 1 teasp. of Vanilla..and substituted lemon juice for lemon extract..It turned out beautiful!!!!...I also made a glaze (1 cup powdered sugar & 2 tblsp milk) and drizzled that over each bundt cake and added a few chopped walnuts to the tops of the ones my husband is taking to work...He loves nuts on anything!!.. If you have any hesitation about making this at all, just do it!!!...Its the best, it really does melt in your mouth!.We have company coming for dinner next week and Im going to make it again so that everyone will have their own mini bundt cake, and that way I dont have to share mine!!! ...LOL",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IGLOOSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/459038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-29T01:13:40.687Z",
                "reviewBody": "Seven-Up Cake is the BEST cake ever, a classic dessert. It's a tradition in my family, and everyone who tries it, absolutely loves it. There's just something about it that makes it a very special cake.\n\nA few tips: Please cream your butter for a few minutes first on high speed. Then cream the butter and sugar together for 15-20 minutes...knowledgeable cooks know that this makes ALL the difference. Beat for one minute after adding each egg, on a high speed. The egg mixture should be incredibly fluffy. I then add THREE tsp. of vanilla extract, then beat in my flour and 7-UP in stages (one cup of flour, then 2 oz. of 7-UP). Beat for one minute after each 7-UP addition. Finally, add THREE tsp. of lemon extract, and beat it all together. Also, it is very easy to overbake the cake, so start checking it at 50 minutes. 75 minutes is usually way too much. Finally, you can add up to 8 oz. of 7-UP--just play around with the amount that suits your taste. Seven-Up cake is time consuming, but oh so worth it for special occasions!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Serenity",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3336340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-15T14:04:41.717Z",
                "reviewBody": "This cake was great!! I made it for my mom yesturday (Mother's Day) and she loved it!! I will definitely make it again. \n\nI may never return to box cakes!!\n\nI even made a glaze to drizzle on top out of 1 cup powder sugar, 2 tsp. milk, and 2 tsp. vanilla extract and a splash of 7-up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NaturallyMara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1875550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-27T02:15:52.653Z",
                "reviewBody": "This cake was Great.  As I was making this cake,  I was a little concerned because I only creamed the  butter and sugar for 5 mins. I tasted some of the batter and it was grainy and then I really started to worry. The recipe calls for you to cream the butter and sugar for 20 minutes and I did not do so. I started to second guess myself about my decision to cream the butter and sugar for only 5 min instead of the 20 minutes or even the 10 minutes as most reviewers did.  But not to worry,  I put a lemon glaze icing on the cake while it was hot and the cake was WONDERFUL.  This was a relief to have such a wonderful cake and it was so easy to make.  I have to make this cake again next week for a friend,  so I said,  I will at least cream the butter and sugar for 10 minutes just to see if it makes a difference but honestly,  I don't think it will.  I just don't think the cake can get any better but if it does then I will definitely be surprised and the winner. I made this cake for a Saturday event and there was no cake left, so I guess all of our guests felt as I do that this was a wonderful cake. I received many compliments on this cake.  Thanks for sharing this great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSBETTYE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/848003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-20T14:46:25.983Z",
                "reviewBody": "just a little note i made a lemon glaze using an half an bottle of pure lemon extract a box of confectioner's sugar and 1/3 cup of hot water. mix well let the cake cool and drizzle it over the top it got rave reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FAYTHD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/480309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T20:51:10.46Z",
                "reviewBody": "I am a baker by trade for over 37 years. I always make this recipe. If you use only cake flour for this recipe I'm sure you will have a hit on your hands. My aunt refuses to eat anything else that I bake. I make over 52 different cakes alone but she refuses to try any of them because this is her absolute favorite. She will be 73 years old December 28th. I also use Virginia Dare Lemon extract. I invert the recipe I have for the extracts though. My recipe calls for 1 T vanilla extract and 1 t lemon extract. I was given the recipe from a neighbor about 26 years ago after tasting the cake she made. I also never beat my sugar and butter for more than five minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Delores A Diakite",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1905830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T00:09:51.403Z",
                "reviewBody": "I have used this recipe for years. I did learn to cream the butter and sugar for at least 10 min and not to blend much after the flour is added. This really helped the consistency of the cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lmartin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2622501/"
                }
            }
        ]
    }
]