[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14683/desserts/cakes/cheesecake/new-york-cheesecake/",
                    "name": "New York Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7546/cheesecake-supreme/",
        "name": "Cheesecake Supreme",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6800200.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "1998-05-10T13:04:41.000Z",
        "description": "This is the best cheese cake ever, a true New York cheese cake!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "1 - 9 or 10 inch springform pan",
        "recipeIngredient": [
            "1 ½ cups graham cracker crumbs",
            "½ cup white sugar",
            "¼ cup butter, melted",
            "5 (8 ounce) packages cream cheese, softened",
            "5 eggs",
            "2 egg yolks",
            "1 ¾ cups white sugar",
            "⅛ cup all-purpose flour",
            "¼ cup heavy whipping cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the graham cracker crumbs, 1/2 cup of the white sugar, and the melted butter together. Press mixture into the bottom of one 9 or 10 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine cream cheese, eggs and egg yolks; mix until smooth. Add the remaining 1 3/4 cups white sugar, the flour and the heavy cream. Blend until smooth. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F (200 degrees C) for 10 minutes, then turn oven temperature down to 200 degrees F (100 degrees C) and continue baking for 1 hour, or until filling is set. Let cheesecake cool, then refrigerate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "New York Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Muffy Nasner"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.595330739299611,
            "ratingCount": 771,
            "itemReviewed": "Cheesecake Supreme",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "609.6 calories",
            "carbohydrateContent": "49.4 g",
            "cholesterolContent": "231.3 mg",
            "fatContent": "42.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "11.1 g",
            "saturatedFatContent": "25.1 g",
            "servingSize": null,
            "sodiumContent": "399.4 mg",
            "sugarContent": "41.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-02T17:27:02.2Z",
                "reviewBody": "A++\r\n\r\nOk, I've made this cheesecake about 8-10 times perfecting the recipe.  I have it down now.  Don't you hate how the outside of the cheesecake is rought but the middle is creamy.  Follow my adjustments and it will be same texture all the way through, nice and creamy.  Also, make sure you make some restaurant style strawberry topping.  Try the \"supreme strawberry topping\" recipe here at allrecipes.com.  Adjust cooking time on it as appropriate (about 15 minutes).\r\n\r\nCheesecake recipe adjustments:\r\n\r\nDo not cook at 400 at all!  Do NOT preheat oven.  Prepare according to recipe and put in springform pan.  Put pan in over.  Now turn over to 200.  Cook for ~3 hours & 10 minutes. (give or take 10 minutes).  Should be a little firm when you turn the over off, but not real firm.  Turn oven off after the 3 hours and about 10 minutes.  Crack oven open and let cheesecake cool in over for 1 hour (or longer if you wish).  The put cheesecake in refridgerator for AT LEAST over night.  Best after full 24 hours.  Prepare \"supreme strawberry topping\" and put in refridgerator.\r\n\r\nWalla!  Best cheesecake ever.  Raves from friends of mine:\r\n\r\nthe skeptic: \"Its creamier than cheesecake factory.  Its hard to compare them...Honestly, I like this better.\"\r\n\r\ncheesecake enthusiasts: \"I used to eat cheesecake a lot.  Honestly [pause as she recounts all the cheesecakes she had ever had]....this is the best cheesecake I have ever had.  Really, this is the best.  The topping was good.\"\r\n\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brad G Reynolds",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/heislord5/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-15T13:24:52.357Z",
                "reviewBody": "SUPERIOR RECIPE BUT ONLY GIVEN FOUR STARS BECAUSE\r\nSUCCESS OF RECIPE DEPENDED ON OTHER REVIEWERS DIRECTIONS. CHEESECAKE TURNED OUT PERFECTLY USING THESE DIRECTIONS:  (1)  USE A GREASED 10-INCH PAN (2) USE ONLY 1/4 CUP SUGAR FOR CRUST (3) ADD 2 TSP. VANILLA TO CREAM CHEESE MIXTURE (4)  DO NOT PREHEAT OVEN; DO NOT USE A WATER BATH (5) BAKE AT 200 DEGREES FOR 3 HRS. AND 10 MINUTES  (6) TURN OVEN OFF AT END OF BAKING TIME (4) PARTIALLY PROP OVEN DOOR OPEN AND ALLOW CAKE TO COOL AN ADDITIONAL HOUR IN THE OVEN (7) REMOVE CAKE FROM OVEN AND REFRIGERATE 24 HRS. BEFORE REMOVING FROM PAN OR SERVING.  THESE DIRECTIONS  MADE A PERFECT, PERFECT DELICIOUS CHEESECAKE WITH ABSOLUTELY NO CRACKS!   TIP:  I ALWAYS PLACE A CARDBOARD CAKE CIRCLE INSIDE THE CHEESECAKE PAN.  I GREASE THE CARBOARD JUST AS I WOULD THE PAN. THE CARDBOARD WILL NOT BURN AND THE CAKE AND THE BOARD CAN BE REMOVED AT THE SAME TIME FROM YOUR PAN.  USING A CAKEBOARD ELIMINATES THE PROBLEM OF SCRATCHING THE BOTTOM OF YOUR PAN, OR LOSING THE BOTTOM OF THE PAN IF YOU ARE SERVING OR TAKING YOUR CAKE OUTSIDE OF YOUR HOME.  ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "The Cake Maker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/135083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-21T14:19:22.623Z",
                "reviewBody": "This is an old, tried and true NY cheesecake recipe and is absolutely the BEST (and I've tried lots of them).  I make mine with a few slight variations (I use a little less sugar and add lemon and orange zest).  \r\nWhile I have no objection to people making changes to a recipe to suit one's own taste, I am always astounded when people rate a recipe with an average or poor rating, then go on to describe how they've COMPLETELY changed the original recipe.  Apparently these people don't realize that, when they rate a recipe based on their own concoction that has little resemblance to the original recipe, they are SKEWING a recipe's rating, and possibly altering other readers' opinions about whether to try a recipe or not.  \r\nI would like to kindly suggest to persons who drastically change a recipe to refrain from rating it.  What you have created is a NEW RECIPE.  You should post it and rate it elsewhere on this website as such!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jenel25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1528293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T04:20:25.123Z",
                "reviewBody": "I followed the modifications suggested by Heislord5 on 10-02-01.  Cook 3 hours 10 min at 200 degrees, leave in the oven 1 hour after cooking time.  Turned out perfect.  I also added the suggested vanilla to enhance flavor.  A trick a chef friend of mine recommended was instead of the white sugar, substitute with confectioners sugar.    I also used 1/4 cup of flour instead of 1/8 listed to add thickness.  I had never cooked a cheesecake before and following this recipe with the suggested modification, it turned out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHERYLZYX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716999/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-10T16:14:06.747Z",
                "reviewBody": "This cheesecake rivals anything you will ever buy in a bakery or a fine restaurant! I've read all the tips and here's the scoop on the \"Undercooked\" problem. I baked it according to the directions but after the hour at 200 degrees, I simply shut the oven off. DO NOT PROP THE DOOR OPEN. I left the cheesecake in the oven for a few hours. Actually, I went to bed around 1am when the baking was done, got up for work at 5am, took the cake out of the oven and put it in the fridge. There were NO cracks and it was set perfectly! This is the best cheesecake I've ever had and can be the basic starter for any additions you may want to make, like chocolate chips or carmel sauce... give it a shot, it's easier than you think!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Knightcraft",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/833159/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-13T08:02:43.687Z",
                "reviewBody": "The BEST a true New York style cheesecake! All who have tasted it say it is the best they've had. Many people ask to buy this cake from me. I have made this cake many times and have used some revisions in the reviews. Make sure all ingredients are at room temp. before starting. I bake my crust at 325F for 10 min. and let it cool on a wire rack while mixing batter ingredients(use 1/2 stick of butter,crust will hold up better) Completely blend cream cheese. I also add 1 tsp. vanilla. I blend one ingredient at a time with a SLOW beater, don't over blend. Over beating will cause air bubbles on the top of cake. Absolutely use hot water bath (prevents cracking and drying out, boil water before then add to a sheet cake pan, or roasting pan and put on the bottom rack of oven before putting in the cake). Bake 3 hrs. 10 min. at 200F( Lower temp. will keep the cake from browning and drying out on the edges),  Crack oven door and cool for at least 2-3 hrs in the oven if you don't want any cracks (should be room temp.)Important tip: Chill the cake in the refrigerator at least 48-72 hrs. before cutting and serving it. Like fine wine, it needs aging. I have even froze left overs for a month and it is still incredible. I love it plain, but have fun and drizzle chocolate or caramel sauce on the top. Great with a berry topping too, but put it in a pretty bowl and serve it on the side. The top will get mushy if it's on the cake to long. Awesome recipe!!!!!! I love Allrecipes.com!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LKanalos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/503456/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-16T14:22:36.497Z",
                "reviewBody": "I am a great cook, and have won many awards for my desserts. When I say this is the best cheesecake you will ever make, I mean it.Only a few changes I made.Cook cheesecake at 200 degrees for 3 and half hours, at a preheated oven Then shut off oven and leave door ajar  for 1 hour. I also added vanilla to the batter. Came out perfect. This is the best New York cheesecake you will ever make. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz Valentino-Tetu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1243518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-04T14:21:35.14Z",
                "reviewBody": "I give the recipe 'as is' only 1 star, because if someone followed it exactly, they'd end up with a very undercooked, yucky cheesecake. Even though after an hour of baking, it's obvious that it will have to cook MUCH longer, for someone that doesn't read the reviews first, this could be a disaster/waste. Luckily I did read reviews first, and anticipated having to cook for the 3 hours instead of 1. I didn't alter the sugar amounts, but now I wished I would have. It was WAY too sweet, even for me, and I have a sweet tooth. :]Also, it is better if it sits overnight. Gives it plenty of time to set, otherwise it's a bit mushy. I don't know if there were typos in the original recipe or what, but with the adjustments of cooking time, and much less sugar, this is a 5 star cheesecake. Without adjustments, it's a mess of a recipe. Thanks to all that reviewed with the heads up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorielle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1409921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T04:20:24.84Z",
                "reviewBody": "My first time making cheesecake.  Leave out the sugar in the crust (it was too sweet).  Add a couple of tbsp of lemon juice into the cheese mixture to enhance flavour.  I baked this cheesecake as another reviewer had suggested:\r\n200 degrees for 3 hours and 10 minutes.  It was absolutely creamy and delicious, and it didn't crack because I let it cool down in the oven for another hour after turning it off.  My guests were VERY IMPRESSED.  All of them say that it was the best, creamiest cheesecake they had ever had. An easy recipe.  Go for it! You'll be glad you did.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTINECUSHING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/694270/"
                }
            }
        ]
    }
]