[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/718/world-cuisine/european/austrian/",
                    "name": "Austrian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7650/dobos-torte/",
        "name": "Dobos Torte",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2419.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "1998-06-05T10:46:56.000Z",
        "description": "The word 'dobos' means 'like a drum' in Hungarian. However, this cake is named after its creator, Hungarian pastry chef Josef Dobos.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 9-inch 6-layer cake",
        "recipeIngredient": [
            "9 egg whites",
            "8 egg yolks",
            "1 cup white sugar",
            "¼ cup milk",
            "1 tablespoon lemon zest",
            "1 pinch salt",
            "1 ½ teaspoons vanilla extract",
            "1 ½ cups sifted all-purpose flour",
            "½ tablespoon shortening",
            "1 cup white sugar",
            "1 recipe Chocolate Buttercream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (205 degrees C).  Have ready two 10-inch cardboard circles. Generously grease a 9-inch springform pan with soft butter, and dust with flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the egg whites until frothy, and gradually add 1 cup sugar. Beat just to soft peaks.  In another bowl, beat the yolks with the milk, lemon peel, vanilla, and salt.  Fold this into the egg whites.  Sift the flour over the egg mixture, and fold in.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread 1 1/3 cups batter into the prepared pan.  Bake for about 5 to 9 minutes, or until small, brown spots begin to appear on cake.  Remove the cake from the oven, and remove layer from pan with a spatula.  Dust the cake lightly with flour, and place on a rack to cool.  Grease pan again, and repeat this process until all of the batter is used, about 6 times more.  Place the layers between wax paper, and cover with a towel.  Chill layers for a few hours.  Make the Chocolate Buttercream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Layer the chilled layers on one of the cardboard rounds with the buttercream.  Start with one layer; cover with the buttercream, and then press down with another layer to make a good seal.  Repeat this with the remaining layers, but reserve one layer.  Wrap the cake in plastic, and chill for at least 6 hours along with the remaining buttercream.  Grease the other cardboard round with the shortening, and place the last layer on it.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 1 cup sugar into a non-stick skillet over medium heat.  Allow sugar to cook until the edges look melted and brown.  Begin stirring with a wooden spoon.  Cook until the sugar become an amber color, and is smooth.  Carefully pour the caramel over the top of the last layer, and spread to the edges with an oiled knife.  Quickly, using an oiled knife, indent the top of the caramel into 16 wedges.  Allow to cool slightly, and then retouch the indents with the knife again.  Place layer onto a counter top dusted with sugar, and allow the caramel to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place some more buttercream on top of the chilled torte, and top with the caramel round.  Frost the sides with the remaining buttercream.  Chill the torte before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Austrian"
        ],
        "recipeCuisine": [
            "European",
            "Austrian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kevin Ryan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.545454545454546,
            "ratingCount": 33,
            "itemReviewed": "Dobos Torte",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "242 calories",
            "carbohydrateContent": "46.2 g",
            "cholesterolContent": "137 mg",
            "fatContent": "3.7 g",
            "fiberContent": "0.5 g",
            "proteinContent": "6.3 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "49.4 mg",
            "sugarContent": "33.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-04-09T15:08:00.81Z",
                "reviewBody": "This worked out really, really well and was great!  Being half Hungarian, I decided that I needed to master the Dobos Torte.  This is the most comprehensive and well-written recipe I've been able to find (i.e. not assuming that you grew up making it and just needed a refresher).  I have a few suggestions to make this easier for folks trying it - 1.) Be prepared the batter is THICK! I just used the bottom of the springform pan and spread the batter onto it - it was a lot easier and no burns taking the thing apart to quickly get the layer onto the cooling rack.  The sides are not needed to keep the batter in and just got in the way.  2.) this made a tad too much caramel and people were peeling it off and setting it aside because it was too much to crunch through - it ended up being the thickness of brittle.  I'll reduce by half next time so that it's more of a glaze.\r\n\r\nThanks, Kevin!  I owe you one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1026448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-25T23:22:32.78Z",
                "reviewBody": "That was really good but I am not certain that it tasted how I remembered it tasting back home. Two tips: (1) Instead of measuring batter layers as 1 1/3 cups each separate the batter into 7 equal amounts to avoid problems with varying batter volume. I had trouble getting 7 layers out of the batter - only got 4 and a bit 1 1/3 cup each as per the recipe. I used organic free-range eggs (denser so less volume) which may have been the problem. (2) Make sure you pour the melted sugar over a perfectly level layer or else it will just run down from it. This was a fairly annoying way for me to discover that the countertop is not quite level:-D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HIKOSKO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1126894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-05T17:24:27.22Z",
                "reviewBody": "This torte is absolutely delicious. However the recipe calls for icing sugar in the buttercream. The original recipe uses a cooked sugar syrup and egg yolks. I would give this one 5 stars had it not been named \"Dobos\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NeedleDodger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2251168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-02T02:33:49.313Z",
                "reviewBody": "I finally had the chance to make this for my mum's birthday with great success. My family loved the \"waffer-like\" layers of cake. The chocolate buttercream frosting might seem too rich but trust me it goes really well with the mild flavor of the cake. I'd recomend chilling the whole thing before serving and storing in the refrigerator (the frosting held up and tasted better cool/cold). I'd also recommened working on making the frosting and caramel toping while you bake the cake layers because this recipe takes quite a bit of time. Can't wait for an excuse to make this again;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kellianne Rumsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2366932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T19:16:29.18Z",
                "reviewBody": "I made this recipe as a weekend project and I am very glad I allotted so much time for it! However I knew something this fancy would take a long time and it was definitely worth it! Rich creamy buttercream and light eggy cake! Don't even get me started on the caramel...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Snow_Day_Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3500844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-22T21:40:27.72Z",
                "reviewBody": "One of the most authentic recipes. But their are two problems: Dobos means drummer in Hungarian, not \"like a drum\" and please give us back Jozsef Dobos to us Hungarians, because we are very proud of him. And since he was born in Hungary and died in Hungary, and he had his pastry shop in Hungary, and he created Dobos Torte in Hungary, I assume this makes him Hungarian. Thank you very much,",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4337521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-11T23:04:26.01Z",
                "reviewBody": "I made this for my father-in-law who used to make a dobos torte.  I followed this cake recipe to a \"T\" and it came out perfect.  I used 9\" pans that are just flat disks my in-law had made years ago.  I put parchment paper on it before I poured batter.  WOrked like a charm, when I took out of oven I flipped it onto a cookie sheet lined with more parchment paper and then you peel of paper and let cool...Cake tasted great and father-in-law LOVED it and said it was perfect!  I did use a different chocolate buttercream frosting though...Oh, and I found if you use 1 1/4 dry measure cups of batter, you will get 6 cakes exactly.  This recipe is SO easy too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3485711/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-11T13:41:26.03Z",
                "reviewBody": "A bit time consuming to make and unhealthy as they come but the result is stunning! Took it to a gathering and everyone loved it and brought home seconds. I cut the sugar in the buttercream to 3 cups but it's still a little too sweet for me. Next time I will try 2 or 2 1/2 cups.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnInHK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/422932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-20T02:46:01.63Z",
                "reviewBody": "this recipe was good but as a hungarian myself I must say the frosting was not what I have grown up with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "FUNGRAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1031579/"
                }
            }
        ]
    }
]