[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
                    "name": "Apple Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7700/autumn-cheesecake/",
        "name": "Autumn Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4556947.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "1998-05-27T18:17:59.000Z",
        "description": "This is a delicious Apple Cheesecake that I usually make in the fall.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT4H0M",
        "recipeYield": "1 - 9 inch springform",
        "recipeIngredient": [
            "1 cup graham cracker crumbs",
            "½ cup finely chopped pecans",
            "3 tablespoons white sugar",
            "½ teaspoon ground cinnamon",
            "¼ cup unsalted butter, melted",
            "2 (8 ounce) packages cream cheese, softened",
            "½ cup white sugar",
            "2 eggs",
            "½ teaspoon vanilla extract",
            "4 cups apples - peeled, cored and thinly sliced",
            "⅓ cup white sugar",
            "½ teaspoon ground cinnamon",
            "¼ cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). In a large bowl, stir together the graham cracker crumbs, 1/2 cup finely chopped pecans, 3 tablespoons sugar, 1/2 teaspoon cinnamon and melted butter; press into the bottom of a 9 inch springform pan. Bake in preheated oven for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine cream cheese and 1/2 cup sugar. Mix at medium speed until smooth. Beat in eggs one at a time, mixing well after each addition. Blend in vanilla; pour filling into the baked crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together 1/3 cup sugar and 1/2 teaspoon cinnamon. Toss the cinnamon-sugar with the apples to coat. Spoon apple mixture over cream cheese layer and sprinkle with 1/4 cup chopped pecans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 60 to 70 minutes. With a knife, loosen cake from rim of pan. Let cool, then remove the rim of pan. Chill cake before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Apple Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.72883064516129,
            "ratingCount": 992,
            "itemReviewed": "Autumn Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "341.3 calories",
            "carbohydrateContent": "30.3 g",
            "cholesterolContent": "82.2 mg",
            "fatContent": "23.4 g",
            "fiberContent": "2 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "11.4 g",
            "servingSize": null,
            "sodiumContent": "165.5 mg",
            "sugarContent": "23.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-29T18:09:50.797Z",
                "reviewBody": "To save you teh time of looking through over 200 reviews,here is the general consensus of the previous reviews:This cheesecake is awesome. But double the cheesecake ingredients or it will be runny. Microwave the apples for a few minutes to soften them before adding them to the topping. Bake in a water bath if possible, or at least put a pan of water on the oven rack below. Bake at least 70 minutes and let cool in the oven with the door open for 45 minutes to an hour. I used all these tips and was glad. I add these tips of my own: You can omit the pecans in the crust and add more graham cracker crumbs. An apple corer/peeler/slicer is perfect for this recipe. Finally, in a small bowl I mixed a handful of brown sugar, a handful of flour and cut in a few small chunks of butter and spread it over the top of the apples befor baking. It created a light crumb crust which was awesome and improved the apprearance of the cheesecake (which seemed to be a concern to other reviewers). Great recipe! Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NOELC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/847512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-03T01:45:06.613Z",
                "reviewBody": "In a word - Fabulous! If you LOVE apples and you LOVE cheesecake then this dessert is for you! I had my eye on this for a while and decided to make this for Thanksgiving and was so glad I did! The crust is awesome. The cheesecake itself is oh so creamy - definitely double it for this recipe as this is more of a New York Style cheesecake. The topping is equally delightful. You really need to microwave the apples to get them tender first. I also took the advice of another reviewer and did a streusel topping - flour, brown sugar, cinnamon, and butter combined until crumbly. I threw that over top before baking the cheesecake in a water bath (definitely do a water bath). This cheesecake turned out so incredibly good that I'll definitley be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T04:17:13.17Z",
                "reviewBody": "This really is fabulous.  After reading the multitude of reviews, I opted to increase the cream cheese to 3 pkgs., added one egg, and increased cooking time by 15 min. For the crust, I found graham crackers that were a combination of sugar, cinnamon and oats. To this I added half the sugar and additional cinnamon, and it seemed to require extra butter to hold together. This was the best crust I've ever tasted! I chose to use Macintosh apples, which I tossed with the pecans and a tablespoon of caramel sauce.  I was concerned about the apples making the cake watery, so I microwaved them for a minute before putting them on top.  I discarded about 1/2 Cup of juice, which may have affected the setting of the batter. You can taste the apples throughout the cake. Divine. I also used a water bath and kept it in the oven for 2 hours to cool. This rivals any cheesecake I have had, from any source. My recipe guinea pigs (coworkers)were extremely pleased. Go for it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAOSPARK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T04:17:41.903Z",
                "reviewBody": "I made this cheesecake for Thanksgiving and everyone loved it!  As suggested, I added 1 pkg cream cheese, 1 egg, 1/4 c sugar, and 1/4 tsp vanilla to make the filling thicker.  I also added ~1/2 tsp cinnamon to the filling to give it a little kick.  I used Fiji apples and also as suggested, I microwaved them (with the cinnamon & sugar) for about a minute and then put them on top of the cheesecake (w/o the juice).  I baked it in a water bath for about 70 minutes and it turned out beautifully!  Everyone at the party was shocked by my baking ability!!  I definitely recommend making this the night before as the cheesecake will get a chance to firm up and it will be even more fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jellyjar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6906/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-30T16:17:18.05Z",
                "reviewBody": "Much has been written about doubling the crust and filling ingredients and pre-cooking the apples - all great tips. Not as much, however, has been said about the wonderful texture and creaminess of this cheesecake. I'm sure the water bath has a lot to do with this, so don't skip this step. The filling is so good I think I'll use it as a standard recipe to use with other add-ins and toppings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-09T03:46:14.453Z",
                "reviewBody": "I preheated my oven with a pan of water under the rack (rather than the water bath).  For the crust, I 1-1/2'd the ingredients so I could reserve half for the topping, since some people said a more streusel-like topping was better looking/tasting. For that, I cut in butter chunks rather than melted it.  For the apples, I thinly sliced (less than 1/8 inch) four Galas, then cut them into smaller sections so the  cheesecake would be easier to slice (as some recommended).  Then I microwaved the apples for one minute (to soften and remove some moisture, as recommended).  After tossing with the cinnamon and sugar, I drained the excess moisture from the bowl.  For the filling, I decided to increase the ingredient amounts to 1-1/2 times since some people said the original recipe was too thin.  Once the crust had cooled, I poured in the filling and then spooned the apples on top.  Over that, I sprinkled about a third of the streusel mix and then reserved the rest to add during the last 15 minutes in case it overbrowned (as some people indicated).  I baked for 60 minutes, then checked it.  The topping had not overbrowned, but I added about another third of it to the cheesecake (it didn't need any more than that) and baked for another 15 minutes (total of 75 minutes).  I removed it from the oven and let it cool for approximately 20 minutes before removing the sides of the pan and refrigerating it.  My husband said it was \"amazing\"; PERFECT in texture and flavor.  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hotstuff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1539720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T04:18:05.09Z",
                "reviewBody": "Well, call me a believer now.  I'm now a part of the Autumn Cheesecake fanclub.  I just served it for a dinner party and it was sensational!  I enjoy cheesecake but will only have a small slice of it because it's so heavy and thick; this one I had 3 helpings of and I had to stop myself from getting another one.  Seriously, my husband helped himself to numerous slices and couldn't stop raving about it.  I've been burned from cheesecake recipes over the years--just too many not-so-great ones.  I made the Better Homes & Garden praline pecan cheesecake last year (major effort) and it tasted gooey and way too cheesy.  You felt like you had enough after the first bite.  But this one...well, it's in another class.  It's an exceptional cheesecake and I'm so happy \"Stephanie\" put the recipe online.  Just a note: I got a little confused about whether or not to press the crust up the sides of the springform pan. Usually recipes specifically state to do that. This one didn't. So for you people trying cheesecake for the first time, you need to press the graham cracker crumbs onto the bottom and up the side of the pan to form the complete crust (maybe it's just me).  And I used Fuji apples cut up very small, which gave it a crispness that I loved.  Just do it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPETROVICH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/161533/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-26T14:24:08.95Z",
                "reviewBody": "This was a HUGE hit at a cheesecake party.  I made the following changes after reading pages of reviews:  I doubled the crust mixture, and sprinkled half on the top with 20 minutes left to bake, I doubled the filling, I chopped the apples and then microwaved them until they were soft and drained the liquid before tossing with sugar.  It was beautiful and awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ACSENNEFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/504865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-13T17:16:56.547Z",
                "reviewBody": "I would give six stars if I could. It does have a good amt of prep time to it, if you don't want to feel rushed I would suggest peeling/coring/slicing the apples before starting on the rest of the recipe. I didn't do it until the cheesecake was in the pan and ready for them so I prepared them as fast as I could - and came really close to slicing my finger. I doubled the filling after setting my two 8oz cubes next to the springform and realizing how little filling there would be. It's also a good idea to microwave the apples for two minutes before putting them on top of the filling - gets some of the juice out and softens them a little. Drizzle the slices with chocolate syrup and caramel for a finishing touch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rocks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1764721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-08T08:07:51.92Z",
                "reviewBody": "If I could give this a zero I would the cheese cake went flat even though it cooked it for 65 mins and followed the instructions exactly. If I left it in a few minutes more it would have burned! I thought with all the great reviews it'd be amazing... I'll probably give it one more try but I m not sure it will make a difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Seba",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1495177/"
                }
            }
        ]
    }
]