[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14671/desserts/cakes/cheesecake/chocolate-cheesecake/",
                    "name": "Chocolate Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7713/brownie-caramel-cheesecake/",
        "name": "Brownie Caramel Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6582759.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1998-05-24T02:48:11.000Z",
        "description": "This is a great recipe that gets compliments when ever I make it. It is very rich, and worth the time and calories.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT4H30M",
        "recipeYield": "1 - 9 inch springform pan",
        "recipeIngredient": [
            "1 (9 ounce) package brownie mix",
            "1 egg",
            "1 tablespoon cold water",
            "1 (14 ounce) package individually wrapped caramels, unwrapped",
            "1 (5 ounce) can evaporated milk",
            "2 (8 ounce) packages cream cheese, softened",
            "½ cup white sugar",
            "1 teaspoon vanilla extract",
            "2 eggs",
            "1 cup chocolate fudge topping"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Grease the bottom of a 9 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together brownie mix, 1 egg and water.  Spread into the greased pan. Bake for 25 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the caramels with the evaporated milk over low heat in a heavy saucepan.  Stir often, and heat until mixture has a smooth consistency. Reserve 1/3 cup of this caramel mixture, and pour the remainder over the warm, baked brownie crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat the cream cheese, sugar and vanilla with an electric mixer until smooth.  Add eggs one at a time, beating well after each addition. Pour cream cheese mixture over caramel mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cheesecake for 40 minutes.  Chill in pan.  When cake is thoroughly chilled, loosen by running a knife around the edge, and then remove the rim of the pan.  Heat reserved caramel mixture, and spoon over cheesecake.  Drizzle with the chocolate topping.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "Chocolate Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JACKIE MEIBORG"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.356088560885609,
            "ratingCount": 542,
            "itemReviewed": "Brownie Caramel Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "512.2 calories",
            "carbohydrateContent": "68.9 g",
            "cholesterolContent": "93.2 mg",
            "fatContent": "24.1 g",
            "fiberContent": "1.4 g",
            "proteinContent": "8.2 g",
            "saturatedFatContent": "11.9 g",
            "servingSize": null,
            "sodiumContent": "354.9 mg",
            "sugarContent": "43.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-05-04T18:11:42.31Z",
                "reviewBody": "The first time I made this recipe, I used  the caramels and evaporated milk as directed. I used a standard brownie mix made according to package directions, baking it in a 10\" spring form pan well coated with Pam. I baked the brownie layer for 15 to 20 minutes then sprinkled the edges with some chopped pecans to prevent the caramel layer from leaking out. I sprinkled white chocolate chips over the baked brownie crust before I spread the caramel layer on. I took the advice of others and used 3 pkg.  of cream cheese, 3/4 c sugar and  3 eggs. I baked the cheesecake layer for 50 minutes. I had no problems getting it out of the pan and it was not hard to cut. It was marvelous. I decorated the top with carmel and fudge drizzles put through a pastry bag..\r\nI just made it for the second time and used the La Lechera Caramel flavor, although it is easier,  I do not think it tastes  as good as caramels w/ evaporated milk. I followed all the above steps and it baked nicely. We will \"taste\" the second creation  results on  Mother's Day.\r\nThis is definately a 5 Star recipe.  I come from a family of professional chefs and have done the baking for our restaurant for many years.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATHY A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1087826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-22T19:18:30.14Z",
                "reviewBody": "I have made this cheesecake many times. Some things I have adjusted. First do not cook the brownie crust as long as it says. If you do you will not be able to cut the cake! 10 minutes works fine for me. Also because this is a bit overpowering sweet, I have made the cheesecake portion 50% bigger. 3 creamcheese, 3 eggs, 3/4 cup sugar,1 1/2 vanilla. 60 minutes in the oven (check at 50 min). Everyone I have made this for, loves it!! I even made it for a bake sale, the price was $10 BUT alot of the people there have had it before and started Bidding on it. Last bid was $38, and the money went to a great cause. Enjoy!!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEATHER_0617",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/502577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-20T15:41:25.73Z",
                "reviewBody": "I am having issues with the brownie crust. I have made this twice and the brownie part comes out hard. According to the recipe the brownie is being cooked for 65 minutes. I think that is too long and is causing the brownie to be hard. Can some one provide me with how long the this recipe is suppose to be baked for?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "suzbriggs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1564463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-25T17:25:38.42Z",
                "reviewBody": "Taking the suggestions from other reviews, I used a 10-1/2 ounce package of brownie mix and followed the package directions.  Most important, again following the advice of others, I baked the brownie layer for only 12 minutes--and it was not long enough!  I wish I would have followed the recipe.  Other than that, it was a delicious cheesecake, and very pretty too.  I garnished it with pecan halves and used homemade hot fudge sauce. It's very rich, so small pieces are suggested!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-07T03:26:43Z",
                "reviewBody": "The good thing about waiting to make a recipe is that you can wait until it's been tested by others and learn from their mistakes and take their suggestions.  So that's what I did!  Make this recipe using a large size (for 13x9) brownie mix, use La Lechera (thanks to whomever offered that suggestion.  I'd never even heard of that before.), and increase the cheesecake layer by half.  Bake brownie layer for 20 minutes before proceeding.  This turned out wonderful!  We had it for a dinner party and it was the only dessert that totally disappeared! To all of the folks who tried this recipe as written with disasterous results - try it again with these alterations and you'll be pleasantly surprised.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill McLaughlin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20594/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-20T22:29:25.873Z",
                "reviewBody": "INSTEAD OF A 9\" PAN I USED A 7\". THEN USED THE SAME AMOUNT OF INGREDIENTS. I USED A PRODUCT CALLED LaLechera by Nestle (mexican food section-looks like a sweet condensed pan--Dulce de Leche) BASICALLY IT'S CARMEL SWEETENED CONDENSED MILK. SO YOU ELIMINATE THE WHOLE CARMEL PROCESS. SLIGHTLY WARM IT TO SOFTEN IT...THEN ONLY COOK THE BROWNIE 15 MIN. SPREAD THE LaLechera ONLY TO 1/2 \" FROM THE EDGE. FOLLOW THE REST OF THE DIRECTIONS.  THE END RESULT IS ABSOLUTELY FABULOUS. AND NO HARD BROWNIE STORY HERE!  YUMMY!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VOLLEYSKI00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/612912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:45:06.797Z",
                "reviewBody": "This was a HUGE hit at Easter!  I followed previous reviewers' advice and used the Jiffy brownie mix and baked the brownies for 10 minutes.  I then made the caramel and the cream cheese filling; I wrapped the bottom of the pan in tin foil and submerged it in a pan with warm water to bake-it was fabulous!  There wasn't a bite left and I had many requests for the recipe-thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-07T19:57:48.73Z",
                "reviewBody": "Well there's so many reviews about this recipe that if anybody actually falls upon reading this I'll be so happy! I'm giving this recipe a one star and ONLY because I think that it hasn't been tested properly. IMO there' a MAJOR MISTAKE in this recipe. Nearly everyone's complained about the caramel running out of the cake. Here's why. 5 OUNCES OF EVAPORATED MILK IS WAY TOO MUCH. That's roughly 2/3 of a cup! No wonder it oozes out! Use 1/4 cup of evaporated milk with 14 ounces of caramels. And if adding chopped pecans add 1-1/4 cups that will also help the caramel stay put. Also I think that this recipe should just say \"9 ounces of packaged brownie mix prepare as directed on package\".... no wonder so many people have messed it up.. lol... I bet they're adding an extra egg and water to the mix!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Miakoda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4629030/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-09T04:40:22.717Z",
                "reviewBody": "I read several reviews and decided to make this along with the help of a few suggestions. First I used turtle brownie mix, and baked it about 15-20 minutes, just so it looked almost done but not quite. I followed the suggestion of another by using 3 cream cheese, 3/4C sugar,1 1/2 t. vanilla & 3 eggs. I skipped making the caramel sauce completely because the brownie mix had it included. So I purchased a jar of milky way ice cream topping/sauce to drizzle on the top of each slice as it was served. Everyone was soooo impressed!! This turned out awsome!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHERI63MI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/740638/"
                }
            }
        ]
    }
]