[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/375/desserts/specialty-desserts/tiramisu/",
                    "name": "Tiramisu Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7757/tiramisu-cheesecake/",
        "name": "Tiramisu Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F514088.jpg",
            "width": 2853,
            "height": 1899
        },
        "datePublished": "1998-06-14T16:47:23.000Z",
        "description": "Tiramisu-flavored cheesecake combines the flavors and richness of tiramisu and NY Cheesecake. Just before serving, grate some semisweet chocolate on the top.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT5H0M",
        "recipeYield": "1 8-inch cheesecake",
        "recipeIngredient": [
            "1 (12 ounce) package ladyfingers",
            "¼ cup butter, melted",
            "¼ cup coffee-flavored liqueur, divided",
            "3 (8 ounce) packages cream cheese",
            "1 (8 ounce) container mascarpone cheese",
            "1 cup white sugar",
            "2 eggs",
            "¼ cup all-purpose flour",
            "1 (1 ounce) square semisweet chocolate"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Place a pan of water on the bottom of the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Crush the package of ladyfingers to fine crumbs. Mix the melted butter into the crumbs. Moisten with 2 tablespoons of the coffee liqueur. Press into an 8-inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix cream cheese, mascarpone, and sugar until very smooth. Add 2 tablespoons coffee liqueur, and mix. Add the eggs and the flour; mix slowly just until smooth. Pour batter over crust in the springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pan on middle rack of oven. Bake until just set, 40 to 45 minutes. Open oven door, and turn off the heat. Leave cake to cool in oven for 20 minutes. Remove from oven, and let it finish cooling, about 30 minutes. Refrigerate for at least 3 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grate semisweet chocolate over the top right before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marty Fries"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.53904282115869,
            "ratingCount": 397,
            "itemReviewed": "Tiramisu Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "528 calories",
            "carbohydrateContent": "40.2 g",
            "cholesterolContent": "188 mg",
            "fatContent": "36.2 g",
            "fiberContent": "0.5 g",
            "proteinContent": "10.1 g",
            "saturatedFatContent": "21 g",
            "servingSize": null,
            "sodiumContent": "256.4 mg",
            "sugarContent": "20 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-02T18:06:03.17Z",
                "reviewBody": "Thought this might help some cut the cost of this cake.\r\nmascarpone  = mascherpone = Italian cream cheese   Pronunciation:   mas-car-POH-nay  Notes:    A key ingredient in tiramisu and zabaglione, mascarpone is velvety soft, slightly acidic, and very expensive.  Although Italian in origin, the name may come from the Spanish mas que bueno, \"better than good.\"  It's usually sold in tubs.  Use it soon after you purchase it since it's highly perishable.  Substitutes:   Blend 8 ounces softened cream cheese with 1/4 cup whipping cream. OR Blend 8 ounces softened cream cheese with 1/4 cup butter and 1/4 cup cream OR Blend 8 ounces softened cream cheese with 1/8 cup whipping cream and 1/8 cup sour cream. OR Whip ricotta cheese in a blender until smooth (lower in fat)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAS4U",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/204290/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-24T22:19:46.06Z",
                "reviewBody": "I served this for Christmas dinner and it was a big hit. The recipe did need more Kaluha as previously mentioned so I used 3 Tbs. in the crust, 6 Tbs. in the cheese mixture. I would use even more - next time I'll use 5 & 10.  I used shortbread cookies instead of the lady fingers. Couldn't find the mascarpone cheese so I mixed together 8 oz. of cream cheese with 1/4 c. sour cream & 2 Tbs. heavy cream. The substitutions were necessary and worked just fine.  I can't imagine the recipe getting any better. The cheesecake top didn't split but it did brown too much so I mixed up a simple chocolate ganache and poured over the cooled cake.\r\nVery attractive served with whipped cream, a dusting of cocoa a dash of cinnamon sitting in a puddle of Kaluha.  TIP: For nice clean cuts you can cut your cheesecakes with dental floss. Push down and pull straight out, not up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Morupe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/919683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-03T15:35:34.52Z",
                "reviewBody": "A 5-star recipe with a couple of changes: 4 T. coffee liqr in the crust, and 4 T. coffee liqr plus 8 T. Starbucks espresso in the filling gives the cheesecake a perfect coffee flavor! Coarsely crumble lady fingers for the crust, leaving small chunks of cookie. The extra liqueur makes the crust soft, giving more of a Tiramisu taste and texture. I found mascarpone (made in Vermont) at my local Whole Foods market. It cost $4.99 for 8oz, as opposed to imported mascarpone-$15.49 for 16oz! The mascarpone makes this cheesecake, and is well worth it! I turned off the oven after 45 minutes and left the cake in until close to room-temp. It came out perfectly! If you want an easy way to remove the cheesecake from the pan, line the bottom with parchment paper before starting. Press the crust on top of the parchment. When ready to remove chilled cheesecake, undo the side pan, place plastic wrap and plate over top of cake and flip over. Remove bottom pan and peel off parchment. Place serving plate against bottom of crust and flip over. If you want a softer, tiramisu-like crust, brush some extra coffee liqr across the crust before inverting onto serving plate. I topped it with a layer of Ganache I from this site, soaked two lady fingers in espresso, cut them lengthwise, then in half again, and fanned the small strips in a circle on top of the ganache. I topped the cake with chocolate shavings and coffee beans for decor. This recipe was amazingly easy for such a beautiful and gormet dessert!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Full-time Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2147396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T19:02:30.35Z",
                "reviewBody": "This cheesecake was ok.  I don't usually use flour in my cheesecakes (I've made and sold a lot) but tried it for this recipe.  I think it gave it slightly thick texture instead of smooth and melt-in-your-mouth.  I didn't have any problems with cracks.  Here are my tips for avoiding cracks: do not overmix, butter the sides of the pan REALLY well, and cool slowly.  If you butter the sides well, you don't have to run a knife along the edge when done.  I try to avoid doing it because it sometimes makes the edges rough.  A note on the pan of water on the bottom rack, this is not the same as a bain marie (water bath).  A water bath envelops the sides of the pan with water and allows the sides to cook evenly. Putting a pan of water under the cheesecake will not accomplish this.  If using a springform, the best thing I found to keep the water out of the pan is encasing the sides and bottom with a crockpot liner.  Do not use oven bags (for cooking turkeys).  They're unreliable with keeping the water out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-29T03:21:29.187Z",
                "reviewBody": "This was my first cheesecake and I made it for my mom's birthday. I baked it for 45 minutes then let it sit in the open oven for 20 minutes as directed. I then took it out and let it cool for another hour or so but I got the dreaded crack down the middle. The middle of it still looked gooey but I went ahead and put it in the refrigerator over night. After about 24 hours from starting I sifted a little cocoa powder on top and grated some chocolate on top. My expectations were very low not based on the recipe but because of the crack and this being the first cheesecake I made. But whoa this was awesome. My family couldn't believe I made it. Instead of Khalua I used Starbucks Coffee Liqueur and I took the suggestions and used 4 in the crust and 8 in the filling. I highly recommend this and in the future will try either the waterbath or the suggestion from the advice section and run the knife around the cheesecake after removing it from the oven to let the cheesecake pull away from the pan (to hopefully prevent the crack).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/91642/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T05:30:20.84Z",
                "reviewBody": "I made this cheesecake for Christmas and it was a huge hit. I increased the coffee liquer to 8 TBS. (4 in the crust and 4 in the filling.) When the cake was cooled I dusted it with cocoa and garnished it with 1/2 pt. of heavy cream whipped with confectioners sugar and cocoa powder (1/4 cup total) and 1 tsp. of coffee liquer. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAROLYN KOVAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764242/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T05:30:17.747Z",
                "reviewBody": "We made this recipe for my son's traditional \"birthday cheesecake\". I followed the suggestion of other reviewers by increasing the liquor. One thing we found was that the cheesecake needs a full 24 hours to reach its peak. We served it after 15 hours and the crust was still gummy. After 24 hours it was perfect. Thanks for sharing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDT2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/297942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-25T05:59:11.53Z",
                "reviewBody": "Oh yum. Like others I doubled the Kahlua that I put in the crust and the cheesecake itself. I ran out of ladyfingers and used vanilla wafers. I hate to say it but there wasn't much of a difference in the taste- especially with the extra kahlua. I dusted the tops with cocoa powder and then finished with a homemade whipped cream which I added 1 tbs. of corn syrup to stablize the cream and then added about 1 tbs of instant powdered mocha (like instant by Folgers) to one cup of heavy whipping cream then finished with shaved chocolate. It was gorgeous and delish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sedohnah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T05:28:02.14Z",
                "reviewBody": "Amazing Cheesecake! I made this for a dinner party and even my lactose intollerant friend couldn't help but ask for seconds and thirds! The only thing I did different was use espresso instead of coffee liqueur and I put 4 tbsp. in the crust and 4 in the cake. Then I sprinkled the top with chocolate shavings ground cinnamon coffee dust and icing sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AMANDA FAIR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/458498/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Tiramisu Cheesecake",
            "description": "Two classics in one dreamy dessert!",
            "uploadDate": "2017-06-12T16:45:30.761Z",
            "duration": "PT58.558S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F8f3cb807-98fc-449f-9921-92b5a3bdeb94%2F080b7916-c6cb-46ef-a112-e9e3f1a904dd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5468268485001"
        }
    }
]