[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
                    "name": "Lemon Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7864/lemon-chiffon-cake/",
        "name": "Lemon Chiffon Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3427077.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1998-07-05T14:50:36.000Z",
        "description": "This cake recipe makes lemony, light, and luscious lemon-flavored chiffon cake with a creamy filling made with lemon pie filling.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 10-inch tube pan",
        "recipeIngredient": [
            "1 ¾ cups cake flour",
            "1 tablespoon baking powder",
            "1 teaspoon salt",
            "½ cup white sugar",
            "½ cup vegetable oil",
            "6 egg yolks",
            "¾ cup water",
            "1 tablespoon lemon zest",
            "6 egg whites",
            "½ teaspoon cream of tartar",
            "¾ cup white sugar",
            "1 cup heavy whipping cream",
            "2 ½ cups lemon pie filling",
            "8 slices  lemon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine flour, baking powder, salt, and 1/2 cup sugar. Add oil, egg yolks, water and lemon rind. Beat with an electric mixer until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, beat egg whites and cream of tartar until peaks form. Gradually add 3/4 cup sugar, and beat until very stiff and shiny peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain. Turn batter into ungreased 10-inch tube pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 60 minutes or until a toothpick inserted in the center comes out clean. Invert cake and cool completely in pan. When cool, loosen edges and shake pan to remove cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Filling: Beat cream to stiff peaks. Fold in lemon filling. Chill until stiff.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Assemble Cake: Slice cake horizontally into 3 equal layers. Fill layers with 1/3 cup of filling. Spread remaining filling on top layer. Decorate with lemon slices.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Lemon Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.519607843137255,
            "ratingCount": 102,
            "itemReviewed": "Lemon Chiffon Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "459.5 calories",
            "carbohydrateContent": "66.9 g",
            "cholesterolContent": "173.5 mg",
            "fatContent": "19.4 g",
            "fiberContent": "0.9 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "343.8 mg",
            "sugarContent": "48.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-03-04T18:26:21.49Z",
                "reviewBody": "Note:  This review is for the cake only - I didn't make the filling. \n\nI made a trial run of this recipe while looking for a good base for a bday cake for my Chinese mom. This cake has a very similar texture to those light, airy cakes you can buy at Asian bakeries - perfect! I halved the recipe, used an 8\" round pan, and baked at 350 for 25 minutes. I paired it with some fruit and stabilized whipped cream frosting, and it was heavenly!\n\nSome helpful tips: For those who are looking for in your FACE lemon flavor, be aware that the lemon in this is quite subtle, which I preferred. If you want stronger flavors, add some lemon extract along with a bit  more zest.  I also used half splenda and half sugar (I have diabetic family members), and it still came out great. I would highly recommend not substituting regular flour for the cake flour. One of the great things about chiffon cake is the texture. I think cake flour is what makes it so tender. \n\nAlso for those who rated this recipe low because of a failed cake: there is absolutely nothing wrong with the recipe. Any failed cakes are due to personal error. If the cake comes out eggy, you're not folding the egg whites into the batter thoroughly. Make sure your batter is smooth and uniform in color before pouring it into the pan to bake. If your cake is collapsing or coming out flat, make sure that you're NOT greasing the pan.  Having ungreased sides lets the cake \"cling\" better and thus rise higher. Happy baking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6653022/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-23T16:48:53.59Z",
                "reviewBody": "My first time trying out a chiffon cake. This recipe is fantastic! I half the recipe and used a 8 inch round cake pan instead. Thank you carol for the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1553785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-19T11:00:57.623Z",
                "reviewBody": "This is an excellent cake.   I have been making chiffon cakes of different types for years.  This is the best lemon one to date and have topped it with blueberry sauce which seems to be enhanced by the lemon flavor.   A keeper.\nThanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EILISH40",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1446852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-06T20:40:03.75Z",
                "reviewBody": "This cake is high and light.  I made a Almond Chiffon Cake with this recipe;\r\ninstead of 1 Tbp. lemon zest, I used 1 Tbp. Almond Extract.  It was delicious \r\nwhen served with raspberries jam.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIMCANCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/719814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-06T20:40:02.95Z",
                "reviewBody": "This is easy light moist and delicious. We eat it plain as a light and lovely dessert. Adding the whipped cream frosting makes it wickedly wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARY-CAREL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/235044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-16T18:35:01.167Z",
                "reviewBody": "I halved this recipe and baked it at 325 degrees (I have a hot oven) for 35 minutes in a 9-inch springform pan. The cake was perfectly done with just the right touch of moistness in the center. We ate it plain. It was tender, light, and not extremely sweet - perfect for a light ending to a heavy meal. Use a whisk instead of a rubber spatula for folding egg whites into the yolk mixture. It's so much faster and easier. Also, here's a tip for folding egg whites. CUT the whites into the batter, instead of using the flat side of the spatula to press them down. This DEFLATES them and cause your cake to later sink in the middle and become dense on the bottom.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Selene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3043820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-06T20:40:02.45Z",
                "reviewBody": "This cake is delicious! Even my mum told me to make some for our relatives! Its easy to make and I replace the lemon zest and pie filling with smuckers strawberry syrup and strawberries still tastes great. This is a wonderful recipe for making different flavours of chiffon cake juz experiment with it. I defintely making this for parties!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANICE77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/573079/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T17:12:26.627Z",
                "reviewBody": "I made this cake for a bake sale so I was only able to taste the filling and some crumbs but from my sampling it seemed as if it would be very good. I found my cake took significantly less time to bake than the recommended time and I'm glad I was keeping a close watch on it. I suggest making sure you stir your lemon pie filling well before trying to fold it into the whipped cream otherwise you'll have some lumps. I used Jello lemon pudding and pie filling that I enhanced with additional lemon juice and zest and it was fairly stiff when set so I did have a few lumps in the whipped cream mixture. I garnished the top with some strips of lemon zest. The cake sold for 20 at the bake sale.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mallinda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/206971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-09T22:54:02.357Z",
                "reviewBody": "I add up 1 teaspoon of lemon extract. And add baked coconut shredded on top. Normally I'm not big in Chiffon cake but my husband was begging for it! And I agree it was delicious nice light mild flavor. My husband & son just called me from work they'd die for it!! ( I packed some cakes for lunch box to go for them.) Thank you Carol for a wining prize recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHISSANUCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/352725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-20T08:30:55.057Z",
                "reviewBody": "I like anything lemon so I decided to try this recipe as it had good reviews and looked yummy. The first time I baked this cake I followed the recipe closely but something was missing or maybe their was to much of something. Anyway I wanted the LIGHT fresh taste of lemon but the cake was dominated by the heavy pie filling. Since this is a good basic chiffon recipe I decided to tweak it a little. Wanting to punch up the lemon I substituted the water with 3/4 cup 1 tbl of fresh sugar free lemonade to which I added the white sugar. This was simmered in a small sauce pan till well dissolved. Do not reduce as this will effect the texture of the cake. Also cool well or risk having scrambled eggs in the batter. After combining the dry ingredients I added the oil egg yolks cooled lemonade mixture and increased the lemon zest to 2 tbl. The cake was baked to recipe. Wanting a light cake I chose to top with a glaze. For this I combined a scant 1/2 cup white sugar 1/2 cup water and the juice of 1 large lemon. This was simmered until reduced to a thin syrup. As I had a little limencello left over from a party I added 2 shots to the syrup and mixed well. This was drizzled over the top of the cake. You could always skip the limencello but it gives a pronounced fresh lively citrus flavor. This can also be made to taste by adding lemon zest extract or oil as well as making thinner or thicker. Try it with orange juice zest and liqueur. Either way it is yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Beas42luv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3037177/"
                }
            }
        ]
    }
]