[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/350/bread/quick-bread/muffins/",
                    "name": "Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7907/easy-jam-muffins/",
        "name": "Easy Jam Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F98391.jpg",
            "width": 1771,
            "height": 1284
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "Jam-topped muffins. These are great for breakfast!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 dozen",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "½ cup white sugar",
            "1 tablespoon baking powder",
            "½ teaspoon salt",
            "¾ cup milk",
            "⅓ cup vegetable oil",
            "1 egg",
            "2 tablespoons any flavor fruit jam",
            "¼ cup chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oven to 400 degrees F (205 degrees C). Grease bottoms only of 12 muffin cups or line with baking cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine flour, sugar, baking powder and salt; mix well. In a small bowl, combine milk, oil and egg; blend well. Add dry ingredients all at once; stir just until dry ingredients are moistened (batter will be lumpy.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill cups 2/3 full.  Place 1/2 teaspoon any flavor jam on each muffin before baking; press into batter. If desired, sprinkle with finely chopped nuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 25 minutes or until toothpick inserted in center comes out clean. Cool 1 minute before removing from pan. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jenn Hall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9210526315789473,
            "ratingCount": 114,
            "itemReviewed": "Easy Jam Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "201.4 calories",
            "carbohydrateContent": "27.9 g",
            "cholesterolContent": "16.7 mg",
            "fatContent": "8.6 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "232.4 mg",
            "sugarContent": "10.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-26T14:37:57.14Z",
                "reviewBody": "These muffins were not the best ones I have ever made but they were surprizingly good for what little amount of time was required to make them and for so few ingredients. I added a few of my own touches to it- applesauce instead of oil 4 tbs. jam(strawberry) IN the batter and 1 tsp of vanilla extract in the batter as well. It is important to let the muffins sit for about 2 min in the pan before taking them out so the jam will not spill out the bottom. I drizzled a mixture of honey vanilla and red food coloring on the top of my muffins right after they came out. It really dressed them up. I will make these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TOOCUTE4UJANELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1185952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-19T14:22:25.013Z",
                "reviewBody": "My mom used to make jam-filled muffins.  I hadn't thought about it for a long time, then I found this recipe today.  I halved the recipe so I could make 6 muffins in the toaster oven and not heat up the whole kitchen by using the big oven.  (It's August!)  I used half white wheat flour, Splenda instead of sugar, red currant and black currant preserves, and chopped hazelnuts on top.  When assembling the muffins, put a bit of batter in the bottom of the muffin cup, then add a dab of jam (not too much), then top with more batter.  Try to \"seal\" in the jam with the batter so it doesn't boil out.  Don't put in too much jam or it will boil over and burn and stick in the pan.\n\nThese were really good!  It's not an overly sweet, caky muffin, but a more traditional muffin that's slightly sweet.  (Like how scones are supposed to be only slightly sweet, not the icky cake-cookie concoctions at Starbuck's--too sweet!)  The real sweetness comes from the jam inside, all hot and melty.\n\nLet the muffins cool a minute or two before you bite into it...keep the kids away for a bit, you know they're going to grab 'em right away.  The jam inside is HOT and you don't want to burn your mouth.\n\nYUMMY breakfast muffin and super easy, with ingredients you have on hand.  It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kentuckyliz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1640980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-03T03:15:59.17Z",
                "reviewBody": "everyone complained this recipe was bland. I found the quick and easy solution was a small amount of chocolate chips. It was perfect!I used raspberry jam. They were delicious and with 10 seconds in the microwave it was like they were fresh out of the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1754972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-30T19:10:24.95Z",
                "reviewBody": "I put the jam in the middle rather than just at the top. Next time I would kind of lightly mix the more jam into the bottom half as this part of the muffin remains somewhat bland. I put sweetened flaked coconut on a couple of the muffins then put them all in at 350 for about 22-24 minutes.(These ones were the best!) I made them medium sized by filling up only 7 muffins. I would double this recipe and cut the oil down with some applesauce next time. Good basic recipe though-takes like 10 minutes to make!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "EMINEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/715619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-13T01:26:09.593Z",
                "reviewBody": "Excellent recipe for a good breakfast muffin. While not extravagant these muffins take little time to put together for fantastic results. I took the advice of Eminee and put the jam in the middle of the muffin instead of on the top. While the recipe is great as is I'm now in the habit of adding 1/4 c more white sugar and 1 tsp vanilla to suit my personal preferences.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CELYIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1449039/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-28T01:20:19.59Z",
                "reviewBody": "Excellent. Had to do them twice because i put the jam on top the first time and burnt it. Second time i put a spoon of batter in the bottom then the jam then the rest of the batter. Beautiful light and not too sweet. Im not particularly an experienced cook and this was an ideal easy recipe for me. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "steffstone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183104/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-16T05:01:58Z",
                "reviewBody": "I loved this recipe! I am not a cook but I know you have to make this your own. It is a great basic recipe that you can have fun with. I also mixed the jam into the better next time I will add even more. You cannot go wrong with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1442034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-10T19:51:02.513Z",
                "reviewBody": "Jam melts off the top and gets stuck to the pan and on to the bottom of the over. Hard to get rid of and takes forever to scrub. That's the only problem with this otherwise fabulous recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PRINCESS88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/130886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T20:10:29.553Z",
                "reviewBody": "I just whipped this recipe up in about an hour and a half with all clean up and such. Here's the recipe I followed (from various readers input and what I had in my kitchen): 2 cups all-purpose flour 1/4 cup white sugar 1/4 cup brown sugar (plus some extra for topping) 3 teaspoons baking powder 1/2 teaspoon salt 3/4 cup milk 1 tsp. vanilla 1/3 cup applesauce 1 egg 2 tablespoons any flavor fruit jam I also put the jam in the middle (as some suggested) and it was delicious. I think the best way to do it is to mix it in a tiny bit (marble it) with a fork. That way it doesn't bubble up as much. Before baking I also sprinkled a teaspoon or so of brown sugar on the tops. Just plain brown sugar. It hardened and blended in during the baking BUT it tastes delicious. Gives it an extra kick with a little crunch and some sweetness to balance the batter (since the jam resided mostly in the bottom on mine). These were very easy to make and I had all the ingredients in the house which makes it better. A little bit of jam bubbled up on the outside of my pan but I just rinsed it under hot water and scrubbed it right after I took the muffins out. It took maybe three minutes to clean and wasn't that hard. Overall this recipe is a solid 4. Tasty but not amazingly outstanding. But I will probably make it again- it's easy and the men of the house seem to like it. =) Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cassandra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1985202/"
                }
            }
        ]
    }
]