[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7948/key-lime-cheesecake-ii/",
        "name": "Key Lime Cheesecake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F256758.jpg",
            "width": 1712,
            "height": 1713
        },
        "datePublished": "1998-06-30T22:56:20.000Z",
        "description": "Key lime cheesecake - sweet, tart and delicious! You may add 1 drop of green food coloring if desired. Garnish with whipped cream.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 9 inch cake",
        "recipeIngredient": [
            "1 ½ cups finely ground graham cracker crumbs",
            "2 tablespoons white sugar",
            "¼ cup unsalted butter, melted",
            "1 ¼ pounds cream cheese, softened",
            "¾ cup white sugar",
            "1 cup sour cream",
            "3 tablespoons all-purpose flour",
            "3 eggs",
            "¾ cup key lime juice",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make Crust: In a bowl stir together the graham cracker crumbs and 2 tablespoons sugar, stir in the butter well.  Pat the mixture into the bottom and 1/2 inch up the side of a buttered 10 inch springform pan and bake the crust in a preheated 375 degree F (190 degree C) oven for 8 minutes.  Transfer the pan to a rack and cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl with an electric mixer, beat cream cheese and 3/4 cup sugar until smooth, beat in the eggs, one at a time, beating well after each addition. Beat in the sour cream, flour, lime juice and vanilla. Beat the mixture until it is smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the filling over the crust.  Bake the cheesecake in the preheated oven for 15 minutes, reduce the temperature to 250 degrees F (120 degrees C) and bake for 50 to 55 minutes longer, or until center is barely set. Let the cheesecake cool on a rack, then chill it, covered, overnight.  Remove the cheesecake from the pan and transfer it to a cake stand.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cindy Chaney"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.308943089430894,
            "ratingCount": 123,
            "itemReviewed": "Key Lime Cheesecake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "370.9 calories",
            "carbohydrateContent": "27.7 g",
            "cholesterolContent": "117.1 mg",
            "fatContent": "26.7 g",
            "fiberContent": "0.4 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "15.9 g",
            "servingSize": null,
            "sodiumContent": "232.1 mg",
            "sugarContent": "18.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-08T04:31:19.28Z",
                "reviewBody": "USE THESE CHANGES!\n\n... and make a fantastic Key Lime Cheesecake!\n\nUse 3 8-oz pkgs. cream cheese instead of 2 1/2 pkgs.\nUse 1/3 cup lime juice instead of 3/4 cup.\nUse 4 eggs instead of 3.\n\nThe above changes will give you superb results!  Additionally, when you take the cheesecake out of the oven and set it on a cooling rack, set a timer for 10 minutes.  When the timer goes off, use a paring knife to gently separate the edge of the cheesecake from the pan.  Continue to cool, and then chill 5 hours or overnight.  The cheesecake will not crack and will easily come free of the pan, and look picture-perfect!  Top with fresh whipped cream, (heavy whipping cream whipped with a dash of vanilla and just a tiny bit of powdered sugar).\n\nThanks to all of you who wrote your comments to use MUCH less lime in this recipe!  You saved me from making a drastic mistake, and now this recipe (with my alterations), is my favorite cheesecake recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PattyJoy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1743573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T11:02:53.257Z",
                "reviewBody": "This cheesecake was excellent and loved by everyone!! Make the following changes and it will taste wonderful with no cracks. For the crust increase melted butter to 6T and add 4 T coconut. Cake: Use 3- 8oz cream cheeses 4 eggs and 2/3 c. lime juice. I used Rose's sweetened lime juice avail. in the cocktail isles of grocery stores. Add 2 drops of blue food coloring to give a lime green color. Bake cheese cake in a hot water bath (put cake in larger pan and add boiling water to larger pan before baking). After 50 min.of baking open oven door and allow to cool in oven. Chill overnight. Garnish with 8 oz. cool whip grated lime rind and thin slices of lime. This looked beautiful and tasted even better!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patti R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/432060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-19T00:50:30.34Z",
                "reviewBody": "This was great! I did alter it though so that I could use 3 full packages of cream cheese instead of 2 and 1/2. In order to compensate for this I added an extra egg 1/2 tsp extra vanilla 1/4 cup more of sugar. And I used my own crust recipe. I kept the key lime juice the same however and found it more than adequate in the tartness department. Note to anyone using fresh key limes: It will take about 20 key limes to equal 3/4 cup of juice. Popping them in a bowl in the microwave for about 15 seconds will help them to release more juice when squeezed. I used a fork to pulverize the membranes as well. Although it does seem like I changed a lot the methods involved in the preparation are sound and the taste yields a very refreshing tang.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MSALLIED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762587/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-20T18:23:20.657Z",
                "reviewBody": "I made this cheesecake for Thanksgiving. It was just great. The texture was creamy but you could cut pieces and serve them without the whole thing collapsing. Changes: For the crust I did use 5 tablespoons of butter. For the filling: I used 3 boxes of cream cheese about a 1/2 cup of key lime juice (I tasted it at 1/4 cup and it just wasn't \"limey\" enough) and about a 1/3 cup powdered sugar too. I used 2 drops of green food coloring that gave the finished product a lovely color - just be sure to mix very well or you will have green stripes! Did not bother with the hot water bath. It turned out just fine with two very minor cracks. I will be making this again for Christmas and I may try the coconut as others have suggested. I'll let you know how that works out. Thanks again for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna Mae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1686079/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-24T15:56:57.59Z",
                "reviewBody": "My favorite dessert is the Key Lime Cheesecake from the Cheesecake Factory Restaurant and this had the same wonderful tart/sweet flavor. The only changes I made were using 24 oz of cream cheese and 4 eggs. This is a recipe that I will definitely add to my favorites.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUDETHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1014501/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-28T09:16:59.153Z",
                "reviewBody": "My 13 year old made this recipe for her father's birthday. She took the advice of other reviewers and cut back on the key lime juice to 1/2 c. The cake turned out great. Light creamy and very flavorful. She frosted it with whip cream and added a little lime zest. The cake had just the right amount of tartness. Also she did make this a day ahead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JO-KE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/862413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-17T13:09:32.74Z",
                "reviewBody": "Nice base recipe. I followed others suggestions by using 4 eggs, 24 oz of crm cheese and 1/2 c of key lime juice. I also added Key Lime zest & about 1/2 c of sweetend coconut that I toasted in a pan first. I also use chocolate graham crackers for the crust and sprinkle a bit more toasted coconut on top of filling before baking. Very yummy cheesecake!\nUpdate 11/2/10: When making this for the 5th time - when the oven temp is reduced, I accidentally dropped it to 350 instead of 250 for 30 minutes. I turned the oven off & let it be for an hour. Still turned out great even with oven temp mistake. I may do that again, haha. No cracks either.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MakeItWork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/makeitwork/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-28T09:17:36.157Z",
                "reviewBody": "A bit tart with the full 3/4 cup of juice. Cake itself has a nice texture and was easy to prepare. I reduced the juice to 1/2 cup and also added 1/2 cup powdered sugar. Really helped lighten up the taste. Definitely a good cake recipie for use with any flavoring.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "N60OSU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/799082/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-04T21:26:32.077Z",
                "reviewBody": "I recently returned from a trip to Florida and was looking for more ways to use the Key Lime juice I brought back with me. This recipe is definitely a keeper! I made the following changes and the cheesecake came out light fluffy and tasty - got lots of rave reviews from those I served it to: increase eggs to 4 use 2-8 oz. pkgs light cream cheese and 1-8 oz. pkg reg cream cheese decrease key lime juice to 1/2 cup. The cheesecake baked up beautifully and held it's shape very well. Make sure to cool completely in the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "REALMATERIALGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/812994/"
                }
            }
        ]
    }
]