[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15490/desserts/cakes/cake-mix-cakes/yellow-cake/",
                    "name": "Yellow Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8047/orange-cake/",
        "name": "Orange Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5733352.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1998-10-11T23:55:56.000Z",
        "description": "This is the best cake I have ever tasted. My mom gave me this recipe and  I can't make it often because I would weigh 500 pounds. Hope it lasts more than a day at your house!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 - 10 inch Bundt cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package yellow cake mix",
            "1 (3 ounce) package instant lemon pudding mix",
            "¾ cup orange juice",
            "½ cup vegetable oil",
            "4 eggs",
            "1 teaspoon lemon extract",
            "⅓ cup orange juice",
            "⅔ cup white sugar",
            "¼ cup butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease a 10 inch Bundt pan. Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together cake mix and pudding mix. Make a well in the center and pour in 3/4 cup orange juice, oil, eggs and lemon extract. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 50 to 60 minutes. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium heat, cook 1/3 cup orange juice, sugar and butter for two minutes. Drizzle over cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Yellow Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Angie LaSala"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6004390779363336,
            "ratingCount": 911,
            "itemReviewed": "Orange Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "409.8 calories",
            "carbohydrateContent": "55 g",
            "cholesterolContent": "73 mg",
            "fatContent": "19.8 g",
            "fiberContent": "0.5 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "442.7 mg",
            "sugarContent": "31.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-27T16:37:16.53Z",
                "reviewBody": "I have one suggestion for all of those taht tried this and it tasted more like lemon than orange. My family has made this cake for years. However, we do not use lemon pudding we use vanilla. I don't understand why lemon would be used at all because it would alter the flavor. If you are looking for ORANGE flavor use vanilla pudding instead and you will be impressed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHAREE28",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1134556/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-16T00:01:01.09Z",
                "reviewBody": "I can't believe I'm rating a recipe that begins with a yellow cake mix 5 stars, but I call it as I see it! This was just that good, and with none of that \"this is a cake mix\" taste. It seems most reviewers put their own spin on this recipe, as did I. I used yellow cake mix because that's what I had on hand, (but I've found French Vanilla makes a much better substitute for yellow cake mix in general), vanilla pudding, 1 tsp. orange extract, 1 tsp. vanilla, fresh orange juice and....one full tablespoon of orange zest! Since there seemed to be a great deal of disappointment with this cake not being very orange tasting, this full-flavored cake, as I made it anyway, is very definitely a prominent, fresh tasting orange. The glaze, too, is orangey, buttery good, and makes the cake all shiny and beautiful. I used a tube pan, but used the \"bottom\" of the cake for the top as I liked the imperfect and crackly look of it. This is just one outstanding, delicious and beautiful orange--yes ORANGE--cake. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-27T22:14:11.17Z",
                "reviewBody": "My family enjoyed this easy,tasty,moist cake. My only complaint was that it was more of a \"citrus cake\" rather than orange. I added orange zest to the batter but it still lacked the orange punch I was looking for. That said I would make it again & enjoy every piece.\nI would like to add my way of adding the glaze: After the cake has cooled\nI put the cake back into the cake pan & add the glaze to the bottom of the cake first. Glaze soaks into the bottom of the cake which traditionally never gets it. It soaks into the sides too. I then invert the cake onto a cake plate & glaze the top & sides. All the glaze gets used & doesn't run all over making for messy cleanup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHUBBYCHICK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1462394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-29T15:52:52.233Z",
                "reviewBody": "This was a great base recipe, but I could tell from reading it that it wouldn't have the strong orange flavor I was looking for.  First, I used a lemon cake mix instead of a yellow one to increase the citrus taste.  Then I used orange extract instead of lemon.  To really pump up the orange flavor, I added 3/4 of a packet of orange Kool-Ade unsweetened drink mix to the dry ingredients.  I put the other 1/4 packet in the glaze.  After the cake cooled, I put it back in the bundt pan and poked big holes in the bottom of the cake with a chopstick.  Then I poured most of the glaze over the bottom of the cake and let it soak in for about 20 minutes. I then inverted the cake onto a cake plate and drizzled the remainder of the glaze over the top.  This came out great; very orangey and saturated with glaze.  Delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-17T23:25:14.1Z",
                "reviewBody": "Based on many of the reviews I read, I also thought the cake would taste too lemony.  In order to avoid that, I substituted Orange Supreme cake mix, vanilla pudding mix, and used vanilla extract instead of lemon.  It was awesome!  I also made an icing made with powdered sugar, a little o.j., and a few drops of vanilla extract...the white icing looks really great on the orange cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Fawn Le",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/760115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T02:03:52.57Z",
                "reviewBody": "Delicious cake! Made this for a Labor Day party and everyone loved it. I didn't have lemon instant pudding mix, so I used vanilla instant pudding mix instead. I think next time I will use orange extract instead of the lemon for more of an orange flavor. Iam also going to try and make a glaze out of powdered sugar, orange juice and orange extract. The glaze in this recipe was more of a syrup that soaked into the cake instead of a glaze. Delicious none the less, but I will change a few things next time. This cake was moist and yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLJ6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-15T16:23:07.26Z",
                "reviewBody": "Fabulous - plus it's so simple to make! You'd really never know it was a boxed cake - it's that good! It's very moist and bursting with orange flavor - what more could you ask for from such a simple recipe! I did use vanilla pudding mix vs. lemon, 1 tsp of vanilla extract vs. lemon and to heighten the orange flavor added a 1 tsp. of orange extract and a Tbsp of orange zest. Other than that, I wouldn't change a thing! This cake is perfect when you don't have time to make a scratch cake but want something that tastes like you did! It baked up perfectly and even though the recipe for the glaze could probably be cut in half it really does add to the cake. Once it was cooled, I couldn't resist drizzling some melted white chocolate over it for a bit of contrast and to take it over the top. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-18T13:28:46.48Z",
                "reviewBody": "Excellent cake.  Rave reviews from family.  I made this twice.  The first time my SIL made the glaze and did not bring it to a complete boil.  The glaze ran all over the place but still tasted good.  The second time when I made the glaze I brought it to a complete boil and then drizzled it over the cake.  This hardened the glaze somewhat, and it was excellent.  You definitely should bring it to a full boil, though, just like you would when making candy.  I will definitely make again. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SimQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1517348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-20T16:56:27.21Z",
                "reviewBody": "I have made this cake twice in the last week.  It is so good!  A suggestion for doing the glaze...first poke the cake randomly with a toothpick.  Then place the cake on a wire rack and straddle the rack over a jelly roll pan.  As the un-absorbed glaze drips off, you can then collect it and keep re-drizzling until it is all abrorbed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARISA_W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/39724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-14T05:58:32.620Z",
                "reviewBody": "The ongoing theme with the comments on this recipe seems to be to change it... I definatly don't think it's a 5 star recipe 'as is'. I did the original first and it was too lemony. Moist, light- but definatly not predominantly orange. I was looking for a very fresh, very obviously orange cake so my next try was to follow the recommendation of all the other bakers who tried it their way. I subbed vanilla pudding for the lemon and orange extract in place of the lemon. I added 3 teaspoons of the orange instead of 1. I also used a french vanilla cake mix with it. NOW it's a 5 star recipe! Very fresh- the orange lingers in your mouth! I didn't do the bundt cake with the glaze. I filled it with a coconut cream and mandarin orange filling and frosted it in almond buttercream. AMAZING! P.S. Add a little orange gel food coloring to it. You wouldn't expect a strawberry cake to be white would you?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cake Lady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2506467/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Orange Cake ",
            "description": "Refreshing citrus cake.\n",
            "uploadDate": "2019-04-10T17:26:40.909Z",
            "duration": "PT56.619S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc8f15998-5734-4de7-8dfb-cd4354be1064%2Fc3f2174b-d2b3-4140-808e-7811e8b68057%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6024771688001"
        }
    }
]