[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/400/desserts/cakes/yellow-cake/",
                    "name": "Yellow Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8063/cake-mixes-from-scratch-and-variations/",
        "name": "Cake Mixes from Scratch and Variations",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F620309.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "1998-05-25T14:32:25.000Z",
        "description": "A convenient substitute for commercial mixes. Quick, easy, and yummy. Best of all, YOU control the ingredients!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 -9x13 inch cake",
        "recipeIngredient": [
            "2 ⅓ cups all-purpose flour",
            "1 tablespoon baking powder",
            "¾ teaspoon salt",
            "1 ½ cups white sugar",
            "½ cup shortening",
            "2 eggs",
            "1 cup milk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "For a Yellow Cake: Sift together flour, baking powder, salt, and sugar. Cut in shortening until fine crumbs are formed. Add eggs, milk, and vanilla. Beat at low speed for 1 minute, then high for 2 minutes, scraping the bowl frequently.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into greased and floured 9x13 inch pan. Bake in preheated 350 degree F oven (175 degrees C) for 25 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Variation for a White Cake: Prepare as for the basic cake except use 3 egg whites for the 2 whole eggs. Whites may be beaten separately and added for a lighter cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Variation for a Chocolate Cake: Add 1/4 cup cocoa powder to the basic cake mix prior to adding the milk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Variation for a Spice Cake: Add 1 teaspoon cinnamon, 1/4 teaspoon ground cloves, and 1/4 teaspoon ground allspice to the basic cake mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Variation for a Pineapple Upside Down Cake: Melt 1/2 cup butter in the bottom of a 9x13 pan. Add 2/3 cup brown sugar, stirring into the butter. Arrange pineapple slices in the pan. Top with the basic (yellow cake) mix recipe. Bake 30 to 35 minutes, cool 5 minutes, and invert to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Yellow Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Janet"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.136304062909567,
            "ratingCount": 763,
            "itemReviewed": "Cake Mixes from Scratch and Variations",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "142.2 calories",
            "carbohydrateContent": "22.5 g",
            "cholesterolContent": "16.3 mg",
            "fatContent": "5 g",
            "fiberContent": "0.3 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "143.9 mg",
            "sugarContent": "13.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-22T22:32:51.793Z",
                "reviewBody": "Ok guys - I have a suggestion.  I've been using this recipe for a couple of years since our son is allergic to red dye (which ironically, is in almost all commercially prepared yellow cake mixes).  I have made the basic yellow cake and also the pineapple upside down cake version.  DO NOT use the shortening - use oil instead, and you will get a much lighter cake which is not dry and dense.  I have tried it with shortening and with the oil, and hands down, the oil version wins.  I also increased the milk to 1 1/2 cups instead of 1 cup (or 1 cup milk and 1/2 cup pineapple juice if using the upside down cake version).  VERY good with the tweaked changes, so I'm going ahead and giving it 5 stars.  Hope this helps.  :o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FAMILYJEANS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1201779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-05T22:42:59.717Z",
                "reviewBody": "I'm giving this 4 stars because of the adjustments I made.  I just tried the white cake variation, except I used oil instead of shortening and I used cake flour instead of all-purpose.  I recommend using cake flour as I makes it more fluffy and tender.  If you're going to use all-purpose, sift it, then measure it out.  This takes care of the density problem some reviewers have had.  Also, I didn't follow the directions.  When making cakes, you don't want to disturb the flour too much, otherwise it forms gluten strands which toughens the cake, and it comes out to be more like a bread.  Here's what I did:  In a large bowl, combine oil milk and vanilla.  In a medium bowl, combine flour, sugar, baking powder and salt. In a small bowl, beat egg whites until stiff peaks are formed (room temperature is best). Gradually add flour mixture to wet ingredients until just blended.  Fold in egg whites and pour the batter into the dish immediately.  Mine baked for about 30-35 minutes.  Combining the ingredients that way made it come out tall, fluffy, tender, moist, and full of flavor!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sixkyej",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1606012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-08T04:32:53.78Z",
                "reviewBody": "I'm a cake decorator, and I've been using this cake mix recipe for years.  It is the absolute best tasting cake in any of it's flavor variations.  Anyone who had trouble with this recipe either 1) didn't have fresh baking powder or 2) didn't realize that from scratch cakes do NOT look and taste like boxed mixes (and that's a GOOD thing).  I recommend using butter flavor shortening and only use real vanilla.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "runnerchicki15",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/63646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-07T15:28:08.373Z",
                "reviewBody": "I've been using this recipe for nearly a year; I can't believe it's taken me this long to rate it...I use it as a base for almost every cake I make; I've made variations with chocolate, peppermint, cardamom, rum, fresh raspberries...pretty much everything comes out perfect.  To some of the reviewers who have had trouble with the cake being dense, try beating it slightly longer than specified...also I usually make the white cake and beat the whites separately as suggested, that makes it fluffier.  I also usually cook it in a loaf pan, but if you're using a flatter pan (13x9) I find it's better to lower the temperature somewhat to prevent the edges burning. A great basic recipe, though, and it's even low-fat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KYMBERAND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/454444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-30T19:18:12.577Z",
                "reviewBody": "Before I baked this Cake I read the reviews and found them very helpful...First I used 2 Cups of sugar and instead of milk I used 1 1/2 Cups of flavored coffee creamer.. I know this sounds really odd but it makes the cake soooo Moist and flavorful..Use any flavor you would like trust me you will NOT be dissapointed..When I bake cakes I use my judgement on cooking time and just insert a toothpick or knife in the middle to jugde doneness.. This recipe is really good if you make it your own",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "attendedkarma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1510615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-22T07:12:22.09Z",
                "reviewBody": "Delicious and easy. I made a lemon cake variation. I used the yellow cake recipe but instead of 1 cup of milk I used 2/3 cup of milk and 1/3 cup of lemon juice. Family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STARLA133",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/465302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-27T22:03:22.843Z",
                "reviewBody": "Delicious! I used the yellow cake recipe. I tweaked it a little. I add 1 package of vanilla pudding and increased the eggs to 3. I also added 1/3 cup sour cream. I also did half butter and half butter flavored shortening. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetslady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1053162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-22T03:03:54.923Z",
                "reviewBody": "I've always had a weakness for sweets, especially cakes (probably because growing up my nanny was a professional cake decorator!) Having mixes on hand isn't always convenient. Besides, wouldn't you rather give people you love something special, made entirely from scratch (short of milling the flour!) that's variable and wholesome? This recipe allows for reasonable variance without sacrificing that \"home-made from a box\" type of familiarity yet is better because YOU made it. You always knew you could! Simply SIMPLE and delightfully DELICIOUS! Not a complaint to be found. Janet, with something so straightforward and honestly good you ought to have named it An Honest Cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Greg Gibson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/481478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-21T22:25:40.357Z",
                "reviewBody": "Excellent...I made the yellow cake and as per past reviews I used Cake flour skipped the shortening and used oil also added an extra half cup of milk...the mix looked watery however it baked up perfectly. Baked at 350 for 20 minutes than reduced to 325 until done with a clean knife result!!! Very moist in our opinion...not like the boxed cake but for scratch it is wonderful. Iced with chocolate icing!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACYCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1387573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-01T23:30:11.963Z",
                "reviewBody": "I had to make a LOT of changes so this recipe is only getting stars because 1) it's pretty simple/easy 2) the baking time and temperature are accurate. That said I had to change many of the ingredients (added an extra 1/2 cup of milk an extra cup of sugar an extra egg one extra tsp. extract used cake flour and used 1/2 cup oil instead of shortening). With these changes the cake had a better texture and flavor. Also I mixed the wet ingredients THEN mixed in the dry until everything just came together. If you over mix the texture won't be right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SilverNBlack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3344090/"
                }
            }
        ]
    }
]