[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/400/desserts/cakes/yellow-cake/",
                    "name": "Yellow Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8138/boston-cream-pie-ii/",
        "name": "Boston Cream Pie II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F636979.jpg",
            "width": 1294,
            "height": 961
        },
        "datePublished": "1999-01-29T13:52:00.000Z",
        "description": "Yellow cake filled with custard and topped with chocolate icing--yummy!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "1 9-inch round cake",
        "recipeIngredient": [
            "1 ¼ cups all-purpose flour",
            "1 cup white sugar",
            "1 ½ teaspoons baking powder",
            "½ teaspoon salt",
            "¾ cup milk",
            "⅓ cup shortening",
            "1 egg",
            "1 teaspoon vanilla extract",
            "⅓ cup white sugar",
            "2 tablespoons cornstarch",
            "⅛ teaspoon salt",
            "1 ½ cups milk",
            "2 egg yolks",
            "2 teaspoons vanilla extract",
            "2 (1 ounce) squares unsweetened chocolate",
            "3 tablespoons butter",
            "1 cup confectioners' sugar",
            "¾ teaspoon vanilla extract",
            "2 tablespoons hot water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 inch round cake pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the flour, 1 cup sugar, baking powder, salt, 3/4 cup milk, shortening, 1 egg, and 1 teaspoon vanilla at low speed, scraping bowl constantly for 30 seconds. Beat on high speed, scraping bowl occasionally for 3 minutes. Pour batter into the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes or until a wooden pick inserted near the center comes out clean. Remove from the pan and let cool on a wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make The Cream Filling: In a 2 quart saucepan, mix 1/3 cup of the sugar, the cornstarch and salt. Stir in the milk gradually and cook over medium heat, stirring constantly, until the mixture thickens and boils. Boil and stir 1 minute. Stir at least 1/2 of the mixture slowly into the egg yolks. Return egg yolk mixture to the saucepan and boil and stir for 1 minute. Remove from heat and stir in the 2 teaspoons vanilla. Let cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Chocolate Glaze: Heat the chocolate and butter or margarine over low heat until melted. Remove from the heat and stir in the confectioners' sugar, and vanilla. Stir in the water, one teaspoon at a time, until glaze is of desired consistency.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Assemble the Cake: Split the cooled cake in half to make 2 thin layers. Fill the layers with the filling. Then spread the chocolate glaze over the top. Refrigerate any leftover cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Yellow Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JBS BOX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1182266009852215,
            "ratingCount": 203,
            "itemReviewed": "Boston Cream Pie II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "318.4 calories",
            "carbohydrateContent": "47.3 g",
            "cholesterolContent": "60.9 mg",
            "fatContent": "13.2 g",
            "fiberContent": "1.1 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "5.7 g",
            "servingSize": null,
            "sodiumContent": "230.2 mg",
            "sugarContent": "34.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-11-08T04:15:46.153Z",
                "reviewBody": "Here's a trick I learned a couple of years ago about splitting the cake. Instead of using a knife to cut the cake, you can use dental floss. Just use a long piece of floss to line up the floss with center height of the cake, all the way around the edge. When the floss is all lined up, loop the ends over each other and pull through. This will give one perfect slice through the cake two make two thin cakes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CMDMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cmdmd/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-24T12:38:02.14Z",
                "reviewBody": "THE CAKE CAME OUT GREAT.  VERY EASY.  I HAVE READ A FEW OF THE REVIEWS, AND ONE HAD SAID THAT THE CUSTARD WAS LUMPY.  THE ONLY LUMPS I GOT WERE FROM THE SIDES OF THE PAN WHEN I STIRRED THEM IN.  I HAD USED A LARGE SERATED KNIFE TO SPLIT THE CAKE AND IT CAME OUT FINE.  I HAD ALSO USED BAKING POWDER INSTEAD OF THE BLOCKS.  3T OF POWDER AND 1T OF OIL EQUALS 1 1oz BLOCK CHOCOLATE.  I THOUGHT THERE WAS ENOUGH GLAZE.  I ALSO QUARTERED BANANAS THEN SLICED THEM AND PUT THEM ON TOP OF THE CUSTARD IN THE MIDDLE.  I TOSSED THEM CAREFULLY WITH JUST ENOUGH LEMON JUICE, ABOUT 2t SO THEY DIDNT TURN BROWN.  THIS WAS A GREAT ADDITION.  I HOPE THIS HELPS AND ENCOURAGES YOU.  BAKE ON GIRLS!!  GOD HAS A WONDERFUL PLAN FOR EACH OF YOUR LIVES.  HE CREATED YOU.  HE LOVES YOU.  ASK HIM TO REVEAL HIMSELF TO YOU, AND I PROMISE YOU HE WILL.  START LOOKING FOR HIM IN EVERYTHING!  HE IS THERE.  STAND ON HIS PROMISES IN HIS WORD, AND BE ENCOURAGED.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jesuslovesyou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1262637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-26T00:06:18.53Z",
                "reviewBody": "I can't speak for the icing or the filling, but this cake recipe is wonderful and moist.  However, I prefer to bake it in two layers rather than split it, so if you are like me, just enter 18 servings for the amount and hit calculate, and this should give you enough batter for two 9 inch pans (use 2 eggs instead of 1 1/2 though).  Some advice on pastry cream:  mixing the sugar and cornstarch in the beginning is essential to smoothe cream, but there is also another problem.  Even after you remove the pan from heat, the custard continues to cook, and thus, if you do not continue to stir afterwards, you may still get lumps.  To combat this, chill a metal or ceramic mixing bowl in your freezer before beginning the cooking process.  Once thickened, remove the custard to the bowl, mixing all the while, and stir until the custard is no longer hot. (If you have a stand mixer, you can use the accompanying mixing bowl and mix on low speed until cool).    For the topping, I used a dark chocolate ganache (1c scalding hot evaporated milk or cream, 8oz 70% dark chocolate, 1/4c sugar: pour the hot milk over the chocolate and sugar; stir to combine; chill until spreadable consistency.)    Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JoeTheBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/joethebaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-03T18:27:54.82Z",
                "reviewBody": "This was a GREAT recipe! I did make a couple of changes. I used my own custard recipe which is basically the same as this one but the quantities are different and I wanted a bit more. I also used can frosting for the top simply because I bought 4 cans at Sams the other day and had it on hand. If you are pressed for time, I would recommend can frosting but please don't fudge on the cake. The cake was delicious and I cannot imagine any box mix being as good. I want to add a couple of hints to the custard.  It isn't necessary to add the eggs at the end. It is fine to add them to the beginning. All custard recipes say to add them at the end but as someone who learned to make custard on a chair in her grandmother's kitchen, adding them with the rest of the ingredients is OK. Also, once it boils, let it boil for about 3 minutes.  One minute is not long enough. It must boil for 3 in order to completely set for a pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Genesis54",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2440282/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-11T16:13:56.327Z",
                "reviewBody": "Excellent Cake. I always mix sugar and cornstarch first until it is a fine powder (for any recipe).  Then I stired in the milk with no problem with lumps.  I always use a rubber spatula with a flat bottom to mix any kind of custard/pudding.  This keeps custard from forming lumps too.  I cheated by using box cake mix too, but followed directions exactly for the cream.  Thanks for the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin Gail",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1098306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T19:31:15.84Z",
                "reviewBody": "I made this today as a birthday cake and was very pleased about the results. I used a golden yellow cake mix (as I can't seem to get my homemade cakes that light yet) but followed the directions for the filling and glaze. It had just the right amount of sweetness, the richness of the chocolate just balancing the custard. I used about a quarter cup of chocolate chips in the glaze and microwaved the chips and the butter until melted then added the sugar, vanilla and water until I got the right consistency. All of the birthday party guests had great things to say! I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAVIST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/491160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T19:31:07.717Z",
                "reviewBody": "I took a shortcut and used a yellow boxed cake mix but this was devine. The custard filling and chocolate glaze were the best and taste just like I had gotten it from a bakery. I used a wire wisk to continuously stir the custard and it came out lump free. I could use a little help on cutting the cake in half but overall this was an excellent recipe and I will definitely make again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CK.CROOKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/708327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-13T19:08:47.38Z",
                "reviewBody": "I only used the custard and chocolate parts of this recipe. I was afraid to use the cake part of this recipe based on the negative reviews so I used just a Duncan Hines Golden Butter mix. As it turns out the boxed cake mix was the highlight. The custard was tasteless and didn't set up well and by the time I was ready to serve the cake from the fridge (about 4 hours after assembly) the chocolate top had become a tarmac. This cake was for my husband's birthday and I actually had to cut a hole through the topping with a paring knife to insert a candle. The layers slid apart while eating due to the runny custard and the amount of force needed to cut through the chocolate tarmac. I won't use any part of this recipe again but thanks just the same.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "KimberMc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2319269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-20T06:43:25.51Z",
                "reviewBody": "This is the same recipe as in my old Betty Crocker cookbook.  Excellent flavor and easy to make.  The only thing I do different is add a tablespoon of butter with the vanilla once the custard is cooked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kel7298",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kel7298/"
                }
            }
        ]
    }
]