[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8148/sticky-toffee-pudding-cake/",
        "name": "Sticky Toffee Pudding Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F563722.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1999-02-10T09:58:17.000Z",
        "description": "This version is rich with dates. A pudding cake with caramel sauce served over the top.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "1 8-inch cake",
        "recipeIngredient": [
            "1 ¾ cups pitted, chopped dates",
            "1 teaspoon baking soda",
            "¾ cup boiling water",
            "⅓ cup butter",
            "¾ cup white sugar",
            "2 eggs, beaten",
            "1 ⅛ cups self-rising flour",
            "¾ cup packed brown sugar",
            "⅓ cup butter",
            "⅔ cup evaporated milk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl combine the dates and baking soda. Pour enough boiling water over the dates to just cover them.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream 1/3 cup of butter with the white sugar until light. Beat in the eggs and mix well to combine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the flour and date mixture (including water) to the egg mixture and fold to combine. Pour the batter into the prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a tester comes out clean, 30 to 40 minutes. Let cool slightly and prepare the sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Caramel Sauce: In a small saucepan combine the brown sugar, 1/3 cup butter, and evaporated milk. Cook over medium heat and bring to boil. Turn heat down and simmer for 5 minutes, stirring occasionally. Remove from heat and stir in the vanilla. Pour the sauce over individual servings of warm cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Maree"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.670520231213873,
            "ratingCount": 173,
            "itemReviewed": "Sticky Toffee Pudding Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "432.9 calories",
            "carbohydrateContent": "69.7 g",
            "cholesterolContent": "82.9 mg",
            "fatContent": "16.4 g",
            "fiberContent": "2.7 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "9.9 g",
            "servingSize": null,
            "sodiumContent": "476.8 mg",
            "sugarContent": "54.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-07T20:38:38.37Z",
                "reviewBody": "Delicious and oh so sweet! The recipe seems accurate, but the instructions for the caramel sauce should be clarified. Whenever you make caramel sauce, you should always cook the sugar with the butter ONLY until it reaches a \"soft\" ball stage - after about 5 minutes of continuous surface bubbling. Only THEN do you add the cream or milk and vanilla. You won't end up with that greasy separated mess that some have described. Serving the warm sauce over the sweet cake and a lump of vanilla ice cream is a perfect way to end a special evening's meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1003613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-28T04:23:47.64Z",
                "reviewBody": "A similar recipe calls for 1 cup of water to be brought to the boil in a saucepan with about a cup of chopped dates (you can use dried chopped dates instead of fresh if these are not available). Then take it off the heat and add the 1 teaspoon of Baking Soda. It will fizz up quite a bit so don't be alarmed. Leave it to cool while you pretty much follow the rest of this recipe. The recipe I have calls for more flour though (1 1/2 cups of self-rising flour) which may explain why some found this version to be \"mushy\". I have found that this cooks very well in a greased glass 9-inch pie dish cooked for about 40-45 mins. I only gave this version 4 stars though because the other recipe makes a richer, better tasting sauce. (Dissolve 1 1/2 cups firmly packed brown sugar in 1 1/2 cups heavy cream, stir over heat without boiling. When sugar is dissolved take it off the heat and add 1 stick and 1 Tbs chopped butter, stir until dissolved). You can serve the sauce poured over the pudding if you like a cake-like consistency but if you like a \"gooier\" sticky pudding, poke some holes in the top and spoon some of the sauce over it so it soaks in. You can then serve with more sauce if wanted. Hope this additional information helps and that you enjoy this traditional \"down under\" favourite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIASA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-21T14:43:35.857Z",
                "reviewBody": "I have been making a very similar recipe for over 20 years.   Five star recipe, four star for the confusing instructions in this recipe.   Combine the pitted dates (my recipe specifies 8 oz), baking soda and boiling water (just 1 cup) in a food processor to chop until they are very fine.   The mixture will be foamy.    If you don't have self rising flour use regular flour and add 1/2 tsp. baking powder.  The cake can be baked in a 9x9 or 13x9 pan.  It's always nicely set in 35-45 minutes.  My toffee sauce is different -  1-1/2 cups heavy cream, 3/4 cup unsalted butter, 1/2 cup DARK brown sugar.  Combine all in saucepan over low heat until melted.  Simmer gently for 20 min. or until thick, stirring often.  Don't boil this!  I would think that the evaporated milk would make the sauce too sweet.  This very moist cake freezes well.   I've successfully made the toffee sauce earlier in the day and reheated it just before serving. Warm the cake before serving, top with toffee sauce and a dollop of real whipped cream sweetened with just a little sugar.  A traditional Christmas dessert in our home.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Suze55",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9956003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-22T05:32:41.813Z",
                "reviewBody": "Excellent recipe!  Tried a version of this 6 years ago at a tea shop in England, and this recipe is pretty close!  I made this for a large group and the pan was scraped clean!!!  Not to mention all the recipe requests!  I also used whipping cream for the sauce.  Be sure to use REAL butter as this makes a huge difference--especially in the sauce!   Thanks Maree",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALBY44",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1186785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-10T00:39:58.34Z",
                "reviewBody": "Awesome!  I've had this a couple times eating out and loved it every time.  finding this recipe I had to try it at home - to be honest, I've never had better!  I baked it in a bundt pan and did what a couple reviewers had suggested (I doubled the sauce and didn't add the milk and vanilla until the sugar/butter mixture had reached soft ball stage), I also poked holes in the pudding when it was done and poured 1/2 the sauce all over it and put it back in the oven for another 10 minutes - a heavenly delight!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ward",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2296661/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-11T13:16:26.937Z",
                "reviewBody": "This is a very easy recipe! Cooked it about 50 minutes. But a word of caution...you can't eat just one slice!!!! I cut the amount of sugar in the cake itself and I'm glad I did because the sauce is SO sweet. Don't get me wrong - the sauce is awesome just very sweet. Definately will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Fawn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1552478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-05T03:29:54.123Z",
                "reviewBody": "This was a quick easy and really good recipe for someone with a sweet tooth. The only changes I would suggest making would be to lower the sugar a little bit. I cut it down to a half cup of sugar and it still was bordering on excessively sweet. Also I think next time I make this I'll pour the caramel sauce overtop and then put it in the oven. I'm used to pudding cakes being more 'pudding' like. If you follow what the recipe says it still turns out a really tasty moist cake with a surprising amount of flavor...I can hardly keep my hands off of it:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FRAMBUESA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-25T15:49:35.247Z",
                "reviewBody": "I was disappointed in this especially after all the rave reviews. My cake did not resemble a pudding cake at all and I believe I've figured out why. The directions say to just cover the dates with boiling water but at the end of the ingredient list 1-1/2 cups of boiling water is listed. I'm sure I didn't have that much boiling water which is why the cake was drier. Also my sauce separated and was not the smooth caramel sauce I expected. Taste of both the cake and sauce were okay but not great. I would not make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Mallinda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/206971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-15T04:04:24.62Z",
                "reviewBody": "Pretty good. Be careful not to overdue it with the dates (ouch!) Would be good substituting dates with other dried fruits and flavored chips. I didn't care too much for the sauce next time I'll use a thicker/sweeter caramel sauce. Oh yeah a little cocoa powder in the cake mix was a hit!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jody1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666812/"
                }
            }
        ]
    }
]