[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/395/desserts/cakes/pound-cake/",
                    "name": "Pound Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8169/marble-swirl-pound-cake/",
        "name": "Marble Swirl Pound Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1107023.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-02-23T10:33:25.000Z",
        "description": "A tube cake with vanilla and chocolate layers swirled together to achieve a marbled effect.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 tube cake",
        "recipeIngredient": [
            "2 cups white sugar",
            "1 cup butter, softened",
            "3 ½ cups cake flour",
            "1 cup milk",
            "1 ½ teaspoons baking powder",
            "2 teaspoons vanilla extract",
            "¼ teaspoon salt",
            "4 eggs",
            "¼ cup unsweetened cocoa powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, with electric mixer at low speed, beat sugar and butter or margarine until blended.  Increase speed to high, and beat until light and fluffy.  Add flour, milk, baking powder, vanilla, salt, and eggs; beat at medium speed until well mixed.  Increase speed to high, and beat batter 4 minutes longer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove about 2 1/2 cups batter to a medium bowl.  With a wire whisk or fork, beat cocoa into batter in medium bowl until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease a 10 inch tube pan. Alternately spoon vanilla and chocolate layers into prepared pan.  With a large spoon, cut and twist through batters to obtain marbled effect.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 1 hour, or until a toothpick inserted in the center of the cake comes out clean.  Cool cake in pan, and on a wire rack, for 10 minutes.  Remove cake from pan, and cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Pound Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "shirleyo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9635416666666665,
            "ratingCount": 192,
            "itemReviewed": "Marble Swirl Pound Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "391.1 calories",
            "carbohydrateContent": "58.5 g",
            "cholesterolContent": "89.4 mg",
            "fatContent": "15.4 g",
            "fiberContent": "1.1 g",
            "proteinContent": "5.7 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "215.4 mg",
            "sugarContent": "29.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-27T23:52:41.127Z",
                "reviewBody": "I have done this cake twice. First time following the instructions to the letter and the result was OK, not great. The second time around I reduced flour quantity by half a cup and baked it for a little over 50 min and it was just fantastic. I was so proud of myself for baking such a delicious cake. I highly recommend it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bakingaficionado",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2176837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-29T01:50:57.847Z",
                "reviewBody": "Great! but If I hadnt made these changes I think it might have turned out dry:\n1. use 3 cups flour (I used normal all purpose flour)\n2. Mix differently: First cream butter and sugar together. Beat in eggs one at a time, add vanilla. Then add the premixed dry ingredients SIFTED to the batter alternating with the milk (1/3 flour mixture - 1/3 milk ending with milk) When you put in the cocoa to the 2 1/2 cups of batter SIFT THE COCOA\nI used salted butter and omitted the extra salt. Also, I used the whisk advise to creat a marbled effect. I put 3/4 of the chocolate batter, then all the white batter and then spooned in the rest of the chocolate batter and spreaded with a knife, then stuck in the whisk all around the cake. Perfect!\nGlazed with easy chocolate bundt cake glaze from this site\nNOTE: this is a dense but moist cake making these adjustments. You WILL need a glass of milk!\nI am giving this 5 stars ONLY BECAUSE I THINK THAT WITH THESE CHANGES ITS WORTH A TRY, AND TO ENCOURAGE OTHERS TO TRY IT! if I were to rate this recipe as is i wouldnt be able to because I didnt follow directions because in my book ingredients arent mixed that way and im not going to risk my ingredients\nUpdate: ok, so a day has past and this cake is definetly a 5. it is still moist. its covered only with plastic wrap. forgot to say i glazed this with a glaze found on this site: 1 cup semisweet chocolate chips, 1 (14 ounce) sweetened condensed milk. heat on medium heat stirring constantly until chocolate ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katie_luvs2bake!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/katie_luvs2bake/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-02T23:03:52.7Z",
                "reviewBody": "The look was fantasctic, but the taste was not to die for, next time, I would cut down the amount of flour to 2 3/4  cups only, because the flour ratio is big comparing to the  to the other ingredients ratio.\n Just cut down the flour, and you can’t go wrong with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "nancy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1657929/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-12T15:44:18.83Z",
                "reviewBody": "Very nice pound cake with just the right amount of sweetness.  I cut the recipe in half and baked it in a 9x5 inch glass baking dish.  I creamed the butter and sugar together, then added the eggs and vanilla (2 tsp.).  I cut the cake flour down to 1 and 1/2 cups and mixed the dry ingredients together then added that to the creamed mixture alternately with the milk, starting and ending with the flour.  I then removend part of the batter and added the cocoa and twisted the layers to obtain the marlbed effect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-09-15T20:27:03.217Z",
                "reviewBody": "Used regular flour less 2 Tbsp per cup. Easy to use recipe. Nice texture and flavor not at all dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATHY CLARK-MARLOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/407568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-03T03:03:40.59Z",
                "reviewBody": "I followed the advice of other reviewers and decreased the amount of flour. I also reduced the bake time from a full hour to just 50 minutes. I was glad to have the tips ahead of time because they seemed to be just the ticket to a moist cake. My only complaints are that I have quite a sweet tooth and I would have liked the cake to be just a little more sugary. (I was looking to recreate something akin to Starbucks' marble loaf.) The other thing was the order of the ingredients being added was a little odd to me. The flour was the third ingredient and it made the batter like a thick cookie dough until I got the milk added. I may change the order in which I add them the next time I make it. Overall it was good and I'll try it again someday.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JFERSTOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/43170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-27T20:25:45.06Z",
                "reviewBody": "Really really good everyone LOVED it. Following others suggestions I just did 3 1/4 cups of flour (and we're high altitude 7800 ft) and then added a TBSP of milk to the choclate mixture when I added the cocoa baked for 50 minutes exactly and it came out wonderfully moist and deliccious. We sliced it and had it with strawberries chocolate sauce and whipped cream it was lovely. The kids delared this \"version\" of strawberry shortcake THE BOMB. It was a great mix of not too chocolately or sweet but satified all those together. Mmmmm Thank you for this great recipe I will make it often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dinabu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2199553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-17T00:44:48.23Z",
                "reviewBody": "Loved this cake! It's exactly what I've been looking for. Since others had posted that they thought it was a bit dry I cooked it 5 minutes less than the recipe said and made sure my oven was just slightly on the under side of the temp. listed. It was not dry and didn't last long at my house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUESHELL51",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-14T17:33:36.763Z",
                "reviewBody": "I melted 2 squaes of unsweetened chocolate ground 2 squares of semisweet chocolate squares instead of the cocoa powder. DELICIOUS",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Glenda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1520766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-30T04:03:47.58Z",
                "reviewBody": "Like many others the recipe AS WRITTEN DID NOT WORK for me. It came out dense to the point of tough; dry and not edible to the kids. I tried it a second time following the many excellent suggestions to reduce flour change sequence of preparation etc. The result was dense and MOIST and quite tasty. Here's what I changed: Flour reduced to 3cups. Baking powder increased to 2tsp. Doubled the vanilla increased cocoa powder to 1/3 cup of more. also used brown sugar instead of white cause that's what I had. Whipped butter then sugar for a long while. Added eggs one at a time beating til smooth each time. Added flour-mix and milk in alternating thirds mixing just enough to blend. I checked for doneness long before the stated time and removed as needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SWINGSPRITE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/977485/"
                }
            }
        ]
    }
]