[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8229/new-york-cheesecake-iii/",
        "name": "New York Cheesecake III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6449742.jpg",
            "width": 3374,
            "height": 2759
        },
        "datePublished": "1999-05-29T14:20:59.000Z",
        "description": "A dense, thick cheesecake with a shortdough crust. This is THE definitive one! You'll never use another cheesecake recipe after you try this.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 10 inch springform pan",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "⅓ cup white sugar",
            "1 egg, beaten",
            "½ cup butter, softened",
            "2 ½ pounds cream cheese, softened",
            "1 ¾ cups white sugar",
            "3 tablespoons all-purpose flour",
            "5 eggs",
            "2 egg yolks",
            "¼ cup heavy whipping cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly coat a 10 inch springform pan with spray oil. Note: You could use a 9x13 inch pan instead.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the crust: Combine 1 1/2 cups flour, 1/3 cup sugar, 1 egg and 1/2 cup butter or margarine. Spread to the edges of the pan. Prick all over with a fork, then bake 15 minutes at 400 degrees F (200 degrees C). Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Increase oven temperature to 475 degrees F (245 degrees C). In a large bowl, combine cream cheese, 1 3/4 cups sugar, 3 tablespoons flour, 5 eggs and the yolks and mix thoroughly. Add cream and mix only enough to blend.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour filling over crust  and bake for 10 minutes at 475 degrees F (245 degrees C). Reduce temperature  to 200 degrees F (95 degrees C) and continue to bake for one hour. Turn oven off, but leave cake in for another hour. Don't worry if it looks a little jiggly in the center.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Chill overnight. This is imperative! If desired, top with your favorite fruit or serve plain.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sandy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.661119515885023,
            "ratingCount": 661,
            "itemReviewed": "New York Cheesecake III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "493.4 calories",
            "carbohydrateContent": "38.3 g",
            "cholesterolContent": "193.7 mg",
            "fatContent": "34.4 g",
            "fiberContent": "0.4 g",
            "proteinContent": "9.5 g",
            "saturatedFatContent": "20.9 g",
            "servingSize": null,
            "sodiumContent": "279.8 mg",
            "sugarContent": "26.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-10T15:34:31.39Z",
                "reviewBody": "Even though my first attempt was a flop, I still give this a five for taste. I am not an experienced cheesecake maker, but I looked up some tips and I will make this again today. Here's what I learned: 1)Cream the cheese before adding all your other ingredents. This gets all the lumps out without adding too much air. Eggs are what traps the air. 2) Checking for doneness: One article I read said it should look shiney on top. I did not want to prick with a toothpick and risk cracking the top, so I followed the instructions given here and it was a runny mess. 3)I added 1 tsp of vanilla and subsituted sour cream for whipping cream and it taste great. I like the tang the saour cream gives it. 4) Grease your entire pan that way it will pull away from the pan as it cools avoid cracks. I also notice the edges were nicer when it pulled away on its own. The parts where I had to run my knife around the edge looked jagged and crumbly (cold be due to being undercooked - I dunno). 5) I followed the advice of another reviewer and only spread the shortbread on the bottom, however, I found it to be too thick. Tastey, but it was like try to swallow a spoonful of peanut butter. Sorry this is so long, but I wanted to try and save any first time cheesecake makers (like myself) frustration on some of these novice mistakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PuffNoodle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1166064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T21:38:03.28Z",
                "reviewBody": "For many years, I have been in charge of baking the dessert for various family celebrations. After baking dozens of cheesecakes, I have found that this cheesecake recipe was HANDS DOWN the most superior plain cheesecake recipe. The taste and texture were phenomenal--absolute perfection.  I like a slightly dense cheesecake and this was truly was--like one you would find in a New York deli.  The shortbread crust was so delicious and blended perfectly with the cake.  \r\n\r\nI believe the temperatures and baking times (as well as the hour cooling time in the oven after baking is complete), were one of the reasons this cake comes out so beautifully textured and decadent.  Most of my previous cheesecakes cracked.  No cracks in this one.  It looked gorgeous.  I've unsuccessfully tried water baths in the past.  I also believe that water baths add moisture to the cheesecake which negatively affects the density/testure.  So, from now on, I will never use a water bath and I will adjust baking times to allow for that one hour oven cooling time.\r\n\r\nI got rave reviews...Several people insisted that this cheesecake HAD to be from a high-end catalogue. Thanks to Sandy for posting this great cheesecake recipe.\r\n\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELA4548",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/980156/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-29T08:43:22.09Z",
                "reviewBody": "This recipe is phenomenal! I recently moved from USA to Finland, where my husband is from, and since living here I have had unconsolable cravings for foods from home that just aren't available here. Cheesecake was one of these undeniable yearnings. I asked my hubby if he knew what it was, and he didn't, nor could I find cream cheese at any of the stores. I was devasted and figured I would have to add cheesecake, my most favorite food, to the now ever-lengthening list of foods I can no longer make for lack of ingredients. But, as it turns out I was finally able to find cream cheese - yummy Philadelphia, actually - and the first thing I did was try this recipe. I didn't change a thing and it was absolutely perfect. \n\nI have made this twice in the past 2 weeks, much to the joy of my husband and his family who are now absolute cheesecake addicts! \n\nThe famiy is so taken with this recipe and \"new\" dessert. I'll never try another again! This great recipe has already become a new family tradition for us! \n\nAlso, I really think the shortbread crust was dynamite. So many cheesecake recipes call for crushed graham crackers, which I've always used, and those aren't available here in Finland, either, so having the chance to make a tasty crust from scratch with ingredients I had on hand was just awesome. In fact, the crust was the reason I chose this recipe in the first place. :P And, I have to say that this crust was better than any graham crust, and just as simple.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "eiskyjente",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2329658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-05T00:04:47.1Z",
                "reviewBody": "Wonderful cheescake...thank you for sharing. For all you choco-holics out there I made this cheesecake even more decadent by melting 6oz.(half a bag)of semi-sweet chocolate chips in the microwave and mixing it with half of the cheesecake batter. I then poured the chocolate cheesecake mixture on top of the crust and then toppped it with the remaining cheesecake batter, so I had 2 layers. Oh my...looks like it came from a restaurant, tastes even better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SGORDON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/147833/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-25T21:37:56.12Z",
                "reviewBody": "I would like to add another response but apparently they only allow one so I am editing this one.  To the person who said that the eggs are too much for only 2 packages of cream cheese, its because there are FIVE packages, 2 1/2 POUNDS... please try it again!\n\nI would also like to tell the people who don 't consider this a New York cheesecake, that it is Lindy's recipe. So i'm pretty sure that qualifies! Thank you for the responses in any event!\n\nEarlier response:I am overwhelmed by these reviews! I haven't been to the site in a long time (in fact I had to re-join)and I am so happy to see others have enjoyed this.\n\nI am making the cheesecake today for a family birthday tomorrow night. I am using a ganache topping (easy- just bring heavy cream to a boil and pour over chocolate chips- stir and let cool)and topping it after it has chilled overnight; then garnishing with chocolate-dipped strawberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sandyh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2019986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-29T16:10:01.04Z",
                "reviewBody": "Holy CHEESECAKE Batman!!!......WOW there is no doubt that this is the ultimate perfect cheesecake recipe. I used the allrecipes.com article: Making Cheesecake Filling. As for the crust I do like my graham cracker crust. For the crust I used a bit of a couple of different recipes and I made 1 the recipe. FYI Vanilla is a must for almost everything (if it is not called for in the recipe I usually add at least 1 tsp). I press the crust up the sides of the pan as well as the bottom. Then refrigerated it while making the filling. To me the article made me more nervous about bubbles and cracks at the end I didn t have any bubbles or cracks. Creaming the cheese is important. I left mine out for over an hour or so it was very easy and quick to cream it. I followed the article and recipe (except to add vanilla) as laid out. I placed a 9x13 pan of water on the shelf directly under the pan I m not sure if this helped or not. Superb outcome.I made 2 cheesecakes within 2 days 1 reg fat and sugar and one low-fat and Splenda with cornflakes crust. My parents absolutely loved the Low-fat No Sugar cake.For those with sugar and fat intake limits the substitution of the low-fat and Splenda truly works with this recipe!!....Also as I made the second one I still followed the article but didn t fret so much and it still came out perfect I found this recipe and the article really not hard to do it s just following the recipe and using a specific process that help",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUTH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2720960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-29T03:55:17.623Z",
                "reviewBody": "I have made this cheesecake several times and everyone says it is the best they have ever had. I am NOT a good baker but this is an easy recipe. (The KEY is to make sure your cream cheese is room temperature before beginning or you will get lumps. Instead of an electric mixer I use a wooden spoon. DON'T open the oven while the cheesecake is baking.) I served a chocolate version today at an ornament exchange and everyone raved about it. After the original recipe was mixed I added 8 squares of melted semi-sweet chocolate making sure to stir only until the chocolate was incorporated. Instead of the shortbread crust I used 16 coarsely crushed oreos mixed with 2 tbs of butter pressed into the springform pan and did not prebake. I poured the chocolate version on top and followed the original baking instructions. PERFECT and NO CRACKS!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLEICHRODT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1268445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-01T16:00:04.437Z",
                "reviewBody": "Okay 1st attempt at a cheesecake results: fantastic. The cake was perfectly cooked looked great with no cracks just the right density and great flavor. Definitely make sure your cream cheese is at room temperature. If you use an electric mixer keep it on low and don't overmix - you may add to much air and that's bad. After reading many reviews on many recipes I finally made the choice to do the water bath. I used a large baking sheet set the springform pan inside (wrapped on the outside with a plastic roasting bag as suggested in another recipes' review - worked great and was easier than foil) and added about 1\" of boiling water from a tea kettle after I placed it on the rack in the oven. Used an oven thermomemter to be sure my oven temp was accurate and followed recipe temp and time exactly. I did not open the door of the oven (no matter how badly I wanted to peek). I then placed it in the refrigerator for 6 hours before serving. I topped it with Supreme Strawberry Topping from this site and my 16 guests were blown away - I had a hard time convincing some that this was not a store bought cake. Final suggestions - while my 'reviewers' liked the crust that comes with this recipe it was a bit sweet and may be a bit different than what you're used to. I'll be trying a graham or other crust next time. Also be patient. You don't have to be an expert baker to pull this off but you have to take your time. It will be worth the investment.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OC Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2130958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-24T23:24:02.503Z",
                "reviewBody": "Makes a lovely, dense, flavorful cheesecake.  I didn't need a water bath or anything, and it was perfect; no cracks.  I just left it in the oven until it totally cooled to room temp and then put it in the fridge.  I also made a few adjustments: I used a combination of sugar and splenda (couldn't tell the difference), cut the total sugar down to 1.5 cups (plenty sweet), added vanilla as recommended by reviewers, and left out the extra 2 egg yolks.  The egg yolks weren't missed - I don't like my cheesecakes eggy.  I paired it with a homemade berry sauce: frozen strawberries, dethawed w/ the juice (these were home-frozen so no syrup); frozen berry mix from safeway; sugar; vanilla balsamic vinegar.  Lightly boil for 10 minutes.  Mix some cornstarch with a bit of water and mix into the berry mixture to thicken.  Let cool.  You can add some cinnamon/nutmeg for some spice, but it's a nice, naturally sweet and tart sauce to compliment the creamy sweetness of the cheesecake.  I also sprayed my springform pan with PAM for baking and I didn't have to use a knife to separate the crust from the pan at all.  It separated on its own beautifully.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "w",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-04T15:30:31.823Z",
                "reviewBody": "I made this recipe and was quite disappointed. First of all it is NOT New York style cheesecake. Anyone that is familiar with the white dense almost crumbly cheesecake of NY and is looking for that recipe should pass this one by. This recipe produces more of a heavy cheesecake custard (I should have known with all the eggs) and in my opinion has kind of an \"off\" flavor that I can't quite put my finger on. It is better with a fruit topping and if I made this recipe again (which I won't) I would add the zest of two lemons.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "D J Grover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5488520/"
                }
            }
        ]
    }
]