[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16701/desserts/cakes/sheet-cake/",
                    "name": "Sheet Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8255/snickerdoodle-cake-i/",
        "name": "Snickerdoodle Cake I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F789078.jpg",
            "width": 2640,
            "height": 1980
        },
        "datePublished": "1999-06-21T01:40:36.000Z",
        "description": "Sugar and cinnamon topping. Like the famous cookie, only BIGGER!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9x13",
        "recipeIngredient": [
            "2 cups white sugar",
            "½ cup shortening",
            "2 eggs",
            "2 ½ cups all-purpose flour",
            "2 teaspoons baking powder",
            "½ teaspoon salt",
            "1 cup milk",
            "3 tablespoons white sugar",
            "1 teaspoon ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, sift together flour, baking powder and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream shortening and 2 cups sugar until fluffy. Add eggs one at a time, mixing well with each addition. Alternately add milk and flour mixture in three stages, mixing well with each addition.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix 3 tablespoons sugar with 1 teaspoon cinnamon. Sprinkle this mixture evenly over cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into prepared 9x13 inch pan and bake at 350 degrees F (175 degrees C) for 35 to 40 minutes or until done.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Sheet Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KATEE2"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.529801324503311,
            "ratingCount": 151,
            "itemReviewed": "Snickerdoodle Cake I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "167.2 calories",
            "carbohydrateContent": "28.9 g",
            "cholesterolContent": "16.3 mg",
            "fatContent": "5 g",
            "fiberContent": "0.4 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "99.4 mg",
            "sugarContent": "18.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-21T23:29:27.18Z",
                "reviewBody": "Looking over the recipe and judging from other reviews it was apparent this cake needed \"something.\" I made half a recipe in an 8x8\" pan and rather than use the sugar/cinnamon topping, I added a half teaspoon of cinnamon and a teaspoon of vanilla to the batter. It turned out to be not as tall a cake as I would have liked, but it was fragrant with the vanilla and cinnamon and simply delcious topped with a fluffy buttercream and an extra sprinkle of cinnamon. And sure enough, it does taste like a Snickerdoodle - a moist Snickerdoodle with a fluffy, creamy frosting! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-30T18:04:39.34Z",
                "reviewBody": "AMAZING!!! I used butter instead of shortening and that definately made it better! I added 1 tsp of cinnamon to the batter, and I also doubled the cinnamon topping and put half of it in middle of the cake then covered it with the rest of the batter. Also, with the second half of the topping I added about 1 TBSP of flour, 2 TBPS of brown sugar and then cut in 2 TBSP of room temp butter until it resembeled more of a crumbly mixture and sprinkled that on top. HOLY COW!!! It made a perfect strussel topping! I also followed other reviewers suggestions and drizzeled 1/2 a stick of melted butter over the top while it was still warm. Everyone raved over this!!! Thanx for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alytholen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2468821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-18T22:21:55.07Z",
                "reviewBody": "I made a couple small adjustments. I used one stick of softened margerine instead of shortening (I don't keep shortening on hand outside of the holidays) and I took naples34102's advice and added a teaspoon each of vanilla extract and ground cinnamon to the actual cake batter, BUT I still added the cinnamon/sugar mixture on the top. Those were very minimal changes, I followed the recipe exact aside from those. It's in the oven now--we haven't tasted it yet but so far, it looks and smells amazing. I'll update my review once we've had a chance to try it. EDITED: I baked mine in a dark cake pan at 350* for just under thirty minutes. After it cooled, I found the edges and bottom were tough and seemed to be overdone. That aside, the cake flavor was spot on and it looked gorgeous from the top. I'm trying to save the cake now with a vanilla glaze, but next time, I think my mistake might have been using margerine (higher water content?) and baking it in a dark pan. I will try this again but I'll use butter and bake it in my glass baking dish. I'll update my review once I've had a chance to try it again and know it was something I did. EDITED AGAIN: Now that I know I'm supposed to reduce the oven's heat 25 degrees when using a dark baking pan, I'll do this next time I make this cake. And I will make it again. It's fabulous--I just fudged it up when I baked it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-16T19:24:08.797Z",
                "reviewBody": "Absolutely one of the best cakes I've ever made. It's quick and simple to make fairly quick to bake and you probably have all the ingredients necessary for it in your cupboard and fridge. Thank you to the person who invented this! I'll definitely make it again. The cake turned out moist and delicious with the flavor of a snickerdoodle cookie without the dryness of a cookie. It was a big hit at a potluck. I would highly recommend though adding a teaspoon of vanilla extract to the wet ingredients before mixing. Also I added a dash of cinnamon to the batter before putting it into the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CORY_P82",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/800715/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-15T18:36:35.2Z",
                "reviewBody": "This is a dense moist delicious cake. The only thing different I did was double the sugar/cinnamon sprinkled half of it over half the batter in the cake pan poured the remaining batter and then sprinkled the rest over the top of the batter. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Eisenreich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/597327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-15T16:42:52.357Z",
                "reviewBody": "I used this recipe as a coffee cake and it was excellent! I increased the amount of cinnamon-sugar topping and added chopped pecans. Also I poured half the batter in the pan sprinkled it with the pecan mix poured in the rest of the batter and then covered it with the rest of the pecan mix. When it was done I poured half a stick of melted butter over the hot cake and drizzled powdered sugar icing on top. You could sell this stuff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "METROPHOBIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460762/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-18T20:19:03.247Z",
                "reviewBody": "I was really impressed by such a simple recipe!! I added a teaspoon of vanilla and used butter flavored shortening instead of the regular. The end result was fantastic. Instead of the 9X13 inch pan I opted for a bundt pan and added a glaze to the finished warm cake. I received rave reviews from all the workers that are in my home doing construction projects inside and out! I am very happy to have stumbled on such a fluffy light simple cake that is sure to please even the most sophisticated of palates!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Verena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-30T00:26:11.717Z",
                "reviewBody": "I have made this several times and I think I have perfected it. Not so much for the Snickerdoodle taste but perfected it more for a coffee cake / cinnabon taste. I used 1c white and 1c brown sugar instead of just white. I used margarine instead of shortening. Also I added 1 box instant vanilla pudding. I increased the cinnamon to 3 teaspoons. I also made a mixture of 1C brown sugar 2 t cinnamon 1/2 t vanilla and 2 T margarine. Mixed this an plopped by spoon fulls over cake in pan. Then ran a knife to create a marbalized effect. Then sprinkled a little cinnamon and sugar over top and baked @350 x 32min. When cool I drizzled some white icing overtop. YUMMM!! Taste more like a cinnabon but so good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim McD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2069071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-22T04:03:23.53Z",
                "reviewBody": "My grandson LOVES Snickerdoodle Cookies. He asked me if I could bake him Snickerdoodle Cupcakes for Christmas. I found this recipe and thought I'd give it a try. I substituted butter for the shortening and increaed the cinnamon to 2 teaspoons. He gave it a THUMBS UP! So I will make it again. NOTE: Any recipe I cook which calls for milk I substitute Lactose Free Whole Milk. It made NO difference in the outcome of this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candice100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-02T02:19:44.747Z",
                "reviewBody": "I prefer the cookie much better than the cake. My husband kept asking me to find a snickerdoodle cake recipe and I gave this one a try. We both said that it needed some kind of frosting. Tomorrow I'll add a little frosting to improve our liking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen McCleane Mullin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1925886/"
                }
            }
        ]
    }
]