[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8282/red-velvet-cake-iv/",
        "name": "Red Velvet Cake IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F18043.jpg",
            "width": 2080,
            "height": 1544
        },
        "datePublished": "1999-06-19T23:28:21.000Z",
        "description": "The classic red cake with a white chocolate cream cheese icing.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 8-inch pans",
        "recipeIngredient": [
            "1 cup butter, softened",
            "3 cups white sugar",
            "6  large eggs eggs",
            "1 ounce red food coloring",
            "3 tablespoons unsweetened cocoa powder",
            "3 cups all-purpose flour",
            "1 cup buttermilk",
            "1 teaspoon vanilla extract",
            "½ teaspoon salt",
            "1 teaspoon baking soda",
            "1 tablespoon white vinegar",
            "2 (8 ounce) packages cream cheese",
            "12 ounces white chocolate",
            "1 cup butter, softened"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour three 8 inch pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream 1 cup butter with sugar. Add eggs one at a time, beating well after each addition.  Mix food coloring with cocoa and add to mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add flour alternately with buttermilk. Add vanilla and salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix baking soda with vinegar, and gently stir into mixture. Be careful not to over mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide batter into three prepared 8 inch round pans. Bake at 325 degrees F (165 degrees C) for 25 minutes. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the White Chocolate Cream Cheese Icing: Melt the white chocolate and allow to cool to lukewarm. In a large bowl, beat the cream cheese until light and fluffy. Gradually beat in melted white chocolate and softened butter. Beat until it is the consistency of whipped cream, then use to fill and frost the cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PAL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9936708860759493,
            "ratingCount": 316,
            "itemReviewed": "Red Velvet Cake IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "916.3 calories",
            "carbohydrateContent": "92.7 g",
            "cholesterolContent": "222.2 mg",
            "fatContent": "56.8 g",
            "fiberContent": "1.3 g",
            "proteinContent": "12.4 g",
            "saturatedFatContent": "34.7 g",
            "servingSize": null,
            "sodiumContent": "617.5 mg",
            "sugarContent": "67.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-25T18:39:10.777Z",
                "reviewBody": "I am an experienced cook, and here is my review: I followed this recipe to the exact ingredients and directions given. The frosting taste too much like cream cheese and is not stiff enough for frosting a layered cake. It is NOT runny, and will work great on a single layer or cupcakes. However, after frosting my 3-layer cake, I placed my cake in the fridge to allow the frosting to stiffen even more. And, 5 minutes later I opened the fridge door and found my top layer lying in front of the cake plate. For those of you who are questioning if a Red Velvet cake is a chocolate cake, the answer is “yes.” And, this cake is by no means in the chocolate cake category. It just does not taste like chocolate. For ‘just a cake’, it is good. But, not for Red Velvet because, again, it should be a chocolate cake. My suggestion to alter this recipe would be to add some confectioners sugar, vanilla flavor, and a dab of flour to the frosting. As far as the cake itself, I would reduce the eggs to 2 and then add 3 eggs whites, double or triple the cocoa, and cook for 10 minutes longer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "WalkerC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2703692/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-19T17:23:45.327Z",
                "reviewBody": "I made this cake for my husband for his birthday, it was phenomenal. I did have to leave it in the oven about 15 minutes extra. And I would definitely sift the cocoa with the flour and add food coloring to butter sugar mix. I have submitted a photo of the cake i made, just click on the picture on the recipe to see the color I acheived following the recipe exactly, if you are going for a deeper red I would add 2-3 times the amount of food coloring. To ice the cake I would make sure you let the white chocolate cool to luke warm because if th icing is to warm you won't be able to work with it. Also to lower the amount of fat I used 8 oz regular cream cheese and 8 oz fat free cream cheese and it tastes great. I have to say i was shocked by the amount of butter in this cake but it tasted sooooo good, we had to give some of it away or we woul dhave been balloons.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacquelyn Phillips",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1164831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-30T22:21:00.307Z",
                "reviewBody": "I did not care for this recipe. I made it for a neighborhood block party and ended up throwing it away. I have found many recipes on here and they were great but never goofed making one before. It was like a sponge cake and not very moist. I guess I should have known when it called for 6 eggs. I think that made it too heavy. A waiste of ingredients.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sunshn195",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/209409/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-13T15:50:38.923Z",
                "reviewBody": "This was hit! For those of you out there who like me do not like the flavor or use of food coloring please keep in mind the original red velvet cake recipe calls for the use of red sugar beets. So taking that as a clue I put some red sugar beets through the juicer and used that juice instead of the artifical red food coloring. It came out beautifully and super moist!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gaochinwen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1465349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T13:49:09.64Z",
                "reviewBody": "Another recipe trying to fit 10 lbs. of stuff into a 5-lb. bag. Way too much batter for 3 8-in. pans. The recipe should have asked for 3 9-in. pans and even then I am not sure the batter would have fit properly. The pans kept dripping making a mess in the oven. Another matter: in step 1 the recipe specifies 350 F as the oven temperature to be used. In step 5 however the temperature asked for is 325 F. I used 325 F and ended up having to keep the pans in the oven for about 15 more minutes at 350 F. other than than that it did come out well and was highly liked. Will make it again but using the 9-in. pans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIHAELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/97390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-14T04:02:28.107Z",
                "reviewBody": "I fixed this today for a birthday celebration. I have never made a homemade cake before and never even tasted red velvet cake. Let me tell you this is wonderful!!!! I took other's advice with the coco by putting 4 1/2 Tablespoons with the flour and sifting it together also used 2 1/2 bottles (2 1/2 ounces) of red food coloring used 3 9\" cake pans and baking it at 340 degrees for 35 - 40 minutes. It came out perfectly. I think the recipe would be right if the person who posted it had told us to put 1 pan in at a time on 325 for 25 minutes. I bet that is what the recipe should be!!!! We had 6 or 7 Foreign Exchange students from New Zealand Germany Columbia Austria Switzerland Australia and Italy and most laughed and said they all made the comment that they had never seen a red cake and one of them thought the cake was bleeding. It was funny! Everyone raved over the cake. I thought it was wonderful!!!! I made the icing the night before and made sure it was cold...it made it thicker so it wasn't runny! Then after spreading the icing I refrigerated the cake so it the icing wouldn't be too runny! It had a GREAT flavor! It is an EASY cake to make!!! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1715963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-30T23:54:59.827Z",
                "reviewBody": "This recipe is great! I bake all the time and if you follow this recipe to a T it turns out great! I do have one advice instead of making three layers I do two 8 inch 1 smaller like a 6 inch for the top. Then for the left over cake mix bake in bread pan until done once done let sit until almost cool then crumball for cake toping or to decorate cake it makes it look elegant I like to sprinkle it on the sides and just a small pile on the top! Great cake!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber Lim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1880914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-10T21:02:58.337Z",
                "reviewBody": "Moist and delicious cake!!! I added 1 1/2 tablespoons of additional cocoa and 1/4 more buttermilk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chareese",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2311412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-11T18:29:03.553Z",
                "reviewBody": "Four stars are for the icing because I didn't use the cake recipe. I use my grandma's red velvet cake recipe that has been tried and true for decades and is a little different from this one. I made it for Christmas last year and have gotten several requests to make it again this year. I usually make my RV cake with plain cream cheese frosting which is still very good. But I never got as many compliments as when I used the white chocolate cream cheese frosting from this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MizzCandi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/80474/"
                }
            }
        ]
    }
]