[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/395/desserts/cakes/pound-cake/",
                    "name": "Pound Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8300/country-pound-cake/",
        "name": "Country Pound Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9076431.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This a really good down-home style, back to basics pound cake that my whole family enjoys! This recipe was handed down to me with the stipulation of   placing the cake in a cold oven, and it turns out perfectly every time.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 10 inch tube pan",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "¾ teaspoon baking powder",
            "¼ teaspoon salt",
            "1 cup unsalted butter, softened",
            "½ cup shortening",
            "2 ⅔ cups white sugar",
            "5 eggs",
            "1 cup milk",
            "1 teaspoon vanilla extract",
            "1 teaspoon lemon extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Do not preheat the oven. Grease 10 inch tube pan and line bottom with wax paper or parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together the flour, baking powder and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat the butter, shortening, and sugar on low speed for 10 minutes.  Add the eggs one at a time, blending well after each addition.  Alternately add the flour mixture and milk, mixing well.  Add the vanilla and lemon extracts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into the prepared pan.  Set the oven temperature to 350 degrees F (175 degrees C. Bake for 1 hour and 20 minutes, or until a toothpick inserted into the middle of cake comes out clean.  Allow cake to cool in the pan for 1 hour.  Remove to a cake rack and cool for at least 3 hours.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Pound Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Morgan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.673239436619719,
            "ratingCount": 355,
            "itemReviewed": "Country Pound Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "462 calories",
            "carbohydrateContent": "59.6 g",
            "cholesterolContent": "102.7 mg",
            "fatContent": "22.9 g",
            "fiberContent": "0.7 g",
            "proteinContent": "5.7 g",
            "saturatedFatContent": "11 g",
            "servingSize": null,
            "sodiumContent": "102.2 mg",
            "sugarContent": "39.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-25T20:48:58.083Z",
                "reviewBody": "I made this recipe Christmas Eve.  I followed it to the letter - except I used a bundt cake pan with NO wax paper - just sprayed it with PAM spray and coated lightly with flour.  All I can say is that it is out of this world good.  This is the recipe I have been looking for all these years.  The cold oven start gives it that good crusty outer layer. Fabulous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2703884/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-12T23:04:05.467Z",
                "reviewBody": "Wanted to make a plain old fashioned pound cake and this was it! I followed the instructions with only 2 changes (because I needed to substitute) I used evaporated milk and 2 teas. of vanilla extract. I thought I had lemon in my cupboard but I was out! I used a 10 cup Bundt pan sprayed with Baker's Joy. Put the cake in a cold oven & set the oven for 350 degrees & timer for 80 minutes as instructed. The cake really got too brown but stil edible. I think next time I will lower the time to 55-60 minutes and keep checking. I think this is a great cake to have with tea or coffee. Hubby raved. His only comment is that he would have like a lemon flavor. Lemon peel would be good along with the extract. This is a keeper for us!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WVJBEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1118673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-03T18:59:17.107Z",
                "reviewBody": "My family loved this recipe. It was very easy to make.I cooked the cake in two (2) seperate bread pans as i did not have the pan the recipe called for. We ate one watching the football game and I froze the other.It is also very good if you add cherry pie filling and whip cream to your finished cakes. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMAEEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610800/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-12T19:34:01.64Z",
                "reviewBody": "I couldn't have been more pleased.  Perfect, dense pound cake texture, but still with a light and not overly compact crumb.  Flavorful, with the ideal level of moistness, a result of getting the best of both worlds with the butter and shortening combination.  (I've experienced both pound cakes that have been too dry as well as those with far too much fat, causing them to be not moist, really, but greasy!) I used this for cupcakes and, just for fun, flavored them with pure watermelon extract, then frosted them with \"Grocery Store Frosting,\" recipe also from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-03T14:20:13.813Z",
                "reviewBody": "This was a very good cake. The texture and taste were like a commerical pound cake. I did not use lemon extract instead adding two teaspoons of vanilla. I used two loaf pans and it filled both. For one cake I would suggest halving the recipe next time. I will use this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2790484/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-12T19:37:08.1Z",
                "reviewBody": "Perfect pound cake. I love how smooth and white and pretty it is when you cut into it. Tastes just like Sarah Lee. I used margernine instead of butter b/c that's what I buy (WAY cheaper) since we go through so much of it and extra vanilla instead of lemon extract (didn't have any but I know it would be great with it!). Put it in two loaf pans and baked away. Mine was done in about an hour and a half I bumped a oven to watch if the middle moved and then tested it with a knife to make sure it was done. Tip: take 1 cup strawberries 1 c. sugar and one egg white beat it until stiff and serve on top. VERY GOOD! Thank you for a classic pound cake recipe. Oh - wouldn't this be great layered in a trifle??",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "outnumbered",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1800607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T14:43:33.37Z",
                "reviewBody": "My cake was done at 50 minutes early as many other reviewers had stated. I actually checked on it at 35 minutes and it was fairly brown by then so I covered it with foil during the remaining baking time so that it didn't overbrown. My DH does not like lemon so I subsituted an extra teaspoon of vanilla for the lemon extract. I was very happy with the results nice texture and taste. Buttery rich taste with a hint of sweetness. Would be wonderful with sugared sliced strawberries and whipped cream. We finished off a quarter of the cake on my birthday then froze the rest in individual pieces for a quick dessert in the coming months.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTY7795",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1058280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-25T04:53:06.043Z",
                "reviewBody": "I love it! No more box pound cakes for me! My kids love it too! I halved this recipe and baked it in one loaf pan and it was perfect!  I'm making it again! It's your basic pound cake that is great alone, or with a topping or you could even embellish the batter with chocolate chips, etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUCCESSB440",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/152270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-05T17:38:21.883Z",
                "reviewBody": "The ingredients are pretty standard for a pound cake with the exception of adding shortening in place of a last stick of butter. I don't however believe that was in any way responsible for the dryness I experienced. I believe it was due to the unconventional baking method. I did as directed starting in a cold oven. I set the alarm to sound at one hour just because I was unfamiliar with baking an item this way and wanted to check it at that point. Good thing I did! When I pressed the center slightly it was quite firm. I inserted a toothpick in the middle just to be sure and it came out completely dry without even so much as a tiny crumb clinging to it. When I served it at a Fourth of July party I was grateful I had made 3 fruit compotes or the embarrassingly dry texture would have had nowhere to hide. I calibrate my oven every few weeks and the last time was last week; dead-on accurate so that wasn't the problem. I've worked as a pastry chef have over 40 years of experience baking so I'm known for my baked goods. This was not even close to my standards. I can only imagine how dry it would have been had I not yanked it at one hour. It might have fared better at 50 minutes. The taste was that of a generic pound cake nothing special but I would not recommend this recipe because there are much better out for flavor and they turn out enjoyably moist. In this case only the fruit and real whipped cream stood between me and culinary humiliation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            }
        ]
    }
]