[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17527/desserts/fruit-desserts/banana-desserts/",
                    "name": "Banana Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8333/banana-cake-vi/",
        "name": "Banana Cake VI",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F848894.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1999-07-11T21:05:07.000Z",
        "description": "This cake was first made for me by a friend while I was visiting her after she had delivered her 11th child. I told her, 'I should have baked for you!'",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "¾ cup butter",
            "2 ⅛ cups white sugar",
            "3 eggs",
            "2 teaspoons vanilla extract",
            "3 cups all-purpose flour",
            "1 ½ teaspoons baking soda",
            "¼ teaspoon salt",
            "1 ½ cups buttermilk",
            "2 teaspoons lemon juice",
            "1 ½ cups mashed bananas",
            "½ cup butter, softened",
            "1 (8 ounce) package cream cheese, softened",
            "3 ½ cups confectioners' sugar",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 275 degrees F (135 degrees C). Grease and flour a 9x13 inch pan. In a small bowl, mix mashed bananas with lemon juice, set aside. In a medium bowl, mix flour, baking soda and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream 3/4 cup butter and 2 1/8 cups sugar until light and fluffy. Beat in the eggs one at a time, then stir in 2 teaspoons vanilla.  Beat in the flour mixture alternately with the buttermilk. Stir in banana mixture. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 1 hour, or until a toothpick inserted into the center of the cake comes out clean. Remove from oven and place directly into freezer for 45 minutes. This will make the cake very moist.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For the frosting: In a large bowl, cream 1/2 cup butter and cream cheese until smooth. Beat in 1 teaspoon vanilla. Add confectioners sugar and beat on low speed until combined, then on high until frosting is smooth. Spread on cooled cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Banana Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cindy Carnes"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.760748959778086,
            "ratingCount": 2884,
            "itemReviewed": "Banana Cake VI",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "453.4 calories",
            "carbohydrateContent": "68.6 g",
            "cholesterolContent": "79.4 mg",
            "fatContent": "18.4 g",
            "fiberContent": "1.1 g",
            "proteinContent": "5.2 g",
            "saturatedFatContent": "11.3 g",
            "servingSize": null,
            "sodiumContent": "298.8 mg",
            "sugarContent": "50 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-25T16:08:23.17Z",
                "reviewBody": "Baking a cake at a ridiculously low temperature (traditionally it's 350 degrees), then putting a hot cake right out of the oven into the freezer?  What? I was tempted to simply bake this in the traditional manner, 350 degrees until done, then let cool on a wire rack. But I noticed the submitter's review, and she was so adamant about the unconventional baking temperature and cooling method that I thought to be fair to her I'd give it a try (especially since it was the rare occasion where I had enough room in the freezer for it). Well let me tell you, I don't know if the cake would have turned out any differently had I baked it in the traditional manner, but this was one, outstanding banana cake! To tell you the truth, I was surprised. It is not uncommon for these types of cakes to be dry or not to be baked through. But this one has a soft outer crust, not overly browned, and a moist, tender interior.  It was fun to give this unusual set of directions a try and I'm glad I did. Other than make a half recipe in an 8x8\" pan and adjusting the baking time accordingly, I followed the directions exactly and was not disappointed.  Now that I've had the first piece I can't wait to share it! The added perk was that because the cake is cooled in the freezer, you can bake and serve this in no time! The frosting is a tried and true cream cheese frosting, and topped with a sprinkle of finely chopped nuts, this was just a simply delicious and beautiful cake.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-26T21:20:15.967Z",
                "reviewBody": "This is my recipe, the temperature is not a mistake in the directions. It is to bake at a slow rate to keep the cake moist. This recipe has been made by tons of friends of mine over and over, not one of them has had a problem with the directions, temperature, or the ingredients.   Check your oven temperature with a thermometer, also use the correct size pan. It all makes a difference!!!  Pyrex pans are freezer to oven...their claim to fame when first on the market...that dates me, I guess. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy Carnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T08:06:20.827Z",
                "reviewBody": "To anyone reading this, do not hesitate to make this cake.  I think the cooking temperature and placing it in the freezer after baking is what makes this cake outstanding.  I myself made a couple of changes. 1.) I did not have buttermilk, so I used regular milk and added 1.5 tablespoons of vinegar to make it comparable to buttermilk. 2.) I had 4 large bananas so I used all of them, (I did not use lemon juice) 3) I used 2 cups of white sugar and 1/4c of brown sugar 4) I used about another additional tablespoon of vanilla. 5) I had to bake it a LOT, LOT longer than the recipe calls for. Every oven is different, so just keep checking it and don't rush it. 6. I only used 2 cups of conf. sugar in the icing.  Just add the sugar by the cup and check taste after every one and stop adding it when the flavor is the way you like it.\r\nIt is worth the extra time.  I know I could have won a cake cook-off with this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PressureCooker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/391140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T23:17:01.36Z",
                "reviewBody": "This is my first banana cake and I followed the recipe exactly.  Boy am I glad I did!  This is so moist and delicious!!!!  I topped it with 1/2 cup of finely chopped walnuts which is the only thing I would add.  I was a bit skeptical about cooking a cake at 275 and then putting it in the freezer.  I never heard of such a thing.  Please follow the directions, you'll be glad you did. For me it took 1 hour and 10 minutes until the toothpick came out clean.  Maybe that's where people are having trouble - taking the cake out of the oven before it's done and then putting it in the freezer.  I made the icing while the cake was cooling in the freezer. I topped it with the icing and nuts and then stuck it in the refrigerator to have after dinner. I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-23T23:46:10.64Z",
                "reviewBody": "A WOW!!! cake - brilliantly easy and simply scrumptious! At this time of posting, it is hardpressed to keep the remaining half for dear hubby when he gets home later, lol; the children - who vehemently declared not liking banana cake, groaned and moaned their pleasure and this will now be THE banana cake recipe with us. The changes after reading all the reviews (thank you to all) are: decreased the sugar to 1 cup using (packed) brown sugar, increased bananas to 1 3/4 cups, used self-raising flour with 1 teaspoon baking powder, omitted the salt, doubled the vanilla and baked it for 40 minutes at 325 degrees. Tried freezing but 10 minutes only just to cool it down quick smart; the cake is moist even without freezing it for the stated time ... I have the proof ;) so to 'speak', lol. And I sprinkled a bit of chocolate rice on one side, left the middle plain and chopped pecans on the last 'division' ... and served the cake with  homemade caramel sauce. With the decreased amount of sugar, this is just right. We loved the plain or with pecans, but not chocolate rice, maybe either some cocoa powder or melted chocolate would be better. Kept the cream cheese frosting for my carrot cake. Thanks to both Cindy and her friend who shared the recipe with us here. Good one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sereneblue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/972019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-04T14:29:49.647Z",
                "reviewBody": "I have made this recipe many times and it is wonderful.  Frost with a homemade caramel frosting and it is out of this world.\nFrosting:\n1/3 cup butter, 1/4 cup milk, 1 cup brown sugar, 2 cups powdered sugar and 1 tsp vanilla.\nCombine butter, milk and brown sugar.  Cook over medium heat for a few minutes after mixture begins to boil.  Beat in powdered sugar and vanilla.  Pour over cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Collins Potter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1929855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-02T00:09:24.123Z",
                "reviewBody": "I always make a recipe the first time without any changes. This was \"country good\", however this is more like a light banana bread in texture than that of cake, REAL HEAVY. By the second day we scraped the frosting off and just ate the cake. As with all cakes I bake 300 degrees seems to make a more tender cake. This batter goes from jiggly center to done quickly and may need more oven time than the recipe called for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANNA RODRIGUEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/606817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-17T17:39:06.483Z",
                "reviewBody": "I didn't think that a better recipe existed besides my grandmother's, but boy was I wrong!  This banana cake was unbelievable.  I took it to a family dinner and got rave reviews.  Was told that this is the best banana cake ever had by one guest and my grandfather said he would even eat it without the icing!  I followed the recipe pretty closely although I did take other's advice and bake for about 45 minutes on 325.  Threw it straight in the freezer for 45 minutes afterwards.  Delicious icing- even my husband, a serious icing critic, loved this!  Plenty of icing left that I put in the freezer for maybe cinnamon rolls one morning.  Excellent dessert Cindy and thank you for sharing this with us all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/854533/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-01T12:26:10.247Z",
                "reviewBody": "I think the baking temp should be 375 instead of 275 as listed here.  After 1 hour at 275 it was not even close to being done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OOMPALOOMPA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/119972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-03T19:19:44.850Z",
                "reviewBody": "The cake is just OK. The cooking time was 30 plus minutes off. The cake was too sweet, heavy,and not quite what I expect out of a cake. I like trying new recipes, so I am glad I tried it, but it is the end of the road for this one. I will find another recipe to use up bananas in the future.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "family of five",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1023428/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Banana Cake VI",
            "description": "Discover the secret to a super-moist banana cake.",
            "uploadDate": "2013-12-20T19:52:51.248Z",
            "duration": "PT4M16.756S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc40629e8-8a48-4d00-a871-bc09482fbaa8%2Fb853216e-c4e2-4f54-8a9d-da647f55372c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2955994184001"
        }
    }
]