[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/395/desserts/cakes/pound-cake/",
                    "name": "Pound Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8384/cream-cheese-pound-cake-iii/",
        "name": "Cream Cheese Pound Cake III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3997515.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-09-21T18:55:10.000Z",
        "description": "This is a heavy, dense, extremely good pound cake.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 10 inch tube pan",
        "recipeIngredient": [
            "1 (8 ounce) package cream cheese",
            "1 ½ cups butter",
            "3 cups white sugar",
            "6 eggs",
            "3 cups all-purpose flour",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (160 degrees C) grease and flour a 10 inch tube pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream butter and cream cheese until smooth. Add sugar gradually and beat until fluffy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add eggs two at a time, beating well with each addition. Add the flour all at once and mix in. Add vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into a 10 inch tube pan. Bake at 325 degrees F (160 degrees C) for 1 hour and 20 minutes. Check for doneness at 1 hour. A toothpick inserted into center of cake will come out clean.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Pound Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Nanci"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.653381642512077,
            "ratingCount": 1656,
            "itemReviewed": "Cream Cheese Pound Cake III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "525.1 calories",
            "carbohydrateContent": "63.9 g",
            "cholesterolContent": "149.6 mg",
            "fatContent": "27.7 g",
            "fiberContent": "0.7 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "16.7 g",
            "servingSize": null,
            "sodiumContent": "218 mg",
            "sugarContent": "43.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-04-06T16:35:18.95Z",
                "reviewBody": "I have been making this pound cake for years, with only small changes.  Increase the vanilla to 1 1/2 tsp or 2tsp, (your preference) I use 2. Start with ROOM TEMPERATURE butter,(REAL butter) cream cheese and eggs which makes for easier mixing and a more creamy outcome, and using cake flour (cup for cup) gives it a more velvet type texture.  I also add the eggs one at a time and make sure each one is completely mixed in before adding the next. And the baking time really depends on how true your oven temp is. Sometimes it may take two hours for this cake to bake if your oven is lower than 325, but baking at a higher temp will cook the outside, but not the in. Tricky?  Yes.  Worth the effort?  Oh yes! Be patient with the mixing, and you will have the best pound cake you will ever eat.  It stands alone, or you can top it with whatever you want.  Simply the best for a good old fashion comfort dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARB MAXWELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/492841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-29T21:26:31.02Z",
                "reviewBody": "Wonderful! I made this cake (with just 2 adjustments) for my boss' birthday yesterday, and absolutely everyone devoured it and asked for the recipe. In fact, one woman almost cried when she took her first bite- she said it tasted just like her mother's pound cake from decades ago! \n\nThe only changes I made were to decrease the sugar to 2 1/2 cups, and add some almond extract along with the vanilla. \n\nAlso, just a note, but swan's down cake flour is the only flour that I will use for pound cakes. It gives the cake a very fine crumb without the need to sift. \n\nOne more comment: to those people who have uncooked dough in their finished cakes, make sure that your butter and cream cheese are both at true room temperature. Otherwise, the cream cheese doesn't get mixed in and never bakes up, no matter how long you leave it in the oven. \nIf your crust burned before the cake was completely cooked, either the oven was too hot, or your oven doesn't circulate the hot air (convection oven). Use a thermometer to tell what the exact temperature of your oven is, and rotate the cake every 20-25 minutes if it's an older oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1747473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T00:05:49.373Z",
                "reviewBody": "I don't give very many 5 star rating unless the recipe is truly \"the best\".  This pound cake deserved all 5 stars!!  This could probably be the best pound cake I have ever made...but I did tweak it a bit.  I used 1-1/4 cups of butter and 1/4 cup of buttermilk.  Buttermilk is a secret ingredient of mine that I like to use in place of regular milk called for in a recipe.  It makes your cakes, muffins and breads very moist.  This recipe didn't call for any liquid, but I did add a little for that \"moistness\".  I also added a tsp of lemon extract to the batter along with the vanilla.  The lemon flavor was very light, but gave it a little something special.  Perfect recipe!!  Many thanks Nanci.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-14T16:57:48.857Z",
                "reviewBody": "This a great pound cake! The texture is truly like velvet.  It was golden on the outside, creamy white on the in. And it was just delicious. I've found that good pound cakes aren't hard to make, but they require some care in making them. You can't rush the mixing process. (If you have one, use a stand mixer with the paddle attachment for the best result.) Beat the butter and the cream cheese until it looks silky. Add sugar in a slow stream with the mixer still running and beat until this is full and fluffy. This takes a good while, but this how you'll get a lighter cake. The butter, cheese, sugar and eggs mixture should be well mixed because once you add the flour, you are only mixing to incorporate. Beating the flour in will result in a mess. I followed someone else's suggestion and exchanged 1/4 cup of butter for buttermilk. I baked in a cold oven, the way I always make a pound cake, and had a nice crusty exterior.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Byrdie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1500151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-24T20:16:13.56Z",
                "reviewBody": "I'm not sure exactly how to rate this.. I made it Saturday for a party on Sunday and cooked it for 1 hour 20 minutes as directed (I used a bundt pan).  I checked it with a toothpick for doneness and it came out clean. Imagine my HORROR when I went to cut it 20 minutes before the party to find that it was raw in the middle.  I have never had this experience with a cake before and I bake often.  So as for taste, the edge I could taste was great, but WATCH YOUR TIME so you won't be scrambling at the last minute like I was yesterday.  And the toothpick test for doneness apparently isn't accurate for pound cake.  :-(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Knee Talley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1109461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-17T03:24:24.38Z",
                "reviewBody": "This cake was absolutely phenomenal. I used two loaf pans. I mixed the sugar into creamed butter and cream cheese in a thin stream, then added one egg at a time (Make sure that the egg is at room temp). To freshen things up a little bit, I filled the loaf pan about a third way up, and sprinkled some raspberries. Then I topped more batter to completely cover the raspberries. The raspberries were a delightful surprise!  Refer to my photo to see how it looks like. Not only does it add a refreshing touch, but also looks beautiful when sliced. Absolutely gorgeous cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "little biscuits",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1130975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-18T00:05:41.043Z",
                "reviewBody": "Delicious!  I made the recipe as directed the first time, and it was great. The second time, however, I decided to tweak it a little. I prepared the batter as directed, then I added 1/4 cup of buttermilk and 2 tsp of pure lemon extract, because I love lemon pound cake. I also made a yummy glaze out of 2/3 cup of melted margarine, 3 cups of confectioner's sugar, and 1.5tsp of lemon extract. This is a slightly crispy glaze when it sets, and the margarine has just the right amount of salt to offset the sweetness of the cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JenniJ3333",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2196294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-25T00:54:54.96Z",
                "reviewBody": "I've made this cake twice.. and both times it turned out great... the first time I substituted 1/2 stick of butter for 1/4 cup of buttermilk like another poster suggested.. that made it very moist but it was still very dense.. the second time I subsituted the buttermilk again and also I left out another 1/2 stick of butter and added 1/2 cup of sour cream... this was the perfect combination.. it made the cake light and fluffy with lots of taste.. neither cake lasted 24 hours in my house... so to make it simple.. I used 2 sticks of butter, 1/4 cup of buttermilk, and 1/2 cup of sour cream.. and I creamed  it all in together with the cream cheese..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "keek77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5729343/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-30T20:53:25.42Z",
                "reviewBody": "I've used this recipe for several years.  My husband yearned for his Mom's pound cake and unfortunately no one seemed to have her special recipe. I looked for many years until I found this one in a church cookbook which he believes is \"just like Mom's\".  In our family cookbook it was voted \"The Best Ever Pound Cake\".  Others might be interested in an alteration I've made when adding nuts to this cake.  Reduce the flour to 2 cups and add one cup of pecans by hand at the end.  For several years I've reduced the sugar to 2 cups and haven't missed it.  But if you like chocolate chips or icing on your pound cake then you'll most likely want to keep 3 cups of sugar in the recipe.  I also start baking in a cold oven, my grandmother said it made the crust true.  I'm not sure if there is any truth to this or just an old wives tale, but the cake turns out great!  A definite family favorite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicki Mixon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1569047/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cream Cheese Pound Cake III",
            "description": "A classic recipe for a cream cheese pound cake.",
            "uploadDate": "2015-05-01T19:34:30.385Z",
            "duration": "PT1M47.608S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F5c92b2b6-e666-47fb-8daf-51962d543c79%2Ffe1652a8-04e7-4643-b8c3-f6a660d2f277%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4209467390001"
        }
    }
]