[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8421/chocolate-decadence-cake-ii/",
        "name": "Chocolate Decadence Cake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2507110.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1999-10-12T02:55:31.000Z",
        "description": "This recipe is a big seller in my bakery. The most important thing is to use good quality chocolate - I suggest going to your local gourmet food shop and asking them for a couverture - chocolate which has a high percentage of cocoa butter as opposed to vegetable fat. It will make all the difference in the world.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 inch round pan",
        "recipeIngredient": [
            "1 cup butter, melted",
            "1 ¼ pounds bittersweet chocolate",
            "5 eggs",
            ".867 cup white sugar",
            "½ cup cake flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch pan or line with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt chocolate in the top of a double boiler and mix with melted butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whip the eggs and sugar to full volume. Gently fold the chocolate into the whipped eggs.  Quickly but gently fold in the flour. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 35 minutes, or until the center feels firm to the touch. Do not turn out of pan until completely cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Melissa"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.111111111111111,
            "ratingCount": 18,
            "itemReviewed": "Chocolate Decadence Cake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "507.3 calories",
            "carbohydrateContent": "46.3 g",
            "cholesterolContent": "120.2 mg",
            "fatContent": "33.4 g",
            "fiberContent": "3.8 g",
            "proteinContent": "6.5 g",
            "saturatedFatContent": "20.2 g",
            "servingSize": null,
            "sodiumContent": "140.7 mg",
            "sugarContent": "36 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-09T22:50:51.573Z",
                "reviewBody": "Fantastic! I made this for one of the girls at work and it was a HUGE hit! It does only make one small cake but to be frank it's VERY rich (as if the 4lbs of chocolate doesn't give THAT away!) so almost everyone in the office was able to snag a little piece. (I filled a pan w/ six little tulip-shapped slots and about a half a bread pan) One thing I did notice anyone with a strong aversion to DARK chocolate gave a 'too rich' answer. To answer some questions added by a previous reviewer on instructions. When you whip (Unless you're looking for a REALLY good work out use a mixer not a whisk!) sugar and egg the color will actually lighten a bit to a very soft yellow and it will about double in size. Basically blend the out of it and when it won't poof up anymore you're there.:) This cake is also VERY easy to over bake which is what would make it dry! You can't do the toothpick test on this one since there is SO much chocolate most of it won't completely solidify until it has cooled. As the instructions say use the poke test it shouldn't be hard but as soon as there is resistance take it out you're done! I'm not sure about refrigerating however I had to because I baked it a day in advance and I didn't trust to leave it out w/ the dog all day but I FULLY Suggest warming it up when you serve it! It will be very fudge/brownie like when cold but softens right up again if you heat it up a little. I do also agree on the suggestion for using raspberries with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LauraAnne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3591683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-17T00:04:27.92Z",
                "reviewBody": "Fantastic!!! This cake was VERY Chocolatey sweet (but not too) moist (not wet) just about PERFECT. Taste like a dessert you'd have at a fine restaurant. This cake is great on its own or dress it up with fresh whipped cream berries melted chocolate sauce (for chocoholics) rasberry sauce whatever your hearts desire it can handle it. The birthday girl (30 ) I made it for who's a chocoholic absolutely loved it. As another reviewer wrote it needed 50-minutes to cook and I used a whisk instead of folding to incorporate everything.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "withmilk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479091/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-25T03:51:01.623Z",
                "reviewBody": "I am a Chocoleatier. I found this cake to be very dry and tasetless. I used 75% German chocolate and the result was not a keeper. All is not lost. I improvised with the product adding gansche and hot cream to the cake. I put the cake in a food processor and added the mix with flovoring. Great truffles. I would not make this cake again. Ken",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Ken",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1763836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-04T18:35:28.133Z",
                "reviewBody": "Hints for the inexperienced and experienced baker:  The nine inch pan should be at least 2 inches high.  In step #2 it states to whip the eggs and sugar to full volume.  This means you should use an electric mixer on high for at least 10 minutes or more until the eggs mixture looks like lemon chiffon (yellow should be the color of the inside of the lemon and fluffy/frothy looking).  The more you whip the more air you incorporate in to the mixture which is needed for this type of cake.  IF you don't do this the cake will be too dense not cook throughly in the middle.  If you read some of the other reviews you will see this happened on occasion.  Remember to fold in the chocolate and cake flour and not use the electric mixture.  I also used Kerry Gold Butter which is usually located in the gourment cheese section of your grocer.  Make sure the butter is thoroughly melted before you mix it in with the chocolate melted in your double boiler.  IF you do not have a double boiler, put a small pan in a larger pan filled 1/4 way with water.  I baked this cake in a convection oven at 335 for 45 minutes.  Otherwise, follow the temp and cook time in step 4.  It came out perfect.  I served it warm with a scoop of Breyer All Natural Vanilla Bean Ice Cream, drizzled with a raspberry sauce and fresh whipped cream.   Remember, if you do not incorporate enough air into the egg/sugar mixture the cake will be undone in the center.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy from Connecticut",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3524115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-21T23:04:16.513Z",
                "reviewBody": "I made this with dark chocolate and it was a big hit. Took longer to bake about 50 min. Absolutely wonderful with raspberry sauce!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAJSF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/61314/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-10T19:06:32.037Z",
                "reviewBody": "This got rave reviews from all the guests. My only complaint was the lack of instructions with this recipe. When you say \"whip the eggs & sugar to full volume\" does that mean whisk? Are you using a stand mixer with whisk attachment? What does full volume mean? How long does that generally take? Should the cake be refrigerated before serving like other decadence cakes? The center of this cake didn't completely cook at 35 minutes and no chilling but no one seemed to mind!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HUDIT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/306034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-21T23:02:44.793Z",
                "reviewBody": "This recipe was fabulous tasting and so easy to make. I've had this kind of cake at coffee shops and always loved it. I had never even thought about being able to make it myself! This is best topped with raspberry loganberry or some other tart berry puree. I highly recommend this recipe for all chocoholics.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARDOZOS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/478095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-21T23:02:46.107Z",
                "reviewBody": "I followed the recipe exactly.  I even used this expensive 70% bittersweet chocolate.  The cake was dry and crumbly.  It reminded me of dry fudge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "RSTUBBS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/377450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:54:51.25Z",
                "reviewBody": "perfection!!!!!!! my boyfriend is now my slave!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WRENWREN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/192920/"
                }
            }
        ]
    }
]