[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/347/bread/quick-bread/pumpkin-bread/",
                    "name": "Pumpkin Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8458/pumpkin-cream-cheese-muffins/",
        "name": "Pumpkin Cream Cheese Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F425065.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "You'll be glad you made this recipe for pumpkin muffins with a cream cheese filling and a streusel topping.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "18 muffins",
        "recipeIngredient": [
            "1 (8 ounce) package cream cheese",
            "1 egg",
            "1 teaspoon vanilla extract",
            "3 tablespoons brown sugar",
            "4 ½ tablespoons all-purpose flour",
            "5 tablespoons white sugar",
            "¾ teaspoon ground cinnamon",
            "3 tablespoons butter",
            "3 tablespoons chopped pecans",
            "2 ½ cups all-purpose flour",
            "2 cups white sugar",
            "2 teaspoons baking powder",
            "2 teaspoons ground cinnamon",
            "½ teaspoon salt",
            "2 eggs",
            "1 ⅓ cups canned pumpkin",
            "⅓ cup olive oil",
            "2 teaspoons vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour 18 muffin cups, or use paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the filling: In a medium bowl, beat cream cheese until soft. Add egg, vanilla and brown sugar. Beat until smooth, then set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For the streusel topping: In a medium bowl, mix flour, sugar, cinnamon and pecans. Add butter and cut it in with a fork until crumbly. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For the muffin batter:  In a large bowl, sift together flour, sugar, baking powder, cinnamon and salt. Make a well in the center of flour mixture and add eggs, pumpkin, olive oil and vanilla. Beat together until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pumpkin mixture in muffin cups about 1/2 full. Then add one tablespoon of the cream cheese mixture right in the middle of the batter. Try to keep cream cheese from touching the paper cup. Sprinkle  on the streusel topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 375 degrees F (195 degrees C) for 20 to 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Pumpkin Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Barb"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3374164810690425,
            "ratingCount": 898,
            "itemReviewed": "Pumpkin Cream Cheese Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "303.9 calories",
            "carbohydrateContent": "45.2 g",
            "cholesterolContent": "49.8 mg",
            "fatContent": "12.2 g",
            "fiberContent": "1.4 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "225.8 mg",
            "sugarContent": "28.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-13T17:24:46.903Z",
                "reviewBody": "Okay Ya'll, I've made these muffins a few times now, and I think I've got my final version.  First, when you soften the cream cheese, do not beat until creamy.  It should still be fairly stiff when you add the remaining ingredients.  Also, don't mix it thoroughly.  If you still have little \"globs\" of cream cheese floating around, it's perfect.  It should be the consistency of a thick sour cream.  The first time I made it, I beat it thoroughly smooth and ended up with soup! \r\n On the actual muffins, if you use white sugar, you get a lighter muffin, brown sugar makes a heavier muffin (go with what you like best).  I added 1 tsp of pumpkin pie spice in addition to the cinnamon. The batter is thick, but it works if you only fill the muffin cups 2/3 full.  I always get at least 24 muffins with this recipe. Last, the cream cheese mixture makes a cheesecake topping on the muffin, not a filling. I liked this recipe alot better once I realized that!  (Especially since I really like cheesecake) Make sure you put in indent with a teaspoon on top of muffin batter before you top it with cream cheese mixture. You end up with cheesecake spread evenly over the top! This recipe is very good, the cream cheese mixture was the only thing I had difficulty with.  But now, it's all goooooood.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GR8TSCOTT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/732028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-20T03:37:47.59Z",
                "reviewBody": "Yummy!\r\nI made a few changes.  I substituted 2 tbsp. of brown sugar for the 5 tbsp. called for in the stuesel topping, and I didn't use pecans, because my husband doesn't like them.  I added 1 tsp. of ground cloves and 1 tsp. of nutmeg to the muffin batter.\r\nI had enough muffin batter for 24 regular size muffins -- I did not have enough cream cheese topping for all 24 -- but that was okay, the muffins were divine without it.\r\nAlso, I used vegetable oil, instead of olive oil.\r\n\r\nGreat recipe!  Muffins are \"to die for\".  Will make perfect gifs this fall. Thanks a bunch for posting this recipe.  It is a new family favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSU71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/417915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-20T03:37:13.89Z",
                "reviewBody": "I'm a 20-yr-old college student home for the holidays, and I just used this recipe to make a birthday cake for my pumpkin-loving mother (who usually requests a pumpkin pie on her birthday, when everyone has had their fill of pie).  It worked out great!\r\nI skipped the crumb topping, cooked the batter in two round cake pans and then used the rosting (raw) to frost the cake.  There wasn't enough to completely cover the cake, but I frosted the top of one, than placed the other on top and frosted the top of that one.  It looked like a big sandwich cookie and after a while, the frosting starts to ooze down the sides, making it look like an old-fashioned confection (very pretty).  \r\nI used nonfat cream cheese and was worried about its ability to stand up to refrigeration, but it made it great!  I also used applesauce instead of any shortening-- no one was the wiser.  Thanks a bunch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEVINT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/510393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-12T02:52:26.457Z",
                "reviewBody": "My best friend and I used to work together . . . right across from a Starbucks.  We loved getting their Pumpking Cream Cheese Muffins in the fall.  When they stopped serving them, I found this recipe and made it right before my friend came over one night.  We both loved them.  She has since moved to another state and always asks me to make them when she comes to visit!  My husband, who grudgingly tried these because he hates pumkin pie, also loves them.  I did make a few variations.  I make double the cream cheese mixture (and I've never had a problem when the cream cheese touches the paper cup).  I leave out the pecans, and I add some pumpkin pie spice.  I also substitute canola oil for the olive oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alyssa Allen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2140783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-22T19:23:11.637Z",
                "reviewBody": "Please read the one, two and three star reviews - I found my experience with these muffins to be the same! While I wouldn't call them a failure, they didn't deliver the exceptional results I was expecting from them either. To address a few issues: olive oil is very well-suited for this recipe, so it is not a mistake or something weird. Extra-virgin olive oil, however, is generally NOT suitable for baking because its flavor is too strong. \"Pure\" or \"light\" olive oil should be used here. In addition to the cinnamon I also added a teaspoon of pumpkin pie spice but it did little to give these the flavor boost I had hoped for. As for the \"filling,\" which really is a topping, I increased the brown sugar to 1/3 cup and was glad I did. Similar recipes call for 1/3-1/2 cup sugar as opposed to this recipe's mere 3 T. But the \"filling\" was a disappointment, not making the statement I had hoped for or expected. Summing it up, these were a fairly flavorless muffin with a barely noticeable cream cheese topping. The recipe made 24 acceptable, but not outstanding muffins. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-21T19:44:20.18Z",
                "reviewBody": "This is basically the first thing I've ever baked successfully! Haha.  I even got the cream cheese filling to work for the most part by trying it a different way for every group of six muffins(it wasn't a very BIG filling, but there was still a definite area that was just cream cheese).  To do this, all I did was add a little bit of batter to the bottom of a muffin cup, then used a spoon to make a sort of raised wall around one side.  I snuggled the filling against that wall and then added batter to the other sides of the muffin cup and over the top of the filling.  Most of them came out with no cream cheese on top but with a nice little section beneath the surface that tasted very good.\n\nI didn't use pecans and I added 1/2 tsp pumpkin pie spice to the streusel topping (which I made a double dose of so I could pack it on, mmm hahaha).  The muffins turned out VERY good! =D I will definitely make these again, especially come Fall!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cyle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2405828/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T16:09:01.613Z",
                "reviewBody": "These were very nice muffins (as my co-workers who just happily gobbled down a bunch can attest!)  I'd make them again, but here's how I'd fine-tune the recipe: In the streusel, I'd use a little less flour, a bit more butter, and a bit of brown sugar.  Would also kick up the muffin's spiciness by adding some nutmeg to the batter.  And, I didn't like the idea of using olive oil, so I used vegetable oil and the texture was great - very tender.  Finally, these muffins are really not \"cream cheese FILLED.\"  Instead, the thin cheesecake-like topping sits atop the muffin underneath the streusel.  Next time I may try adding a touch of flour to the cheese mixture and put more than 1 T. of the mixture in each muffin (Got leftover cheese mixture?  Use it to make an individual-sized cheesecake \"tart.\"  I did and it was yummy and very cute!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINGIRLLJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/451423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-30T02:24:54.06Z",
                "reviewBody": "Yummy! The house smelled fantastic while these were cooking! I followed the recipe closely. I added a little extra vanilla to the batter, and I substituted pumpkin pie spice for the cinnamon in the topping. It sounds like a lot of people are having issues with the filling being more of a topping. Put the cream cheese filling in a sandwich size ziploc bag and cut off the tip. Stick the tip of the bag about 3/4 of the way into the pumpkin batter (once in the muffin tin) and squeeze. Your muffins will have perfect cream cheese centers. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ashley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3373912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-27T17:49:35.03Z",
                "reviewBody": "These muffins are the best! They are moist and very delicious....My husband thought they could win a prize for not only tasting great but looking so good as well! As others mentioned, I used veg. oil instead of olive oil. I highly recommend these muffins!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonnie Spada",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/903169/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Pumpkin Cream Cheese Muffins",
            "description": "Cakey pumpkin filled with cream cheese goodness!",
            "uploadDate": "2017-11-03T16:02:28.917Z",
            "duration": "PT1M40.334S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F47a6506f-724b-435c-ab77-38ec56e59eaa%2Fcf636cba-a2d3-4b7e-b298-d8a875b2d8c4%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5634383339001"
        }
    }
]