[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/712/world-cuisine/european/eastern-european/",
                    "name": "Eastern European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/714/world-cuisine/european/eastern-european/hungarian/",
                    "name": "Hungarian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8488/hungarian-flourless-hazelnut-cake/",
        "name": "Hungarian Flourless Hazelnut Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F879317.jpg",
            "width": 1451,
            "height": 1924
        },
        "datePublished": "1999-12-01T23:34:08.000Z",
        "description": "This cake was traditionally a birthday cake in my friend's home. Her mother is from Hungary and only has this recipe in her head! Now it will be preserved.... Note: hazelnuts may be toasted or untoasted. The skins may be removed or left on.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 9-inch 3-layer cake",
        "recipeIngredient": [
            "12 ounces hazelnuts",
            "2 teaspoons baking powder",
            "6 egg yolks",
            "⅝ cup white sugar",
            "6 egg whites",
            "1 pint heavy whipping cream",
            "⅛ cup chopped hazelnuts, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 9-inch springform pan. Grind hazelnuts until very fine. Add baking powder and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whip the egg yolks with the sugar until pale yellow in color. Beat in the ground hazelnut mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate CLEAN bowl, with a CLEAN whisk, whip the egg whites until stiff. Quickly fold 1/3 of the egg whites into the yolk mixture, then add the remaining whites and fold in until no streaks remain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into a 9 inch springform. Bake in preheated oven for 60 to 75 minutes, or until top of cake springs back when lightly tapped. Cool on wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When cake is cool, slice horizontally into 3 layers. Whip the cream until stiff, and spread generously between layers, on top and on the sides of the cake. Sprinkle chopped hazelnuts on top for decoration.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Eastern European",
            "Hungarian"
        ],
        "recipeCuisine": [
            "European",
            "Eastern European",
            "Hungarian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "LAURANERIC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.465909090909091,
            "ratingCount": 88,
            "itemReviewed": "Hungarian Flourless Hazelnut Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "398.8 calories",
            "carbohydrateContent": "17.1 g",
            "cholesterolContent": "156.8 mg",
            "fatContent": "35 g",
            "fiberContent": "2.9 g",
            "proteinContent": "8.4 g",
            "saturatedFatContent": "11.3 g",
            "servingSize": null,
            "sodiumContent": "128 mg",
            "sugarContent": "11.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-08-09T21:01:02.983Z",
                "reviewBody": "This is a fabulous torte.  I've made it several times and it has been perfect EVERY time. I do \"sift\" the hazelnuts using a colendar to be sure the nuts are fine enough. I've also made it using almonds instead of hazelnuts. (12 oz equals 2 1/2 c. nuts).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JanZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/639854/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-09T21:01:08.64Z",
                "reviewBody": "I very much enjoyed this cake; I've made it seperately with almonds and hazelnuts.  However, I did make several modifications to it.  Since the cake is so dry, after I sliced the cake into 2 layers, I soaked each layer with Frangelico or Amaretto.  Then I added whipped cream stabilizer, and flavored the whipped cream with liquer and sugar.  Lastly, I used an extra half pint of whipped cream in the \"frosting\".  With these additions, I've gotten rave reviews at the parties I took the cakes to.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LYONESSKIM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/238586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-20T05:47:18.733Z",
                "reviewBody": "Thank goodness someone is drawing attention to the traditional Hungarian torte recipes. These flourless \"tortes\" are NOT easy to make and if you can master them---you will forever long for tortes and scowl at those \"common\" flour cakes! I grew up eating these cakes and they are splendid--as is this one. It DOES take practice to master these--and they are worth it. The secret of tortes are many many light layers and lots of air being beaten into the batter. Bakers are no longer taught these old baking techniques as these cakes commonly used 16 to 24 egg whites each and ground nuts for batter---which equates to very expensive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lina G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1687768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-13T02:21:41.967Z",
                "reviewBody": "This has a delicious hazelnut flavor and was surprisingly easy to make. It's also very healthy for a cake! I used farm eggs so I actually needed nine eggs to make it workable. I started with seven separated but the nuts and yolks formed a dense ball that was difficult to work with so I wound up adding two whole eggs to the mixture before folding in the whites. So if you find yourself in that position just add more eggs until it softens up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANTHM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1375802/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-26T02:51:07.64Z",
                "reviewBody": "I made this for Christmas dessert this year. A few comments when I mixed the ground nuts (you can buy them pre-ground) into the yolks it turned into a hard lump making gently folding the whites impossible. Next time I'll fold the nuts into the whites then into the yolks. I used two 9\" round pans (lined the bottom with parchment) and baked them for 45 minutes (no springform pan but this worked great.) To the whipped cream I added 4 tbs powdered sugar and 4 tbs Godiva liqueur. Awesome dessert! My husband says it's his new favorite (he is very picky not a sweets eater.) Though he thought a little rum soaked into the cakes would be a good addition. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FREYAUSA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1182752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-09T21:01:14.793Z",
                "reviewBody": "This was not difficult to make but was drier than I had hoped for - and did not require the full time to cook. It took 15 less minutes to cook and that was with my oven on about 320. In addition the recipe does not indicate when to add the white sugar (although common sense says add to the egg whites). The whip cream should also contain some white sugar as it is a bit bland by itself in between the layers. I found that the cake was difficult to cut into 3 layers and opted for 2 layers instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PAM G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/235012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-06T21:23:35.987Z",
                "reviewBody": "I experimented with this cake as I want to make it for my sis-in-law this weekend... who is allergic to both wheat and dairy! But...This cake was awesome!! Instead of cream I used dark chocolate ganache and I loved it! My hubby cant wait for me to make it again. I will be making it for her birthday this weekend and I hope she loves it too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SDoc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2307572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-16T18:17:35.77Z",
                "reviewBody": "I read all the reviews and tried it.  I ground about 1 lb of hazelnuts, after roasting and peeling the skins off.  The ground hazelnuts came to about three cups (ground).  I then use \"large\" eggs, but chose 6 of the largest in my dozen for my eggs to separate.  Once I whisked the six yolks in sugar (to a light yellow color), I, in a separate bowl and beaters, whisked up the 6 egg whites, until they formed peaks.  I then put one whole egg in my hazelnut, egg yolk mixture, and beat those together. Adding the whole egg loosened up the hazelnut mixture.  I folded in the eggs whites with no trouble, at all.  I used a spring form pan, greased and floured.  Baked at 325, for 40 minutes.  I immediately removed baked cake from pan and let it rest on a rack for about 10 minutes, but then wrapped both the rack and the cake in foil, to capture any steam produced and keep the cake moist.  It came out VERY moist and rose to almost 2 inches, enough to get three layers out of it.  I iced it with whipped cream that I whipped until almost butter (just until it starts to clump-you have to watch this closely).  It creates a sturdy whipped cream without having to make a cream cheese whipped cream.  Hope this helps! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "coupykk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11545143/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-28T04:06:06.077Z",
                "reviewBody": "I decided to make this cake for my dad for his birthday. He likes dense nutty cakes and this sounded exactly to his tastes. I followed the recipe as it was written. The nut and yolk mixture was rather stiff for folding in the whites but if you do the 1/3 first trick it works ok. I think it probably lost a bit of air trying to get it mixed in but I didnt fuss too much and left it very slightly lumpy to avoid losing too much more. The cake cooked beautifully in 55 minutes leaving it quite moist and smelling gorgeous. I decided like others to cut it into 2 layers as it wasnt a very thick cake.(and who needs the extra cream?) I did however make it a little extra special by making a runny ganache with some melted chocolate milk and a slosh of quintreau and spreading it on the bottom layer before the cream. This complemented the fresh strawberries we had with it perfectly. Everyone wanted a second piece! My dad is surely going to insist I make this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "belinda blight",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1536133/"
                }
            }
        ]
    }
]