[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8761/chicken-scampi-ii/",
        "name": "Chicken Scampi II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8050741.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-05-07T14:45:00.000Z",
        "description": "All the flavor and taste of shrimp scampi! Serve over rice or with spaghetti. Do not forget to serve with crusty rolls or bread to sop up the sauce! Enjoy!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ cup butter",
            "¼ cup olive oil",
            "1 teaspoon dried parsley",
            "1 teaspoon dried basil",
            "¼ teaspoon dried oregano",
            "3 cloves garlic, minced",
            "¾ teaspoon salt",
            "1 tablespoon lemon juice",
            "4  breast half, bone and skin removed (blank)s boneless chicken breast halves, sliced lengthwise into thirds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat the butter and oil over medium high until the butter melts. Add the parsley, basil, oregano and garlic and salt and mix together in the skillet. Stir in lemon juice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Then add the chicken and saute for about 3 minutes or until white. Lower the heat and cook for about 10 to 15 minutes or until chicken is cooked through and the juices run clear. More butter can be added if needed.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CYNDEE1942"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.48653500897666,
            "ratingCount": 1114,
            "itemReviewed": "Chicken Scampi II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "458.4 calories",
            "carbohydrateContent": "1.4 g",
            "cholesterolContent": "129.4 mg",
            "fatContent": "38 g",
            "fiberContent": "0.3 g",
            "proteinContent": "27.7 g",
            "saturatedFatContent": "16.8 g",
            "servingSize": null,
            "sodiumContent": "677.5 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-05T06:26:00.577Z",
                "reviewBody": "OMG, this is AMAZING!  We loved it!  After reading the reviews I added some things.  I added 1/4 cup of white wine (Chardonnay) when I added the lemon juice, I used 2 tbs of lemon juice instead of 1, a couple more cloves of fresh garlic, and I sauted red and yellow pepper, mushrooms, and red onions and added them in with the chicken.  I also added the pasta in with the chicken at the end so it could get all the great flavor!  My husband kept saying this tastes like restaurant quality and it really did!  It's really fresh tasting and you can taste every ingredient. It wasn't too greasy either.  It would be great to serve for company and it's super easy too!  Thanks for the great Italian recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovin'life",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1385303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-14T18:33:58.403Z",
                "reviewBody": "This recipe is INCREDIBLE. It is most definitely the base for creating an authentic Olive Garden-style Chicken Scampi. I used chicken tenderloins instead of sliced breasts and coated them in flour before cooking them. A also added extra garlic, since I'm a garlic lover. When the chicken was almost done cooking I added red onion and red, yellow, and green bell pepper cut into strips. Serve over angel hair pasta and and top with grated Parmesan cheese and I don't think anyone could tell the difference between this and the restaurant original! The only thing I recommend is keeping the heat down to medium - the chicken will cook slower but the garlic won't get burned - burned garlic will utterly ruin the whole meal with its bitter taste. Thank-you, thank-you, thank-you Cyndee for this wonderful recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/870105/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-25T13:21:04.373Z",
                "reviewBody": "What a great recipe!  I ended up serving it over angle hair pasta and it worked out perfectly for two... you may want to consider doubling the recipe if you're thinking about serving more people than I did.  Otherwise, I added about a half cup of white wine to the sauce while the chicken was cooking and cut up a tomato for some more color.  I cooked the chicken on low heat and would suggest doing so if any of you try this.  Too high and you'll sear it (trap the juices inside) and prevent it from flavoring the sauce... which it does beautifully!  Also, I parboiled some broccoli, sauteed it in garlic, and added it right before I served everything -- turned out so well!!!  Top it with parmasean cheese for the finishing touch :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIKEYB01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/731838/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-19T20:34:53.877Z",
                "reviewBody": "Very good! I carefully read through a great amount of reviews and followed some good suggestions - 1/2 the butter in the recipe use only 2 Tlbs. of Olive oil more garlic (I used 4 big cloves) added 1/2 cup of white wine 1 diced tomato for color added a small red chili pepper chopped fine and last but not least topped it with fresh grated parmasan cheese. It came out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2343336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-03T21:27:25.627Z",
                "reviewBody": "Delicious!! One of the cooks at my Dad's restaurant used to make this for me every day when I was a kid. Being very picky it was one of the few things they could get me to eat. I've ordered chicken scampi in rest. a number of times in hopes that it would be the dish I ate as a kid. No luck....until now!! I will make this again and again. Perhaps try adding a little white wine sometime maybe a little more lemon and a little less salt. But it's great as is. I actually like the large amount of butter and olive oil sauce it yeilds as it is great over pasta. Be sure to have some fresh Parmesan to grate over the top when serving. Goes great over angel hair and makes awesome leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PrincessJenna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-04T19:53:16.797Z",
                "reviewBody": "This was delicious! I did cut out a lot of fat and calories by browning the chicken and spices in only 1/4 cup butter then added 1/2 cup of chicken broth and let the chicken simmer until done then added some cornstarch to thicken it up just a little. Served over angel hair pasta with salad and french bread. It was a wonderful fairly low fat meal. I will be making this one again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MADISONLIBERTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1050343/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-14T13:28:11.68Z",
                "reviewBody": "The chicken in this recipe was good but the sauce just didn't really do it for me. It needed something else. If I make again I will try adding a little wine or chicken broth so I can reduce it and get better flavor. Also I though there was just too much butter and oil. I will cut it in half next time. I tried putting the left over oil/butter mix over pasta but it really have no flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-08T21:04:12.31Z",
                "reviewBody": "I was surprised at how good this dish was. It was also a cinch to prepare. I didn't measure a thing I just added as much as I like. I used fresh basil and fresh parsley from my herb garden that made a huge difference. Also I tossed the cooked pasta in the dish I made the sauce in to make sure it coated well. I don't recommend cooking the chicken for 10-15 minutes check it after 5. This dish was good enough to make for company. Thanks for sharing. I've had this recipe for years now and am glad I finally tried it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "amydoll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-01T20:10:30Z",
                "reviewBody": "This is the first review I've written after using this site for about 5 years and making dozens of recipes - just to give an idea of how good this recipe is. I read the reviews and used some of their suggestions: did not turn the heat up too high to avoid burning the garlic dredged the chicken in flour used half of the butter to start with and the remaining half throughout while cooking. I also used about 1/4 cup of white wine when putting in the lemon juice and used about 4 cloves of garlic. Once the chicken is cooked I added chopped yellow and red bell peppers (1/2 of each) mushrooms and fresh broccoli. After letting it cook for another minute or two I added my cooked angel hair pasta and tossed it all together in the pan. DELICIOUS! My two sons and husband ate it all up and barely even talked. VERY VERY good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thekearns2004",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3858771/"
                }
            }
        ]
    }
]