[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/283/desserts/pies/vintage-pies/",
                    "name": "Vintage Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12957/desserts/pies/vintage-pies/chess-pie/",
                    "name": "Chess Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9090/chess-pie/",
        "name": "Chess Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4589509.jpg",
            "width": 3443,
            "height": 2582
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This is a very old Southern recipe. It's a very sweet, rich pie which cannot be described as anything but marvelous. This is not my personal recipe but was passed to me by my grandmother and from her grandmother and so on and so forth.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "½ cup butter",
            "2 cups white sugar",
            "1 teaspoon vanilla extract",
            "4 eggs",
            "1 tablespoon cornmeal",
            "¼ cup evaporated milk",
            "1 tablespoon distilled white vinegar",
            "1 (9 inch) unbaked pie shell"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix the butter, sugar and vanilla together. Mix in the eggs, then stir in the cornmeal, evaporated milk and vinegar until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 minutes in the preheated oven, then reduce heat to 300 degrees F (150 degrees C) for 40 minutes. Let cool. Cut and top servings with whipped cream. You will think you have died and gone to heaven.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Vintage Pie Recipes",
            "Chess Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "T. Knecht"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1694352159468435,
            "ratingCount": 301,
            "itemReviewed": "Chess Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "460.3 calories",
            "carbohydrateContent": "62 g",
            "cholesterolContent": "125.8 mg",
            "fatContent": "22.1 g",
            "fiberContent": "0.9 g",
            "proteinContent": "5.3 g",
            "saturatedFatContent": "10.3 g",
            "servingSize": null,
            "sodiumContent": "242.3 mg",
            "sugarContent": "51.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-13T03:59:40.593Z",
                "reviewBody": "Just thought I'd throw in my two cents worth on this one.  FYI for previous reviews: Chess Pie should have a \"burnt\" top.  It's the cornmeal that comes to the top and browns that gives this appearance.  \r\nMy great-grandmother's recipe calls for only 3 eggs and only 1 1/2 cups sugar.  My mother always removes her pies when a butter knife inserted in the middle comes out clean.  For those of you who have slightly runny centers, when you turn off the oven... leave the pie inside until the oven is cool. As far as I've ever been able to tell.. you can't dry out a Chess Pie.  And for those whose pies cracked on top, this is fairly common. Sometimes mine crack, sometimes not.  May have to do with humidity and that sort of stuff.\r\nFinally, for those knocked out by the sweetness.. Chess Pie is a traditional down-home Southern Pie. If it ain't sweet, it ain't dessert.  I only wonder why T.Knecht put any topping on at all.  Never had it with topping... don't guess I ever will. Hope I helped.  God Bless!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE HALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/839438/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-24T11:32:47.82Z",
                "reviewBody": "This is an excellent recipe and very easy to make.  I am a little surprised at some of the negative comments.  This pie recipe is very typical and delicious for one of the custard-type pies.  Try using heavy whipping cream rather than evaporated milk, this will help with the texture and the cracking.  Also, PRE-HEAT your oven to 450 degrees, place pie plate on a cookie sheet, place in oven and immediately turn oven down to 350 degrees and bake 45-50 minutes.  The top will be a medium brown as the cornmeal surfaces and browns, and the pie should be set.  I had no problems with it and my family absolutely loves it.  Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CRIVY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/861404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-14T03:23:29.45Z",
                "reviewBody": "This pie is still in the oven as I write this, but after all the recipes Ive tried I have yet to come along one that resembled the pies my grandmother used to make.  One of the reasons I searched for so long was that I didnt realize the one very simple fact that set my family pies apart from the \"recipe pies\" - the commotion.  There was always so much going on in our house during the holidays that this pie was made, that the pie always fell.  Every Chess pie (we call it Vinegar Pie) Ive ever had in 22 years has been flat!  I would recommend stomping to anyone else who has this same tradition.  Also, leaving your pie in the oven while the oven cools is truly the best way to set the center, and the top is SUPPOSED to be brown and cracked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FYRECRACKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1286968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-21T02:19:50.25Z",
                "reviewBody": "This is a very good Chess pie recipe, but I did modify it to resemble the pies of my youth.  I have never heard of using evaporated milk, so I substituted buttermilk instead, and I also used 1 C white sugar, 1 C brown sugar to cut down on the sweetness.  I did follow the advice of some of the other reviewers to guarantee my pie filling set up nicely.  I heated the oven to 450 F and once I put the pie in, immediately lowered it to 350 F.  I ended up cooking mine for 50 minutes and left the pie in the oven the entire time it was cooling down.  Afterwards, I put it in the fridge for 15 minutes, and it turned out the perfect consistency.  Since this pie has to cook for so long, I would recommend putting tinfoil over the exposed crust, unless you like the edges browned.  My husband prefers browned crust, so I just brush mine with half-and-half before cooking and leave them uncovered.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2470067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-10T20:26:27.523Z",
                "reviewBody": "My fiancee asked me to make a chess pie for his office potluck and not only did I not know how to make it, I never even heard of it!  I decided to look it up here and found this recipe, and I am glad I did!  It turned out great!  I made enough for 2 pies.  I did modify with buttermilk instead of evap. milk and half brown sugar/half white. The rest I followed exactly and it was delicious. I was scared it would be firm enough like some other users said, but I left it in the oven until it was cool and it had a great texture!  5 stars!!  Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tashmaxx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1717770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-11T19:58:21.61Z",
                "reviewBody": "I have made this pie recipe several years and the most important tip that I can give is to make sure that no mixer is used to make this pie. As the directions state everything is stirred together. No whisking. only stirring. I do not put cornmeal in my pie. This is a good sugar pie. Years ago it was said that the name was Jess Pie....or Just Pie..there are a lot of old stories as far as the name goes. However I have been eating Chess Pie for over 50 years and this is a good recipe. There is also another name...Transparent Pie...regardless of what it is called...baking until a knife comes out clean is the way I was taught to bake it. This pie cooked at the right time and temp that were recommended in the original directions and I used the ingredients that were called for other than leaving out the cornmeal. I make this pie for Thanksgiving and Christmas and the forks are ready long before the pie is cool enough to eat. I always make 2 or 3 as I know how special this pie is for our family holidays. It makes no difference how many other desserts show up these pies go out first...I do cover the edges with foil; as I don't like a burned crust or even too brown. It is an old Southern pie recipe and it was made when there were very few ingredients available to even make a pie. Just Pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LadyLoy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3331333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-29T16:46:02.687Z",
                "reviewBody": "I wish I knew what I did wrong with this pie.  I've tried it twice, and both times bombed by having a beautiful crust only to discover a chess \"pond\" below.  The first time I followed the recipe exactly.  Since that didn't work, I tried some of the previous cooks' suggestions and added cooking time and left the pie in the oven while it cooled down. Both results were the same. The flavor is exactly what I'm looking for, but I just can't get it to set.    I'm an old-fashioned southern girl from Tennessee who knows her chess pies and has worked in bakeries, so why is it that I can make a three-tiered wedding cake, but can't get this pie to set?! ha ha",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4039990/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-07T18:22:14.997Z",
                "reviewBody": "this pie is great, but it really does crack a lot. i used 1/4 cup buttermilk in place of evaporated milk, and it did not crack, and still taste great.  it is the best chess pie ever.  i make it and sell it along with other pies i sell, but i don't let my customers know where i got the recipe (smile).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KID KARE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/737169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-29T15:02:43.42Z",
                "reviewBody": "I found that when I followed the directions the pie wasn't set in the center so I had to return it to the oven. Might want to increase the bake time. Would also suggest that you cover with foil so the top won't brown too much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SAMOORE112",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/260850/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chess Pie",
            "description": "A traditional Southern sweet and rich pie.",
            "uploadDate": "2015-06-22T20:28:56.193Z",
            "duration": "PT1M28.755S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F28f2e839-a6f5-4ac0-84ab-cc308c539743%2Ff6b23741-2c3e-4e5f-9fdd-09604a29599d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4313883968001"
        }
    }
]