[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9346/chocolate-cookie-cheesecake/",
        "name": "Chocolate Cookie Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4556862.jpg",
            "width": 1694,
            "height": 960
        },
        "datePublished": "1998-12-11T02:57:18.000Z",
        "description": "I don't know what to say about this recipe other than it is decadent and addictive.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT11H0M",
        "recipeYield": "14 servings",
        "recipeIngredient": [
            "2 cups chocolate sandwich cookie crumbs",
            "2 tablespoons butter, melted",
            "¼ cup packed brown sugar",
            "1 teaspoon ground cinnamon",
            "2 pounds cream cheese, softened",
            "1 ¼ cups white sugar",
            "⅓ cup heavy whipping cream",
            "2 tablespoons all-purpose flour",
            "1 teaspoon vanilla extract",
            "4 eggs",
            "1 ½ cups chocolate sandwich cookie crumbs",
            "16 ounces sour cream",
            "¼ cup white sugar",
            "1 teaspoon vanilla extract",
            "1 cup heavy whipping cream",
            "1 ½ cups semisweet chocolate chips",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine 2 cups cookie crumbs, melted butter, brown sugar, and cinnamon in a medium bowl; firmly press mixture evenly onto bottom and 1 inch up sides of a 10-inch springform pan. Bake at 350 degrees F (175 degrees C) for 5 minutes; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat cream cheese until smooth. Gradually mix in 1 1/4 cups sugar, 1/3 cup whipping cream, flour, and 1 teaspoon vanilla. Beat in eggs, one at a time, beating after each addition. Pour 1/3 of batter into prepared pan. Top with 1 1/2 cups cookie pieces; pour in remaining batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 45 minutes. Remove cake from oven. Combine sour cream, 1/4 cup sugar, and 1 teaspoon vanilla; spread evenly on cheesecake. Continue baking for 7 minutes. Turn oven off and leave in oven 30 minutes. Remove cheesecake, and let cool completely on a wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1 cup whipping cream and chocolate chips in a saucepan; stir over low heat until chocolate melts,  and then stir in 1 teaspoon vanilla. Pour mixture over cheesecake while still warm. Refrigerate until serving time. Should be at least 8 hours for refrigerator time, remove about 1/2 hour to 1 hour before serving, remove ring from springform pan, decorate to choice and get out your fork!\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Millie Ellis"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.703187250996016,
            "ratingCount": 502,
            "itemReviewed": "Chocolate Cookie Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "753.5 calories",
            "carbohydrateContent": "62.9 g",
            "cholesterolContent": "174.2 mg",
            "fatContent": "52 g",
            "fiberContent": "0.7 g",
            "proteinContent": "11.2 g",
            "saturatedFatContent": "30.5 g",
            "servingSize": null,
            "sodiumContent": "347.9 mg",
            "sugarContent": "33.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-10T00:11:59.513Z",
                "reviewBody": "Thank you for this great recipe. I continue to enjoy my leftovers! My suggestions-I think that the oreo cookie crumbs for the crust caused the crust to be gooey (probably a function of the white center). Next time I will use chocolate Teddy Grahams or another plain chocolate cookie to avoid this. Also, the recipe calls for 1 1/2 Cups of cookie crumbs to be added after 1/3 of the batter is ptu in the crust. If you read the instructions however, you should add cookie pieces. This makes a HUGE difference, because the cookie pieces (the bigger the better) are what make this cheesecake so good. It's yummy to bite into a piece of cake and get a cookie surprise. Overall, a great cheesecake. Will add to my recipe book!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deanna Latendresse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/847639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-29T02:44:59.64Z",
                "reviewBody": "Absolutely phenomenal cheesecake recipe!  I had a 9\" pan, not 10\", so I baked it for 55 minutes (not 45), then for 8 minutes (not 7) once sour cream was put on. I did leave out cinnamon in the crust.  I also put a large stainless steel bowl over the cheesecake once I took it out of the oven (had read that it helped maintain moisture while it cooled) till it was completely cooled. It came out perfect,and just like other reader's attested, was gobbled up by all.  I will make this over and over again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RIVES1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1103960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T02:43:11.937Z",
                "reviewBody": "This is a very good cheesecake..but I need help on what I did that made the cheesecake hard to slice...the chocolate topping was hard to cut through and didn't slice very well..should I have left out some chocolate? It was very heavy on top! Also do you let the cheesecake cool before putting sour cream on? It was very good and it looked good until I sliced it..Please tell me what I can do to make it easier to slice..THANKS",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CORDELLIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762533/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-31T04:16:47.717Z",
                "reviewBody": "My husband and his co-workers said this cheesecake was \"amazing!\"  One even said it was the best dessert he had ever tasted.  Mine didn't look like the one in the picture.  Instead, mine was layered.  The chocolate ganache topping covered all of the top of the cheesecake, about one-quarter inch deep, and made a lovely, neat-looking (smooth) top.  Next was the sweetened sour cream layer.  The texture of the sour cream concerned me at first, because I feared the cheesecake wasn't set, but it turned out it was just the texture of the sour cream.  Even though it was initially concerning to me, everyone else thought it was fantastic, and one of the best details of the cake.  After that was the cheesecake layer, also visually interesting with the cookie pieces inside of it.  Yes, it took three hours to prepare, but made a very large cheesecake that fed quite a few guys that can really eat dessert.  Thank you for a great recipe!  Will definitely save for a special occasion!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hotstuff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1539720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-27T21:28:10.223Z",
                "reviewBody": "Wow! What a great dessert! This is one of the most delicious, rich, and decadent desserts I have ever eaten!!! That said, next time I will NOT add the cinnamon. I only used half the amount the recipe called for, but it still was too obvious and clashed with the flavors of the cheesecake. Also, when adding the sour cream mixture to the top of the cheesecake, be careful not to pour it directly into the center, as I did. This results in a big gob of sour cream mixture sinking into the cheesecake. Despite this, it still turned out magnificent. The chocolate top layer covers up any imperfections, and it truly is bakery/restaurant quality.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "leahnwells",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/771970/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-03T23:27:25.087Z",
                "reviewBody": "I honestly rated this under my mom's name in 2004 but I have used this recipe many times since that time. It is very, very good but can be hard to slice depending on how long you heat the chocolate/cream/vanilla topping. It always helps to take a sharp knife, run it in hot tap water, wipe with a towel and repeat with every slice. It takes 4 8oz packages of cream cheese, please only use Philadelphia Creme Cheese for the best results. I would beat the mixture awhile to get it smooth enough. I have shared this recipe with many people and actually had a person call me for another person whose daughter only asked for this for her birthday, a college student! My son who was 6 when I rated it is now 9 1/2 and still asks for this for his own birthday cake. I had an uncle who said it was as good as the Cheesecake Factory. A good recipe for parties and anytime you want to impress anyone. Here is my original review, I still love it.\n\n 1/25/2004\n\nSUBMITTED BY: SHEILA R \n\nThis is the FIRST recipe I got from All Recipes. The directions were very easy to follow and the cheesecake is very, very good. My picky 6 yr old loved it and I have so many more friends now and a couple extra pounds too!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Rohrbach Donoghue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2363607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-26T14:29:18.377Z",
                "reviewBody": "With both chocolate and sour cream frosting this cheesecake is definitely 'decadent'. I would however recommend doubling the amount of butter it calls for. Before bringing this cake to a potluck I chilled it overnight. The next day I tasted the cheesecake. It was dryer than I prefer. But after eating a leftover slice maybe 2 days later I was surprised that it was so unbelievably rich and creamy with just the right amount of firmness. So if you plan on making this for someone I would highly recommend making it days earlier to get optimal cheesecake. 100% Recommended. =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SheffShannon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2693394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-05T18:23:09.823Z",
                "reviewBody": "Yum!!!  I will definitely be making this cheesecake again! I modified part of the recipe to make it fit into a 9\" springform pan.  I used 1 1/2lbs cream cheese, slightly less than 1 cup of sugar, 1/4 cup whipping cream, 1 1/2 T. flour, 3/4 t. vanilla and 3 eggs.  Some tips: Bring the cream cheese and eggs to room temperature before mixing.  Let the cheesecake stand for 5 minutes out of the oven before spreading the sour cream mixture over the top and putting in back in the oven. Leave the cheesecake in the oven for a full hour after you turn the oven off.   Let cheesecake cool completely on the counter before putting it into the fridge.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WAMommyof4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wamommyof4/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-31T19:46:23.9Z",
                "reviewBody": "Indulgence should be enjoyable. This cake is not.\n\nLook at the calorie content, it is completely unnecessary. I didn't notice it until I had already made it and immediately felt guilty about serving it.\n\nI'm all for foregoing calorie counting at the holidays but this is ridiculous and, worse, not worth it.\n\nThe coarse, processed sweetness of the cookies is a poor match for the subtle, tangy sweetness of cheesecake. The topping is way too heavy and overpowers the rest of the flavors.\n\nUse low-fat milk in this recipe instead of heavy whipping cream. The latter's just too much. For the topping try a lighter, fudge-like recipe (chocolate and marshmallow cream for example), or at the  very least, half the ingredients. It's too thick otherwise.\n\nWhat I ate of it I had to dig around the cookies and topping to make it worthwhile. This was the least popular dish at my holiday meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3431348/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chocolate Cookie Cheesecake",
            "description": "Show-stopping cheesecake stars cream-filled chocolate sandwich cookies.",
            "uploadDate": "2013-11-27T19:27:24.118Z",
            "duration": "PT5M12.062S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7d9b4c80-8de3-407e-a384-c83ed4ca64bc%2F6bdfdb2a-2c79-4239-93a0-255adf7490dd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2874145874001"
        }
    }
]