[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
                    "name": "Greek",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9454/greek-baklava/",
        "name": "Greek Baklava",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8944157.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-11-17T14:12:24.000Z",
        "description": "A Greek favorite that makes everyone think you are a master chef and is sooo easy to make!! I taught a Greek friend how to make apple pie and she taught me this fabulous recipe. The phyllo dough for this recipe is found in the freezer section of most grocery stores. Add a little lemon zest to the sugar sauce, if desired.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 (16 ounce) package phyllo dough",
            "1 pound chopped nuts",
            "1 cup butter",
            "1 teaspoon ground cinnamon",
            "1 cup water",
            "1 cup white sugar",
            "1 teaspoon vanilla extract",
            "½ cup honey"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F(175 degrees C). Butter the bottoms and sides of a 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Chop nuts and toss with cinnamon. Set aside. Unroll phyllo dough.  Cut whole stack in half to fit pan.  Cover phyllo with a dampened cloth to keep from drying out as you work. Place two sheets of dough in pan, butter thoroughly.  Repeat until you have 8 sheets layered. Sprinkle 2 - 3 tablespoons of nut mixture on top. Top with two sheets of dough, butter, nuts, layering as you go. The top layer should be about 6 - 8 sheets deep.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using a sharp knife cut into diamond or square shapes all the way to the bottom of the pan. You may cut into 4 long rows the make diagonal cuts. Bake for about 50 minutes until baklava is golden and crisp.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make sauce while baklava is baking.  Boil sugar and water until sugar is melted.  Add vanilla and honey.  Simmer for about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove baklava from oven and immediately spoon sauce over it.  Let cool.  Serve in cupcake papers.  This freezes well. Leave it uncovered as it  gets soggy if it is wrapped up.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Greek"
        ],
        "recipeCuisine": [
            "European",
            "Greek"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "NEONWILLIE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.831835686777921,
            "ratingCount": 2337,
            "itemReviewed": "Greek Baklava",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "393.1 calories",
            "carbohydrateContent": "37.5 g",
            "cholesterolContent": "27.1 mg",
            "fatContent": "25.9 g",
            "fiberContent": "3.1 g",
            "proteinContent": "6.1 g",
            "saturatedFatContent": "9 g",
            "servingSize": null,
            "sodiumContent": "196.4 mg",
            "sugarContent": "19.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-10T06:31:37.04Z",
                "reviewBody": "I have made Baklava for about 30 years now, ever since my greek stepmother made it during my teenage years.  At first it took me about an hour to assemble, but now only about 15 minutes.  Here are the shortcuts to save time.  I do let the phyllo dough thaw, but do not cut the dough and do not cover it while layering. I just drape the bottom half over the pan and then fold the top half over it, \"painting\" a thin layer of butter quickly.  I use a new and clean basting paint brush, to spread a very thin layer of butter between each phyllo sheet. It is only necessary to lightly brush on the butter, not saturate.  The more wrinkles the sheet has in it, the better.  You just keep putting and folding the edges and that ends up making the baklava more layered and crispy.  If it turns out soggy, it's from too much butter, not the sauce.  Also, when you cut the Baklava before you bake it, use a sharp knife and cut to within a half inch FROM the bottom of the pan, so then when you pour the sauce into the cooled Baklava, the sauce seeps into every layer of the Baklava, but doesn't sit at the bottom. Then, cut all the way thru after the whole thing has completely cooled.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sandra lee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2595819/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-01T19:42:40.86Z",
                "reviewBody": "I have been using this recipe from allrecipes.com for years, and I just realized I never reviewed it.  I have made it dozens of times, and without fail it always impresses.  You should follow these tips that are suggested by other reviewers: 1) Lightly roast nuts prior to chopping (I always use walnuts). 2) Make 1 1/2 times sauce recipe calls far. 3) Make sauce AHEAD of recipe, and put in the fridge to cool. By pouring the  cool syrup on the warm baklava it will turn out crispy. 4) Cook at 325F until browned on top (I have found 350F a little too high) This recipe, along with the Classic Tiramisu also on this site, are my top 2 desserts to make. For any function, family get together or holiday, I always get requests for these 2 desserts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/213785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-24T05:26:30.53Z",
                "reviewBody": "I have another tip to use for this recipe.  I really wanted to use real butter, and I had so much trouble using a pastry brush to brush the butter on because it kept crunching up the dough as I painted, so I bought I can't believe it's not butter spray and dumped the contents in a cup, then I melted my \"real butter\" and put it into the spray bottle and sprayed the dough.  This saved time and your dough won't crunch up.  Then after I was done I just poured the other stuff back into the bottle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "angela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1568989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-20T12:39:42.03Z",
                "reviewBody": "This is the second time I have tried this recipe and it just keeps getting easier.  A few tricks I learned this time:  Make the sauce first, before you start to do anything else with the baklava.  Let it cook while you are preparing and putting everything together, and let it cool while the baklava is cooking.   I got the sauce started, and then chopped and prepared the nuts (I used a variety of nuts; almonds, walnuts and pecans), and rolled out my dough.  I lay out my phyllo dough before I start layering and cut it to the shape of the pan I am making it in.  This made the layering SO much easier.  I put a piece of plastic wrap over the phyllo dough and then the damp towel.  This helps keep the dough from sticking to the towel.  I made an extra 1/2 of the sauce recipe and it seems like the perfect amount (I doubled it last time and it seemed like too much). I also used about 2 sticks of butter instead of 1.  It took me about an hour total to prepare and assemble.  CUT the baklava after assembly and before cooking, and top with butter to make everything smooth and “pretty”.   Put the cooled sauce on as soon as you pull the baklava out of the oven.  I let it adsorb overnight.  Easy and wonderful!!  It tastes like the baklava I buy in the Greek stores downtown and a LOT cheaper per piece.  I think this cost me around $15 to make and I yeilded 3 dozen pieces(it would be less if I did not use almonds and pecans).  I will be making this for years to come!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Thompson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-12T15:34:00.903Z",
                "reviewBody": "I have made this recipe numerous times and it is always a huge hit. In fact it just won best of show at the county fair in the culinary division! A few modifications I have made...\r\nI use toasted pecans for the nuts. I mix 1/4 cup sugar in with the cinnamon and nuts. I make the syrup first and allow it to cool while I put together the baklava and bake it, then I can pour cooled syrup onto hot baklava (this helps keep it from becoming soggy). I also use only 1/2 cup of water and a full cup on honey in the syrup. I usually need more butter than called for also. \r\n I am so thankful to Donna for posting this recipe. She has made a lot of us look like pro's. And thanks to everyone else who has written reviews with their tips here and there. You know a recipe is great when over 175 people take the time to write a review on it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara Bear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1488222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-11T14:14:12.793Z",
                "reviewBody": "It's nice recipe but baklava is a Turkish dessert not Greek.They learned it from Turks in Ottoman era.Turks make baklava in their special days.Gaziantep city's baklava very famous in the world and there are even Turkish baklava stores in Athens",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CA2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2597995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-18T17:43:05.297Z",
                "reviewBody": "A good recipe, but here are a couple of hints:  Melt the butter and use a pastry brush.  Cut the pastry BEFORE you bake it .  Pistachios, walnuts and pecans are the best nuts for baklava.  DO NOT cover after complete, and remove from baking pan so the bottom doesn't soggy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TAKYSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/831557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-06T19:43:11.083Z",
                "reviewBody": "This is an excellent recipe, time consuming but not difficult.  I went with several reviews that said they only used half the package and then was in a mad dash to thaw the second half when the first was clearly not enough.  I think some packages of fillo come in 2 8oz packages and thus do not require cutting in half, but the recipe is right when in says it uses 16 oz. The syrup was sufficient as well but here is a hint from a Greek person for those who say it is too soggy: pour hot syrup over cool baklava or cool syrup over hot baklava to avoid it all seeping to the bottom and becoming soggy.  Also for convience I used a bad of finely chopped walnuts I found in the store, they were the perfect size and saved on chopping.  Everyone at our Easter table was impressed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACY ANN H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/826214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:38:02.38Z",
                "reviewBody": "This is a great recipe for Baklava!  You have to make it.  I had phyllo dough that had been in the freezer for a while and was starting to dry out, so I decided to make this recipe.  Even though it was quite difficult to work with dried out dough, the end result was fabulous.  Flaky & crispy on top with yummy sweet layers in the middle.  I added a bit of sugar to the nut mixture (1/4 cup max) and the sugar caramelized nicely in the oven.  I also added a touch of nutmeg and ground cardamom to the nut mixture (not too much, because it's really strong and you don't want it to overpower the cinnamon flavor).  I also added a bit of orange zest to the syrup along with the vanilla, and it was delicious.  It wasn't as sweet as store bought baklava and that made it so much better.  Before putting it in the oven, I cut the baklava with a pizza cutter and that really worked well.  I served it in multicolored cupcake wrappers.  Yummy, yummy.  One thing I noticed was that it was a bit dry for my taste.  Next time, I think I'll increase the sugar/honey syrup by 1/3 to 1/2 than the recipe calls for.  I had originally made this recipe to share with my extended family, but now I'm thinking of making something else to take to that party and keeping the baklava at home for us.  Soooooo good!  Try it, you won't regret it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BANSREEPARIKH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/400771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-06T17:41:23.890Z",
                "reviewBody": "This recipe is very good, almost similar and true to real Greek baklava. However, the syrup is not right. It is supposed to be thick in consistency, this syrup was too watery and was not thick enough. \n\nSomething that should be added to the syrup is orange or lemon peel. It's traditional in baklava syrups and it gives a sweet scent and taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Masterful_Creations",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3123193/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Baklava",
            "description": "Discover how surprisingly easy it is to make this classic Greek dessert.",
            "uploadDate": "2012-06-01T18:40:19.445Z",
            "duration": "PT4M14.171S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6a5646c8-5363-40e1-b549-566dfab515e4%2Fbd3a0340-02de-4f04-9349-ef5479cf4b75%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1667896765001"
        }
    }
]