[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
                    "name": "Apple Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9543/apple-bavarian-torte/",
        "name": "Apple Bavarian Torte",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F366308.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-12-12T03:48:34.000Z",
        "description": "This  torte is made in a springform pan. Cream cheese, almonds, and apples deck this to the nines! Enjoy this dessert with your loved ones during the holidays.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "½ cup butter",
            "⅓ cup white sugar",
            "¼ teaspoon vanilla extract",
            "1 cup all-purpose flour",
            "1 (8 ounce) package cream cheese",
            "¼ cup white sugar",
            "1 egg",
            "½ teaspoon vanilla extract",
            "6 apples - peeled, cored, and thinly sliced",
            "⅓ cup white sugar",
            "½ teaspoon ground cinnamon",
            "¼ cup sliced almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F(230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream together butter, 1/3 cup sugar, vanilla, and flour. Press crust mixture into the flat bottom of a 9-inch springform pan. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, blend cream cheese and 1/4 cup sugar. Beat in egg and vanilla. Pour cheese mixture over crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1/3 cup sugar and 1/2 teaspoon cinnamon. Toss the sliced apples with the sugar mixture and spread over the cheese filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 minutes. Reduce heat to 400 degrees F (200 degrees C) and continue baking for 25 minutes. Sprinkle almonds over top of torte. Continue baking until almonds are lightly browned and apples are tender. Cool before removing from pan.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Apple Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TERRI DALLEN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6055363321799305,
            "ratingCount": 289,
            "itemReviewed": "Apple Bavarian Torte",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "284.7 calories",
            "carbohydrateContent": "33.8 g",
            "cholesterolContent": "56.4 mg",
            "fatContent": "15.8 g",
            "fiberContent": "2.2 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "116.5 mg",
            "sugarContent": "22.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-22T16:54:18.81Z",
                "reviewBody": "Good recipe, Terri. I've made this twice now. First according to the recipe: I like the crust, but there was a little too much of it for my taste, and I liked the filling which there was a little to little of it. I thought the apples being crunchy detracted from the overall flavor. So, the second time I cut the crust by 1/3, upped the filling by another 1/2, and precooked my apples in the cinnamon sugar in the microwave for 3 minutes. Then I arranged the apples in a circular pattern covering the entire top of the torte. While warm from the oven, I covered the top evenly with a cinnamon sugar sauce. Wow! What flavor, and the presentation was beautiful. The ladies at my Bunco party thought I had ordered it from their favorite bakery! Thanks for creating the roadmap that helped me reach my destination....AND keep up my reputation as the best cook in the group! ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-05T04:10:56.95Z",
                "reviewBody": "This was *THE* most gorgeous dessert I've ever personally made. It came out looking like I had spent a gazillion dollars on it at some fancy bakery -- well, until I tried to cut through the crunchy apples!!!! I WISH I had seen the review that suggested to cook them first, because they DEFINITELY need it!!! Also, I think two medium/largish apples would be plenty. Six is WAY too many apples -- and I only used 4 biggish ones, and that was too many. I will definitely try this again, but I think I might try it with my home canned peaches, or maybe pears, next time. It was absolutely delicious -- just very hard to cut because of the apples. If I do the apples again, I know a lot more about how I would do it this time! The bottom crust and the cream cheese part was to die for!!!!! (***UPDATE*** I made this a second time with pears -- two cans canned pear halves, I sliced them -- and it was WAAAAAAAAAAAY better than with apples! I've revised my version of the recipe to be PEAR Bavarian Torte. Try the pears, you'll be delighted!!!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GRETCHEN01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/879742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-17T14:29:30.92Z",
                "reviewBody": "With the exception of the almonds, which I don't use, this is a recipe I've used for 25 years because it's so darn good! This can easily be doubled; just spread the dough into the bottom and sides of a 9x13\" pan. If my gooped, splattered, and dog-eared recipe card offers any proof, this classic recipe is just plain delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T17:55:30.667Z",
                "reviewBody": "OMG! What can I possibly say about this recipe that hasn't already been said - it's fabulous! I didn't change a thing except to leave off the almonds as my husband isn't a huge fan of them. It took a little longer to cook and the smell was divine. When it came out of the oven I couldn't resist topping it off with a warm caramel sauce - just a little. I must say the smell from the oven was definitely an indication of how it was going to taste. My husband devoured his piece and declared that I could make this anytime!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-01T02:53:35.78Z",
                "reviewBody": "This is a delicious and easy dessert. I suggest pressing the crust 1 1\\2 \" up the sides of the springform pan and using almond extract instead of vanilla in the crust (goes well with the almonds in the torte). I also slightly cooked the apples in the microwave for 2 min or so before I mixed them with cinnamon and sugar. Lastly after the torte cooled I used a glaze of strained nectarine jam heated and mixed with a tsp of water to give it a nice glossy finish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEN-SU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/269919/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-28T06:17:25.14Z",
                "reviewBody": "DO NOT MESS WITH THIS RECIPE JUST FOLLOW THE DIRECTIONS..IT IS PERFECT! The most impressive and delicious dessert I have had in a long time. I checked out the description of a torte vs a tart and it seems to be a TART (A tart is a pastry dish usually sweet similar to a pie but different in that the top is open and not covered with pastry.) I followed the directions to the T except for the crust and I did not add vanilla. I cut my butter into the flour and sugar and did not want to mix in liquid so added a sprinkle of cinnamon then patted into the bottom of the spring form....i then put the cheese filling on top of that and I thought the recipe said 4 cups of apples for some reason so that is what i used. I sliced them in about 1/4\" slices and arranged them on edge sticking them down into the cheese mixture making a circle and then filling in the middle. Baked according to instructions. I then removed from oven and put about a 1/4 cup of peach preserves on the top and then the slivered almonds and put it under the broiler for a few minutes...(watch carefully) It was beautiful and delicious! I even think you could cut back on the sugars somewhat. Divine! just divine and very impressive! thanks for sharing this recipe! Yes I am a food critic! and still able to impress my friends thanks the these kinds of recipes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pjlee123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/839956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-02T05:24:50.247Z",
                "reviewBody": "This is possibly the best dessert I've ever made and desserts are one of my specialties. Rave reviews from my husband as well. It didn't last long enough to share it with anyone else! Only made two small changes to the original recipe following some of the suggestions of other reviewers: microwaved the apple mixture for 3 minutes (and drained 2/3 of the liquid off before putting it on the torte) and added 1/4 tsp of almond extract and 1/4 tsp of vanilla to the cream cheese mixture instead of 1/2 of vanilla. It was perfect with the small changes. Thanks for an awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CanadaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2572372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-28T16:50:06.17Z",
                "reviewBody": "Good torte. Loved the buttery taste of the crust - it complements the apples very nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MIHAELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/97390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-18T18:41:12.263Z",
                "reviewBody": "I liked that this recipe sounded easy, with beautiful results.  Well, it was easier than I expected.  I followed the instructions, with the exception of cooking the apples in the mircowave for 3 minutes.  I liked the way the photo looked and decided to layer it... from the bottom, to the top, I used crust, filling, apples, filling, and more apples (arranged in a circular pattern on top).  We did not have the almonds, and so I decided on a cinnamon sugar sauce.  YUM!  Got rave reviews from everyone, and they were fighting over who got the last of it.  This would be impressive enough for guests.  Next time I may glaze it with my Cabernet Sauvignon jelly and use pears, instead of apples.  Thank you, Terri, for a wonderful recipe.  It will be in my holiday repertoire this season as everyone has already requested it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debra Lundquist",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2928288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-10T23:21:06.64Z",
                "reviewBody": "Turned out pretty good not sure if I'll end up making this again or not.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Trenado",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6393318/"
                }
            }
        ]
    }
]