[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/283/desserts/pies/vintage-pies/",
                    "name": "Vintage Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9545/mock-apple-pie/",
        "name": "Mock Apple Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2190259.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "Apple pie flavor without the apples. Fun to make and sure to please, but should be served warm! Enjoy.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "2 cups water",
            "1 cup white sugar",
            "2 teaspoons cream of tartar",
            "30 buttery round crackers",
            "½ teaspoon ground cinnamon",
            "1 tablespoon lemon juice",
            "1 recipe pastry for a 9 inch single crust pie",
            "1 cup crushed buttery round crackers",
            "½ cup packed brown sugar",
            "½ teaspoon ground cinnamon",
            "⅓ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium high heat, combine the water, sugar and cream of tartar; bring to boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop in whole crackers and boil for 5 minutes. Pour mixture into pie shell; sprinkle with cinnamon and lemon juice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together the crushed crackers, brown sugar, cinnamon and butter; sprinkle over pie filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 minutes and reduce heat to 375 degrees F (190 degrees C) and continue to bake for 15 to 20 minutes longer. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Vintage Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Brenda Moore"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.638888888888889,
            "ratingCount": 72,
            "itemReviewed": "Mock Apple Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "440.3 calories",
            "carbohydrateContent": "61.8 g",
            "cholesterolContent": "20.3 mg",
            "fatContent": "20.9 g",
            "fiberContent": "1.4 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "366.4 mg",
            "sugarContent": "39.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-05T13:07:48.143Z",
                "reviewBody": "I've had this recipe sitting in my recipe box for years now, scared of making it, and not sure about what kind of crackers to use! I finally bough the original ritz crackers, and said what the heck, I'll just make it and see! I was afraid it was going to be too salty or something. \nLet me tell you, it came out awesome!! I cannot believe how much it tastes like apple pie, but better! My mom tasted it not knowing it didn't have apples, and said,\" this is a great pie, especially cuz the apples have caramelized, and THAT's how I like them to taste!\" The topping was also really good, crispy and chewy at the same time. It was perfect warm or even after it cooled down completely. If I cut down on the sugar next time however, I think it would be even more delicious! Great recipe if you need to make really good apple pie and you don't have apples, but should't be made too often, just because it is not as healthy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-31T19:57:29.39Z",
                "reviewBody": "I have been making mock apple pie for many years at Thanksgiving time. This has to be the easiest recipe that I have tried. Thank you Brenda for adding this recipe to allrecipe.com",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WATCM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/64153/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-12T01:58:51.797Z",
                "reviewBody": "I had a bunch of crackers left over and I thought they would go to waste. This was the perfect answer. Loved it. Thought it tasted like apple pie. Tasted a bit and gave the two pies away as a Valentine's Gift. Added a bit of lemon juice and added more cinnamon during the boiling process. We didn't have enough Ritz crackers for the topping so we used cheddar and peanut butter sandwich crackers. This made it even better! It gave it a saltier tangier kick that only that sandwich cracker can do. It reminded me of a salt water taffy type candy. Yummy. I would definitely make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TINNGO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/313324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-06T01:32:24.353Z",
                "reviewBody": "So I made this recipe this weekend because it intrigued me. It was great to see my father's reaction when I told him it wasn't apple pie but cracker pie! It was a great experiment but really nothing more. After being in the refrigerator overnight the filling thickened up to look even more like apple pie. It tastes like a decent pie but I think the topping was a little too salty with the additional Ritz crackers. I would recommend making another streussel topping or adding a top crust instead. After the first piece of \"apple pie \" I could not eat anymore because the thought of cracker pie was somewhat sickening. It is a great joke to play however and it may be a great gift to give unexpecting relatives.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2916647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-25T02:04:29.747Z",
                "reviewBody": "I have to give this recipe 5 stars for pure genius! I made it as a experiment and I can't imagine making it again because truly why would you want to take the apples out but it was so much fun when people kept wandering in after I had made it smelling the apple pie and then having them comment on how great it was and then watching their shcoked expressions after revealing the truth. Priceless! Probably the most fun I've EVER had cooking something and I always have a lot of fun cooking. Tips: Make sure the crumbs on top are really crushed or just go ahead and use another pie crust. If anything were to give the pie away it would be big pieces of crackers on top. Additionally 35 minutes was a little too much in my oven so make sure you check while it cooks. Cornstarch would be great(about a TB or so) to thinken it up because it totally fell apart when we cut it. The only one who thought the pie was fishy was my mom( a highly critical foodie) who thought that I had made the pie with applesauce. That's the only fault of the pie; it lacks the chunkiness that real apple pie has and that why I'll stick with the real apples. Plus Ritz crackers aren't really the best for you. But still a fun experiment!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "foodlover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1801673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-08T11:39:40.697Z",
                "reviewBody": "Great pie. This was very fun to make - as the crackers were boiling I was delighted by how much they smelled like apples. Other than adding about 1/2 teaspoon of cinnamon to the syrup (I love cinnamon) and using less of the topping than called for (I'm a cheapskate; didn't want to use all that butter) I followed the recipe exactly. By the way as another reviewer noted DON'T stir the crackers after putting them in the syrup. Just plop them in and leave them be for 5 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Foamy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2790269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T16:58:29.81Z",
                "reviewBody": "This is one of my favorite recipes I've discovered on this site and I've found lots of good ones. This tastes looks and smells like apple pie. At first this disgusted me but I decided to try it out of curiousity. I keep marveling at how crackers make this recipe. I used Ritz Crackers and followed the instructions exactly. I will definitely make this again. Do not let the ingredients keep you from trying this. It's that good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amydoll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-01T17:25:09.63Z",
                "reviewBody": "i made this for april fools last year and i almost couldnt contain my self before my husband ate this he thought this was a delicious apple pie! i was laughing so hard he kept saying what i said its cracker pie he was astonished that it taste just like apple pie but with crackers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wilene Parris Messex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lucky13/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-26T21:10:42.343Z",
                "reviewBody": "My boyfriend is allergic to apples. Weird! Myself I love apple pie. So I always lamented not being able to make it. But this recipe turned things around completely! He loves it I love it this pie is wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine Gullett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3102890/"
                }
            }
        ]
    }
]