[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/750/desserts/candy/fudge/",
                    "name": "Fudge Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1279/desserts/candy/fudge/peanut-butter/",
                    "name": "Peanut Butter",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9551/chocolate-peanut-butter-fudge/",
        "name": "Chocolate Peanut Butter Fudge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F637584.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-12-15T18:31:05.000Z",
        "description": "This is such an easy and fun recipe to make.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 pounds",
        "recipeIngredient": [
            "3 cups white sugar",
            "1 cup evaporated milk",
            "¼ cup cocoa",
            "½ cup peanut butter",
            "1 tablespoon margarine",
            "1 tablespoon butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Butter one 9x9 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the sugar, evaporated milk and cocoa in saucepan. Stir over high heat until mixture comes to a rolling boil. Lower heat to medium and continue cooking to a soft ball stage.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat, add peanut butter and margarine. Beat by hand until creamy; pour into prepared pan. Allow to cool and cut into squares.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Fudge Recipes",
            "Peanut Butter"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jean"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.062200956937799,
            "ratingCount": 209,
            "itemReviewed": "Chocolate Peanut Butter Fudge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "114.5 calories",
            "carbohydrateContent": "20.7 g",
            "cholesterolContent": "3.2 mg",
            "fatContent": "3.4 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "1.1 g",
            "servingSize": null,
            "sodiumContent": "33.4 mg",
            "sugarContent": "19.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-08T19:54:15.873Z",
                "reviewBody": "I tried this recipe twice, and I've perfected it now. The trick is to use confectioner's sugar, not white sugar like the recipe specifies. I tried once with white sugar and 2 times with confectioner's sugar. Confectioner's sugar is in 99% of fudge recipes - there were a lot of people on here saying their fudge came out grainy, and that would be why! So make sure to use confectioner's, and I've found that 7-8 minutes is the right amount of time for the \"soft ball stage\" to be reached, but you really ought to try it out in a cold glass of water every 30 seconds until it forms little balls in the water. I added a little more peanut butter in my 2nd try as well, maybe 1/8 cup more, and my family definitely liked it better, so if you're a PB stickler like me, add more peanut butter!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PaulFoster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2196976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T00:13:58.06Z",
                "reviewBody": "This is the fudge my Mother made. It does take white sugar, not powdered. The reason for the graininess, is stirring it too much. Mom always said, Don't monkey with it or it'll go sugary on you. Soft ball stage is dropping a teaspoon full in a cup cold water..If it stays together in a soft ball, it's done. Good luck with this recipe, once you do it right, you'll feel so accomplished.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara Jeanne Clark-Fonda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1089893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T02:55:05.03Z",
                "reviewBody": "I think the problem people were running into when they say this mixture never got to the \"soft ball\" stage is this: the soft ball stage does not mean that the mixture in the pan comes together in a ball, like dough does, but rather that a drop of the mixture, dropped into a glass of ice-cold water, will form a ball that flattens slightly when you place it on a flat surface. You can also tell the stage with a candy thermometer. This recipe is pretty sweet, but has a nice texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYEPONINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/250731/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-16T02:39:33.483Z",
                "reviewBody": "This recipe is missing a tsp. of vanilla extract at the end of the cooking process. This is the very same recipe that I lost that was my grandmothers. I agree with the othe lady,my grandmother always told me to leave it be as it cooked to. \n\n** Follow the recipe. Add the sugar, cocoa and milk.. Bring it to a slight boil.. Until the endges are boiling.. Turn the heat down and let it cook stirring OCASSIONALY... UNtil a soft ball forms in a seperate cup of cold water. \n\nTake it off of the fire and add 1 tsp of vanilla extract, the butter and peanut butter. (my family loves p3eanut butter so I added a cup to this recipe) stir vigorously until smooth. Then put the WHOLE PAN in a slightly larger pan of COLD WATER.. ( that grainey stuff.. this will stop the crystals from getting bigger) Stir until smooth. This is all a very quick process.  \n\nThen butter your pan, pour in the fudge and place it in the fridge until it's hardened. You guys will love this recipe once you get the hang of leaving it alone to cook. I just got finished making this recipe. It took 20 minutes total and so far it is firming perfectly. \nI hope this helps you all. If you have a question. Email me at Zammada@Aol.com... Thanks, \nCrystal ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Country Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3385804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-05T21:32:30.54Z",
                "reviewBody": "Just responding to graininess issues - don't forget that candymaking is a crystallization project.  You need to form the proper sized crystals in your fudge to have a creamy texture.  If the crystals are allowed to grow to large, the candy becomes grainy and, if very large, hard and brittle.  You need to stop cooking fudge at the soft ball stage as measured by a properly calibrated thermometer.  If it is a recipe that requires beating, you need to stop as soon as it loses it's gloss; further beating allows crystal growth which changes the texture.\n\nAlso remembering that making any substitutions may change your inhibiting agents and allow crystals to grow larger as well.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mochiemom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3354832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-03T22:24:39.263Z",
                "reviewBody": "Really Good, to be the first time that i make it of course we love peanut butter so instead of the original amount of peanut butter i used 1/2 Cup crunchy PB and 1/4 creamy PB and instead of evaporated milk i improvised and used normal 2% 1&1/2 C and also i added 1 Teaspoon of vanilla it came out sooooo creamy of course i added and extra 1 TSP of butter and cutted it as soon as it was semi cold kinda semi warm so it wont brake, i submited a pictured and guess what? it Melts in your mouth, not grainy or crystalized and even tho i dont have a candy thermometer i did it and just let it boiled till it became a very slow boil and all the way to the top, so for those who dont have a CT just let it boil till it raises like if its going to overboile and the trick is when it is boiling really slow like not boiling at all. I love it, and plan to make it again just as i did. again not bad for a first time make!!!! Jen",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BoobyBabyMommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2378703/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-25T21:46:31.227Z",
                "reviewBody": "I followed this recipe and it was just like my mothers fudge. We lost the recipe and now I found it again. This is exactly like MOMS! My family loves it. I put 1 tsp of vanilla in at the end. I used regular sugar and it turned out perfect. Only needs to cook about 5-7 min. after a rolling boil. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LWELLING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1365813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-25T21:35:37.2Z",
                "reviewBody": "I don't know how some people got a creamy textured fudge out of this. I have been cooking and baking since I was 12 years old and this recipe stinks! I am now 68 years old. I did everything right of that I am sure. It is toooo sugary too grainy and also it got hard as a rock in a matter of hours. Don't even try this one it's a waste of all the ingredients!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OLDLADY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1124710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-23T07:43:47.797Z",
                "reviewBody": "This was a horrible recipe! I tried it twice and both times immediately after adding the peanut butter the fudge hardened up and became rock solid and crystalized. I was sad to have wasted all my ingredients on this recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "SachaG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1952463/"
                }
            }
        ]
    }
]