[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17285/desserts/nut-desserts/almond-desserts/",
                    "name": "Almond Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9603/chocolate-and-almond-biscotti/",
        "name": "Chocolate and Almond Biscotti",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2730808.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "Lots of chocolate chips make this biscotti irresistible.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 ½ cups blanched whole almonds",
            "2 cups all-purpose flour",
            "½ teaspoon baking soda",
            "½ teaspoon baking powder",
            "⅛ teaspoon salt",
            "⅞ cup white sugar",
            "2 cups semisweet chocolate chips",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "2 tablespoons whiskey"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Toast the almonds in a shallow pan for 12 to 15 minutes, shaking the pan a few times, until almonds are lightly colored.  Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).  Line 2 or 3 cookie sheets with aluminum foil, shiny side up.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, baking soda, baking powder, salt and sugar. Place 1/2 cup of these dry ingredients into the bowl of a food processor.  Add about a half cup of the toasted almonds and process for about 30 seconds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return the mixture to the bowl of dry ingredients and stir in the remaining almonds and chocolate chips. In a large measuring cup, beat the eggs, vanilla and whiskey with a fork to blend. Stir into the dry ingredients until moistened. Wet your hands and divide the dough into four portions.  Keeping hands wet, form each quarter into strips about 9 inches long, 2 inches wide and 1/2 inch high.  Round the ends. Place two strips crosswise on each of the cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 minutes in the preheated oven. If baking more that one sheet at a time, reverse the sheets top to bottom halfway through cooking time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using a metal spatula remove the slabs from cookie sheets and let cool for 20 minutes on cutting board.  Reduce oven temperature to 275 degrees F.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a serrated knife, carefully cut at an angle into slices about 1/2 inch wide.  Place the slices, cut side down, onto cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 25 to 30 minutes in the preheated oven, until the biscotti is crispy and lightly toasted.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn oven off and open the oven door, allowing the biscotti to cool in the oven.  When cool, store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Almond Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "C. Anderson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.166666666666667,
            "ratingCount": 66,
            "itemReviewed": "Chocolate and Almond Biscotti",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "260.6 calories",
            "carbohydrateContent": "34.6 g",
            "cholesterolContent": "20.7 mg",
            "fatContent": "12.4 g",
            "fiberContent": "2.7 g",
            "proteinContent": "5.6 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "78.2 mg",
            "sugarContent": "20.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-18T23:03:26.22Z",
                "reviewBody": "I have been making this biscotti for 6 years. I give it away to family and friends at Christmas time. I just finished making a recipe for 40 cookies last night. I went to my local resaurant to get a quick dinner and mentioned that I had been baking all day and I did not feel like making dinner. I told them I make biscotti and cookies. The owner asked if I sell the biscotti and I told her no I give it away to family and friends. She asked me to bring some in today and if shel liked it she want me to make her some for an up coming party. She called me back about 15 minutes and said she would pay me 50.00 if I made her two dozen. I gladly accepted her proposel and I will have them done tomorrow. Just goes to show this is an excellent recipe. By the way she is Italian from Italy. Everyone should be so lucky to make and share this recipe with everyone! Bon Apetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1685061/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-15T15:37:15.623Z",
                "reviewBody": "There is something wrong with this recipe.  I'm no biscotti idiot as I've made many times before, however, this recipe is much too dry to even form a loaf.  I think butter was left out !!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JACKIE MEYER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/225265/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-21T15:10:35.12Z",
                "reviewBody": "I really like these as coffee dunkers!!\nBefore making them, I read the reviews and changed the recipe by melting one cup of the choc.chips and stirring them in with the egg mixture,and I melted 1/4 cup  \nof butter and stirred this into the same mixture. I also toasted the almonds.\nAlso, I spread half of the biscotti with\nmelted chocolate (only one end) and half of those I sprinkled with toasted finely chopped almonds.   I left the rest plain \nand have been dunking these in my coffee.\nI plan to take them to relatives we are staying with over Thanksgiving,, we can \nhave them with coffee on Friday,,,if there are any left to take!  Next time I will try to make them a little longer and wider.  However, they break easily, so maybe I will add more butter and more melted chocolate to make them even more rich and chocolaty, not so crisp.  I love experimenting,,,",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Fran Shaw",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2627751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T21:48:40.637Z",
                "reviewBody": "Good recipe for those of us trying to eat healthy. Note that this recipe will be dry unless you add 2 tablespoos not teaspoons of whiskey flavoring or another liquid.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Chuck in Park City",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2684923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-16T04:59:29Z",
                "reviewBody": "Loved these! This was my first time making biscotti...everyone loved this and I was quite impressed. I substituted a tsp almond extract for the whisky. The dough may seem to dry at first...just make sure your hands are wet and really just mold and form the dough into a log. It may take time..almost like you are sculpting the form. It will quickly become moist. Also I used a very sharp knife for cutting. Sawing didn't work for me...it was breaking the cookies and making a mess. Just a quick cut straigt down w/ a sharp knife worked great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2659743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-21T13:15:07.64Z",
                "reviewBody": "Made Biscotti for the first time using this recipe and they turned out perfect! I left out the chocolate chips and added apricot flavored brandy in place of the whiskey. I've seen this recipe referred to as to dry several times... it does say to wet your hands before you work with dough to shape it.. that worked for me. And i always use a bit more extract vanilla and in this case almond when i cook. My Biscotti are great (i ate WAY to many yesterday) and THANK YOU for posting this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Fiveonit brownies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2367653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-10T02:38:29.693Z",
                "reviewBody": "This made a wonderful crunchy biscotti that I plan to use when my family comes for the holidays. I didn't have whiskey so I added another egg for the extra moisture. I also had sliced almonds rather than whole ones. I toasted the sliced almonds omitted the step using the food processor and just added all the sliced almonds to the dry ingredients. With all the almonds and chocolate chips the biscotti look as good as they taste. I got about 50 slices from the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CJBURGESS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/424847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-15T01:43:08.313Z",
                "reviewBody": "The end result of these was excellent. However I added 3 or 4 tablespoons of water to the dough to get it together. I don't carry whiskey at my house either so I left it out. The only other minor change I made was a substitution of dried cranberries for the chocolate chips. Consequently I didn't have any problems with the chocolate smearing and the cookies were beautiful in the end. They taste delicious and I wish I could give it another 1/2 star because this is a pretty authentic recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHATTAPEACH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1180895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-22T15:14:08.327Z",
                "reviewBody": "I thought this recipe was great except I just needed to add about 1/4 cup water for it not to be so dry. It went over great and now I am making for Christmas presents.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Dugas Vitale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/845653/"
                }
            }
        ]
    }
]