[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17285/desserts/nut-desserts/almond-desserts/",
                    "name": "Almond Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9716/almond-thins/",
        "name": "Almond Thins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2220592.jpg",
            "width": 4320,
            "height": 2432
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "Thin and delicate, these are perfect for everything from formal parties to your  morning coffee.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H17M",
        "totalTime": "P0DT0H32M",
        "recipeYield": "6 dozen",
        "recipeIngredient": [
            "1 cup unsalted butter",
            "1 egg",
            "1 cup white sugar",
            "1 ¾ cups all-purpose flour",
            "1 teaspoon vanilla extract",
            "1 teaspoon salt",
            "2 cups sliced almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the butter and sugar until light and fluffy. Add the egg and vanilla and beat until smooth. Sift together the flour and salt and slowly stir into butter mixture until just blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide batter in half and place each half on  in the center of two ungreased, flat-sided cookie sheets. Dip a spatula in warm water and spread batter to cover the entire baking sheet, making sure  batter is spread evenly.  Sprinkle almonds and press gently into dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake each sheet about 12 minutes, or until edges are lightly browned.  Cut hot cookies into  2-inch squares.  Return to oven and bake until lightly golden... about 5 minutes. Watch carefully to prevent over baking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from oven to a wire rack.  Slide spatula under cookies to loosen.  Cool completely on cookie sheets.  Store in airtight containers with waxed paper between layers.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Almond Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Violet Gibbons"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.521739130434782,
            "ratingCount": 23,
            "itemReviewed": "Almond Thins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "61.4 calories",
            "carbohydrateContent": "5.6 g",
            "cholesterolContent": "9.4 mg",
            "fatContent": "4 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "33.7 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-21T20:16:40.583Z",
                "reviewBody": "After finishing a batch of greasy cookies that had 3/4 c of butter, I was reluctant to put the whole cup of butter into this recipe. I used only 3/4 c and they came out very good. My batter was not spreadable at all, that may be from cutting back on the butter. I flattened the dough between parchment paper (on the bottom) and wax paper on the top and used a rolling pin. Then I just peeled off the wax paper, transferred the batter on parchment paper to a cookie sheet, sprinkled the almonds and baked it all. This is such an elegant looking cookie for the amount of effort that it takes. \"It's not a cookie, it's an almond thin.\" Thanks for a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LZELENAK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-12T21:40:37.177Z",
                "reviewBody": "These cookies taste great!  They are not spreadable though, so I placed the dough in between sheets of parchment paper and smoothed out with my hands.  Then lifted the top sheet and placed almonds on dough and pressed them into the dough with the top sheet.  Then all I had to do was slide the bottom sheet with the dough onto the cookie sheet and bake!  They are WONDERFUL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHUGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1158894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-20T19:54:32.983Z",
                "reviewBody": "The main thing about this recipe is that it tastes wonderful. The problem is in the baking. I chilled the dough for 30 minutes in the freezer. The dough is too sticky unless you chill it. Then I took a melon baller and scouped a small ball of dough. After that I took a glass with a flat bottom dipped it in water and squished the ball flat twisting to release from dough. After that I baked for 25 minutes until they were light golden brown. The orginal timing wasn't nearly enough but I am not sure if that is because of my oven or not. Also be CERTAIN to use parchment paper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SSilk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1686847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-22T17:46:48.863Z",
                "reviewBody": "I followed the recipe as it is and would reduce the salt by half the next time I bake this again. The consistency was just right to spread with a spatula. I noticed that a lot of you mentioned you have problem with doing that as the batter was more like dough. I think the trick is to have butter at room temperature or soft to the touch before creaming it with the sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "waipeng",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4472298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-27T00:00:49.967Z",
                "reviewBody": "I give this recipe 5 stars even though I had trouble with it! I bought some almonds at Sam's Club so wanted to find a terrific recipe to use them in. I could not get this batter to spread please give me the secret! I tried a spatula icing knife and a rolling pin. I ended up making rolled cookies out of them and pressed them out with a cookie cutter. I almost threw the second batch of batter away but I poured about 3/4 cup of almonds onto the mound and kneaded it in prior to rolling them out. That worked even better! They turned out pretty and tasty. Great recipe for taste but didn't work out according to the directions for me! thank you for sharing Violet! I WILL make these again - rolling them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FAITHPCFL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/992609/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-23T17:59:55.483Z",
                "reviewBody": "My whole family loves these cookies I have to make several batches at a time. I also love to give these away.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PinkLady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/108255/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-21T21:33:41.327Z",
                "reviewBody": "I found and made this recipe after tasting some purchased almond thins. The taste was delicious but preparation was tedious and half of the cookies stuck to the sheet so I ended up with Almond Thin Crumbs. I doubt I will make them again but they sure do taste great. I actually used 1 stick unsalted butter and 1 stick salted butter and cut back on the salt. I like the suggestion of using parchment paper & rolling them. Maybe I will have try again with this suggestion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SMOWER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/95354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T18:04:22.79Z",
                "reviewBody": "I stumbled upon this recipe after a cookie search using almonds. I am at my mountain cabin and intended to get started on some holiday baking but I didn't realize that I didn't have one of the ingredients I needed for the almond cookies I was going to make. I read all the reviews here and decided \"really how bad could this be?\". Well I found out that the original recipe as published has a huge \"hassle\" factor. Yes it was hard to roll..and I took others' advice and used parchment. Be sure to get it think enough in the middle! I rebaked mine (the center part) twice. Used a pizza cutter to cut it. For the second half I just rolled in balls and rolled in sugar flattened with a glass over a little hunk of parchment. They turned out brown and crispy on the edges but not very festive looking. I think a little almond flavoring might be helpful also. It wasn't worth the effort!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "annsmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/214136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-10T17:18:08.91Z",
                "reviewBody": "I used margarine and found the batter to be soft and easily spreadable.  I kept the knife wet, and just scraped it periodically with a spatula.  I baked them on a no stick pan, and mine burned from being on too low a shelf, but the few that didn't were perfect and the family loves them.  So the only thing I'll change next time is to put them higher in the stove and watch more carefully.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4821272/"
                }
            }
        ]
    }
]