[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/725/world-cuisine/european/scandinavian/",
                    "name": "Scandinavian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9745/rosenmunnar/",
        "name": "Rosenmunnar",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F149282.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "Swedish thumbprint cookies.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "½ cup white sugar",
            "2 cups sifted all-purpose flour",
            "½ cup any flavor fruit jam"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream butter and sugar until light and fluffy. Add sifted flour, and mix well. Shape dough into 1-inch balls and place on cookie sheets. Imprint your thumb in the center to make a 1/2-inch indentation. Fill with your favorite preserves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 15 to 20 minutes or until golden brown at the edges.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Scandinavian"
        ],
        "recipeCuisine": [
            "European",
            "Scandinavian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "G. Crandall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.584142394822006,
            "ratingCount": 618,
            "itemReviewed": "Rosenmunnar",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "93.5 calories",
            "carbohydrateContent": "11.1 g",
            "cholesterolContent": "13.6 mg",
            "fatContent": "5.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "37.9 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-26T02:34:39.197Z",
                "reviewBody": "sooo good! especially when you first take them out of the oven, they're just like air. I added 1/2 Teaspoon of vanilla extract. To keep the jam from spreading all over the cookie, just make small thumbprints!  I am only 12 so i may not be that much help...but my whole family loved them and asked me to make more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jules M.E.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2318074/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T15:11:15.59Z",
                "reviewBody": "INCREDIBLE!  This is my kind of cookie...I made them for a cookie swap, but decided not to take them...they were too yummy!  I tried 3 different kinds of jam: rasp., boysenberry and blueberry.  Raspberry won hands down around here. \nThe dough is very sticky, so I refridgerated it for a while to make it easier to work with.  I used a small 1\" stainless steel scoop to make the cookies, and then the back of a round stainless 1/4 teaspoon to make the prints.  I dipped the jam with the same 1/4 t. so it fit perfectly into the holes.  I only got 3-3 1/2 dz cookies from this recipe as opposed to the 72 servings listed.  Bake until JUST starting to lightly brown around the edges.  These cookies spread out to 2\" while baking, but the final product was delicate and buttery with a sweet and tart rasperry center.  FAB!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUEENOFGREATJUNK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/318819/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-12T12:57:50.577Z",
                "reviewBody": "For several years, this has been my go-to cookie recipe when I need something fast and fabulous.  The only difference is the presentation; I don't make thumbprint cookies.  Instead, I reserve 3/4 c of the batter and the remainder is pressed into the bottom of a 13\"x9\" baking pan, with a slight \"lip\" at the outside edge to hold in the preserves.  The preserves (apricot or raspberry is the best in my humble estimation) are spread over that, and lastly the reserved batter is  crumbled over the top of the preserves. Bake as directed.  Cut into squares when cooled.  Everyone I've offered these to LOVE these and many have asked for the recipe and are amazed at its sweet simplicity.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATYPI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2074840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-16T18:50:29.033Z",
                "reviewBody": "Proof positive that the simplest recipes are almost always the best. How can four ingredients come together to taste so darned lovely? Easiest way to mix is to pulse in your food processor. Like almost everyone else, I found the number of cookies promised to be almost double the number it actually made. 31 exactly. Keep a tiny bit of confectioners sugar around for dipping whatever implement you use to make the indentations (handle of a wooden spoon, your thumb, measuring tsp, etc) so that it doesn't stick to the dough. Remember that the key to making them look picture perfect is to avoid the temptation to put more than a small dab of jam in the indentation. This avoids \"oven boil over\" and the consequent mess. A+ for a superb recipe that is not only simple to make, it bakes up looking like it belongs on the cover of Bon Appetit and tastes so wonderful, it's the stuff dreams are made of! Note: for ehuber and others who had trouble with the dough spreading when baked and tasting inedibly greasy, that's indicative of an inadequate measure of flour. Knead in more flour, 1-2 Tb at a time, until incorporated. When the dough stays together and doesn't cling to your hands, but is not crumbly, you've added enough. If it's  sticky, add another Tb of flour. Allow to rest 20 minutes or more after you finish kneading in the flour to relax the gluten so that the finished product will not be tough. It just takes a little practice to develop the feel for dough with the proper consistency.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-30T14:02:20.95Z",
                "reviewBody": "I was born in Sweden and my mom always made these cookies! If you substitute about 1/4 cup of the flour for potato flour, the texture and flavor becomes even better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandra H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1749657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-03T07:02:35.29Z",
                "reviewBody": "I love this cookie..My Mom made this exact recipe every Christmas...but..she rolled them into balls and then rolled the balls in crushed walnuts..then thumbprinted them then filled them with rasberry jam..Mmmmm..Today I do half in nuts and the other half plain..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy LaRocque Westgate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3013659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-01T21:52:58.327Z",
                "reviewBody": "Nice, pretty looking little thubmprint type cookies. The dough is very easy to work with... I added about 1/4 tsp of vanilla and a splash of almond extract - gave it a wonderful delicate flavor. I used raspberrry jam, and they turned out great... the trick is to use very little jam (about 1/6 of a tsp) - enough to not quite fill the depression in the cookie, and keep an eye on them near the end of the baking time - once the jam starts to bubble, it may 'boil over' and run out of the imprint. About 13 minutes was the right baking time for me. Also, this recipie did NOT make anywhere near 72 cookies for me... closer to 40. But, still tasty, and a very easy, simple cookie to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CASSIADAWN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1009128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-05T03:10:24.083Z",
                "reviewBody": "I love these cookies! They're so easy to make and the end results are just fantastic. They make your whole kitchen smell like sweet buttery heaven! My only change to this recipe was adding a teaspoon of vanilla extract to the dough which yielded very tasty cookies. I used both apricot and raspberry preserves to fill in the thumbprints. I must say I do like the raspberry best! These little cookies are very pretty too looking like precious jewel-topped cream-colored morsels. I have already made a few batches and I will be making these again and again. Thanks for the recipe Crandall!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baker Boy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2264947/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-03T04:16:37.467Z",
                "reviewBody": "Very good! My swedish grandma used to make these all the time! I put them in the oven for 10 minutes instead of 15-20. But overall excellent and very easy to make!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lil_V",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/281228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-04T16:52:51.6Z",
                "reviewBody": "I followed the recipe exactly but ended up with extremely flat very buttery cookies. They were similar to Irish lace cookies in texture and flavor (minus the oats and with jam on top). I think next time I'll halve the butter and see if it holds up better to baking. The flavor is pretty good though a little too buttery.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZZY217",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1438379/"
                }
            }
        ]
    }
]