[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/850/desserts/cookies/nut-cookies/",
                    "name": "Nut Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13350/desserts/cookies/nut-cookies/walnut/",
                    "name": "Walnut",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9804/urban-legend-chocolate-chip-cookies/",
        "name": "Urban Legend Chocolate Chip Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F271983.jpg",
            "width": 3418,
            "height": 2278
        },
        "datePublished": "1997-07-28T05:10:52.000Z",
        "description": "You may have heard this story...a woman asks to buy a cookie recipe and is told it will cost 'two-fifty.' She thinks this means $2.50, but then she gets her credit card bill back and finds out it is $250.00. Outraged, she spreads the recipe far and wide to try and get her money's worth. I first heard this story 6 years ago and was given a recipe on a sheet of paper which bore the date '1986.' The supposed originator of the recipe was a well-known cookie company. I have since heard this tale again several times, with the recipe originating from different upscale department stores. True story? Who knows, but it's a darn good cookie. Here's my version.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H8M",
        "totalTime": "P0DT0H23M",
        "recipeYield": "5 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "1 cup white sugar",
            "1 cup packed brown sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "2 cups all-purpose flour",
            "2 ½ cups rolled oats",
            "½ teaspoon salt",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "2 cups semisweet chocolate chips",
            "4 ounces milk chocolate, grated",
            "1 ½ cups chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Measure oats into a blender or food processor, and then blend to a fine powder. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together butter and sugars. Beat in the eggs one at a time, then stir in the vanilla. In a separate bowl, mix together flour, oats, salt, baking powder, and baking soda. Stir dry ingredients into creamed butter and sugar. Add chocolate chips, grated chocolate, and nuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop by rounded teaspoons onto ungreased cookie sheets.  Bake for 6 to 8 minutes in the preheated oven.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Nut Cookie Recipes",
            "Walnut"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rene Kratz"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5554231227651965,
            "ratingCount": 839,
            "itemReviewed": "Urban Legend Chocolate Chip Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "141 calories",
            "carbohydrateContent": "17.5 g",
            "cholesterolContent": "14.8 mg",
            "fatContent": "7.7 g",
            "fiberContent": "1 g",
            "proteinContent": "2 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "76.1 mg",
            "sugarContent": "11 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-02-08T18:58:50.717Z",
                "reviewBody": "Tip #1: Finely ground oatmeal for a subtle nutty taste and texture. Don't grind if you prefer a rougher, more dense cookie that tastes more like an oatmeal cookie with chips. Tip #2: Using unsalted butter will make cookies spread more while using a margarine will make them spread less and be thicker. Tip #3: Add 1/2 tsp more of baking soda for a higher rising cookie. Tip #4: These cookies are extra extra sweet so you may want to reduce sugars to 3/4 cup each to lessen sugary taste. Tip #5: I found 1.5 cups of choc. chips more than enough for me. But, true chocoholics should try 2 cups of the chocolate chunks instead. Tip #5: Watch cookies very carefully. Cooking times may range from 7-10 minutes depending upon the cookie size you choose, your texture preference, and your oven's temperature settings. They may look undercooked, but you'll get a crunchy edge and soft chewy inside if you bake just until the outer edge only is brown.  Let them set 1 minute on the cookie sheet after removing them from the oven to finish cooking them and you'll get a perfectly chewy but not soogy cookie. Over-cooking (entire cookie is brown) will definitely result in a hard crispy cookie, unless you like them that way.  Tip #6: This is a lot of dough so you can either halve the recipe or store the dough in your frig. in a platic zipper bag so you can make a fresh batch when the mood strikes you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLWDANIELS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1346160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-09T18:46:32.233Z",
                "reviewBody": "Perfect! A new favorite for my husband and me. He couldn't get enough of them!  Here are the slight changes I made which resulted in a perfect, thick chocolate chip cookie...I used margarine (1 stick lite, 1 stick regular). Margarine helps cookies stay plump rather than flat.  I let my eggs reach room temperature, and was careful not to overblend them with the dough (another common problem with cookie bakers).  Lastly, I added 1/2 tsp more of baking soda and 1/4 tsp more of baking powder to help the cookies stay thick.  I followed the rest of the recipe to a T using Ghirdelli (sp?) chocolate chips.  I noticed some people said the dough got stuck in their mixers, but if you look at the recipe closely, you will notice it says to STIR the batter once you mix in the dry stuff...do not use your mixer at this point. Good luck! This is quite a perfect cookie!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allyson Hester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T14:05:12.2Z",
                "reviewBody": "The funny thing is, I don't really like chocolate chip cookies all that much - I just wanted something for my kids to send to my husband (who was working out of town), but DANG these are good! They stay dense and moist, not fluffy and cake-y like other recipes I've tried, and it's all chunk with a just a little cookie holding it all together!! The last time I made them, I used 1/2 cup each of walnuts, pecans and macadamia nuts, and substituted almost 1/2 of the semi-sweet chips with a Hershey Bake Shoppe product called Almond Toffee Bits - basically the inside of a Heath bar, but in perfectly uniform little chunks and with no mess and frustration of chunking up the candy yourself. Really great!  Oh, and if you really want to go overboard, make an ice cream sandwich with a couple of these bad boys!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-21T16:10:56.983Z",
                "reviewBody": "These are IT!! Absolutely the best chocolate chip cookies. If you don't like your cookie too sweet, reduce the amount of brown sugar and white sugar to 3/4 cup. Please don't omit the grated chocolated as well as the ground oats. It makes a world of a difference in taste and texture. For those reviewers who left out the grated chocolate, try it again and you'll taste a difference. I've also found that I get a better looking cookie when I mix the batter by hand rather than with an electric mixer. The trick is to let the butter soften at room temperature or pop it in the microwave for about 10-15 seconds. Make sure not to let it melt though! It alters the appearance and texture of your cookie. \r\n\r\nThese cookies do take quite some time to prepare so be sure to make a huge batch and freeze the rest of them. Everyone who tastes these delectable treats raves about them and will beg you to make them. I love to bake and do it quite often. These are the most requested treats by my family and friends.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FILROSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1028235/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T17:11:00.607Z",
                "reviewBody": "I left the oats whole and used chocolate baking chunks instead of the smaller chips but believe me when I say I have NEVER had a more delicious chocolate chip cookie. They stayed soft after being out uncovered all night then remained soft in a ziplock bag for 5 days. I will make this my only chocolate chip recipe from here on out. Thanks for the submission!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FlourGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/574638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-18T18:36:55.437Z",
                "reviewBody": "OK these are five star cookies as is-I make all the time and people rave about them(minus the nuts)..but you MUST try this. With halloween coming I needed to clear out all existing candy in my house so instead of grating a regular chocolate bar..I stuck some mini snickers twix m&m's baby ruth's and hershey bars into a food processor and blended it up nice and added that to the cookie (maybe 10 mini bars altogether). OOOOHHHHH my it was so good the next day I had to make another batch using the same candy bars and even mixed in some reeses p-butter cups and a whatchamacallit bar. Even better. Now I can't wait for my kids to bring home all their trick or treats so I can make yet another batch...My co-workers love me this week! TRY IT...IT\"S SO YUMMY!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T22:25:02.467Z",
                "reviewBody": "I will not try again. Even with all of the chocolate it is very bland and very dry. Reread the reciped several times to be sure that I wasn't leaving anything out and that I had read it correctly - I had and they turned out bad. Did anyone in the past have tips for a cookie that is not so dry?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "lefinley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/410495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-11T21:38:05.23Z",
                "reviewBody": "I got compliments like I couldn't believe from my co-workers after bringing these in these cookies.  I got raves...I mean RAVES from people who usually just take a cookie and run.  You must measure accurately with this cookie...or you'll have a rock hard piece of dough/oatmeal that will wear the motor on the best of mixers. I use an icecream scoop to make large cookies that don't spread out all over the pan.  I like to \"change\" receipes but this is one that I'll always make exactly the same.  The compliments make the mixing worth while!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PUBLIUS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/195138/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-21T13:01:46.14Z",
                "reviewBody": "I halved the recipe didn't have any nuts to add (but I would add pecans if I had them) added 1/2 cup peanut butter and used old-fashioned oats. This recipe produces a slightly chewy slightly crispy tasty cookie. I like the depth the grated chocolate adds. Great cookies Rene!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANNYLOOHOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/953764/"
                }
            }
        ]
    }
]