[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/106/appetizers-and-snacks/fruit/",
                    "name": "Fruit",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218605/savory-blue-cheese-cheesecake-with-cherry-pear-compote-and-cherry-balsamic-glaze/",
        "name": "Savory Blue Cheese Cheesecake with Cherry Pear Compote and Cherry Balsamic Glaze",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4556948.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2020-03-05T05:08:14.000Z",
        "description": "A rich and elegant savory appetizer, worthy of the time and effort.  Excellent for wine tasting parties, holiday gatherings and special occasions. The best part is that it can be made days in advance and topped just before serving.  I created this for a gathering of Allrecipes foodies in Southern California.",
        "prepTime": "P0DT1H30M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT9H30M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "½ cup butter",
            "4 ounces freshly shredded Parmesan cheese",
            "1 teaspoon minced fresh thyme leaves",
            "½ teaspoon Kosher salt",
            "½ teaspoon ground black pepper",
            "1 ¼ cups all-purpose flour",
            "¼ cup chopped toasted pecans",
            "1 tablespoon butter, melted",
            "3 (8 ounce) packages cream cheese, softened",
            "8 ounces blue cheese, crumbled",
            "6 ounces freshly shredded Parmesan cheese",
            "4 large eggs at room temperature",
            "¼ cup heavy cream at room temperature",
            "1 teaspoon ground black pepper",
            "2 tablespoons olive oil",
            "2 large sweet onions, thinly sliced",
            "2 pears - peeled, cored and chopped",
            "½ cup dried cherries",
            "2 tablespoons black cherry balsamic vinegar",
            "½ cup brown sugar",
            "¼ teaspoon kosher salt",
            "1 (8 ounce) package cream cheese",
            "2 ounces freshly shredded Parmesan cheese",
            "4 ounces blue cheese, crumbled",
            "½ teaspoon ground black pepper",
            "¼ cup candied pecans",
            "1 firm green pear, cored and thinly sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat 1/2 cup butter, 4 ounces Parmesan cheese, thyme, 1/2 teaspoon salt, and 1/2 teaspoon black pepper with an electric mixer in a large bowl until light and fluffy. Add the flour, and mix on low until mixture resembles large crumbles. Turn dough out and shape into a log. Wrap dough with plastic wrap, and refrigerate until chilled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C). Slice the prepared dough into 1/4-inch thick pieces and place on a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden brown, about 22 minutes.  Cool crackers on the sheets for 10 minutes before removing to cool completely on a wire rack. Reduce oven heat to 300 degrees F (150 degrees C). Line the bottom of a 10-inch springform pan with parchment paper, then butter the paper and the sides of the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the toasted pecans, baked crackers, and 1 tablespoon melted butter in a food processor. Pulse until crumbled. Press the crumbs into the bottom of the prepared pan. Chill in the refrigerator while preparing the filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat three 8-ounce packages of cream cheese, 8 ounces of blue cheese, and 6 ounces of Parmesan cheese with an electric mixer in a large bowl until smooth and creamy. Add the eggs one at a time, allowing each egg to blend into the mixture before adding the next. Beat in the heavy cream and 1 teaspoon pepper with the last egg.  Pour the mixture into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for about 1 1/2 hours. The cheesecake is ready when the edges have nicely puffed  and the surface of the cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken. Run the tip of a paring knife around the edges of the pan, set the pan on a wire rack, and allow the cheesecake to cool at room temperature for 1 hour before placing into the refrigerator, and cooling 4 hours to overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. Add in the chopped pears, dried cherries, balsamic vinegar, brown sugar, and 1/4 teaspoon salt. Cook and stir until pears are tender. Remove the onion and fruit from the skillet using a slotted spoon. Drain the juice back into the skillet, then mash the fruit in a bowl with a fork. Simmer the juice in the skillet over medium heat until thickened, about 5 minutes. Transfer glaze to a separate bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the remaining 8-ounce  package of cream cheese, 4 ounces of blue cheese, 2 ounces of Parmesan cheese, and 1/2 teaspoon of black pepper with an electric mixer in a bowl until smooth. Spread the cheese mixture over the cooled cheesecake. Sprinkle with candied pecans. Serve with cherry pear compote, sliced pear, and vinegar glaze on the side.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Fruit"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Baking Nana"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.75,
            "ratingCount": 4,
            "itemReviewed": "Savory Blue Cheese Cheesecake with Cherry Pear Compote and Cherry Balsamic Glaze",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "394.1 calories",
            "carbohydrateContent": "19 g",
            "cholesterolContent": "108.9 mg",
            "fatContent": "29.6 g",
            "fiberContent": "1.6 g",
            "proteinContent": "14.2 g",
            "saturatedFatContent": "17.2 g",
            "servingSize": null,
            "sodiumContent": "651.1 mg",
            "sugarContent": "9.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-08-08T16:49:45.243Z",
                "reviewBody": "I created this recipe for Marianne's So. Cal Allrecipes Beach Bash. It was very well received by the Blue Cheese lovers in the group. Warning - put a sign by this saying \"Savory......\" Some people thought it was a sweet cheese cake with carmel drizzle. OPPS - Sorry! This can be made ahead of time and refrigerated or even frozen. I said it serves 24 but it actually would probably serve more than that. I plan to make one and freeze in smaller pieces for a elegant appetizer to take to holiday parties. Update- I used my immersion hand blender to mash up the onion fruit mixture - if you don't have one I would consider peeling the pears. Also as you are adding the eggs to the filling - do so on a slow speed and try to not incorporate too much air. Air in the filling causes the cheesecake to crack.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-16T20:03:57.04Z",
                "reviewBody": "This is going to be one of those reviews that drive folks nuts who don't like tinkering and reviewing. I am sorry, but I have wanted to make this for a very long time and I didn't have any event large enough to do this generous and beautiful appetizer. I decided that I would divide this to serve 6 so that I might use it for just my husband & I for Valentines Day as an app. and freeze some for drop in guests. Please forgive me Nana for deconstructing this to use in small amounts. First, I skipped the crust recipe because I decided to bake this  4 oz ramekins. To compensate for the thyme that was missing in the crust, I added it to the cheese mixture. I divided the finished cheesecake mixture between three 4 oz ramekins and baked in a water bath at 350 for 30 minutes. They puffed up beautifully. I then halved the fruit compote recipe and made as directed. I did not \"frost\" the cheesecakes cuz they came out beautifully. I then served the compote over the cheesecake with a sprinkle of toasted pecans and sliced baguettes for the foundation. YUMMY!!!! The beauty is that I still have two little ramekins in the freezer to pull out when I have impromptu guests or just us :) Thanks so much for sharing Baking Nana. this is impressive and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-18T13:45:54.247Z",
                "reviewBody": "How could I not have reviewed this yummy piece of artwork?! It makes a lot so you may want to cut down the size. It makes such a delicious centerpiece for appetizers! Thanks for this beautiful and great-tasting appy! Baking Nana you are the best!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            }
        ]
    }
]