[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/852/desserts/cookies/peanut-butter-cookies/",
                    "name": "Peanut Butter Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10064/magic-peanut-butter-middles/",
        "name": "Magic Peanut Butter Middles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2554626.jpg",
            "width": 1068,
            "height": 1068
        },
        "datePublished": "1997-11-07T12:50:53.000Z",
        "description": "Chocolate cookie with a surprise peanut butter center.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "30 cookies",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "½ cup unsweetened cocoa powder",
            "½ teaspoon baking soda",
            "½ cup white sugar",
            "½ cup packed brown sugar",
            "½ cup soft margarine",
            "¼ cup peanut butter",
            "1 teaspoon vanilla extract",
            "1 egg",
            "¾ cup confectioners' sugar",
            "¾ cup peanut butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In small bowl blend flour, cocoa and baking soda.  Mix until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large bowl beat white and brown sugars, butter or margarine and 1/4 cup peanut butter, until light and fluffy.  Add vanilla and egg, beat. Stir in flour mixture until blended.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make Filling:  Combine confectioner's sugar and 3/4 cup peanut butter.  Blend well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll filling into 30 1-inch balls.  For each cookie, with floured hands, shape about 1 tablespoon of dough around 1 peanut butter ball, covering completely.  Place 2 inches apart on an ungreased cookie sheet.  Flatten with glass dipped in white sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 375 degrees F (190 degrees C) for 7-9 minutes. When cookies are done, they should be set and slightly cracked.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Peanut Butter Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Gerry Burns"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.460122699386503,
            "ratingCount": 815,
            "itemReviewed": "Magic Peanut Butter Middles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "289.2 calories",
            "carbohydrateContent": "34.4 g",
            "cholesterolContent": "12.4 mg",
            "fatContent": "15.5 g",
            "fiberContent": "2.3 g",
            "proteinContent": "6.7 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "198.6 mg",
            "sugarContent": "21.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-21T22:39:51.71Z",
                "reviewBody": "I actually discovered this recipe on another forum & have been making these cookies for years with some very minor alterations. MOST IMPORTANTLY: ADD A TBSP. OF WATER OR MILK, as the dough is a bit too dry. I also always add an extra couple tsps., maybe even tbsp. of PB. Works every time. The dough should not looked cracked when you roll it, it should look like playdo. In addition, I cut both types of sugar down to 1/3 c. & they always come out fine. The middles are very sweet, so there's no need for that much sugar in the chocolate dough. With time, you become experienced at assembling these & eventually you'll be so good at it that you won't have any leftover PB balls, because you'll be able to handle more PB in the center, which makes them so much better!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUBES1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1217546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-12T07:12:28.487Z",
                "reviewBody": "Ok so I have made these about 5 times now. The first few times I found the chocolate dough to be a little dry and not very flavorful. Here is a summary of what I figured out to make the chocolate part moist fudge and just awesome: 1) Use brand name cocoa like hershey's it will taste better; 2) Add 2 Tbsp sour cream to liquid mixture; 3) Add 1 extra egg (total of 2); 4) add 1/2 cup mini chocolate chips to chocolate dough. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2141509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-21T04:32:47.657Z",
                "reviewBody": "Oh my! I almost gave up when the chocolate dough wouldn't wrap around the peanut butter middles very easily. But I didn't give up & found that if I really flatten the dough and then wrap it it works better. I think next time I make these I will chill the peanut butter middles before wrapping the dough around them. (Oh yeah I too was left with more middles than dough lol!!) They do look scrumptious time for a taste!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SMILEYNKF68",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/523863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-21T16:23:06.827Z",
                "reviewBody": "LOVE LOVE LOVE this recipe! I have to say that this is one of the easier Christmas cookies I have ever made. I made the filling first and stuck it in the fridge while mixing up the cookie batter. Based on suggestions and opinions here I added 2 T. sour cream to the batter and to make it more chocolatey I added 1/2 cup semi-sweet chocolate chips. Once that was done I then rolled the filling into balls and put them back in the fridge. I floured my hands and made small patties in the palm of my hand with a dent in the middle for the filling put the filling in and then rolled them like when you make meatballs. No filling seeped out 30 cookies and incredibly delicious. I am just trying to figure out how to hide them from the kids and me before handing out to friends and family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/467578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-14T15:45:59.423Z",
                "reviewBody": "I baked them for my boyfriend (firefighter in training) to bring to his firefighter buddies. They were hit! I'd even give them five stars except they were a pain to make. I even tried to flatten the chocolate dough and plop a peanut butter mixture on top then wrap around. Still pretty hard to cover the peanut butter. My chocolate dough didn't turn out too crumbly but I followed the directions EXACTLY and I realize that by mixing the wet ingredients into the dry VERY thoroughly with my kitchenaid they went from dry to moist - maybe this is the problem others are running into they are undermixing. Anyhow They cracked when I flattened so for that reason alone I may add a little extra water or maybe a couple of tblspoons of sour cream to avoid that. The end result was worth the effort! Don't skip the sugar on top...and these go great with milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pinksnowflakeliz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1401968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-24T18:28:17.22Z",
                "reviewBody": "The end result of this recipe is truly delicious. However it is really time consuming and the number of cookies you get for that time is low. I rolled both dough and filling (both chilled) into logs and cut into 30 pieces but assembling still took an hour. It was hard for me to get the dough around the filling without it splitting and letting a bit leak out. Mine all cracked on baking so you can see a web of the filling through the chocolate cookie. I read the reviews and the suggestion to freeze the centers sounds like it could make things a bit easier. They are very tasty but I won't make them frequently. I overbaked mine going by appearance I didn't think they were done after the specified baking time so I added a few minutes but now that they are cooled they are hard and a bit dry so next time I'll follow the timing in the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-18T15:05:57.24Z",
                "reviewBody": "I made these twice now and they are very good but they are time consuming to make. Assembly is the slightly tricky part. To form the cookie I took a small amount of dough and flattened it in my palm. If its too sticky add more flour. If the flattened disc is bigger than your palm the finished cookie will be too big. Drop the chilled filling in the middle and fold over and crimp. Place the crimped side down and don't forget to flatten the cookie on the baking sheet just a bit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RussellC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/872623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-21T00:30:12.31Z",
                "reviewBody": "This is one of those cookies that you can't just have one. I love the surprised look on everyone s face when they thought it was just a chocolate cookie when they tasted the peanut butter inside. I call them Peanut butter surprise. I chilled the peanut butter mixture and the cookie dough before rolling them into balls. I had no trouble at all. Can't wait for an excuse to make them again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. Chef Esh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mschefesh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-14T20:02:12.383Z",
                "reviewBody": "without some modifications this recipe is only about a 3 but I knew it had potential!! DEFINITELY MAKE THESE they are soooo yummy IF you make the following minor changes: 1) add 2 more TBSP of cocoa powder 2) substitute 1/4 c of melted semi sweet chocolate for the 1/4 c of peanut butter that goes into the cookie dough 3) lessen the flour slightly (I used 1 1/4 cup 2 TBSP) 4) add a pinch of salt to the dough and 1/8 tsp of salt to the peanut butter middle (REALLY enhances the flavor of both the choc & pb...brings the recipe from a 5 in flavor to a 10!!) 5) Lastly make the peanut butter middle batter FIRST portion out into balls using a round bottom tsp place on a plate and (as suggested by several other bakers) FREEZE while you make the choco cookie dough - by the time you're done w/the dough your pb balls with be firm enough to stuff into the middle of it. THEN dip a round bottom TBSP into flour msr out a ball of choco dough then as other reviewers helpfully suggested flatten the ball in your hand put the pb ball into the middle and simply fold the edges up and roll like you would a meatball. EZ!!...IF you do it this way...if not you're going to be frustrated beyond belief! Thanks for posting Stephanie - i'll be making this one for years to come:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amykat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3566033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-15T04:38:46.35Z",
                "reviewBody": "These were way more trouble than they were worth. I felt they were dry and the flavor lacked something (and I am a peanut butter fanatic). I ended up throwing most of them away because no one in my house would touch them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandi Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7595122/"
                }
            }
        ]
    }
]