[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10119/hamburger-cookies/",
        "name": "Hamburger Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F365791.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1997-11-19T18:48:58.000Z",
        "description": "These cookies look just like little hamburgers.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "4 drops green food coloring",
            "½ teaspoon water",
            "¼ cup flaked coconut",
            "48 vanilla wafers",
            "24 chocolate covered thin mints",
            "1 tablespoon sesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (180 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, combine food coloring with a few drops of water.  Add coconut and cover the container, shake until coconut is tinted.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 1/2 of the vanilla wafers, flat side up, in an ungreased cookie sheet.  Top each wafer with a peppermint patty.  Place in the oven about 1 minute or just until chocolate begins to soften.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove cookies from oven and sprinkle each mint with 1/2 teaspoon coconut (for lettuce).  Place another vanilla wafer on top and press gentle.  With a clean paint brush, brush the top of each hamburger with just enough water to moisten so that the sesame seeds will stick when sprinkled on top of each cookie.  NOTE:  You can use canned chocolate frosting in place of peppermint patty, then eliminate the baking.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jennifer Wall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.642857142857143,
            "ratingCount": 98,
            "itemReviewed": "Hamburger Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "191.1 calories",
            "carbohydrateContent": "30.5 g",
            "cholesterolContent": null,
            "fatContent": "7.4 g",
            "fiberContent": "1.1 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "78.1 mg",
            "sugarContent": "11.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-19T06:31:11.06Z",
                "reviewBody": "I tried both the peppermint patty and grasshopper cookie as the meat. The Keebler grasshopper cookie had a much better taste and was more realistic looking with its uneven edges and thinner patty. I glued the cookies on with a dab of melted chocolate, placed in the center of the meat. I painted spots on the top bun with Lyle's Golden Syrup and dipped in the seeds. Piped yellow and red frosting just around the underside edge of the top bun. Placed green coconut on the meat and applied light pressure when placing the top bun on. This caused the frosting to ooze out just enough to look like ketchup and melted cheese. Easy, fun and taste good too. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-20T12:27:43.1Z",
                "reviewBody": "i've made these cookies before, and i used the wafer, grasshopper(mint) cookies, and for lettuce and mustard i used white frosting, divided in half, tinted with food coloring, put down a  wafer, spread with yellow, add mint cookie, spread with green then top with  wafer, slightly wet with egg white and sprinkle with sesame seeds.. no cooking, then arrange hamburgers on large tray and top with potato sticks, now you have hamburger and french fries",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SIXPAK1217",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/594502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-22T04:43:23.553Z",
                "reviewBody": "These are SO MUCH fun!!  The whole family just loved them and couldn't get enough!!  Some reviewers say they don't taste all that great, but I disagree- and I'm not even a big peppermint patty fan.  My 3-year old son helped make these (he unwrapped all the candy).  We made them for us, and my 5-year old daughter as an after school snack.  They're all gone now- should have doubled the recipe!  My daughter wants me to make them for her class.  My husband wants me to make them for his work!  What a fun recipe.  Oh, I used a dab of honey on the inside of the buns, to help it stick.  I found that just using water to make the sesame seeds stick didn't work very well, so I plopped some corn syrup into the water, and used that.  It worked very, very well.  (I didn't totally stir it together, but dragged my paintbrush through it).  I love this recipe, and will definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-31T18:33:54.437Z",
                "reviewBody": "I have made these for years as my boys went through elementary school. Their classmates loved them. I would suggest you not use canned frosting as a substitute for the mint patties though. It's just wouldn't be the same. I always cut squares of wax paper and wrapped each cookie as if it had come from a fast food restaurant. It added to the fun.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MTPURSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/262372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-16T16:10:10.37Z",
                "reviewBody": "To me the point of this recipe is that it is sooooooo cute. People just want to look at it but I had some friends tell me they loved the taste and wanted to eat more.:) I made cheese and lettuce out of rolled fondant. I bought some american cheese to match the color using orange & yellow paste colors rolled out the fondant and cut it with a pizza cutter into squares. The lettuce was obviously green and I just pinched off little pieces so it had rough edges - very cute! You really don't need much to do a couple dozen cookies. I gave them out at work in a french fry bag that said \"a smile for your friday\" - because it was Friday - afterwards my husband said it should have said FrYday. From the bottom: Waffer yellow icing mint patty red icing tiny \"lettuce\" tiny \"cheese\" a smidge more red icing if needed top waffer honey sesame seeds. Wrap in wax paper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARINKAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/karinkay/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-25T04:28:53.34Z",
                "reviewBody": "Well I gotta agree with a few of the other reviews... I don't love the taste but they were a lot of fun to make and even more fun to look at. Every kids wnated to get a piece of the action in making them. My daughter is taking them to school tomorrow for her birthday party. We used other suggestions and wrapped them in tin foil to get the fast food effect. I bought the frosting in a can- ready to squirt. It really made putting on the \"mustard\" and \"ketsup\" a snap. I had some white frsting the I put on the wafers (the bottom \"bun\") for glue to hold on the patty. I used York peppermint patties for the patty. We used a honey/ water mixture for the glue to hold on the sesame seeds. I highly suggest you brush on honey mix on the top bun BEFORE you put in on the rest of the hamburger. I got excited about seeing the finished product and put the top bun on and we had a hard time getting the honey on it w/ out the cookies spinning in circles. I used 1 box of wafers and 1 bag of patties and it made 41 cookies. Now the rest of my kids can't wait to take them for their birthday parties next year. Really quite easy and fast to put together. We put all 41 together in about 15 minutes with 3 of us working. Would be fun for a bake sale!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JONESCLAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1220834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-22T12:13:37.307Z",
                "reviewBody": "I put each little burger back onto the square of foil paper that the mint patty had been wrapped in. Gave it that \"fast food\" look. Doesn't completely wrap it more like a cupcake paper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "None",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T20:01:16.06Z",
                "reviewBody": "I made these for my daughtes day care but what could I use for \"cheese\"?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/292554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-04T18:42:20.927Z",
                "reviewBody": "I used colored frosting for the \"lettuce\" \"tomato\" and \"cheese\" and Grasshopper cookies for the \"burger\". Very cute! Taste was kinda weird but that was not the purpose. I give this a \"5\" because of the fun time my daughter and I had putting these together!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kari",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kari/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-10T17:52:23.623Z",
                "reviewBody": "Five stars for being cute zero stars for taste. I made them with the peppermint patties in the center. The combination of mint with vanilla wafers did nothing for me. Then add tasteless squeeze frosting and the result is yuck. If you just want something cute to look at go ahead and make these but if your looking for a good tasting cookie - move on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MADFORGOLD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/251786/"
                }
            }
        ]
    }
]