[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/836/desserts/cookies/bar-cookies/",
                    "name": "Bar Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10118/rainbow-cookies/",
        "name": "Rainbow Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4803073.jpg",
            "width": 2039,
            "height": 1564
        },
        "datePublished": "1997-11-18T16:48:36.000Z",
        "description": "Moist, mellow, and full of almond flavor.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT10H30M",
        "recipeYield": "8 dozen",
        "recipeIngredient": [
            "8 ounces almond paste",
            "1 cup butter, softened",
            "1 cup white sugar",
            "4 eggs, separated",
            "2 cups all-purpose flour",
            "6 drops red food coloring",
            "6 drops green food coloring",
            "¼ cup seedless red raspberry jam",
            "¼ cup apricot jam",
            "1 cup semisweet chocolate chips, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line three 9x13 inch baking pans with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, break apart almond paste with a fork, and cream together with butter, sugar, and egg yolks. When mixture is fluffy and smooth, stir in flour to form a dough. In a small bowl, beat egg whites until soft peaks form. Fold egg whites into the dough. Divide dough into 3 equal portions. Mix one portion with red food coloring, and one with green food coloring. Spread each portion into one of the prepared baking pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 10 to 12 minutes in the preheated oven, until lightly browned. Carefully remove from pan and parchment paper, and cool completely on wire racks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place green layer onto a piece of plastic wrap large enough to wrap all three layers. Spread green layer with raspberry jam, and top with uncolored layer. Spread with apricot jam, and top with pink layer. Transfer layers to a baking sheet, and enclose with plastic wrap. Place a heavy pan or cutting board on top of wrapped layers to compress. Chill in the refrigerator 8 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove plastic wrap. Top with melted chocolate chips, and refrigerate 1 hour, or until chocolate is firm. Slice into small squares to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Bar Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Penney"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.71044776119403,
            "ratingCount": 335,
            "itemReviewed": "Rainbow Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "60.9 calories",
            "carbohydrateContent": "7.4 g",
            "cholesterolContent": "12.8 mg",
            "fatContent": "3.3 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "17.3 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-17T05:10:59.153Z",
                "reviewBody": "I'm a pastry chef and I use these in my kitchen at work all the time, but I made a few changes to make them even better.  Adding some almond extract to it really enhanced the almond flavor.  Another thing that helps is to melt the chocolate with 2 tablespoons butter and a 1/4 cup of heavy cream.  It still firms up, but it doesn't crack like straight chocolate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KAYDELADY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/970021/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-19T10:08:06.813Z",
                "reviewBody": "Hi, Just a few friendly tips. My Uncle owned an Italian cafe and bakery. I grew up helping out. I would like to suggest using ALMOND FILLING instead of paste. This will make them moist and is easier to mix. Use almond extract, it makes the difference. Use gel food coloring instead of liquid. Use enough to get true rich colors. omit the apricot jam. In all of my years around bakeries no one used the apricot jam...just the raspberry jam was used.  And last seperating the eggs is an un-necessary step.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "sweets4u",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2817426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T21:24:18.857Z",
                "reviewBody": "Penney, you have saved me a BUNDLE of money since I no longer need to fly back to New York to get these cookies!!  I can't believe how great these taste - my visiting NYC relatives don't believe I MADE them!  I'm not crazy about other reviewers' ideas of cutting these before coating with chocolate - though it's difficult for me to admit there could ever be such a thing as too much chocolate, these cookies have such a great flavor, it's a shame to cover it up entirely.  I've found that, after coating the uncut cookies with chocolate and letting the chocolate firm up a bit, you can cut through the chocolate neatly if you dip the knife in hot water before each cut.  Just make sure you wipe the knife off with a towel so that it is still hot but not wet.  I am GRATEFUL for this recipe - thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAUTEFLAMBE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/855083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-27T15:54:43.72Z",
                "reviewBody": "I found this recipe about a month ago and have since made 4 batches of these cookies.  Everyone loves them!  They come out incredibly moist and delicious.  I have made some moderations to this recipe.  First when breaking up the almond paste make sure to beat it very well with the sugar until it is completely beaten if not you will see the paste in the finished cookies.  Second add almond extract to the dough- I would go as much as 3/4 tablespoon, this really adds to the flavor of the cookies.  The spreading of the dough is difficult but do-able.  I take the parchment paper and make it large enough to put under the pan on each side which makes it MUCH easier to spread.  Also, for the melted chocolate on top I add a little heavy cream and butter to make it spread easier and cut without breaking.  I also add some powdered sugar on top of the cookies afterwards which covers any imperfections in the chocolate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2223540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T23:07:33.833Z",
                "reviewBody": "This is one of my all-time favorite and most requested recipes.  I even make it easier by just spraying the pans with non-stick cooking spray instead of parchment paper and the cookies easily come out.  Every time I make these people cannot believe they were not bought in a bakery they look so beautiful and professional.  And how they taste!!  Delicious and super moist little cakes.  Outrageous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBACUB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-23T16:11:12.843Z",
                "reviewBody": "These are delicious cookies and easy to make (just takes a bit of time). The combination of flavors is wonderful. They are beautiful cookies and look a lot harder to make than they really are. I will definitely make them again! One hint: I grate the almond paste into the batter. This makes it much easier to incorporate the almond paste into the cookie dough. I love this cookie!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOOKEC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/65416/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-30T07:15:24.59Z",
                "reviewBody": "I made these cookies and everyone wanted the recipe!  They did take a little longer than I expected and I did think the chocolate on top overpowered the cookies but everyone loved them!  I'll definately make again but next time I'll put a thinner coat of chocolate on top.  It does make a lot of cookies so that does help compensate for the extra time it takes to prepare them.  Be sure you cut them before they harden too much or like other people said, the cookies will crack.  Another tip, almond paste is very expensive.  Try to find a wholesale baking store to purchase a large container.  I think the container I bought was about 10 lbs and only cost about $22.  That is MUCH less than you would spend in the grocery store.  I freeze it and keeps fine for a LONG time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DONNA1000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-05T07:51:08.327Z",
                "reviewBody": "I am a New Yorker living in FL and these cookies taste as if they came from an Italian bakery in NY. I have not found any bakeries here that have pastries as good as NY. My husband and I love rainbow cookies and everytime we go to NY we get some. This recipe is great and the cookies come out great. I have made them several times and everyone loves them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIANA M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/788054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-02T18:29:59.367Z",
                "reviewBody": "Very cute and yummy. I found them easy to make just a little time consuming. I replaced the almond paste with almond filling (Solo brand). It comes in a 12oz can but I only used 8oz. I only used raspberry preserves and added 2 T butter and 1/4 heavy cream to the chocolate. I cut logs out (6 of them) before pouring the chocolate on top. That way I ended up with chocolate on three sides. I eyeballed the food coloring until the colors looked bright and vibrant. To compress the layers while they rested in the refrigerator I put a pan (one of the 9x13 I used) on top and inside I placed a 5 pound bag of rice to apply pressure for 8 hours. UPDATE: I made these again and used raspberry jam instead of preserves and they tasted even better. I also went ahead and added 1 tsp almond extract and it was great. I added the entire can of almond filling this time (12oz Solo brand) and will not do so in the future. It came out too soft/gooey even though the volume it added helped manage the batter better. I'll stick to 8oz of filling raspberry JAM and definitely add cream and butter to the chocolate. I experimented doing it both ways (with and without) and without cream and butter the chocolate does crack when u cut them up. They are absolutely delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LatinaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/latinacook/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Rainbow Cookies",
            "description": "See how to make moist, layered cookies loaded with almond flavor.",
            "uploadDate": "2014-12-04T18:22:11.691Z",
            "duration": "PT3M29.418S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F87051cee-6d75-4948-9039-34ecdbca4bb1%2Fd23e5770-1819-44f5-8c4f-8f2bca7c98f0%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3923866523001"
        }
    }
]