[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/844/desserts/cookies/cut-out-cookies/",
                    "name": "Cut-Out Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10212/cream-wafers/",
        "name": "Cream Wafers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F750299.jpg",
            "width": 2851,
            "height": 2609
        },
        "datePublished": "1997-12-21T06:05:00.000Z",
        "description": "Cookies with a creamy butter filling.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "5 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "⅓ cup heavy cream",
            "2 cups all-purpose flour",
            "⅓ cup granulated sugar for decoration",
            "¼ cup butter, softened",
            "¾ cup sifted confectioners' sugar",
            "1 egg yolk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix flour and 1 cup of butter or margarine thoroughly.  Stir in whipping cream and mix well.  Chill  1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough 1/8 inch  thick on lightly floured board.  Cut into 1 1/2 inch rounds.  Transfer to waxed paper heavily sprinkled with sugar, turning to coat both sides.  Place on un- greased baking sheet. Prick in 4 places with fork.  Bake 7 to 9 minutes or until slightly puffed.  Put two cooled cookies together with filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Filling:   Blend 1/4 cup soft butter, 3/4 cup sifted confectioners' sugar, 1 egg yolk, and 1 tsp. vanilla.  If desired,  tint  with food coloring.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Cut-Out Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "FARMLIFE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.653846153846154,
            "ratingCount": 78,
            "itemReviewed": "Cream Wafers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "130.2 calories",
            "carbohydrateContent": "11.8 g",
            "cholesterolContent": "30.8 mg",
            "fatContent": "8.9 g",
            "fiberContent": "0.2 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "56 mg",
            "sugarContent": "5.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-16T19:06:14.037Z",
                "reviewBody": "This is an excellent wedding or shower tea cookie! Actually it is my favorite special occasion cookie. I only make them on for special events though since they are so time consuming and the dough is difficult to work with. But boy are they worth the extra effort!! Note: I generally double the filling/frosting called for in the recipe otherwise it isn't enough. Also put your frosting in a gallon ziploc bag cut off a small portion of a corner and use the bag to squirt on the frosting. You break less cookies that way and it is much easier than using a knife to spread it on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly McNamara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/298735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-19T02:09:44.013Z",
                "reviewBody": "This is my favorite holiday cookie--and that's saying a lot!  My mom always resists making them at Christmas time because it's a nuisance to roll out the dough, but last year we had an idea that worked really well.  We put the dough on wax paper, rolled it into a log and then refrigerated it.  After it chilled, we took it out and simply sliced the log.  It was sooo much easier and came out just fine.  I also omit the egg yolk with no problems and tint the filling pink.  They're always the first to go as they're so pretty and so delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAHLB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/448752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-16T03:18:24.467Z",
                "reviewBody": "At first I didn't understand this recipe.  How can you have a shortbread like cookie with no sugar in it?  BUT I made it and it was wonderful.  I made one small change and that was to add a little vanilla to the dough.  Since you coat the cut out cookie with sugar on both sides, that gives it enough sweetness.  The cookies are flakey and buttery with so much flavor.  I used a sanding sugar which added a bit of sparkle.  When it came to the filling, I did not use the recipe listed - I used my basic buttercream recipe and I thinned it a little with my left over heavy whipping cream.  I did not feel too good about making the filling recipe with the raw egg.  I'm sure it would be safe but it just didn't sound tasty.  And when you put everything together - it's a beautiful little cookie.  They look pretty fancy!  I took one reviewers suggestion and put a small dab of raspberry jam on one side of the cookie before I added the buttercream filling.  Actually, I didn't think they were very time consuming like some reveiwers said and I made a double recipe.  I bake all the time and do some pretty complicated recipes so the time spent on these seemed very reasonable.  These would make a beautiful gift.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1462254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-23T05:38:19.92Z",
                "reviewBody": "Love this recipe! I've been making it for over 30 years. This is EXACTLY the cream wafer cookie recipe from the 1965 Betty Crocker Cookie Book INCLUDING the egg yolk. I have been making it with out the egg yolk for years and havn't noticed much of a difference. It is light and crispy melt in your mouth yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Power Bergeron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-02T22:33:29.107Z",
                "reviewBody": "A Very unusual texture at first (meaning the wafers) but then there is a light, creamy and buttery taste that blends so well with the sweet filling...\nDelicate! be sure to handle the wafers with care, if you wait 3 minutes after removing from the oven (best on parchment paper) they get crispy and firm enough to handle, don't even TRY before that!! The wafers seem to morph from buttery delicate circles to crispy, light delicacies...\nDefinitely not for the heavy handed baker...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefSuddeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-25T18:45:40.823Z",
                "reviewBody": "\"Wow these cookies are awesome, baby!\" It doesn't get any better than that! These are just like the ones my grandma made when I was little! I rolled the dough into a log and then sliced the log into rounds, rather than roll out. I had a problem with the frosting, and ruined it (operator error) so I just used tub frosting and they were still great. Next time I'll slice my rounds just a little thinner, to achieve a greater frosting:cookie ratio! Sooo good! These are a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MomZilla (Evin)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2701003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-12T03:13:27.12Z",
                "reviewBody": "Our family's number one Christmas cookie, first penned on my great grandmother's index card in lovely old writing.  Our recipe calls for 'light cream', which i prefer because it seems to brown more slowly.  I like them at 10 minutes, too, because I love them just slightly golden.  We always used the raw yolk in the cream filling with no problem -- I like the richness.  Parchment paper DEFINITELY aids in rolling (between 2 layers) and I use a napkin ring to cut them out ;-)  The compliments are endless on these labor intensive, luscious cookies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dairy Godmother",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2671827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T19:43:02.497Z",
                "reviewBody": "What a joy! I have used this recipe since 1965 every Christmas. It is my youngest daughters favorite (and she is a Mom now) it would not be Christmas at home without them! But!! I can not find the BC 1965 Cookie book I have had for over 40 years. Did a search on allrecipes and here it is. Thank you Thank you",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PatB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2010474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-08T01:22:45.06Z",
                "reviewBody": "These are so delicious. A not-too-sweet flaky tender cookie sandwiching delicious rich buttery icing. They are well worth the effort it takes to make them. A word of advice DO NOT substitute anything else for the butter called for in this recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-14T00:22:18.14Z",
                "reviewBody": "My family gets together every year to back Christmas cookies and we decided to try a couple different cookies this year. I suggested this one and I have to say that after all the reviews we were all very underwhelmed. The only modification we made was leaving out the egg yolk from the filling. After much effort ours turned out exactly like others pictured here. However for the cookie that was the most work they just did no deliver on taste. The cookie part was very bland and the buttercream center just could not make up for it. I gave it one star as the colored center looks nice but we will not be making this cookie again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jimmeh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5164118/"
                }
            }
        ]
    }
]