[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17285/desserts/nut-desserts/almond-desserts/",
                    "name": "Almond Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10222/raspberry-and-almond-shortbread-thumbprints/",
        "name": "Raspberry and Almond Shortbread Thumbprints",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1074378.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "1997-12-19T06:03:35.000Z",
        "description": "Shortbread thumbprint cookie filled with raspberry jam, and drizzled with glaze.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H18M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "⅔ cup white sugar",
            "½ teaspoon almond extract",
            "2 cups all-purpose flour",
            "½ cup seedless raspberry jam",
            "½ cup confectioners' sugar",
            "¾ teaspoon almond extract",
            "1 teaspoon milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together butter and white sugar until smooth. Mix in 1/2 teaspoon almond extract.  Mix in flour until dough comes together. Roll dough into 1 1/2 inch balls, and place on ungreased cookie sheets. Make a small hole in the center of each ball, using your thumb and finger, and fill the hole with preserves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 14 to 18 minutes in preheated oven, or until lightly browned. Let cool 1 minute on the cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the confectioners' sugar, 3/4 teaspoon almond extract, and milk until smooth. Drizzle lightly over warm cookies.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Almond Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dee"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6625397948355145,
            "ratingCount": 2827,
            "itemReviewed": "Raspberry and Almond Shortbread Thumbprints",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "103.5 calories",
            "carbohydrateContent": "13.7 g",
            "cholesterolContent": "13.6 mg",
            "fatContent": "5.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "36.5 mg",
            "sugarContent": "8.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-04T01:35:37.78Z",
                "reviewBody": "These cookies taste great when made just the way the recipe is written.\n\nBut, if you're like me and your cookies always turn out flat, here's how to make these cookies turn out taller, just like the ones in the picture.  First, turn the oven temp down about 10 degrees.  Second, don't soften the butter before mixing, just cut it into 1 tbsp pieces and mix with the sugar.  Third, add an extra 1/4 cup of flour to the dough.  Finally, once you've filled the thumbprints with jam, put the whole cookie sheet in the freezer for 10 minutes before baking.  The first time I followed the recipe and my cookies were so flat the jam leaked through the bottom, and the second time I made these adjustments and the cookies not only tasted delicious, they looked perfect, too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MarcieJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2167124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-15T21:52:01.95Z",
                "reviewBody": "I think I figured out why some people have trouble with this recipe.  Made one batch, followed recipe exactly.  They turned out great.  Made another, but decided to substitute vanilla for the almond extract.  BIG MISTAKE! They turned out flat as a pancake, so I'm attributing the cause to the switch in the extracts because I made a third batch, like the first (with the almond extract) and they were perfect.  Also followed another reviewer's advice and used a chapstick end to make the hole. These are delicious and attractive IF you follow the recipe exactly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kikigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1677077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-28T21:49:01.44Z",
                "reviewBody": "Have been making these for Christmas since they first appeared in a Pillsbury Classic cookbook many years ago.  They are a tender, buttery, melt-in-your mouth cookie that also look pretty on the plate.  They do spread a bit, so I always chill the dough first and roll the dough into balls a little smaller than the recipe suggests. This is simply a perfect Christmas cookie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-19T17:58:54.97Z",
                "reviewBody": "I've made these cookies a half-dozen times now. They've been DELICIOUS every single time, but here's a few words of advice: First, do not leave out the almond extract or sub it with vanilla. The almond adds a great flavor and its very distinct. Second, pull the cookies out of the oven midway through cooking, take a spoon and lightly spread the jam outwards and even it out into a circle. This way, the cookies will look much prettier when done. The first time I made them, the jam had bubbled all over the cookie and wasn't evenly spread. The flavor was the same of course but the jam likes to go its own direction and I like them to look pretty. Great recipe!\n\nETA: I have found that once the cookies are ready to be put in the oven, if you put them in the fridge for ~15 minutes, it will eliminate the need to \"fix\" the jam half-way through baking. Also, because shortbread is naturally so white, it is easy to burn these without realizing that the bottoms are browning. So, carefully watch the edges and when they turn light brown, they are done (even if they don't look like it!) Also, use the back of a teaspoon to make perfect little holes to fill.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1879389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T01:19:29.98Z",
                "reviewBody": "These are so fabulously simple and great. Although... it did take 3 tries in the oven before I figured out how to eliminate the jam from spreading all over my cookie sheets and creating a mess! (even the messy looking cookies tasted great though) I should have listened to other reviews... In the end... I made the cookies like small little buttons - about the size of a quarter rolled them into a ball like another reviewer and then made a nice indent for the jam. You don't need a lot of jam... when you use too much the jam will destroy your cookie sheets... suggestion for novice bakers like me... use parchment paper the first few rounds so you don't have to deal with the mess in the event you don't use the right amount of jam or push the indent enough to hold the jam... Anyhow I baked the really small cookies for only 12 1/2 minutes and they turned out fabulously. Each oven is different though... that much I've learned... so I started to look for golden brown edges and then pulled the cookies out.... makes for a tasty shortbread cookie! even my husband who is a die-hard chocolate chip cookie lover and told me \"i don't like sugar/shortbread type cookies\"... well... he has managed to eat close to a dozen of the little button cookies in the past few hours!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "f1fan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2065877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T22:12:25.653Z",
                "reviewBody": "Wow - a simple cooke with a absolutely decadent flavor! I mean these are really really good. the key to these is chilling the dough rolling them small and taking the genious advice of using a chapstick cap to make the indentions. Whoever thought of that little trick deserves a medal! These cookies definitely melt in your mouth. I used glaze featured with the recipe but you can definitely change this up with melted white and dark chocolate - YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-22T23:05:45.89Z",
                "reviewBody": "The first time I made this recipe I didn't have any butter on hand and used margarine (Can't Believe It's Not Butter).  Although I typically never bake with margarine - I was surprised at how well it worked for this recipe.  Although the recipe works as stated - I've found a way to \"improve\" it a bit.  \n\nBy adding 2 egg yolks and 2 extra tablespoons of flour - it creates a tastier cake-like cookie.  The trick is to beat the butter by itself until the butter is very pale - then add the sugar and beat again until very very pale.  Add the eggs and flavoring - then add the flour.\n\nI don't use extract because I don't use any alcohol - I have found an almond emulsion for bakers (alcohol free and much better than extracts) and these cookies are PHENOMENAL with the almond flavoring.  Vanilla works well too - but the almond is the best!  \n\nOf all the cookies I bake these are the most requested cookies.  \n\nI use a cookie scoop to have even sized cookies - shape them into round balls and only use my thumb to make the indentation.  Fill a plastic ziplock bag with the preserves and snip the corner of the bag - and pipe the preserves into the center of the cookie (less fuss and mess)... if you have any extra preserves you can just squeeze it back into the jar.  Be sure to use parchment paper, rotate half way through baking, and remove from oven when the bottoms begin to brown (the tops of the cookie shouldn't brown).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-18T00:55:10.84Z",
                "reviewBody": "These cookies are not only impressive, they are mouth watering delicious!  I made the \"thumb print\" indentation with a wine bottle cork, and filled the centers with a seedless raspberry preserve that I heated on the stove for an easier consistency.  I alternated the drizzle every other cookie with a semi-sweet chocolate and the almond glaze, using a zip lock baggie to pipe the glaze.  This has got to be the most simple, yet impressive cookie I have ever made!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. Chef Esh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mschefesh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-04T20:31:55.247Z",
                "reviewBody": "The best and easiest holiday cookie out there. I have been making this for a few years now. I make equal batches of Strawberry and Raspberry.  These cookies spread. After you roll your cookies and put your jam in put them back in the fridge for about 20 min. makes a huge difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2191965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-21T00:18:57.363Z",
                "reviewBody": "I was very dissapointed in these cookies!  I followed the recipe exactly and ended up with flat cookies!  They looked more like saucers than cookies, the jelly spread everywhere.  I will try these again sometime but will look through reviews on how to make them like the picture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherbear1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sher_bear1/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Raspberry and Almond Shortbread Thumbprints",
            "description": "Your favorite thumbprint cookies, jazzed up with delicious glaze.",
            "uploadDate": "2014-12-04T18:25:05.959Z",
            "duration": "PT2M16.219S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa2e10f16-5d3f-4a7b-bb2b-ff87d721505e%2F27dcdc89-4ce3-45c4-a19f-63344d1e85ff%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3923845858001"
        }
    }
]