[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/851/desserts/cookies/oatmeal-cookies/",
                    "name": "Oatmeal Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17654/desserts/cookies/oatmeal-cookies/oatmeal-raisin-cookies/",
                    "name": "Oatmeal Raisin Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10264/oatmeal-raisin-cookies-i/",
        "name": "Oatmeal Raisin Cookies I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F08%2F17%2FOatmeal-Raisin-Cookies-I-by-Frank-Dilley-7492405_original.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1998-01-07T16:31:12.000Z",
        "description": "An old stand-by that the whole family loves.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "¾ cup butter, softened",
            "¾ cup white sugar",
            "¾ cup packed light brown sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "1 ¼ cups all-purpose flour",
            "1 teaspoon baking soda",
            "¾ teaspoon ground cinnamon",
            "½ teaspoon salt",
            "2 ¾ cups rolled oats",
            "1 cup raisins"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large bowl, cream together butter, white sugar, and brown sugar until smooth. Beat in the eggs and vanilla until fluffy. Stir together flour, baking soda, cinnamon, and salt. Gradually beat into butter mixture. Stir in oats and raisins. Drop by teaspoonfuls onto ungreased cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 8 to 10 minutes in the preheated oven, or until golden brown. Cool slightly, remove from sheet to wire rack. Cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Oatmeal Cookie Recipes",
            "Oatmeal Raisin Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Darlene"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.385793279455551,
            "ratingCount": 2351,
            "itemReviewed": "Oatmeal Raisin Cookies I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "92.4 calories",
            "carbohydrateContent": "14.6 g",
            "cholesterolContent": "15.4 mg",
            "fatContent": "3.4 g",
            "fiberContent": "0.7 g",
            "proteinContent": "1.3 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "75.4 mg",
            "sugarContent": "8.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-30T18:26:20.077Z",
                "reviewBody": "I'm changing my rating to a 2 star.  I hadn't made these cookies in a while, and I forgot about my notes in my first review below.  I didn't add the extra flour and baking powder this last time and this cookies ran like crazy!  I now understand why some where so disappointed. The extra flour REALLY makes the difference.  Without this alteration, the original recipe is not good.\nHope this helps!\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nIn an attempt to make \"perfect\" cookies the first try, I read many of the reviews here.  Guess what!  It worked!  These cookies are fantastic.  I did soak the raisins by putting them in a colander, placing the colander in a saucepan and running hot tap water over them enough to cover them.  I let them soak while preparing the dough.  Another concern expressed in other reviews was that these cookies came out flat and ran into each other.  To try and avoid this happening, I used 1/4 cup more flour and added 1/2 tsp. baking powder.  These did not run at all, and are slightly poofy.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky Black",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/275092/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-13T01:38:31.653Z",
                "reviewBody": "This is a great recipe! I've read most reviews about the recipe and the most common concerns seem to be that the cookie spreads too thinly when baked and that it is too sweet or bland. I have cut down the sugar to 1/2 cup each of brown and white sugar and added 1/4 tsp ground cloves and 1/4 tsp of ground allspice. Also feel free to add more cinnamon if you like. This made the cookies very flavorful. The trick  is, however, mixing the dough by HAND and NOT overworking it. Follow the recipe and incorporate the dry ingredients into the wet in three stages. Do not use a mixer or you will overwork the dough and get flat cookies. I have also soaked the raisins in hot water and drained them in a sieve prior to adding them at the end. Bake the cookies on a cookie sheet at 350 or lower depending on your oven (I baked mine at 325 because my oven was too hot). Regardless at which temperature you bake them, make sure you keep an eye on them after 5-8 minutes and take them out when the edges are golden brown. I had no problems baking these or removing them from the pan. They are moist, flavorful, and delicious. Thanks for a great recipe! This one's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TranceAddict",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2370950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-22T19:56:56.027Z",
                "reviewBody": "for those folks who had issues with the cookies sticking to the pan, etc...since these cookies are made with butter, you need to use a non-insulated shiny cookie sheet.  This will allow the whole cookie to bake without the butter melting first and the cookie turning out flat and crunchy.  (If you substitute shortening for the butter, you can use an insulated pan without a problem, too.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jean Parris Graham",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/672636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T21:49:54.413Z",
                "reviewBody": "Delicious cookie. I tweaked it slightly though; I used more raisins and soaked them in boiling water first (they were moister and plumper this way) I added a bit more cinnamon and the batter seemed wet so I ended up adding more flour and oats. However I would not recommend adding more oats; it was too overpowering. I decided to make monster cookies hoping they would turn our big and chewy which they did. I got 20 large cookies from this recipe. Watch the baking time carefully only adding a minute at a time if you want chewy cookies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen_M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-27T16:46:28.5Z",
                "reviewBody": "Tried and true my foot. My boyfriend had a craving for oatmeal cookies last weekend, so I wanted to make him a treat. These were the worst cookies I've ever made. I consider myself a pretty good cook. When I read the reviews, a couple people said that it didn't work for them. My boyfriend and I assumed these people must not have been following the recipe correctly. These cookies had the worst consistency ever. They hardened up into flat discs as soon as I took them out of them oven. Somehow they stuck to my non-stick, commercial baking pan, even when it was greased. I had to chisel them off (and clean the pan between batches). When I put even a teaspoon of dough out for each cookie, they would spread flat and the raisins would burn. I even tried freezing the dough for the last batch. After about an hour out of the oven the consistency would turn flimsy and sticky. I wish I took a picture to submit. After three batches, all the cookies went into the trash. What a waste of time. It angered both my boyfriend and myself. This recipe either needs to be rewritten or taken out of the tried and true section. I took the leftover dough and added baking powder, another egg, more flour, more oats, applesauce and some spices (poppy seeds, orange peel, vanilla, and coconut). I put the dough in muffin tins and made great muffins. if you have the same problems I had, you might want to try this. The extra ingredients help the dough stay together and rise.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ZEROGIRL42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1409037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-29T19:37:59.86Z",
                "reviewBody": "This recipe came out perfectly for me the first time I tried it. They are a hit with my family. I read most of the reviews here prior to starting. I did soak my raisins which made them extra plump, but I found I did not need to add the extra flour or baking soda, as the dough already had a nice consistency. My cookies did not run at all, and puffed up quite nicely. I cut the white sugar down to 1/2 cup, but kept the brown sugar at 3/4 cup. This did not affect the taste of the cookies, thanks to the raisins, which add natural sweetness. I also added a little extra cinnamon as well as ground star anise (1/2 tsp) to this recipe, which gives a nice flavour. For baking, I rolled spoon-sized amounts of the dough into balls. I turned my oven down to 350, as I found the first batch to be browning a little too quickly on the edges. My cookies needed about 9 minutes, but I had to watch them. They aren't the kind that you can pop in the oven and walk away.  Here's a tip: if you want a slightly flatter cookie, press the cookies down with a fork about 1/2 through baking.\n\nI will definitely be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2921362/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-10T19:06:18.177Z",
                "reviewBody": "Really good cookies! I cut the white sugar down to 1/2 cup, bumped cinnamon up to a whole teaspoon, and added 1/4 teaspoon of nutmeg. If you are having problems with them sticking, it is because you have to let them cool a little on the sheet pan. I used a baking spray and they came off easily for me. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RobinB137",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2668308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-01T22:15:58.71Z",
                "reviewBody": "This was a wonderful recipe! We have tried so many different recipes trying to come up with the perfect oatmeal raisin cookies....and this is it!!! Crispy edges, chewy middles....just perfect!! And very simple to make. Love them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOCHAJAVA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/680341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-01T22:14:50.553Z",
                "reviewBody": "This was a very tasty recipe exactly what I was looking for. It's hard to find an oatmeal raisin cookie recipe that uses butter instead of shortening. I was a little leary before making it because some people said the cookies turned out hard but I have just finished baking them and they turned out perfectly moist. Maybe others baked them too long. Make sure you don't overbake if you want them moist maybe even take them out a couple minutes early. Great recipe thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEZ SHAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/796316/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Oatmeal Raisin Cookies I",
            "description": "Make these classic cookies to sweeten any occasion.",
            "uploadDate": "2012-06-01T16:43:41.091Z",
            "duration": "PT2M40.192S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3070e135-23ea-4da4-91f0-4bdf104b98d9%2Fe912dc1c-fc8f-435f-9d60-ffed2248c74a%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1667735006001"
        }
    }
]