[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
                    "name": "Lemon Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10294/the-best-lemon-bars/",
        "name": "The Best Lemon Bars",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F05%2F1394851-The-Best-Lemon-Bars-Photo-by-Lela-650x465.jpg",
            "width": 650,
            "height": 465,
            "caption": "Photo by Lela"
        },
        "datePublished": "1997-10-18T12:35:44.000Z",
        "description": "Tart, rich and perfection, all rolled into one! Wow your friends with this simple recipe.  Hint: No Substitutions!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "1 cup butter, softened",
            "½ cup white sugar",
            "2 cups all-purpose flour",
            "4 eggs",
            "1 ½ cups white sugar",
            "¼ cup all-purpose flour",
            "2 lemons, juiced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, blend together softened butter, 2 cups flour and 1/2 cup sugar.  Press into the bottom of an ungreased 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 20 minutes in the preheated oven, or until firm and golden. In another bowl, whisk together the remaining 1 1/2 cups sugar and 1/4 cup flour. Whisk in the eggs and lemon juice. Pour over the baked crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for an additional 20 minutes in the preheated oven. The bars will firm up as they cool. For a festive tray, make another pan using limes instead of lemons and adding a drop of green food coloring to give a very pale green. After both pans have cooled, cut into uniform 2 inch squares and arrange in a checker board fashion.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Lemon Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Patty Schenck"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.529227259766182,
            "ratingCount": 3507,
            "itemReviewed": "The Best Lemon Bars",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "125.8 calories",
            "carbohydrateContent": "17.8 g",
            "cholesterolContent": "34.2 mg",
            "fatContent": "5.8 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.6 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "44.4 mg",
            "sugarContent": "11.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-21T22:49:00.14Z",
                "reviewBody": "Excellent, everything a true lemon bar should be. Buttery, tender and tart.  Definitely use at least 1/2 cup of lemon juice or more.  I've made this recipe many times and find that 2/3 cups lemon juice (juice of 3 large lemons) gives this the perfect tartness. (add 1 extra tablespoon flour if using 2/3 cup juice)  I also added the zest of 2 of the lemons.  I made this in an 8 X 11 dish (smaller than what the recipe calls for) and found it ideal.  The crust is the perfect thickness and there is enough lemon custard in each bite to satisfy.  This recipe makes a lot of crust and does spread into a 9 x 13 dish easily, but makes a thinner bar.  If using the smaller baking dish (i.e, 8 X 11), make sure to increase cooking time of the crust and filling an extra 5-10 min each.  As another reviewer stated, it's better to overcook then undercook the crust.  Also, add 1/4 teaspoon salt to the crust for more flavor.  This will be my master recipe for Lemon Bars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-01T05:04:22.577Z",
                "reviewBody": "I have made two other recipes of lemon bars and on both of them the end result was that the liquid filling kind of melted in with the crust. On this recipe however, you can see a nice shortbread crust that was about 1/4 inch thick and 1/4 inch of the filling on top of that. I increased the lemon juice by one more large lemon and got about 3/4 of a cup of lemon juice. I also zested two of the lemons and added that to the liquid filling before cooking. I love it super tart, but I think most people might like it better a little less, so I would suggest using 1/2 cup of fresh squeezed lemon juice. Also,I let the crust cool for until it was just room temperature. To speed this up I put it in front of a fan for about 15 min. and it worked great. Then when the crust was cooled down I poured the liquid filling over it. I cooked the crust first for 20 min. then when  returned it to the oven with the filling, I cooked it for about 25 min. I ate some after it came out of the oven, but about 4 hours later, after being in the fridge, they were the perfect consistency. A nice firm crust, and the filling was like a really firm pudding that held its shape. I also added a teaspoon of salt to the crust recipe. I made mine in a 9 x 12 pan. Next time I am going to double the recipe so that the crust is thicker and their is a thicker amount of filling on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sugarboo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1963939/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-26T16:15:05.203Z",
                "reviewBody": "As printed, this recipe was not lemony enough.  Using other's suggestions, I tried it again using the juice of 5 lemons (a little over 2/3 cup) and the zest of two lemons. I also added 1/3 c. flour to compensate for the extra liquid.  I also had to increase the bake time to about 24 minutes.  These turned out GREAT with the extra lemon (and, of course, powdered sugar on top).  I also added a dash of salt to the crust and thought it was divine.  These weren't anything flashy or out of the ordinary...just exactly what lemon bars should taste like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SALLYCAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/118036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-07T00:18:55.123Z",
                "reviewBody": "I hate it when folks don't try and then rate the original recipe.  Having said that, I'm forced to live a double standard and do just that!  I wanted to give Patty 5 stars for a perfect base recipe to start from.  After reading reviews, i just knew that Patty's original recipe wasn't going to have enough filling, nor be lemony enough to satisfy my lemon craving.  So here are the small changes I made to quell the lemon monster:  kept shortbread recipe as is, but added 1 tsp lemon zest.  Doubled the filling recipe, using a total of 1 1/4 cups fresh squeezed lemon juice and added an extra 2 Tbsp flour.  Cooked crust to recipe instructions, but needed to extend the filling cook time to 30 minutes.\nEveryone loved these bars!  I was told that they beat anything you'd find at a specialty bakery.  That's saying something, folks!\nHowever, credit MUST go to Patty!  Her recipe started it all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deeta Jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/989286/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-02T17:36:48.17Z",
                "reviewBody": "Fantastic!  The crust was nice, crisp, and buttery- exactly how I love it.  And the lemon filling was just right.  I took the advice of other reviewers and added the lemon zest.  \r\n\r\nAlso a tip to make sure you get maxiumum juiciness out of your lemons- pop them in the microwave for about 15 seconds.  They yield much more juice this way!  \r\n\r\nVery lemony, easy, and satisfying!  Throw away the boxed stuff and make these!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSALLIED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762587/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-27T18:10:05.2Z",
                "reviewBody": "The crust seemed to need more sugar.  My mother said all she could taste was butter.  \"Two lemons, juiced\" is vauge and unfortunately my bars turned out with very little lemon flavor to them.  It would be helpful to know the amount of juice to extract.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "IRISHMAIDEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/426961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-18T17:48:37.953Z",
                "reviewBody": "The title of this dessert and the introduction pretty much sums it all up!...The best lemon bars I have ever had.\n---UPDATE---I have been making these for a while now and although I believe they are perfect as written I have recently discovered using 1 Cup Icing Sugar mixed with 2 1/2 TBSP. of Real Lemon Juice (From concentrate/bottle)& 2 drops of yellow food colouring  to make a glaze and pour this glaze over the dessert as soon as they come out of the oven and allow to cool in pan. It's unbelievibly great for those tart lemon lovers with a sweet tooth. Also, keep these bars in the fridge they keep their form better then at room temp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1837326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-29T19:38:39.11Z",
                "reviewBody": "With nearly 1,000 reviews, I don't know that I'm adding much, but these are my favorite dessert to make for myself, throwing parties, and to bring to events. I make three minor adjustments based on other reviews: add 1/4 tsp salt to crust; use 2/3 cup fresh-squeezed lemon juice (more precise than measuring by number of lemons); add 1 Tbsp flour to custard because of extra juice. The result: perfection. Everyone loves them, everyone asks for my recipe, and friends give me lemons from their trees because they want lemon bars in return. I really can't say enough good things about these.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cmpeterson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4299802/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-23T21:30:40.627Z",
                "reviewBody": "My mother always made these when I was a kid, now I make them all the time!  They have a buttery crust and gooey delicious lemon filling.  In the filling we use 2 cups of sugar and at least 1/3 cup lemon juice (and yes, you can substitute the lemon juice from a bottle).  I bake mine 20 min for the crust and an additional 25 with the filling (you want the filling slightly golden brown--a little too long in the oven is better than not long enough).  Dust with powdered sugar while they are still warm so it will stick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATSKI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/127602/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "The Best Lemon Bars",
            "description": "See how to make tart and tasty lemon bars.",
            "uploadDate": "2012-12-12T17:04:43.154Z",
            "duration": "PT3M12.901S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F1b89be00-aea9-404d-bd67-92c2061c6805%2F6616e5e2-f199-4417-a9a9-b841874f8ca6%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2031100658001"
        }
    }
]