[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10339/pignoli-cookies-ii/",
        "name": "Pignoli Cookies II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F260046.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "1997-12-30T18:54:40.000Z",
        "description": "Also called pine nut cookies.  I make them and my family eats them so quickly I have to hide a few so I get some.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "½ pound almond paste",
            "1 cup white sugar",
            "2 egg whites",
            "¼ cup pine nuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Use a pastry chopper (or food processor) to break up the almond paste into a granulated form.  Put in mixing bowl and gradually add the sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another small bowl, beat the egg whites until stiff.  Fold the egg whites into the sugar/almond paste mixture gently.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a greased and floured cookie sheet, drop a spoonful of the mixture.  Press pine nuts into the top of the cookie (you want to cover the top with nuts).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 325 degrees F (170 degrees C) for 10-12 minutes.  Cool on wire rack.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Maryellen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.268656716417911,
            "ratingCount": 67,
            "itemReviewed": "Pignoli Cookies II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "169.8 calories",
            "carbohydrateContent": "26.2 g",
            "cholesterolContent": null,
            "fatContent": "6.7 g",
            "fiberContent": "1 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "11.1 mg",
            "sugarContent": "16.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-18T21:55:27.47Z",
                "reviewBody": "I have been making these italian delicacies for years A hint to anyone trying to use a floured pan or parchment paper...forget it! You have to use the shiny side up of foil paper lightly sprayed with butter flavored PAM. The reflective side up will not burn the cookies. Just do not attempt to lift them off of the foil until 10 minutes after they come out of the oven or else they will crumble as most cookies will. If you have access to a restaurant supply warehouse as i do buy the almond paste in the 5 pound can and it costs only about 12.00 it lasts forever and the cost of the little tubes in the supermarket will run you 5.00 each or higher. that's why the Italian Bakeries charge 14.00 a pound for these cookies. theirs are made with flour(cheaper version) and get hard quickly. Store these cookies in a tin with foil on top and they will last the whole holiday season! Enjoy... Don't forget to put the pignoli's in a saute pan for a few minutes to release the natural oils that are necessary to permeate and enhance the wonderful almond flavoring.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSSELLI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/37678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-16T13:19:21.83Z",
                "reviewBody": "Even though this Pignoli cookie recipe has fewer reviews, it is the better one (and I made both).  If you are using 8 oz. of almond paste (I used solo that comes in the can), you can only use two eggs whites.  If you use too many egg whites your cookies will be a completely flattened.  The only change I made to the recipe was to use 2/3 cup of sugar and not 1 cup because they were just too sweet.  Other than that, this recipe is perfect!  You will have beautiful pignoli cookies that taste like they came from an Italian bakery (this coming from a Jersey girl who had eaten alot of good Italian bakery cookies!) You can't go wrong with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBACUB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T03:39:12.14Z",
                "reviewBody": "Just like my grandmother's and that is hard to top! Delicious moist and chewy. You'll think you bought them at a bake shop.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TONIQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/190175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-14T06:18:25.703Z",
                "reviewBody": "I had never heard of pignoli cookies but thought the recipe sounded fun to try. Found out that almond paste and pine nuts are expensive! Nice flavor overall. For baking it I used parchment paper instead of greasing/flouring--just let the cookies sit for a few minutes after taking them out of the oven then gently work them off the parchment and slide onto wire rack. The next time I will also try: Less sugar and using a stand mixer with paddle attachment to break up the almond paste (my little food processor didn't really break it up enough I had chunks of almond paste in the ending cookies) and making the cookies much smaller--the recipe doesn't really give a hint as to size but I think bite-size is better as these are very intense sweet rich cookies. They do puff out a bit when baking so plan your spacing accordingly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "doestreich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1187720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-24T03:27:55.677Z",
                "reviewBody": "I too have made both Pignoli recipes on this site and find this recipe to be superior. I bake these every year around Christmas time and they always get raves and requests for the recipe. I have used parchment paper and had no problems but i usually use a silpat silicone mat and that works best. I agree that you may not need to use all of the egg white. I doubled this recipe and still only needed 2 whites.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiemonster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2700812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-18T23:44:22.243Z",
                "reviewBody": "This is a great recipe!! These cookies are my hubby's favorite so I decided to make them to see what he thought of them and he gave them a 5 out of 5 stars. I wish I had sauteed the nuts before adding them to the tops (as someone suggested) because that was the only difference between the bakery and this recipe...definitely will remember to do that next time! The parchment paper is a must...no problem with removal and letting the mix chill in the fridge helps with placement. Be sure to make your balls small and completely covered with nuts because they spread out. If you want your cookies to taste like they came from the bakery than you need to use 1 cup of white sugar...it's not too sweet...but just right. It's the closest to the bakery cookie as you're going to get and that's coming from an Italian that grew up eating these cookies. Some reviewers said this was messy but I didn't think it was any messier than other cookies I've made. Put them in a tin lined with waxed paper after they cool to stay fresh...if you can keep them that long lol. Thank you so much for sharing. I will definitely make these again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SuzyHomemaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2131470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-17T02:17:02.08Z",
                "reviewBody": "Delicious flavor and soft chewy consistency Mmm! I only used 2/3 cups of sugar and I refrigerated the mix for about 20 minutes before I spooned them out to bake. I baked them on aluminum foil (shiny side up) and they came off much more easily than they did off of the parchment paper. I will be making these again for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ssejaclop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1573960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-13T11:25:34.927Z",
                "reviewBody": "This recipe is perfect as is except I baked mine for about 15 minutes so they got golden on top. Some tips I have are 1. Definitely toast the pine nuts! 2. Use a silicon baking mat they turn out fluffier and they do not stick. 3. I used 1 cup of sugar and gradually added it in the food processor. I found this helped granulate the (Solo brand) almond paste. 4. Important I like to drop them in 1/2 to 1 teaspoonfuls since they spread out so much - you can probably end up with about 30-36 cookies if you do it this way! Note if you do it this way buy about 1/2 cup of pine nuts so you can be sure to have enough to cover the tops. These are just fabulous!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ICookItsWhatIDo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2995651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-12T04:22:47.257Z",
                "reviewBody": "These are delicious but mine turned out really flat and spread out a lot while baking... what went wrong? Is it better to add a little flour? Or are there other tricks?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "suomikati",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8337707/"
                }
            }
        ]
    }
]