[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/844/desserts/cookies/cut-out-cookies/",
                    "name": "Cut-Out Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10416/chocolate-cut-out-cookies/",
        "name": "Chocolate Cut Out Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F609282.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "1998-01-30T02:46:37.000Z",
        "description": "A great cookie for cutouts that are brown in color:  footballs, animals, leaves, etc.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "2 cups white sugar",
            "3 eggs",
            "3 teaspoons vanilla extract",
            "3 cups all-purpose flour",
            "1 teaspoon baking powder",
            "10 tablespoons unsweetened cocoa powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cream butter or margarine and sugar until light and fluffy; add eggs, one at a time, beating well. Mix in the vanilla. Combine flour, cocoa powder and baking powder; add and mix well.  Wrap dough in waxed paper and chill for 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough in half.  Roll out each half to 1/4 inch thick.  Cut with desired shaped cookie cutters.  Place on lightly greased cookie sheets and bake  for 10-12 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Cut-Out Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Robin J."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0344827586206895,
            "ratingCount": 87,
            "itemReviewed": "Chocolate Cut Out Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "136.5 calories",
            "carbohydrateContent": "20 g",
            "cholesterolContent": "29.1 mg",
            "fatContent": "5.8 g",
            "fiberContent": "0.7 g",
            "proteinContent": "1.9 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "56.2 mg",
            "sugarContent": "11.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-07T19:20:53.623Z",
                "reviewBody": "I have been baking cookies for about 24 years. I have been making these particular cookies of Robin J for about 3 years. They are delicous. I found that the dough is very sticky. To help that I mix up a combo of confectioners sugar and cocoa. sprinkle that HEAVY on the cutting board. Then I sprinkle that same mixture very heavy on the dough that I have placed on the cutting board. That helps tremendously. My family loves these and begs me to make them. I frost them using a marshmallow creme frosting. Delicous and something not everyone else makes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1761335/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-02T01:49:17.837Z",
                "reviewBody": "With a few modifications based on other reviews, I made these cookies for the first time with much success.  They were very very easy and delicious.  The only changes that I made were:  1)  I used two large eggs (not three); 2)  I added one extra TBSP of cocoa;  3)  Because I was in a hurry, I chilled them for about an hour in the freezer.\n\nOnce I removed them from the freezer, I immediately cut the dough in half and put half back into the refrigerator while I rolled and cut the first half.  It worked like a dream.  \n\nHighly recommend this recipe and these cookies.  :)  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2945462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-30T19:21:31.29Z",
                "reviewBody": "I can't believe anyone gave this a bad review! I made them today and they are perfect. If you prepare properly, you should get a nice firm dough. It is a little sticky, so I sprayed my hands with no-stick spray when I was shaping them. Most important thing is to make sure you use 2 sticks of ROOM TEMPERATURE butter, NOT MELTED. just crush the butter into the sugar, and you will get a paste. Also make sure you mix all dry ingredients together in a seperate bowl, and then mix the dry a little at a time into the wet bowl. They are delicious. I added decorators icing and sprinkles. (I added a picture).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TIFFANYW81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1443531/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-29T23:44:38.33Z",
                "reviewBody": "I wanted to comment on the post that the cookies tasted 'chemically'. I had this problem with so many recipes and found out they all had one thing in common they all called for baking powder. Upon researching the taste you are experiencing is from the aluminum in the baking powder. I am very sensitive to the taste but no one else in my family is they think I am nuts lol. The sensitivity to the taste has gotten worse as I get older (35). I only use Argo Baking Powder (aluminum free) and it has made a world of difference. Hope this helps others out there!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IBREAKNRUN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1083249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-22T16:21:10.247Z",
                "reviewBody": "I was really weary of this recipe, because others had so many problems.  With a few tweaks, this is great recipe for chocolate cut outs!  I only used 2 eggs, added 2 T extra cocoa powder, and added 1/2 tsp salt.  With any cut out recipe, you have to chill the dough properly in order to prevent stickiness.  I used plain flour to roll them out, and it didn't affect the color or taste at all (instead of cocoa and sugar others suggested).  I also decided to bake these at 375 for 7-8 minutes, like my other sugar cookie recipe.  I loved the chocolate, tastes very close to a brownie type cookie.  Will def keep as an alternate to regular sugar cookies!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "footballgrl16",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4002607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-03T00:07:37.883Z",
                "reviewBody": "Definately an awesome option for families that don't like sugar cookies, but want the fun of cut out cookies.  I have made this several times and have figured out to use only 2 eggs if you have jumbo or extra large eggs.  Also adding 1T more of Cocoa helps the dough consistancy.  It does still need a fair amount of flour when rolling out.  The final product tastes like mini brownies.  Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Megyesi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-23T18:02:27.11Z",
                "reviewBody": "Just tried these yesterday and the recipe is VERY good. But I agree with the comments and followed them.   If you plan to make this - use only 2 eggs and not 3! Instead of 1 cup butter, use 2 sticks (220gms) and baking time is about 8 to 10 mins and NOT 10 to 12 as it burns quickly. Other than that - a SUPER recipe that is accurate and easy to follow. Merry X'mas one and all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "elainey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1501084/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-24T18:55:23.107Z",
                "reviewBody": "An awesome recipe AS IS!! After reading the reviews I starting tweaking the recipe with disasterous results. Because I was making this for a back-to-school special for the local Kindergarten teacher I had to make them again. This time I followed the directions as written and they came out perfect. Things I did do were: used the 3 (large)eggs reduced the vanilla to 1 tsp and really packed the flour into the measuring cup - usually I spoon the flour but didn't in this case. 10 Tbsp of cocoa is just a hair over 2/3 c so I put in the 2/3 c of cocoa. The dough came out perfect - even tho we didn't mix in all of the flour and cocoa powder in the end - this is because my son turned the mixer on high just after I added some of the flour mixture and blew brown powder all over the kitchen - so I may have been lacking 1/4 c of that mixture I am not sure! I did sift 1/3 c cocoa powder and 1/3 c powdered sugar together and used that to flour my rolling surface. 10 minutes baked on parchment paper made absolutely beautiful and perfect cookies. A definite keeper of a recipe with the results tasting like Nabisco's Famous Chocolate Wafers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kat G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1821605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-04T17:03:23.91Z",
                "reviewBody": "Full chocolate taste. I rolled the dough to 1/4\" thickness between two pieces of waxed paper put it in the refrigerator that way for less than 20 minutes and took it out and it was ready for cookie cutters. No problem! No mess. No dilution from flour/sugar/cocoa powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elisabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2527473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-07T02:31:26.64Z",
                "reviewBody": "I read the reviews and added one extra cup of flour and they were still too soft (even after chilling all afternoon) to roll. So I rolled between two sheets of wax paper used cutter removed excess froze the cookies until solid and only then baked. They still didn't hold a fairly simple cut out shape. The no-fail sugar cookie recipe at cakecentraldotcom is much much better. I think this recipe has too much egg and that's why it's so soft. I'll keep looking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CMHGUPTA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1347053/"
                }
            }
        ]
    }
]