[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/718/world-cuisine/european/austrian/",
                    "name": "Austrian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10573/linzer-tarts/",
        "name": "Linzer Tarts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F440579.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-02-21T03:59:44.000Z",
        "description": "Cut out cookies with a jam filling.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 dozen",
        "recipeIngredient": [
            "1 ¼ cups unsalted butter, softened",
            "⅔ cup white sugar",
            "2 cups sifted all purpose flour, divided",
            "1 ¾ cups ground almonds",
            "⅛ teaspoon ground cinnamon",
            "5 tablespoons raspberry jam",
            "⅓ cup confectioners' sugar for decoration"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat butter and sugar together until the mixture is light and fluffy. Stir in 1/2 cup flour, the ground almonds, and cinnamon. Mix in remaining flour 1/2 cup at a time until the mixture becomes a slightly stiff dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shape the dough into a ball; divide it in half. Wrap both halves in wax paper or plastic wrap, and refrigerate for about one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Line a baking sheet with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, roll half of the dough into a sheet 1/8 inch thick. With a 2 1/2-inch cookie cutter, cut as many circles from the sheet as you can. Knead the leftover scraps of dough into a ball and roll it out again into a 1/8 inch sheet. Cut out more circles. You should now have about 12 circles.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange cookies on prepared baking sheet, leaving about 1 inch of space between them. Refrigerate while working with remaining dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Repeat the rolling and cutting process with the other half of the dough, but after placing the second batch on the baking sheet, cut out the center of each circle with a 1/2 inch cookie cutter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cookies in preheated oven until light brown, 10 to 15 minutes. Cool on wire rack for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread a thin coating of jam on each of the cookie rounds. Set a cutout cookie on top of each, pressing the two together so they make a sandwich. Spoon a dab of jam into the opening of each tart and sprinkle the tops with confectioners' sugar before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Austrian"
        ],
        "recipeCuisine": [
            "European",
            "Austrian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Regina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.410404624277457,
            "ratingCount": 173,
            "itemReviewed": "Linzer Tarts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "441.9 calories",
            "carbohydrateContent": "39.9 g",
            "cholesterolContent": "50.8 mg",
            "fatContent": "29.9 g",
            "fiberContent": "3 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "13 g",
            "servingSize": null,
            "sodiumContent": "3.3 mg",
            "sugarContent": "20.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-04T02:05:34.797Z",
                "reviewBody": "This is a good basic recipe for linzer cookies. I suggest the following adjustments for best results: 1. refrigerate dough overnight if possible, or at least 4 hours, since it might otherwise crumble. 2. Use a mixture of ground nuts (such as almonds, hazelnuts and pecans) for a more wholesome flavor. 3. When the tops are cooled, dust them with powdered sugar. Don't do it after assembling! This way the sugar doesn't cover the cut out center. 4. You must heat the rasberry jam (which means you need an entire jar because it reduces.) Simmer until thick and then spread on you cookie.  This will prevent the tops from sliding off. When you heat the jam, it gets gluey, and yields a nice chewy consistency when the cookie is cooled.  Very yummy! \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NORTHENDGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/966548/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-18T19:15:30.657Z",
                "reviewBody": "Excellent recipe for authentic tasting linzer tarts.  These were even better the next day when the jam softened the cookie a little bit.  I forgot to add the cinnamon by mistake and they still tasted incredible.  They are labor intensive but I had fun rolling the dough and cutting out the shapes.  You just have to gingerly handle everything.  The end product is worth the effort.  Linzer cookies cost $1.50 each in the bakery!  This recipe makes about 30 cookies and they taste BETTER than the bakery.  My mother could not believe that I made them, she said they looked so professional.  I can't wait to make them in heart shapes for Valentine's Day.  Thank you for a true 5 star recipe!!!  NOTE:  I have made these fantastic cookies numerous times and the most important piece of advice I can give is after to roll your dough out onto a pieice of wax paper and place the wax paper with the impressions in the freezer for 5 minutes.  THEN, remove the rounded cut out shapes.  If you do it when the dough is cold, your cookies will not break.  Also, I just use Smuckers squeezable raspberry preserves, you do not have to warm the preserves.  Anytime you have trouble with this dough just chill it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBACUB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-13T14:38:44.763Z",
                "reviewBody": "Don't be afraid of this recipe... it's delicious.  Here are some helpful hints (from mistakes I've made).  Grind the almonds REALLY fine- otherwise the cookies will tend to crumble.  Serve them the day you make them, or the jam will seep into the cookie.  They still taste delicious, but they will not look as pretty. (You can always keep them and eat them yourself).  Be sure to refrigerate the dough.  The longer the better.  The dough is a little tricky to work with and a little sticky, but I promise it's worth it and you will get better each time you make them.  I tried to make hearts, but the cookies are so flaky that it was hard to keep the hearts from cracking because there wasn't much cookie by the time I cut out the middle.  Circles are definitely the way to go, but don't make the inner circle too big.  These are absolutely delicious.  They are as good as the ones I used to buy in the Italian bakery in Brooklyn and are now a standard recipe for Christmas in my recipe box.  Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "happycamper26",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1085944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-14T13:15:44.64Z",
                "reviewBody": "It's hard to review this recipe. On one hand, they were some of the best cookies I've ever had. On the other hand, the dough was nearly impossible to work with. I omitted the cinnamon and added 1 tsp. fresh lemon zest and 1 tsp. vanilla extract. I followed the suggestions of other reviewers and froze the dough after rolling and cutting and that is definitely a necessary step. However, my freezer is completely empty (I've just moved) and if my freezer had been full, I wouldn't have had room to freeze the cookie sheet. I'd try these again, but perhaps just roll the dough into balls, make an indentation, and fill with jam before baking. The taste is wonderful. It's definitely worth playing around with. UPDATE: I took my own suggestion and rolled the dough into balls, indented, filled with jam, baked, and dusted with confectioner's sugar. They were just perfect, and the first cookies to disappear at Christmastime. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "campagnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-30T05:16:05.357Z",
                "reviewBody": "I never made linzer tarts before but I've eaten plenty of them. These were exquisite. They are buttery and nutty and delicious. Much better than a bakery's filled with hydrogenated soy junk. I didn't have trouble with the dough as others did. It will harden if made with real butter and you MUST use real butter or don't bother to make them. In fact I had to let mine warm up a bit to roll it out. Keep the flour handy to prevent sticking. I suggest to grind the nuts very fine (I will next time!) The baked cookies are delicate. I used Hero preserves with great success (they are thick and not runny) and heart shaped cookie cutters (a medium and a tiny one.) They are better the next day when they soften a little and glue together. I brought these to a cookie exchange party where they were a big hit and people kept asking if I made them. These are sure to impress.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRISHICAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/135621/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-24T19:12:19.067Z",
                "reviewBody": "I was initially concerned making these primarily because I thought rolling out the dough would be a nightmare. I was determined not to deal with the sticky mess so I split the dough into 4 sections instead of 2 - and tossed in the freezer for 15/20 min. I was more generous with the flour when rolling out (unlike the original recipe suggested) and had absolutely no problem at all. I used a very small/thin spatula to lift the dough and place on baking parchment to completely avoid breakage worked like a charm. Same with the tops. IF the dough starts to run dry from so much re-rolling (yes they are alot of work but WELL worth it in the end!) I added a touch of butter reworked into dough rewrapped and tossed back in freezer for a few more min. My baking time however was only about 8 min per cookie I think I really rolled them much thinner than recipe required because I was able to make 50 - yes 50 cookies with this recipe. And yes they were still 2 1/2 inch cookies. I will try rolling them out thicker next time but they were absolutely PERFECT once I put the jam on and let set overnight. Once the jam absorbs into the cookie it's nice and tender literaly melts in your mouth. Enjoy everyone these were definitely worth the effort!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rottys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4223465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-13T03:11:47.287Z",
                "reviewBody": "Used linzer tart cookie cutters. I had a hard time rolling out the dough. Next time I won't chill the dough as long. I rolled the dough between parchment paper. Using the cutters I got about 40 per batch. Really tasty and pretty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "5galsandadad",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2738804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T22:32:10.96Z",
                "reviewBody": "I made these cookies a few years ago and now everyone wants them every Christmas! The only thing I do differently is I make the cookies smaller by making small balls and putting a thumb print in each to fill with jam. This way I get a lot more out of the recipe:) They are the greatest!!!!! PS- My finance loves them- so that should say it all lol! Sorry I haven't rated these sooner. They are quick and easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Claudette La Greca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/979562/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-04T07:46:47.497Z",
                "reviewBody": "Wonderful cookie. The dough can be a tiny bit tricky at first but once you get the feel of it it's easy. (All doughs seem to have their own personalities) The cookie part came out light and just crispy enough without being brittle not too sweet with a lovely flavor from the almonds. I used seedless raspberry preserves in my tarts (personal preference) it makes spreading the preserves and assembling the cookies easier. Even my Grandmother was impressed and she's one of the most accomplished cooks I've ever met. Thanks so much for sharing the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DDNOBES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/678097/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-21T17:42:16.94Z",
                "reviewBody": "I grew up eating Linzer Tarts so I was extremely excited to make them for the first time using this recipe after all the good reviews. I bought some festive linzer cookie cutters from Crate & Barrel that I wanted to break in but I was sorely disappointed with the outcome. The dough was very sticky and difficult to work with and after all the hard work of using the cookie cutters to make the top/bottoms of the cookies I was unhappy to see the dough spreading as it baked. The cookies themselves tasted good but looked less than desirable. I probably will look elsewhere for a recipe when I finally get up the energy to make these cookies again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine Clayton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331511/"
                }
            }
        ]
    }
]