[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17524/desserts/nut-desserts/pistachio-desserts/",
                    "name": "Pistachio Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10638/cranberry-pistachio-biscotti/",
        "name": "Cranberry Pistachio Biscotti",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1076432.jpg",
            "width": 1224,
            "height": 1632
        },
        "datePublished": "1998-02-20T18:15:24.000Z",
        "description": "The red and green make a great Christmas cookie. Have used other nuts instead of pistachios with success. If your pistachios are salted, omit the 1/4 teaspoon salt from the recipe.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "¼ cup light olive oil",
            "¾ cup white sugar",
            "2 teaspoons vanilla extract",
            "½ teaspoon almond extract",
            "2 eggs",
            "1 ¾ cups all-purpose flour",
            "¼ teaspoon salt",
            "1 teaspoon baking powder",
            "½ cup dried cranberries",
            "1 ½ cups pistachio nuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together oil and sugar until well blended. Mix in the vanilla and almond extracts, then beat in the eggs. Combine flour, salt, and baking powder; gradually stir into egg mixture. Mix in cranberries and nuts by hand.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough in half. Form two logs (12x2 inches) on a cookie sheet that has been lined with parchment paper. Dough may be sticky; wet hands with cool water to handle dough more easily.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 35 minutes in the preheated oven, or until logs are light brown. Remove from oven, and set aside to cool for 10 minutes. Reduce oven heat to 275 degrees F (135 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut logs on diagonal into 3/4 inch thick slices. Lay on sides on parchment covered cookie sheet. Bake approximately 8 to 10 minutes, or until dry; cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Pistachio Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Gerry Meyer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8097671777399205,
            "ratingCount": 1761,
            "itemReviewed": "Cranberry Pistachio Biscotti",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "91.8 calories",
            "carbohydrateContent": "11.7 g",
            "cholesterolContent": "10.3 mg",
            "fatContent": "4.3 g",
            "fiberContent": "0.8 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "55.3 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-14T01:48:15.033Z",
                "reviewBody": "This is perhaps the most fantastic cookie I have ever made in my life.\n\nHere are my tips:\n\n1) I used 1/2 the amount of dried cranberries (actually used orange crasins)\n\n2) I used 1 tsp. of orange zest and added it right into the batter (next time I am upping this to 1 tablespoon)\n\n3) I used slivered almonds instead of the pistachio nuts.  The slivered almonds worked very well because they did not \"chunk up\" the batter.\n\n4)  When I took the loaves out of the oven, I immediately covered them with two dishtowels so that the loaves would cool more slowly.  It's the sudden change in temperature that makes things out of the oven \"crack\" on top, and the dishtowels minimized this.  \n\n5)  I transferred one loaf at a time to my wooden cutting board and cut diagonal slices with a large bread knife.  I did now saw.  I simply leaned into it with my body weight, and all my slices came out pretty cleanly.  I also first cut off just a tad bit from either in at first before cutting the slices off.\n\n6)  I melted white chocolate in the microwave and dipped on end in, then sprinkled with red and green colored sugars.  \nBy doing all of this, (oh, plus you MUST wet your fingertips while working with the dough before it goes in the oven), I got 24 clean slices.  These freeze beautifully as well.  I LOVE this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1758599/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-15T19:05:03.793Z",
                "reviewBody": "This is a wonderful recipe.  Italian friends have told me this taste \"just the way biscotti is supposed to taste.\"  I reduced pistachios by 1/2 cup and increased the cranberries by 1/2 cup.  I also add 1/2 tsp. real orange extract.  Otherwise, the recipe is perfect.  If you are not getting 3 dozen, you may be making the logs too wide.  Make them 2 inches wide and then flatten them slighty.  It is a smaller biscotti than those sold in jars at coffee shops.  DON'T use butter or margarine.  Find a light good quality olive oil.  Butter doesn't belong in biscotti--it won't age well and will become rancid instead of allowing the flavor to develop.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GZJ123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/519067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-16T08:56:37.56Z",
                "reviewBody": "By gads! This is the very =best= biscotti recipe! Usually I can't stand those nasty little bricks, but these are delicious! Try these even if you usually don't like biscotti... m-m-m-m yummy. HINT: Use a regular knife to cut these... the serrated blade makes a big mess.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Snuffles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/405572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-11T15:43:02.463Z",
                "reviewBody": "Yum!  I used orange-flavored Craisins, used 1c cran & 1c pistachio, and added about 1/4 tsp orange extract.  Based on a review that said these spread out a lot, I made two perfectly round logs (the hand-wetting tip worked perfectly).  After 45 minutes of baking, it still wasn't very brown (but it was done), it didn't spread THAT much, and it was very difficult to cut.  I used a good serrated knife, but I still had to cut them wider just to get a slice that didn't break apart (though some still did).  Since they tasted so good, I thought I'd try a second batch.  My adjustments:  I very coarsely chopped the cranberries and pistachios; I reduced the cran/pistachio amounts to 3/4 cup each (though in hindsight, the chopping might have been enough to help simplify cutting - I might use the full 1 cup next time); I flattened the logs a bit; and I brushed an egg wash on the logs (1 egg + 1Tb water).  After 40 minutes of baking, the cookies had a great brown color, and had spread perfectly.  I let them cool 10 minutes on the cookie sheet, then carefully transferred them to my cutting board, where I let them cool another 10 minutes or so.  What a difference - it was so much faster and easier to cut them.. they came out looking perfect.  I drizzled with white chocolate to finish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LisaD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/687281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-28T03:04:26.53Z",
                "reviewBody": "Excellent recipe that won me a baking contest! Soft enough that they can be eaten without being dipped in a drink. Make sure to let the logs cool before slicing them, otherwise they will crumble and fall apart. Highly recommended!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MWalton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/728792/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T14:50:23.14Z",
                "reviewBody": "These are fantastic!  I've made several bathces of these in the past few months.  Yes, the nuts can be difficult to cut through- I coarsley chop mine.  I've also coated one side in white chocolate then drizzled it with milk chocolate- beautiful presentation & tastes great!  DO use parchment paper, as the recipe calls for, or they will stick.  Wetting your hands does make shaping the sticky dough very easy.  These also freeze beautifully.  5 stars!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Knewasser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/433810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-04T19:27:32.183Z",
                "reviewBody": "I made these biscotti for the holidays because they are apparently a popular holiday item.  I think the biscotti turned out just okay.  I am 100% Italian-American and an exceptional Italian cook.  I grew up cooking and baking with my beloved mom and I've made MANY biscotti in my lifetime.  After reviewing similar recipes, I made some simple changes to this recipe because I think doing so makes the biscotti a bit more authentic & tasty.  For starters, I increased my oven temp to 325F degrees; you might also do 350F degrees, a standard temp for biscotti.  I increased the flour to 2-2 1/4 cups, added 1 tsp vanilla extract, 1 tsp orange extract & 1/4 tsp of cinnamon. I changed the olive oil to 1/3 c vegetable oil 'cause I think olive oil is way too heavy for biscotti.  I also added even cups of dried cranberries and pistachios.  I ALWAYS bake biscotti on parchment paper!  As the biscotti cooled, I melted 8 ounces of semi-sweet chocolate with 1 tsp of shortening and when melted, dipped the biscotti into the mixture.  I think without a chocolate glaze, the biscotti are way too bland...I think chocolate makes the biscuits a LOT more interesting.  Finally, if you are into baking biscotti like I am, invest in a simple electric knife for cutting the logs...it really is the only way to go!  Also, forget all the flipping and turning. Simply cut your biscotti while warm, space them a bit, keep them upright & return them to the oven for another 15-20 minutes.  Enjoy and happy baking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "toni lee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3320285/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-06T19:34:27.857Z",
                "reviewBody": "these are delicious-I made them with olive oil and the 2nd time I use margerine. I liked them better with margerine - I added more cranberries and dipped in white choc-yummy! I will make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUEASTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/616440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-21T19:57:41.78Z",
                "reviewBody": "This tastes great and not to mention is a snap to make. Some helpful hints:\n1.Divide the dough while it's still in the bowl, preferably next to the sink so you can wet your hands and then scoop out and form the loaves. If your hands are wet, the stickiness will not be an issue. \n2. It's totally FINE to substitue a vegetable oil like canola if you don't have light olive oil --they are basically comparable (light olive oil is still olive oil but stripped of its flavor to cater to more \"American\" taste--you don't find light olive oil in Italy, for example).\n3. The loaves WILL crumble during slicing, so just go slow, use a good serrated knife, and don't worry about perfection. These are homemade and IMHO are even better when they look a bit rustic. Who wants mass-produced looking biscotti??\n4. Ovens vary so go by how your oven traditionally runs, hotter or cooler. I found that even though my oven thermometer indicated proper temp., I still had to increase the 2nd bake from 10 to 15 minutes. \n5. Finally, biscotti will harden as it cools so if you follow this recipe to a \"T\" you should have no problems. (Don't you just love it when people make all sorts of substitutions and then complain that the recipe doesn't work? ;-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "H. Fennelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2198605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-21T20:56:55.397Z",
                "reviewBody": "Have to give this a just OK rating as I'm not real excited about the olive oil flavor that sneaks through. Otherwise this is a good biscotti and I agree with the others who have added that hint of orange; I substituted orange extract for the almond.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "TPFEISEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1161842/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cranberry Pistachio Biscotti",
            "description": "Authentic Italian biscotti with distinct, surprising flavors.",
            "uploadDate": "2014-12-04T18:29:10.264Z",
            "duration": "PT2M13.675S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fbe74798a-ea15-4ed1-8cbd-de477c0320cb%2F44360561-351b-456c-b98b-1d77311a00b1%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3923866544001"
        }
    }
]