[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15013/desserts/specialty-desserts/liqueur-desserts/rum/",
                    "name": "Rum",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10790/eggnog-thumbprints/",
        "name": "Eggnog Thumbprints",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F544044.jpg",
            "width": 4752,
            "height": 3168
        },
        "datePublished": "1997-11-20T18:29:30.000Z",
        "description": "Thumbprint cookies with a delicious filling, these are perfect for Christmas.  Does not use eggnog, but they have an eggnog taste. You can substitute 1/4 teaspoon rum extract and 1 tablespoon milk for the rum.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "¾ cup butter, softened",
            "½ cup white sugar",
            "¼ cup packed brown sugar",
            "1 egg",
            "½ teaspoon vanilla extract",
            "2 cups all-purpose flour",
            "¼ teaspoon salt",
            "¼ cup butter",
            "1 cup confectioners' sugar",
            "1 tablespoon rum",
            "1 pinch ground nutmeg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together 3/4 cup butter, white sugar, and brown sugar until smooth. Beat in egg and vanilla. Combine flour and salt; stir into the creamed mixture by hand to form a soft dough. Roll dough into 1 inch balls, and place balls 2 inches apart on ungreased cookie sheets. Make an indention in the center of each cookie using your finger or thumb.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 12 minutes in preheated oven. Cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together 1/4 cup butter, confectioners' sugar, and rum. Spoon rounded teaspoonfuls of filling onto cookies. Sprinkle with nutmeg.  Let stand until set before storing in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Rum"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHOLLISMD"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.338164251207729,
            "ratingCount": 207,
            "itemReviewed": "Eggnog Thumbprints",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "77.4 calories",
            "carbohydrateContent": "9.7 g",
            "cholesterolContent": "14 mg",
            "fatContent": "4 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "41.3 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-03T17:27:22.7Z",
                "reviewBody": "I have been making these cookies since 2000, and every year, they are my biggest request.  My family literally beg me to make them.  The cookies are simple, but combined with the flavorful frosting filling, are absolutely spectactular!  I've made them multiple ways, using either butter or margarine, rum or rum extract in the filling, ditto for the cookie base, and they turn out very good with any combination.  I fill these with a pastry bag and star tip - very cute if I do say so myself :)  Using real butter (& pastry bag), the filling does get very soft if your hands (or home) are hot, so I just stick the bag in the fridge for a while.  I have never had a problem with the frosting \"not setting up\".  Try them - you'll be glad you did!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1630862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T18:49:52.787Z",
                "reviewBody": "Very good cookie!! It's true - it's not very colorful but the taste was wonderful! If you're having trouble spooning the filling into the cookie use a decorating tube or a plastic sandwich bag with a courner snipped out. I had no trouble with the spoon - and no trouble getting my co-workers to eat them too! Lots of compliments! I'm a bit confused that a previous reveiwer had runny filling...with the given ingredients in the correct amounts it shouldn't have happened. I'm curious as to what they did to make it \"runny\"! One thing I was particularly impressed with...whenever a cookie recipe calls for filling such as this there ends up being either way to much filling or not enough. This turned out to have EXACTLY the amount needed - no more no less! How cool is that?:) These would also be excellent to package up and send through the mail.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SQUEEZIECAKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/254463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-21T20:12:58.29Z",
                "reviewBody": "I have been searching for the perfect egg nog cookie recipe for 6 years... and I this is by far my favorite.  I have made 2 batches.  The dough comes out beautifully.  I think next time I make it I will use rum flavoring instead of the vanilla flavoring in the cookie. I did mix the flour in with my KitchenAid on Stir, and baked on parchment paper, and they baked beautifully.  I did modify the filling recipe a little.  I used 2 tsp. rum flavoring, 2 tsp milk, and 1/4 tsp. of nutmeg, (probably an extra tsp of powdered sugar as well).  It makes this frosting taste just like egg nog.  So delish!  This recipe has won a place in my annual holiday \"must have\" cookies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Awestphal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3025352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T04:06:48.86Z",
                "reviewBody": "The frosting makes the cookie on this one. Be sure to follow the recipe and let the cookies cool completely before frosting or your buttery frosting will melt!  Oh, and PS, I only got 30 cookies out of this.  Thanks, Susan!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T13:19:11.373Z",
                "reviewBody": "WOW! I almost didn't try this recipe after reading some of the unfavorable reviews but I am SO glad I tried it. A couple of things that maybe would have tripped me up might be helpful to others: in step 2 you need to mix the flour in by hand. I was buzzing away with my hand mixer when I caught myself! Definitely make into one inch balls. I thought they were too small but I was still just shy of yield. I used the end of a wooden spoon to make the indentations so I wouldn't have to use as much frosting. Lastly under step 4 mix the ingredients by hand. I started off with my mixer (again) and had to stop myself. Maybe that's why some cooks had runny frosting? So delicious - definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FLICKA18",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/969925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-03T02:09:17.49Z",
                "reviewBody": "Wow! I just tried one of these and they are amazing! I used a full teaspoon of vanilla but followed as directed otherwise. Used the end of a wooden spoon to make indentation and baked on parchment paper. The icing is lip smacking good! I used Captain Morgan which is a spiced rum and I think it worked very well here. Very festive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T19:49:56.8Z",
                "reviewBody": "I am sort of on the fence about these cookies. Like some others my main problem is with the cookie base. They turn out too dense--not tender enough for my liking. I think I would look for another sugar cookie recipe to substitute. Also they are homely-looking specimens. Perhaps rolling them in crushed nuts before baking? I only got 30 cookies from this recipe but I still needed to double the frosting. Also it came out very thick so I brought it to the right consistency with a couple of teaspoons of actual eggnog. Finally though I did not add extra rum as others did I still found the resulting cookies very boozy! I felt weird giving them to neighbors with children. So I might cut back or use rum extract next time. With some tweaking this recipe could be a fine addition to your holiday cookie trays and exchanges.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JoyBugaloo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5673938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-04T03:57:48.247Z",
                "reviewBody": "This is the second year I have made these for my Christmas trays and we love them. The food editor at the Las Vegas Journal requested a special Christmas cookie to feature and this one immediately came to mind. I will be delivering them to the newspaper tomorrow ad I think they will agree with our review:) After reading some poor reviews I have some thoughts on what might have gone wrong. Burnt bottoms....oven is running too hot. My oven runs hot so I adjust my temp down. Hard or tough cookie....Over worked dough. You are supposed to cream the butter and sugar and then stir the flour in by hand. Overmixing would produce a very tough cookie. Dry....baked too long. My cookies were done at 11 minutes. Runny frosting....too much rum or not enough sugar or maybe melted butter? With these simple tips you will experience success. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T15:30:30.717Z",
                "reviewBody": "I made some of these to bring to a Christmas party and to work. People at both ends raved about them! They really do taste like eggnog and the \"filling\" (more like frosting really) has a great texture. I didn't want to use real rum so I used 1/4 tsp rum extract and 1 tbs water. I was worried about them sitting out if I used milk as suggested. The frosting was still creamy and great I don't think milk would have made a big difference. Also you cannot use a rounded tsp of frosting on each cookie which is obvious when you see them baked. Just eyeball a small dollop large enough to almost fill the thumb indention and it works out well. These are excellent and highly recommended!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rubenette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/629818/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Eggnog Thumbprints",
            "description": "Decadent cookies that taste like eggnog are perfect for the holidays.",
            "uploadDate": "2014-12-04T18:26:00.931Z",
            "duration": "PT2M18.847S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0fc985bd-d0fc-4692-bd81-4e85ecd751c6%2Fbb590aae-2511-4c9f-bef0-4acc5a121b63%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3923905786001"
        }
    }
]