[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
                    "name": "UK and Ireland",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/707/world-cuisine/european/uk-and-ireland/scottish/",
                    "name": "Scottish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10788/caramel-shortbread/",
        "name": "Caramel Shortbread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4113476.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "1998-01-28T18:12:40.000Z",
        "description": "I got this recipe from a Scottish friend.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "16 bars",
        "recipeIngredient": [
            "½ cup butter",
            "¼ cup white sugar",
            "1 cup all-purpose flour",
            "¼ cup ground almonds",
            "¾ cup butter",
            "⅜ cup white sugar",
            "3 tablespoons golden syrup",
            "1 (14 ounce) can sweetened condensed milk",
            "8 (1 ounce) squares high quality milk chocolate",
            "⅓ cup toasted and sliced almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat 1/2 cup butter and 1/4 cup sugar until pale.  Add flour and ground almonds to form a soft dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Press dough into a 8 inch square pan that has been greased and lined with parchment paper.  Bake shortbread at 350 degrees F (175 degrees C) for 20 to 25 minutes, or until pale golden brown.  Leave in pan until cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Topping:  Cook 3/4 cup butter, 3/8 cup sugar, syrup, and sweetened condensed milk in a saucepan on low heat.  Bring to a boil, stirring constantly.  Boil for 5 to 7 minutes until it has thickened and has a pale caramel color.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread caramel on cooled shortbread, and let set about 40 minutes.  Melt chocolate over low heat.  Spread melted chocolate on top of caramel and sprinkle on toasted almonds.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "UK and Ireland",
            "Scottish"
        ],
        "recipeCuisine": [
            "European",
            "UK and Ireland",
            "Scottish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Mary"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.355555555555555,
            "ratingCount": 45,
            "itemReviewed": "Caramel Shortbread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "380 calories",
            "carbohydrateContent": "39.3 g",
            "cholesterolContent": "49.7 mg",
            "fatContent": "23.4 g",
            "fiberContent": "1.3 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "12.9 g",
            "servingSize": null,
            "sodiumContent": "146.9 mg",
            "sugarContent": "29.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-10T10:14:02.057Z",
                "reviewBody": "FINALLY GOT IT RIGHT!! after using at least 4 different recipes for these squares, this one is the only one that worked!! I did make sure I read all reviews first for this any other same type recipe. \nAfter reading I did a couple different things, I didn't have almond so used same amount of extra flour, poked holes in base before baking, came out fine. I did use non stick paper with non stick spray so it would come out of pan. I let the base get stone cold before adding caramel. I did boil caramel center for the full 7 minutes and yes I got the brown flecks in it, but you couldn't notice on the end product. Still not sure it would take I poured it on the base, let it sit in fridge for 30 mins or so then went directly to freezer until stone cold. The top I used half semi chips and half milk chocolate and added tbsp of crisco to make top shiny. As caramel was very cold, chocolate started to harden almost immediatly..which was great, b/c I then was able to score the chocolate at that time. Put it back in fridge, couple hours later, it removed from pan, cut along score lines, no broken chocolate, base was fine and didn't fall apart....yummy....I love these aquares and have finally found a recipe that works.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cdnshaz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1951050/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-10T15:27:41.077Z",
                "reviewBody": "I have made this recipe every year now for 3 years and each year I'm asked to share it.   I've made one change - I substitute brown sugar (lightly packed) for the white sugar, which I feel gives it more of a caramel flavor. I haven't had any problems with the caramel setting up, but I do  cook it for the full 7 minutes suggested.  I use light corn syrup in place of the golden syrup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RSBORROR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1317426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-27T22:42:54.063Z",
                "reviewBody": "As is the recipe is a 4-star but I think it can be made into a 5-star. Other reviewers didn't mention having any trouble with an excess pool of butter forming after the caramel was cooked but I sure did; I drained at least 1/4c of butter from the caramel before spreading it on my shortbread crust; otherwise I would have had a mushy crust and the gooey caramel that some complained of. I melted semi-sweet chocolate chips for the topping as I had no milk chocolate in the house; even though I'm a bigger fan of semi-sweet I think milk chocolate may be better with this so it doesn't mask the flavor of the caramel so much; next time I would definitely sub brown sugar for white in the caramel mixture to further bring out the flavor. Also I had to cook the caramel mixture much longer than 5-7 minutes; it was more like 20-25 minutes to get it to the nice golden color I was looking for. This may have been because I had to use light corn syrup as it was all I had. This recipe does take some time; to speed things along I put the shortbread in the freezer for 20-30 minutes to help with the cooling process and again to help cool and firm up the caramel and again to harden the chocolate top. Love the combo of shortbread caramel and chocolate; it is somewhat like a Twix bar! Thank you for sharing your recipe Mary!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-19T01:06:35.143Z",
                "reviewBody": "I have two problems with this recipe: the shortbread crumbles when you try to cut it and the carmel is waaay too sweet. It smelled great on the stove until I added the sweetend condensed milk and it just ruined it. I used brown sugar as other suggested which really gave it a carmel smell but again the condensed milk just made the carmel mixture gross. If for some reason I tried this again I would find something other than the condensed milk and use another shortbread recipe. Great idea and it set up well but just way too sweet. I'll stick to the Twix bar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "helenasmommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1477604/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-19T02:28:25.147Z",
                "reviewBody": "I've made this recipe several times over the past few years and have had tasty success each time:) Be sure to beat the crumb mixture for a long time before pressing into the pan and doing the fork-holes I also use a larger pan I htink it's a 9x13 (glass rectangle) and that's the best change I've done. It allows each layer to be thinner so everything is less prone to crumbling but still oh so delish;) I also cut them into teeny tiny squares use high quality milk chocolate bar for half the pan and dark or semi-sweet with coarse sea-salt sprinkled on top for the other half. Both variations get rave reviews and I always end up making another batch before the holidays are over. (Have one baking up this moment). Give 'er a try it's great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KonaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1805617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-24T19:19:05.06Z",
                "reviewBody": "Fantastic!! My sister calls these \"Fake Twix bars\". I've made this recipe a couple of different ways including the original and every batch got rave reviews. If you do not have ground almonds you can substitute 1/4 cup additional flour. It's not as tasty but it still turns out delicious. Also here in the States it might be hard to find Lyle's Golden Syrup so you can substitute light corn syrup if need be. Again not as good but most everyone won't notice a difference. On another batch I added 1/2 tsp. of salt to the caramel mixture so there's more of a sweet/salty taste to these and they came out terrific. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Franny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2291454/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:29:12.233Z",
                "reviewBody": "YUM! YUM! YUM! I made these last night and they are WONDERFUL. I'm having a hard time trying to save them for Christmas guests and not eat it all myself. I have NO IDEA what golden syrup is so I just decided to wing it and substitute light corn syrup... and the finished product is great! Reminds me a lot of a Twix bar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TwoDCsPlus1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/579128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:29:14.653Z",
                "reviewBody": "I first tried caramel shortbread while living in Northern Ireland. I've wanted the recipe for years!!! This recipe is delicious and soooo easy. Everyone who tried it was ranting and raving about how rich and yummy this dessert is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ISSIEBERGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/354223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-04T04:01:23.063Z",
                "reviewBody": "Thanks for sharing this recipe. It is a pleasant surprise to find that it doesn't end up sickly sweet. I made this for a function at work and everyone wanted the recipe. Needless to say there wasn't a crumb left. This is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keri St",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/167711/"
                }
            }
        ]
    }
]