[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
                    "name": "Apple Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10869/danish-pastry-apple-bars-i/",
        "name": "Danish Pastry Apple Bars I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F130909.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-04-23T23:03:03.000Z",
        "description": "Serve warm or cool, topped with powdered sugar or whipped cream. For best results use a tart baking apple such as Cortland, Rome, or Northern Spy.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "32 bars",
        "recipeIngredient": [
            "2 ½ cups all-purpose flour",
            "1 teaspoon salt",
            "1 cup shortening",
            "1 egg yolk",
            "½ cup milk",
            "1 cup cornflakes cereal",
            "8 cups tart apples - peeled, cored and sliced",
            "½ cup white sugar",
            "1 teaspoon ground cinnamon",
            "1 egg white",
            "⅓ cup sifted confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl stir together the flour and the salt.  Cut in shortening till the mixture resembles coarse crumbs.  Lightly beat egg yolk in a glass measuring cup.  Add milk to make 2/3 cup liquid total; mix well.  Divide dough in half.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a floured surface, roll half the dough to an 18 x 12 inch rectangle; fit into and up sides of a 15 x 10 x 1 inch  baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle with corn flake cereal; top with apples.  Combine sugar and cinnamon; sprinkle over apples.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll remaining dough to a 16 x 12 inch rectangle; place over apples.  Seal edges; cut slits in the top for steam to escape.  Bake at 375 degrees F (190 degrees C) for about 50 minutes or until golden brown.  Cool on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Apple Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie Watts"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 11,
            "itemReviewed": "Danish Pastry Apple Bars I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "130.8 calories",
            "carbohydrateContent": "16.6 g",
            "cholesterolContent": "6.7 mg",
            "fatContent": "6.8 g",
            "fiberContent": "1 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "83 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-05T20:47:07.25Z",
                "reviewBody": "I love these! Here's some tips, to make them even better, since a few of the ingredients remain with no instructions.\nRoll your dough between to lightly floured pieces of plastic wrap, makes transferring to a pan so much easier!\nUse 4 different kinds of apples like granny smith, golden delicious, honeycrisp and fuji.\nPut little pats of butter scattered over the apples before you put the cinnamon and sugar over them.\nBeat the eggwhite until stiff, and brush over the top of crust before baking.\nMix 1 c. powdered sugar, 2 T butter, and water to glaze over the top when it's still warm! YUM!\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GoodLookinCooking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2860531/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-27T02:08:45.727Z",
                "reviewBody": "These are delicious. I've had this recipe for years and was happy to find it here. The directions however are incomplete. You need to whip the egg white until it's frothy then brush it on the dough before baking. I made the powdered sugar into a glaze and drizzled it over the top. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-24T20:02:42.66Z",
                "reviewBody": "These were the best dessert bars I've ever tasted! There really was nothing to change about the recipe even though I always look for ways to make recipes better. This one was perfect as written. This is one recipe I wouldn't recommend passing on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AEENJOY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2371226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-08T20:30:51.687Z",
                "reviewBody": "Oh. Wow. Yum. Unbelievably delicious. I had to put them in the freezer so I'd stop helping myself to \"just one more piece.\" The cornflakes are not at all discernible once it bakes. I used 10 cups of apples, and 1/2 cup brown sugar, plus 1/4 cup white sugar, plus 1/2 tsp of freshly ground nutmeg. That addition was the only deviation I made from the recipe. Don't skip the nutmeg - it adds depth of complexity to the flavor. Outstanding! The pastry, which is made with milk in classic Danish style (and which differentiates it from classic American pie dough) is tender. The egg white wash makes for a glossy, professional, Kodak-moment finish. I made them to serve at my daughter's bridal shower (if I can keep my fat mitts off of them, that is!) The lovely aroma hung heavy in the air for hours after they were out of the oven, driving everyone crazy. This is a showstopper recipe, any way you look at it. Thank you, Stephanie, for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-13T19:40:40.22Z",
                "reviewBody": "This recipe has a great crust that was quick and easy to make.  I skipped the cornflakes and doubled the cinnamon...delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "miriam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2152710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-29T03:53:15.437Z",
                "reviewBody": "This is an excellent Danish Pastry Apple Bar. For the pastry I added 1 Tablespoon of vinegar and chilled the dough for about an hour before rolling. Used a 9\" x 13\" baking pan and baked the bottom crust for 5 minutes before placing apple slices inside. Instead of cinnamon I used 1 teaspoon of apple pie spice. I beat the egg white until frothy and brushed on the top crust. Baked up beautifully in 45 minutes. Slices more easily when cooled. Served with a scoop of vanilla ice cream drizzled with my own homemade carmel sauce and topped with Kraft Carmel Bits. Delicious! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JimmyandNancy Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shearone/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-01T21:38:49.61Z",
                "reviewBody": "So yummy! I just had a slice right now hehe. I used butter flavored shortening and the pastry part is sooooo good. I only used 4 apples and thought that that was enough but after baking the apples shrunk so I would recommend using all 8 but 4 isn't bad:) I also used a very very big teaspoon of cinnamon. It was probably 2 tsp. I also didn't put anything on top since it's got so much sugar already. Thank you for the tasty recipe:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nutellapuppy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3799445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-03T04:10:09.743Z",
                "reviewBody": "This recipe is so delicious! My grandma used to make bars like this and they were always my favorite and now I have found the recipe. I made this in two half size pans instead of one with the intentions of freezing the second one, however between my husband and I we finished off one pan before I could get the second one in the freezer.  I had my husband help me peal the apples otherwise that takes a while and I also refrigerated my dough for about an hour before I rolled it out, make sure to get it nice and thin.  Also made the frosting for the top with the powdered sugar, a bit of milk and vanilla and it came out perfect.  Five stars for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Rhode Kempfe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4891778/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-21T00:20:57.05Z",
                "reviewBody": "I am not an expert baker or cook and I don't normally write reviews unless a recipe really stands out. These apple bars are so good. I did change the recipe to suite my personal taste by using 1/4 cup brown sugar and 1/4 cup of white sugar instead of 1/2 cup white sugar. I also added 1/2 tsp. of nutmeg and 1/4 tsp ground cloves. I mixed the sugar cinnamon nutmeg and cloves together before putting it on top of the apples. I left off the corn flakes because I didn't have any. I was worried this would leave liquid and the bottom crust soggy but it did not. My only complaint about this is the difficulty I had with the crust. It was very sticky and difficult to work with. I rolled it on a sheet of floured parchment paper and turned it upside down on the pan. I had to use a lot of flour to not get it to stick to everything and I rolled it very thin to get it to the size I needed it. It turned out well and I was able to seal the top crust to the bottom crust. This recipe is a keeper. I will keep in mind though that this a time consuming recipe dealing with rolling out the crust and peeling and slicing the apples. I wish it had an addition for a glaze recipe I had to look that up. I used 1 cup confectioners sugar 6 tsp. hot water 1 tsp. vanilla and drizzled over the top after removing it from the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8741565/"
                }
            }
        ]
    }
]