[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/839/desserts/cookies/chocolate-chip-cookies/",
                    "name": "Chocolate Chip Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10918/abc-absolute-best-chewy-chocolate-chippers/",
        "name": "ABC (Absolute Best Chewy) Chocolate Chippers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7495590.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1998-05-29T00:07:56.000Z",
        "description": "This recipe is for when you want rich, chewy chocolate chip cookies chock-full of chocolate chips and toasted nuts.  I am happy to share my recipe with other chocolate chip cookie connoisseurs--visitors to this great website!  I guarantee professional bakery results if you follow this recipe as written.  Keep in mind, however, that each specific ingredient and step is important to ensure best results.  Many test batches were conducted in order to perfect this chewy recipe for a cookie you can really sink your teeth into.  If these cookies don't comfort you and make you happy (er, 'chipper'), I don't know what will!  Enjoy!",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT0H20M",
        "recipeYield": "2 1/2 dozen",
        "recipeIngredient": [
            "3 cups unbleached all-purpose flour",
            "1 ¼ teaspoons kosher salt",
            "1 teaspoon baking soda",
            "¼ teaspoon baking powder",
            "¾ cup unsalted butter, softened",
            "1 cup dark brown sugar",
            "½ cup white sugar",
            "1 tablespoon vanilla extract",
            "2 eggs",
            "2 tablespoons dark corn syrup",
            "1 tablespoon half-and-half cream",
            "2 cups semisweet chocolate chips",
            "1 ½ cups chopped walnuts, toasted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Position oven rack in lower third of oven and preheat to 350 degrees F (175 degrees C).  (Using an oven thermometer will ensure proper baking temperature since ovens vary.)  Line cushion-type baking sheets with baking parchment; set aside.  (Professional bakeries double their baking sheets and use baking parchment.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, whisk together flour, salt, baking soda and baking powder; set aside.  In a large mixer bowl, cream together butter, sugars and vanilla at medium speed until creamy and light.  Add eggs, one at a time, beating well after each addition.  Beat in corn syrup and cream or milk.  Reduce mixer speed to low.  Add flour mixture, in 3 separate batches, scraping down bowl after each addition.  Mix well to ensure full incorporation of flour mixture.  Stir in chocolate chips (or chopped chocolate) and nuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For each cookie, using a 1- 3/8 inch spring-loaded scoop (or 1 tablespoon measuring spoon), scoop 2 level spoonfuls of dough and roll into a ball with wet hands.  (Dough will be very sticky.  Wetting hands between every 3 rollings of dough will prevent sticking. Simply hold hands under running tap water and shake hands 10 times over sink before handling dough.  Don't worry, this will not harm the cookies.  I guarantee that this added effort will be worth it for these cookies!)   Arrange at least 2 inches apart on prepared baking sheets.  (Cookies will spread a bit during baking.)  Flatten each ball of dough slightly with heel of hand or fingers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 14 minutes or until light golden brown around edges and centers are still a little puffy.  (Do not underbake this particular cookie or they will be too soft.)  Allow cookies to cool at least 5 minutes while on baking sheets before transferring (with a thin, metal cookie spatula) to wire racks to cool completely.  Repeat with remaining dough and fresh sheets of baking parchment.  Store cookies in an airtight container at room temperature.  (These chewy chocolate chip cookies keep better than traditional types.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Note:  Professional chefs and pastry chefs use coarse kosher salt and I use it in my everyday cooking and baking.  It really does have a better flavor.  However, you may substitute 1 teaspoon regular table salt for 1- 1/4 teaspoons coarse kosher salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Toast Nuts:  Toasting nuts brings out their flavor and makes them crisp.  It is easy to do.  Preheat oven to 350 degrees F (175 degrees C).  Place nuts, in a single layer, on an ungreased baking sheet.  (I like to use my round non-stick pizza pan because it has a lip on it which prevents the nuts from rolling off.)  Bake for 7 to 8 minutes, stirring halfway through baking time, or until nuts become fragrant and are lightly browned.  (Watch nuts closely to prevent burning.)  Cool nuts completely before chopping and adding to recipe.  (You can speed up the cooling process by immediately placing hot, toasted nuts onto a plate and place in the freezer for 5 to 8 minutes.  Halfway through chilling time, stir the nuts to aid the cooling process.)\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Chocolate Chip Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stacy M. Polcyn"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3700787401574805,
            "ratingCount": 127,
            "itemReviewed": "ABC (Absolute Best Chewy) Chocolate Chippers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "229.4 calories",
            "carbohydrateContent": "29.1 g",
            "cholesterolContent": "24.8 mg",
            "fatContent": "12.3 g",
            "fiberContent": "1.4 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "137.3 mg",
            "sugarContent": "17.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-02T18:20:30.247Z",
                "reviewBody": "Okay I make a HUGE amount of chocolate chip cookies-they are my absolute favorite! But as good as my recipe is I am always looking for that ultimate cookie. This is NOT the one. I followed the recipe (everything except the unbleached flour-I used regular flour) shook the hands-the whole bit! I'll have to say they were very pretty cookies but entirely to cake-like (maybe it was the baking powder-never put baking powder in my cookies before). They had almost no taste (the true test of a good choc chip cookie is if the cookie part can stand on it's own without the chips). But the worst part was the kosher salt. I kept biting into chunks of salt. Stacy I appreciate the amount of time that went into perfecting your recipe but I'll have to keep looking. Thanks anyway!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "REDROBINSGARDEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/695028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-06T22:29:34.73Z",
                "reviewBody": "I must have tried every chocolate chip recipe on the Internet, and in all my cookbooks, six of which are just on cookies alone! This is the first time that I was able to get a cookie that looked like a bakery cookie, and didn't flatten out, even though I did not have to chill the dough. It's an easy cookie to make. Wetting hands just made it easier to roll and look pretty; it's not a must. I'm surprised at some reviewers thinking it was so difficult to wet their hands, or that dark corn syrup is such an exotic ingredient. I guess they don't bake very much. Also, I don't like the taste of baked nuts, so I left them out and used extra chips. Loved them! I overbaked one batch till they were all golden, and that was wonderful also. Chewy cookies, not dry. Thank you so very much for this recipe, Stacey. I am indebted to you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUMMERSUNSET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/148049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-22T03:56:52.343Z",
                "reviewBody": "I'm a fan of thin and crispy cookies which is the only reason why I didn't give this recipe 5 stars. I tried it out for a friend who craved big chewy chocolate chip cookies and he freaked. I've been making them ever since. A few tricks I've learned with this recipe: use an ice cream scoop to dump the dough onto the sheet. The cookies are enormous but they definitely retain their chewiness and moist texture(use the baking time listed in the recipe). The ice cream scoop yields 3-4\" wide cookies that are at least 3/4\" thick. to avoid the salt chunks that can happen with kosher salt I let my KitchenAid have at the dough (before adding the chips) for a good long time. I find that I can taste the salt chunks when I rush this step. I add 2 tsp. or so of cocoa powder or even cinnamon to the flour mixture. It gives the dough a little kick and helps it stand up to the chips. if you're out of half and half I've used regular milk and it works fine as a substitute.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DOODOO76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1404086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-12T03:25:06.043Z",
                "reviewBody": "Thank you thank you thank you. Stacy bless you for contributing this recipe. I'm a very serious baker who has been frustrated at the quality of the chocolate chip cookies I've been baking in the past. I don't like the Toll House recipe. I've been fiddling with it for years to no avail. I always end up with either very dry cookies or \"pancake\" cookies with little chocolate chip \"bumps\". They also fall apart very easily. The decreased butter and the addition of corn syrup in your recipe did the trick. The baking time is critical. Too little and they're a little raw too much and they become a bit dry. I've determined the correct length of time for my oven and the cookies are WONDERFUL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHOOGA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-24T17:34:34.86Z",
                "reviewBody": "Sorry but these cookies were absolutely average. They're not bad just not fantastic like the author would have you believe. I prefer a chewier cookie and these were too cake-y for my taste. I did like the level of instruction of the recipe I find that very helpful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JUSTJACKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/538294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-22T22:52:16.373Z",
                "reviewBody": "A week ago I took the top six Chocolate Chip Cookies from this website and made all of them. I took the cookies to work and my church social and asked people to tell me which cookies were their favorite. This cookie got about twenty percent of the vote. I'd have rated it higher if I was a \"chewy\" cookie fan. My husband who liked these the best said that he didn't like them at all when they were first baked but after they had aged a week they were much tastier and had a better texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Francine DeGrood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1717893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:28:38.513Z",
                "reviewBody": "Tough crowd reviewing here! Would agree that this is a soft cookie rather than a chewy one. I do have a couple of suggestions...make sure you folks are using Kosher salt not Sea salt. Could account for the chunks some of you tasted. Using unbleached flour gives you a denser chewier cookie than bleached flour will.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PERSONALBAKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/865891/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T04:50:52.31Z",
                "reviewBody": "I was a little leary of putting the molasses in but followed the recipe except for half and half - used milk instead. I was VERY pleased with the results taste and texture of these lovely morsals! Took some into work and people were asking for the recipe. Awesome A.B.C. cookies!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "none",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697709/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-11T18:10:11.82Z",
                "reviewBody": "These cookies are amazing! They come out very soft and chewy. I mailed them to my husband serving overseas and he and the other guys said that even two weeks-old they remained soft and delicious! They even withstood the high heat well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lizzycam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4530958/"
                }
            }
        ]
    }
]