[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/844/desserts/cookies/cut-out-cookies/",
                    "name": "Cut-Out Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10950/nut-rolls/",
        "name": "Nut Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6194345.jpg",
            "width": 3266,
            "height": 3265
        },
        "datePublished": "1998-06-10T03:10:48.000Z",
        "description": "This is a combination of two or three old recipes.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 or 7 rolls",
        "recipeIngredient": [
            "1 cup white sugar",
            "¼ teaspoon salt",
            "1 cup butter",
            "3 eggs",
            "½ pint sour cream",
            "1 ounce active dry yeast",
            "½ cup warm milk",
            "1 teaspoon white sugar",
            "7 cups all-purpose flour",
            "2 ½ pounds ground walnuts",
            "1 ¼ cups melted butter",
            "2 cups white sugar",
            "1 teaspoon vanilla extract",
            "1 teaspoon ground cinnamon",
            "2 egg whites"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together 1 cup white sugar, 1/4 teaspoon salt, 1 cup melted butter, and 3 eggs.  Mix and add 1/2 pint sour cream.  Mix together yeast with warm milk and 1 teaspoon sugar.  Add to mixture.  Add flour.  Mix and knead.  Divide dough into 7 equal parts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Filling:  Melt 1 cup plus 3 tablespoons butter.  Add 2 cups sugar and stir to dissolve.  Add to ground walnuts and mix until coated.  Add ground cinnamon and vanilla extract to taste, if desired.  Divide filling into 7 equal amounts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll each dough ball into rectangle.  Spread slightly beaten egg white on top of dough.  Spread  equal amounts of filling on top of each rectangle.  Roll in edges and spread edges with egg whites to seal.  Then roll length wise.  Brush tops with egg whites.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a 350 degrees F (175 degrees C) preheated oven for 30 minutes or until lightly brown.  Cool. These freeze well.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Cut-Out Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karren L. Kukral"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.545454545454546,
            "ratingCount": 77,
            "itemReviewed": "Nut Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "500.2 calories",
            "carbohydrateContent": "41.7 g",
            "cholesterolContent": "50.5 mg",
            "fatContent": "35.1 g",
            "fiberContent": "3.1 g",
            "proteinContent": "9 g",
            "saturatedFatContent": "10.6 g",
            "servingSize": null,
            "sodiumContent": "116.3 mg",
            "sugarContent": "18.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-18T16:24:25.903Z",
                "reviewBody": "Excellent!!!  So far I've made them 2 times(for family and very close friends) and have gotten nothing but RAVE reviews.  The only problem is they have split in a few places each time.  PLEASE let me know what can be done to stop that from happening.  I've even reduced the yeast in half the 2nd time...no luck!   I'd love to make them and give them to co-workers and neighbors, but can't with the way they look.   Help!!!  These are too good to give up on...   ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "StillerFan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3393158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-23T04:37:18.39Z",
                "reviewBody": "You're the greatest Karren!  I've been making nut rolls with my Slovak grandpa for about 5 years now (it's become tradition), and I decided to try this recipe instead of the one we've always used.  This recipe was so much better and easier than the one we were using.  The recipe we previously used required two different rising steps and took about 3 hours longer than this recipe.  The rolls also tasted so much better.  We used the nut filling recipe (with a few tablespoons of milk added), and it was delicious.  We also filled some with fruit instead of nut (we use Solo fruit filling because it is a good consistency for these rolls).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALHAAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1441177/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-28T23:31:16.327Z",
                "reviewBody": "THIS WAS THE FIRST TIME I HAVE MADE NUT ROLLS/KOLACHI THEY TURNED OUT GREAT. MY TWO YEAR OLD LOVES THEM TOO. ONLY THING I NOTICED WAS IT SEEMED A MISPRINT ON THE YEAST I USED 1/4 OUNCE OF YEAST (1 PACKET)AND THEY TURNED OUT GOOD.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THOMAS YANISKEVICH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/547653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-25T13:27:36.42Z",
                "reviewBody": "Ok, I feel so bad about leaving such a low rating.  And usually when I don't like something, I just don't rate it at all.  But I am so completely disappointed with this recipe... and mostly because of the reviews!  Only one negative one out of all I looked at and it referred to pecans which isn't even in this recipe! But I followed this recipe to the T. I used it because of the reviewers claiming the likeness to Kolachi.  This is NOTHING like the kolachi I grew up with.  Yes, the dough had a great flavor, maybe a little sweet for Kolachi, and it was easy to work with.  But the recipe did not tell you the thickness to roll out the dough or what area to roll it out (ie - 12x10).  So because other reviewers claimed the \"perfect\" kolachi recipe I rolled it as I would when making kolachi. It did not rise at all.  The dough turned out tough on the outside and too doughy on the inside.  And they also stuck to the pan. Like I said, I followed this recipe to the T.  The recipe does not say to grease the pans so I didn't and usually wouldn't for this type of recipe.  I feel this recipe just leaves out too much info or I'm very wrong in thinking that nut roll is just another word for kolachi.  So I just thought I'd leave this review for those who might assume as I did.  I believe the dough would make for a great Kolacky cookie however.  And I just might give that a try because the dough is good, sweet and easy to work with.  I also felt that the nut filling is delicious as well. Sorry f",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Tisone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/studdabubba/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-18T15:59:28.5Z",
                "reviewBody": "I've made this several times and it's always a huge hit. This year I modified it somewhat. Filling: Substituted dark brown sugar and pecans. Used 1 Tablespoon cinnamon and 1 Tablespoon vanilla.  Dough: Increased sour cream to 1 Cup and added 2 extra egg yolks (reserve 2 whites for the wash). Let dough rest/rise for 30 min in a warm spot. Be sure to roll the dough very thin to about an 8 x 12 inch rectangle.  Use 1 Cup of dough and 1 1/2 to 2 cups of filling for each roll. I get 6 rolls this way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLLYSMAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1330299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-22T21:40:31.403Z",
                "reviewBody": "I made these yesterday and they turned out great. I found a way to avoid cracking of the dough I think. I chilled the dough for approxamately 3 hours prior to using it. I also did not brush with the egg before baking. I also rolled mine into multiple small 5X4 inch rolls and make dozens of them. they come out great! I have been making nut rolls for years and this dough is the best I have worked with and has such a good sweet taste. Thanks for sharing. I need to make a new batch already!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Stewarts kitchen ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4348077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-16T15:14:28.37Z",
                "reviewBody": "I have been making nut roll for 20 years or more. I previously used my aunt's recipe. About 6 years ago I came across this recipe and have used it ever since. I do make a few modifications. 1oz of yeast leaves the rolls tasting too yeasty to me so I use 2 tbsp. I weigh the dough and divide it into 6 11-12oz pieces. I roll the dough into a 9x12\" rectangle and fill with 1 1/2 cups filling. I add raisins as my family has always s done that. I also prick the tops and sides of rolls with a fork before baking which seems to help with cracking but sometimes they still crack a little. By all means don't be afraid to give them to people even if they are a little cracked. They are delicious and people slice them when serving anyway. I rotate pans half way through baking and don't bake more than two pans at a time. This is the best nut roll recipe I have found",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PA baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14916077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T15:59:58.713Z",
                "reviewBody": "I just finished making a batch of these nut rolls and they turned out wonderful! This has to be the easiest dough I ever worked with.After I rolled them I put them on a cookie sheet and flattened them slightly. I brushed with beated egg white and sprinkled with sugar which gave these nutrolls a crunchy top.I only baked a few at a time on one cookie sheet in the middle of oven for exactly 30 minutes and they were perfect. Thanks Karen for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Party Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/570494/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T23:52:14.24Z",
                "reviewBody": "This is the best nut roll recipe I have ever came across.It makes alot but they go fast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jaynene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1559219/"
                }
            }
        ]
    }
]