[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11010/biscotti-toscani/",
        "name": "Biscotti Toscani",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F14870.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "1998-07-17T07:43:01.000Z",
        "description": "These twice baked cookies have a delicate flavor, great with vanilla ice-cream, tea, frozen yogurt, or cappuccino.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "3 1/2 dozen",
        "recipeIngredient": [
            "⅓ cup butter",
            "¾ cup white sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "¼ teaspoon almond extract",
            "2 teaspoons orange zest",
            "2 ¼ cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "⅛ teaspoon ground nutmeg",
            "¼ teaspoon salt",
            "1 cup semisweet chocolate chips",
            "½ cup toasted almond pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a large baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream butter and sugar until light and fluffy. Beat in eggs, vanilla, almond extract, and zest. Combine flour, baking powder, nutmeg, and salt. Stir into the creamed mixture until just blended. Mix in almonds. Divide dough into two pieces. Form into long flat loaves about 1/2 inch tall and 12 inches long. Place the loaves 2 inches apart on the prepared baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 25 minutes, or until a light golden brown. Cool on a wire rack for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a serrated knife, cut diagonally into slices about 1/2 inch thick. Lay the slices flat on the baking sheet. Bake for 10 minutes, turning over once. Transfer to a wire rack to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chocolate chips into a small, microwave-safe bowl. Melt chocolate in the microwave, stirring every 20 to 30 seconds until smooth. Use a spatula to spread chocolate onto one side of each cookie. Let stand at room temperature until set. Store biscotti at room temperature in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "THEA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.684887459807074,
            "ratingCount": 311,
            "itemReviewed": "Biscotti Toscani",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "84 calories",
            "carbohydrateContent": "11.6 g",
            "cholesterolContent": "12.7 mg",
            "fatContent": "3.8 g",
            "fiberContent": "0.6 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "45.6 mg",
            "sugarContent": "5.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-20T01:39:11.857Z",
                "reviewBody": "I am not a big fan of biscotti, but I am trying to find a nice dessert with a longer shelf life (for gifts) and also something tasty to sell during the holidays.  This is my first attempt at making biscotti & I was a little intimidated.  I am happy to say that making biscotti is so EASY!  I followed the directions of the recipe except I didn't have orange zest.  Instead, I added 1-2 tablespoons of Grand Marnier.  The biscotti was a HUGE hit.  I tested it at a party  & everyone thought I should sell it to Starbucks---so much fresher and tastier!  After mixing the dough, I let it sit in the mixing bowl for 10-12 minutes so that it could set up.  It made it easier to handle (wet hands helped with the stickiness).  Also, I baked the biscotti dough on Silpat sheets and had no problems with sticking.  I used a serrated knife & had no problems slicing the biscotti.  Also, I added a few extra minutes to the second baking because I like a drier biscotti.  I can't wait to experiment with more biscotti recipes!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TLBRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-29T20:00:29.5Z",
                "reviewBody": "MORE THAN TWO YEARS AGO WAS WHEN I GAVE THIS RECIPE A FIVE-STAR RATING.....AND I JUST WANT TO CONFIRM THAT THIS IS ONE OF THE BEST BISCOTTI RECIPES, IF NOT THE BEST, YOU WILL EVER FIND.  AFTER GIVING IT AS GIFTS THAT FIRST CHRISTMAS, EVERYONE IS MY FAMILY WANTS IT FOR A GIFT...WORD GOT AROUND QUICKLY IN OUR FAMILY ABOUT IT, AND SO A CHRISTMAS DOES NOT PASS WITHOUT IT....SOMETIMES, I GIVE IT AS GIFTS, FOR \"JUST BECAUSE\".  IT TRULY IS A GREAT RECIPE.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRAUSMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/656082/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T14:34:34.543Z",
                "reviewBody": "These were fantastic! Thanks Thea. Spreading the chocolate on each cookie was a bit time-consuming so on my subsequent batches I laid out all the cooled cookeies cut side up on the baking sheet. I put the slightly cooled melted chocolate in a cake decorating bag with a plain tip and \"squiggled\" it over the cookies. It was fast looked great and there was just enough chocolate on each cookie to enhance the orange flavor without overpowering it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Disney Girl 54",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-27T22:50:20.42Z",
                "reviewBody": "YUM! I tried to follow the recipe to the letter but I didn't have any oranges. I used 1/2 tsp. orange extract instead. Delicious! Also after baking I layed the pieces right next to each other on a wire rack. Then I melted the chocolate chips in a ziplock bag snipped off a very small corner and drizzled the chocolate in patterns over all. Much easier fancy looking and less cleanup. I will definitely be giving these as Christmas gifts this year.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NOCUPPAJO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1407427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-02T01:35:39.683Z",
                "reviewBody": "Excellent recipe! Found that the cookies cut much better with a sharp butcher's knife. The nuts kept sticking to my serated knives (and I tried several) which caused the cookie to break. The sharp butcher's knife cut them easily and cleanly making a much nicer looking cookie. Taste is great Too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bob Miller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/681055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-23T16:34:58.57Z",
                "reviewBody": "This is a great recipe. I have been looking for a good one for a while and I'm so glad I found this one. I didn't have almond extract and I don't care for nutmeg so I left them out. I also didn't read the recipe really well and added the choc. chips to the batter. Yummy! (I didn't dip them later) Not crazy about orange zest but it really adds flavor. Don't leave it out - unless of course you are adapting it to a lemon poppy seed biscotti or something like that. The possiblilities are endless! I also only made one large loaf and because I like a real crisp biscotti I turned down the oven to 200 degrees and just let them hang out for about 30 extra minutes at the end. Turned off the oven and let them cool there. Didn't get any darker at 200 either. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joypip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1786597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-28T19:49:57.403Z",
                "reviewBody": "What a change-friendly recipe! I used this recipe on my first shot at making biscotti. I had to leave out almonds due to an allergy I used anise flavoring instead of the orange zest b/c I did not have any on hand - the anise is my favorite hint of flavor in biscotti so it seemed right. Also I used half whole wheat flour and half AP white flour and THAT really worked too. I normally to change a recipe so much before trying the original but this is just so forgiving. Oh the most important part is - EVERYONE loved it. My sunday school class my mother my 3yr old daughter... I had Nonni's biscotti there to (to fall back on just in case mine was terrible) but everyone went for mine first. I love that! Thank you so much the recipe is delish! I won't look any further but I will continue to experiment with yours!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "onassis75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/684318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T01:45:52.06Z",
                "reviewBody": "SAVE BIG BUCKS!!!!  I used to purchase my coffee-dunking biscotti by the truckload and at gourmet food prices, it was a guilty pleasure...but NO MORE!!  This biscotti was more dense and subtle in sweetness, and stronger in vanilla taste (yum)than most that I've bought. The best feature is that it certainly proclaims \"FRESHLY BAKED\".  I will, however, begin to add different things to this fairly basic recipe (such as hazelnut, cocoa, etc) to be able to offer choices to our overnight guests for their breakfast coffee.  The only step I improved upon as I did more and more is the spreading chocolate on the finished biscotti.  I scooped a spoonful, poured it along the bottom side of the biscotti, then scraped it with backside of butterknife to make even, thin layer.  Be sure to let the chocolate set (fridge for 20 min worked well for me).  Mangia!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAREN WANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/487729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-21T00:18:57.71Z",
                "reviewBody": "This is the 3rd AR biscotti recipe I've tried - and the sweetest (also tried \"Biscotti\" & \"Pistachio and Cranberry\"). I used fresh orange zest and put the choc chips in the batter (1/2c) so I wouldn't have to mess with dipping afterward. Also I did not toast the almonds. I think the zest and untoasted almonds are too chewy. And choc chips make it too sweet. Smells fantastic and tastes nice but I didn't reach for a third like I did the others. Will try again with those modifications. Be sure to flatten it out to 1/2\" high b4 baking. Yield for me was 48 1/2\" pieces.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SiloDog",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/archimomster/"
                }
            }
        ]
    }
]