[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/852/desserts/cookies/peanut-butter-cookies/",
                    "name": "Peanut Butter Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11024/joeys-peanut-butter-cookies/",
        "name": "Joey's Peanut Butter Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F746137.jpg",
            "width": 1975,
            "height": 1981
        },
        "datePublished": "1998-08-01T19:49:48.000Z",
        "description": "My boyfriend's special recipe makes the peanut butteriest tasting cookie I have ever tasted.  These soft and chewy peanut buttery cookies are the best!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 cup peanut butter",
            "½ cup butter, softened",
            "½ cup white sugar",
            "½ cup packed brown sugar",
            "1 egg",
            "3 tablespoons milk",
            "1 teaspoon vanilla extract",
            "1 ¼ cups all-purpose flour",
            "¾ teaspoon baking powder",
            "¼ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the peanut butter, butter, white sugar, and brown sugar until well blended. Beat in the egg, milk, and vanilla one at a time. Combine the flour, baking powder, and salt; stir into creamed mixture. Roll tablespoonfuls of dough into balls. Place cookies 2 inches apart onto ungreased cookie sheets. Press each ball once with fork tines.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven, or until edges are lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Peanut Butter Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "P Weiss"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.313758389261745,
            "ratingCount": 1788,
            "itemReviewed": "Joey's Peanut Butter Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "105.9 calories",
            "carbohydrateContent": "10.6 g",
            "cholesterolContent": "12 mg",
            "fatContent": "6.4 g",
            "fiberContent": "0.5 g",
            "proteinContent": "2.5 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "80.8 mg",
            "sugarContent": "6.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-15T21:36:22.633Z",
                "reviewBody": "Okay, I signed up for this site, just so I can give my review of these cookies.  I own a deli and bake cookies for it all the time.  There are so many other incredible better peanut butter cookie recipes out there.  These were pasty and didn't have a strong peanut butter flavor at all, even though I was a little generous in measuring the peanut butter.  I'm going back to my recipe that I have tweaked to perfection.  I thought with 200 ratings on this recipe, that these would have been fantastic.  I was sorely disappointed.  :(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "COFECHIC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1011595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-14T02:03:31.163Z",
                "reviewBody": "A lot of people love this recipe.  Some do not.  I think it is really good.  You don't need to add any extra flour to the recipe.  I will admit the batter is a bit more slack than a lot of people are used to.  Use a 1-ounce metal cookie scooper and you will have no problem with the dough.  Use a fork dipped in water to make the criss-cross design.  I did refrigerate some of the dough after scooping it and I found that it is actually easier to get a more uniform, pretty criss-cross design if you do it straight from the bowl without chilling.  The chilled dough did work okay, but it did crack on the sides and I had to push the sides together to make a uniform circle.  Also, check you oven temperature.  You cannot go by the time given.  Everyone's oven is different.  I baked mine at 350 degrees for 11 minutes and they were underdone and delicate/broke apart.  But, I baked a second batch for 16 minutes and they are perfect.  They don't fall apart and are still soft in the center and crisp on the edges with nice color.  I bake professionally for an upscale private club and none of our recipes have time listed.  You have to be able to tell when it's done by how it looks and feels.  Baking can be tempermental.  Mixing methods, ingredients, environment, humidity, and a whole host of other things affect your recipe.  The same recipe can come out differently every time if you don't pay attention to things like the weather, brands, heavy footfalls, etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine Brown",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/839173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-15T06:20:52.81Z",
                "reviewBody": "MMM, delicious!! How do I even begin to rave about these? A great, strong, peanut butter flavor, and perfectly soft and chewy. I've never had a peanut butter cookie so wonderful, and everyone in my family thought they were absolutely the best ever. When I was making them, I was a bit worried at first, because the batter looked quite soupy - almost like a pure, creamy peanut butter - But dont worry, they turn out! Also, I accidently really burnt the bottom of my first batch. It worked best for me to put them on the top shelf in the oven, and to take them out at 7 minutes and 45 seconds (the bottom edge looks slightly brown - but don't wait for the top to brown too much or the bottom will burn). They are a bit crumbly at first, so you may not think they are done. But once they cool, trust me! You'll be amazed. MMMM. 10 stars. Oh- Also, don't half the recipe, You'll be sorry you did. Make the entire amount called for in the recipe. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SOMLAND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/653998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-28T15:10:32.693Z",
                "reviewBody": "These are just delicious.  What makes them so is that there is twice as much peanut butter as butter - -most peanut butter cookies recipes call for equal amounts of both. Great recipe Joey!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-10T23:59:20.107Z",
                "reviewBody": "Great texture! Cheap PB works - but you can taste the difference when you use good the quality, rich stuff. Skip the milk...not needed, and I also added a little more flour (1/4 C). Good consistency to roll into balls, then flatten with fork. Try to stay away from dipping the fork in flour first - doesn't help much, and adds unnecessary flour. If your fork sticks to the dough - you probably need to add a LITTLE more flour. If you've added the extra flour - and want to keep your cookies chewy, then take them out of the oven a 1-2 minutes early - then before they completely cool, place them in an air-tight container.  \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/236232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-12T03:55:59.623Z",
                "reviewBody": "This is the BEST peanut butter cookie recipe I have ever made in my life.  They are not dry like most peanut butter cookies, very peanut buttery.  I actually improved on it by adding about 3 small bags of Reese's Pieces to the dough, and instead of flattening with a fork, I flattened them with the bottom of a glass dipped in flour.  Suprisingly, the Reese's Pieces held their shape.  Oh so good!  If you love PB the way my husband does, you must try this recipe.  Definately a keeper!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/175320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T20:15:23.2Z",
                "reviewBody": "This is a keeper. My roommate who doesn't like sweet cookies flipped for these cookies. Perfect texture: thick soft and crunchy (I used extra crunchy processed PB). I like cookies a little sweeter; adding 1/8 cup extra granulated sugar will make them sweeter and just a tad bit crisper. I tried several different baking pans. They came out perfectly on heavy shiny stainless steel sheets. I made them bigger than the dinky tablespoon drop called for in the recipe and baked for 15 mins. Those who are finding them undercooked are probably using insulated baking sheets. Those who are burning the bottoms too easily are probably using the regular nonstick pans you find everywhere. It's all about the sheets. You might also try moving the pan nearer the top of the oven and baking a little longer. The dough is really sticky; chilling helps a little. I didn't add more flour but just settled for irregular edges.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TIRGO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/941702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-07T06:20:18.327Z",
                "reviewBody": "These cookies turned out really good. I used the Pampered Chef medium scoop to drop onto cookie sheet to eliminate the stickiness.  Also sprinkled them with sugar after I criss-crossed with fork.  Mine turned out chewy on the inside and a little crisp on the outside...just perfect.  They were a hit at my office.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lynchcatlover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683454/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-02T12:21:15.403Z",
                "reviewBody": "Wow! They are the best! I didn't use quite a cup of peanut butter because it just looked like too much but they were fantastic! The dough was very fluffy (I used my Kitchenaid mixer) but workable. I rolled them in sugar and made the traditional criscross design. Make a double batch if you're a cookie lover!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOYMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/573019/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Joey's Peanut Butter Cookies ",
            "description": "Simple and exquisite peanut butter cookies!",
            "uploadDate": "2019-05-06T19:04:42.415Z",
            "duration": "PT45.589S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7078d5f6-7e8f-4a74-9e48-2b0fbc072705%2F012e030e-ce3f-4b08-b618-208f8c498276%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6033444181001"
        }
    }
]