[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/838/desserts/cookies/brownies/",
                    "name": "Brownie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2755/desserts/cookies/brownies/nut-brownies/",
                    "name": "Nut Brownie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11043/the-ultimate-brownie/",
        "name": "The Ultimate Brownie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4649180.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "1998-01-01T15:56:47.000Z",
        "description": "Fudgy brownies that are the best you have ever tried. Fattening but worth it! Brownies can be frozen after baking.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "2 dozen brownies",
        "recipeIngredient": [
            "1 ½ cups unsalted butter",
            "3 cups white sugar",
            "2 teaspoons vanilla extract",
            "7 eggs, beaten",
            "1 ¼ cups all-purpose flour",
            "1 ¼ cups unsweetened cocoa powder",
            "1 teaspoon salt",
            "1 pound chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line one 9x9-inch baking pan with foil and spray with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium heat, melt the butter. Stir in the sugar until dissolved. Remove mixture from heat. Gradually pour the melted butter into the beaten eggs, whisking constantly, until mixture is fully incorporated. Stir in the vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift the flour, cocoa and salt together. Add the flour mixture to the butter mixture, mixing until combined. Stir in the walnuts. Spread the batter into the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until brownies are set (a toothpick inserted in the center should have small crumbs clinging to it, rather than wet batter), 45 to 50 minutes. Do not overbake!\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Brownie Recipes",
            "Nut Brownie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.404624277456647,
            "ratingCount": 173,
            "itemReviewed": "The Ultimate Brownie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "378 calories",
            "carbohydrateContent": "35.2 g",
            "cholesterolContent": "84.8 mg",
            "fatContent": "26 g",
            "fiberContent": "2.9 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "9.3 g",
            "servingSize": null,
            "sodiumContent": "120.4 mg",
            "sugarContent": "25.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-25T16:20:30.467Z",
                "reviewBody": "This recipe is similar to one I've had for a couple of years. My comments are as follows: the butter should be melted and cocoa added to that. This cooks the cocoa (like when you boil cocoa to drink).Take off the heat and then put in the sugar. Sugar should not be mixed while the fire is on because it will caramelize and spoil the whole mix. The sugar will still be in granules but that doesn't matter because that gives the brownies top its crust.I think 7 eggs refers to medium sized eggs, while most of us are used to using large eggs for baking.It's okay to add the eggs after this because the sugar has cooled the mix and the eggs won't get accidentally cooked.Should you find the batter slightly lumpy after adding the flour,simply press it against the side of the saucepan with a large wooden spoon to dissolve the lumps.If your oven tends to be a bit hot, reduce the temperature and cook a bit longer. This also reduces the cakey texture.For those who do not like the thickness, simply use a bigger pan. All obstacles overcome, this recipe is really a winner.Enjoy. :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Belderane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2221619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-07T19:11:50.747Z",
                "reviewBody": "They taste great but the instructions weren't clear enough. They say to remove the butter and sugar from the heat then add the eggs. HOWEVER you must let the mixture cool before you add the eggs or the eggs will cook like egg drop soup when you add them. I had to find that out the hard way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JOEBOXERR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697216/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-23T20:02:51.013Z",
                "reviewBody": "These brownies had a great taste.  I did make a few changes like others.  I used only 5 eggs, and cooked in a 9/13 pan.  I also only cooked them for 35 mins.  They were great!  I took them to work and they were gone in 20 mins!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEN91081",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1416966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-03T00:14:47.583Z",
                "reviewBody": "This recipe was very easy to follow and made a very good brownie. I turned it into cream cheese brownies by adding 8oz cream cheese 1/4 cup sugar 1 egg 1/4tst vanilla and 1/4 cup milk blend until smooth spoon into three even lines over the brownie mix swirl the cream cheese into the batter and bake as directed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAPECHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1149105/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-30T04:49:13.827Z",
                "reviewBody": "I lost my favorite recipe for brownies and I've been searching for a replacement ever since.  This is the closest thing I've found.  I'm a fan of fudgey, gooey brownies (if I want cake, I'll make a Devil's Food, not brownies).  Like many folks, I tweaked this recipe.  \r\n\r\n*6 eggs instead of 7.  Next time I'll try 5 as these were still a tad cakey.\r\n\r\n*I added 2 oz unsweetened baking chocolate to the butter when I melted it.  I thought it was wrong to make brownies only using cocoa powder.  Initially, I eliminated 1/4 c. of the cocoa powder, but then I added it anyway.  The brownies were decadently rich...although, in my mind, the words \"chocolate\" and \"overkill\" are mutually exclusive.\r\n\r\n* I used a 9x13 pan, made a sleeve of aluminum foil, and put the pan in an ice bath immediately after I removed it from the oven (you could also pop it in the freezer, but my freezer was full).  The brownies slowly sunk, making them much more dense than they would normally have been.  The ice bath also gives you that nice sheen on the top of the brownies.  The aluminum foil peeled off the brownies quite easily, without any oil or spray.\r\n\r\nAll in all, I liked it.  I'll probably still tinker with it a bit, but it's a great start!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DOODOO76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1404086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-18T01:16:59.717Z",
                "reviewBody": "These turned out to be absolutely delicious. I was skeptical while making the brownies but now that I have one in my hand this recipe has won me over! Quick and easy to make chewy and full of flavor! I took others' advice and used a larger pan (once you try the recipe you'll see exactly why) used PAM only (no foil) added 6 eggs instead of 7 and allowed the sugar/butter mixture to cool down before adding the eggs. I also sprinkled powdered sugar on top of the cooked brownies. they only took 30 minutes in the oven. Make sure you keep an eye on them or they'll overcook and those moist brownies you were craving will go right out the window.;) This recipe is definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SERDES19",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1290365/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-14T23:35:37.42Z",
                "reviewBody": "I just feel the need to let everyone know the calorie count on these is WAY off - I've checked and double-checked and using calculations from online calorie-counters 1/24 of this recipe is closer to 625 calories maybe higher. Which I'm sure is what makes them delicious.:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LovesCheese",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1519689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-06T23:12:30.377Z",
                "reviewBody": "This recipe is a good just like many others I have found and very simple to make. So I am reading about problems with the butter being to hot. Ok after my 20 years of baking here is my advice let the butter stand at room temperature until very soft then you can use that in the mix you do not have to have the butter melted all the way but you do have to have the butter very soft or just stick the butter in the microwave for 30 seconds or so just until very soft then mix the butter with the rest of the ingredients also you do not want to over mix the batter thats a NO NO. Follow the rest of the recipe and brownies will come out just fine I promise you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TheValleyChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2660516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-04T23:07:54.073Z",
                "reviewBody": "I'm glad to have found a good, easy brownie recipe using pantry staples.  I appreciate everyone's feedback.  Here's what I tweaked slightly:\n\n1. Melt 1 1/2 cups butter in saucepan on low.\n2. Stir in 1 1/4 cups cocoa.\n3. Remove from heat, add 3 cups sugar, then 1 tsp. salt and 2 tsp. vanilla.\n4. Stir in 5 large eggs.\n5. Stir in 1 1/4 cups flour, then 1 cup nuts (I prefer pecans).\n6. Pour batter into non-stick 9x13 pan.  No need to use foil, parchment, or even non-stick spray.\n7. Bake in preheated oven (350 F) for 45 minutes.  I covered mine with foil the last 10 minutes.\n\nCool briefly on cooling rack and serve warm.  Cuts into perfect squares.  It's a great standard brownie recipe!  Lovely texture and taste. It would be excellent with a vanilla ice cream topped with a chocolate ganache. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly's Kitchen Creation",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6607730/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-12T19:20:56.277Z",
                "reviewBody": "I tried this recipe and only gave it a 2 star because it was too intence in it's chocolate flavor. I am a big lover of chocolate and so is my sister, and we could hardly eat the one piece. It just becomes too overwhelming and sickly after just a few bites, I will not be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "sarahlovestocook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3455658/"
                }
            }
        ]
    }
]