[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/844/desserts/cookies/cut-out-cookies/",
                    "name": "Cut-Out Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11075/building-gingerbread/",
        "name": "Building Gingerbread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6165193.jpg",
            "width": 1936,
            "height": 1936
        },
        "datePublished": "1998-10-05T17:46:53.000Z",
        "description": "Every Christmas I design a new pattern and make a gingerbread house for the holidays. The kids love to help decorate.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 gingerbread house",
        "recipeIngredient": [
            "5 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon salt",
            "1 teaspoon ground nutmeg",
            "1 cup shortening",
            "1 tablespoon ground ginger",
            "1 cup white sugar",
            "1 cup molasses",
            "2 ½ cups confectioners' sugar",
            "¼ teaspoon cream of tartar",
            "2 egg whites",
            "½ teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt shortening in a saucepan large enough for mixing the dough. Mix in sugar and molasses. Combine the flour, salt, baking soda, nutmeg, and ginger; gradually stir into the pan, using your hands to work in the last bit. Dough should be stiff.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a floured surface, roll out dough to 1/4 inch thickness, and cut out as desired. Make sure the gingerbread is of uniform thickness, or the edges may burn before the center is done. Place pieces onto cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 13 to 15 minutes in the preheated oven. Let cool for several minutes on the cookie sheet, then remove to racks to finish cooling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the gingerbread has cooled completely, make the frosting cement. In a medium bowl, mix together confectioners' sugar and cream of tartar.  Add egg whites and vanilla.  Beat on high speed until frosting holds its shape. If necessary, add more confectioners' sugar to thicken the icing. Cover frosting with a damp cloth to prevent drying.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Cut-Out Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JBS BOX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.7755102040816326,
            "ratingCount": 98,
            "itemReviewed": "Building Gingerbread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "233.5 calories",
            "carbohydrateContent": "40.8 g",
            "cholesterolContent": "0 mg",
            "fatContent": "7.1 g",
            "fiberContent": "0.6 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "111.5 mg",
            "sugarContent": "22.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-10T18:38:50.403Z",
                "reviewBody": "My mom & I make approximately 40 gingerbread houses each year, so I know what I am saying when I tell you this is a great recipe.  We lost our recipe this year so tried this one and we like it better than our usual one.  You will have to correctly measure the flour or it would be too dry.  You scoop the flour into the measure cup and with a kitchen scoop, then clear off the top with a knife WITHOUT tapping the cup.  Then it should not be too dry.  Also don't try to make them too thin.  They should be app. 3/8\" thick.  Good luck with your gingerbread house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebekah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/532171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-05T21:41:51.107Z",
                "reviewBody": "To all those who have tried this recipe and ended up with a crumbly mess (like me!) I have some valuable advice.  Once you've melted the shortening, keep the heat on medium as you add the rest of the ingredients GRADUALLY using a whisk to mix it in, rather than dumping all the dry ingredients in all at once. Keeping it over the heat helped keep it warm and pliable. It's amazing how much of a difference this all made.  It turned out PERFECTLY and I will be sure to use this recipe every year!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kats_snguyen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1657395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-18T18:15:36.123Z",
                "reviewBody": "This recipe goes against all \"rules\" of typical rolled cookies.  This dough needs to be *hot* to be workable, and I wouldn't use any flour at all while rolling - the shortening keeps the dough from sticking to anything, and extra flour just makes a goo out of the oil.  I microwaved the dough for about 10-20 seconds between each rolling, and the results seem fine and strong.\n\nThe flour-to-liquid ratio is critical in this recipe.  I was very light-handed with the flour, and it turned out fine.  You might want to sift the flour first, or spoon it very lightly into the measuring cup.  I also doubled the spices and added 2 t. cinnamon and 1 t. allspice for extra flavor.\n\nI was able to make 2  6-inch square roof pieces, 2 5x5-inch side walls, and 2 front/back pieces extending up to 7 inches tall - and I still had plenty of leftover dough for trees, a chimney, etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JENSPIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/803037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T18:38:09.653Z",
                "reviewBody": "Lost my old recipe and had to try several until I found this one-it is really good.  This makes a good stiff dough that yeilds a sturdy non-puffy cookie that works very well for building houses or making large cookies for hanging.\r\nNOTE:  Flour must be measured very carefully and then should not be dumped into the fluids all at once.  Flour varies in moisture content- the amount needed in any cookie recipe may vary somewhat from time to time even if it is same brand brand of flour. Don't pack the flour into the cup- spoon it into the cup then level the top off with a knife. This makes a very stiff dough, but that is what is needed for house building.  Use a different recipe for cookies to be used for eating only.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hosta53",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/403479/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-21T20:46:47.977Z",
                "reviewBody": "If you are looking for a strong firm gingerbread that will not spread or warp this is it.  BUT, having said that, you need to realize that this is not your typical cookie dough recipe.  This is a HOT cookie dough and if you let it cool down you will have a crumbly mess.  I followed other reviews and added the hot mixture to the dry (minus one cup of flour for my double batch) and mixed until combined.  To roll out the dough I covered my cookie sheet with parchment and microwaved a large handful of dough for 25-40 seconds until it was very warm and soft.  Working quickly I rolled the dough out on my prepared cookie sheet cut out my pattern and removed the (by now) crumbling  dough extras.  My pieces took between 15-18 min. to bake but I was making large walls mostly.  Once I removed them from the oven I quickly put my pattern back on the cooked pieces and trimed the edges to ensure that my building's edges were straight. This recipe was VERY different from anything I have worked with before but the results were just what I was looking for. This is not a recipe for beginning cooks but if you are up for a challenge give it a try. Just remember it needs to be warm!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1591482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T18:51:56.623Z",
                "reviewBody": "This recipe is great, but to make it easier for the beginner to work with, I'd suggest taking the yolks from the eggs --you're using 2 whites for the frosting -  and add them to the dough mixture.  Any good baker knows not to pack flour either, the only ingredient you usually ever pack is brown sugar, so be sure to measure flour by sifting or spooning and level it carefully with the blade of a knife and you'll have a terrific house.  The icing works great even heavy things like ribbon candy can be 'glued on' with it.  This was a fun little house to build.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "THUNDERINGOAK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/968938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T23:04:45.047Z",
                "reviewBody": "I gave it 4 stars because I tweeked the recipe to make it a 5 star!  What I did different: I used 4 3/4 cups of flour instead of 5.  And I added a little bit of cinnamon and cloves to make it smell yummy. I put all the dry ingredients into my mixer bowl then proceeded to make the shortening, molasses, sugar mix.  After I melted the shortening on the stove and mixed in the sugar and molasses, I added it to my mixer bowl (that already held the flour mixture in it.) mixed throroughly for about  1 minute.  I formed it into a big ball, then I put it all into a gallon sized ziploc bag.  From there, I took 1/3 of the dough out of the ziploc and rolled it out onto parchment paper, did the cutouts and removed the excess(instead of the cutouts). Slid the parchment onto a cookie sheet and baked in the oven for 5-7 minutes.  If the dough in the ziploc hardened, I popped it into the microwave for 20 - 30 seconds. The dough was warm to work with but easier. I didn't use any flour when rolling the dough out. It is fairly greasy dough if you warm it in the microwave.  Just work quick and if it gets hard, put in micro. The pieces of my house turned out nice and hard. Perfect to build with!!! Good luck. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DOODYBUG1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1241502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T20:38:01.84Z",
                "reviewBody": "Thanks this was a perfect recipe for a beautiful gingerbread house......it was easily doubled or quadrupled to give very creative house designs. The icing was great.....very strong...once again I recommened this recipe highly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BJUBC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/164457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T20:36:32.827Z",
                "reviewBody": "This was my first attempt at building a gingerbread house and this recipe worked really well.  I used the Royal Icing II for the glue, made an outside chimney with tiny M&M's on it for \"stones\", and small tootsie rolls beside the front door for \"firewood\".  I was able to cut out a window from the back side of the house but left a cutout of a gingerbread person waving through the window!  It was really great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M-DRAGON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/504618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-04T18:16:33.763Z",
                "reviewBody": "The icing was fantastic, but the gingerbread wasn't.  I rolled it thicker than suggested, and it burned on the edges after 8 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/277904/"
                }
            }
        ]
    }
]