[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/859/desserts/cookies/sugar-cookies/",
                    "name": "Sugar Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11124/betzs-good-sugar-cookies/",
        "name": "Betz's Good Sugar Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F12371.jpg",
            "width": 1632,
            "height": 1224
        },
        "datePublished": "1998-11-23T04:45:28.000Z",
        "description": "This recipe has been handed down from my great-great grandmother at least.  We're not sure how far it goes back, but does go back to the early 1900's at least.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT9H0M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "1 ½ cups white sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "1 teaspoon lemon extract",
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 pinch salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until fluffy. Beat in the eggs one at a time, then stir in the vanilla and lemon extracts. Combine the flour, baking powder, and salt; gradually blend into the creamed mixture to form a soft dough. Cover or wrap dough, and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). On a floured surface, roll the dough out 1/4 inch thick. Cut into desired shapes using cookie cutters. Place cookies 2 inches apart on ungreased cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 minutes in the preheated oven, or until lightly browned. Cool on wire racks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sugar Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tricia Weimer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8875,
            "ratingCount": 80,
            "itemReviewed": "Betz's Good Sugar Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "80.6 calories",
            "carbohydrateContent": "10.3 g",
            "cholesterolContent": "17.9 mg",
            "fatContent": "4.1 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "40.4 mg",
            "sugarContent": "6.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-09T03:50:40.31Z",
                "reviewBody": "These cookies are WONDERFUL!! I would recommend this recipe to anyone looking for a light and not overly sweet sugar cookie. I read all the reviews before I made these cookies and all of the negative reviews are ridiculous. So here's a little advice to those people: Everyone should know that a recipe is not set in stone and never complete. Every recipe needs to be adjusted according to personal taste and most importantly elevation and humidity. When baking it is always necessary to pay attention to the amount of flour you're adding to things - and always add flour/dry indredients slowly as more often than not you will need add more or less than what is indicated on your recipe. To those who said this dough was gooey and hard to work with you will probably need to stick to the pre-made dough in the refridgerated section of your grocery store. Because if you had ever worked with dough that would need to be rolled out you would know that if the dough is gooey before you put it in to be refridgerated it will still be gooey when it comes time to work with it. Use common sense and add more flour. If it is dry and crumbly add a little milk and stop adding flour. Sugar cookie doughs are supposed to be soft but shouldn't stick to your hands. This is one of the best sugar cookie recipes I've come across in a long time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alexis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/430225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T13:58:54.453Z",
                "reviewBody": "I've now tested this recipe twice. It definitely does need more flour for consistency. The taste is overall pleasant not too sweet. As for some of the other comments about sticky dough a little stickiness is not bad. I suggest refigerating for overnight before use. Refrigeration hardens the dough (and removes some of the stickiness). You don't want your dough to be non-sticky before refrigeration. That will mean you have too much flour in the batter. I also suggest that you refrigerate any cut cookies until ready for baking because as the dough gets warm it becomes too pliable. Also the more flour in the batter the softer your cookie will be and the more floury the taste (not the idea - another reason not to over-flour it). I hope this helps someone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SFMPCO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/783435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T16:00:25.247Z",
                "reviewBody": "This sugar cookie dough is not the worst I've worked with despite many of the poor reviews. I made it up 2 days before I was going to use it and put it in a covered bowl in the fridge. The dough is very very soft and hard to work with. I simply used a lot of flour on the cutting board grabbed a hand full of dough and kneaded some extra into each handful. I did not use a rolling pin but flattened it with my hands. Use plenty of spare flour and your cookies will come out fine. Also use a simple outline cutter not one with a lot of detail. The dough WILL stick to each part. A seasoned baker will have no problem with this dough. Sugar cookies from scratch are NOT easy to make. Also you may want to ice these or put on some sprinkles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "DIMABS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/54134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-06T20:28:06.717Z",
                "reviewBody": "I loved these cookies! The texture and flavor were as good as the local bakery's! Though I did find it required a little extra TLC and work I have found this to be true of ALL rolled dough cookie batters. But unlike many of the others I had no trouble whatsoever working the dough. I think the long lost secret may be that you need to stir in at least the last half of the flour by hand. An electric mixer overworks the dough so that you need to add lots of extra flour. Once I did this I just added a little extra at a time till the dough was like sticky playdough before refrigeration. Since I live in a tremendously humid climate I find I need to do this with virtually all cookie recipes rolled or otherwise. I ended up with only about 3/4 cup extra flour being required which is pretty normal for me. Great Recipe! I will definitely use it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NAWLINSGRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/708598/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-06T00:16:35.28Z",
                "reviewBody": "Had I read the reviews I would've avoided this recipe. Since I was foolish enough not to read others' opinions I now have my own.:c( This recipe turned into a total flop. The only good thing I can say is that the cookies that did get into the oven tasted great. But the dough was a nightmare to deal with. It was gooey and stuck terribly to the counter even though I had HEAVILY floured it. THEN after rolling the gooey dough into balls and rolling in sugar (trying to salvage it) I baked them on an UNgreased cookie sheet per the directions. They STUCK to the sheets! Ugh! I was SO mad at this point! Plus I was idiotic enough to QUADRUPLE the recipe. Sooo I have a LOT of very gooey nearly useless dough. My fault for ignoring the reviews. I'll not use this one again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "NUTTSNFLAKES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/521895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-19T13:37:03.31Z",
                "reviewBody": "These are great you can even slightly burn them (oops!) and they STILL taste good! OK so they really need the time in the fridge because they're a bit messy to work with but oh so worth the trouble. Thank You.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MYPIEDRA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/746243/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-14T02:38:17.2Z",
                "reviewBody": "Not very kid friendly because of the need for more flour than the recipe calls for. A little common sense and creativity helped me out with this one. Baked with a little grape jelly in the middle is as good as the frosting on top!!! Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROYALE333",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/604871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T23:30:07.187Z",
                "reviewBody": "There was no way to make cut out cookies from this. The dough was way too soft even after being refrigerated overnight. I finally rolled it into walnut sized balls and mashed it a little with a glass dipped in colored sugar. They were a VERY crisp cookie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SEGEL10",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T02:46:26.937Z",
                "reviewBody": "This was a yummy cookie! The Lemon extract really made a difference. I made two batches one with butter and one with margarine. I would highly recommend using margarine. Although the dough was more sticky ( I had to add a bit more flour) It cooked up nicely. THe batch made with butter started off less sticky and more firm but when I cooked it it spread out too much on the pan. They both tasted great the butter batter being more crisp and delicate. I would definitely make these again but will use margarine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne O'Donaghue Hunt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/709304/"
                }
            }
        ]
    }
]