[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/838/desserts/cookies/brownies/",
                    "name": "Brownie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1562/desserts/cookies/brownies/chocolate-brownies/",
                    "name": "Chocolate Brownie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11306/chewiest-brownies/",
        "name": "Chewiest Brownies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4486779.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "1999-03-23T12:55:29.000Z",
        "description": "Rich chocolate chewy brownies, not cakey at all!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -9x13 inch pan",
        "recipeIngredient": [
            "1 cup unsweetened cocoa powder",
            "½ cup melted butter",
            "2 cups white sugar",
            "2 eggs",
            "¼ teaspoon salt",
            "1 cup all-purpose flour",
            "2 teaspoons vanilla extract",
            "⅓ cup confectioners' sugar for decoration"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). Line one 9x13 inch pan with greased parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the cocoa, melted butter, sugar, eggs, salt , flour and vanilla. Mix until well combined. It should be very thick and sticky.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread mixture into the prepared pan. Bake at 300 degrees F (150 degrees C) for 30 minutes. Cool completely before cutting into squares.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Brownie Recipes",
            "Chocolate Brownie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Krissyp"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.030211480362538,
            "ratingCount": 662,
            "itemReviewed": "Chewiest Brownies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "139.1 calories",
            "carbohydrateContent": "24.3 g",
            "cholesterolContent": "25.7 mg",
            "fatContent": "4.8 g",
            "fiberContent": "1.3 g",
            "proteinContent": "1.8 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "58.2 mg",
            "sugarContent": "18.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-04T06:35:32.487Z",
                "reviewBody": "Wow! Best brownie recipe ever! I followed the advice of some other users: Decreased the cocoa powder to 3/4C, decreased the sugar to 1 1/2C and increased the melted butter to 3/4C.  Also, to help with the mixing so it doesnt get crumbly, melt the butter really well and then add the sugar, vanilla and eggs.  In a seperate bowl mix the rest of the dry ingredients.  Now mix the two together. Mixing the indregients this way (rather than putting them all in a single bowl and mixing as the recipe says) will make the batter easier to mix and spread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Matt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1942782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T23:42:01.71Z",
                "reviewBody": "My friend and I have tweaked this recipe to our liking: use three-fourths C cocoa, and add a quarter C vegetable oil (this will make the brownies moist and chewier, promise!).  I agree they are very sweet, so I think you could leave the full sugar in or decrease up to a half a cup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MOELASSES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/706461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-18T00:10:01.153Z",
                "reviewBody": "This is my favorite brownie recipe on the site. (I ve made all of the top rated ones several times). It makes some wonderful chewy brownies with a very powerful chocolaty flavor that I find most recipes lack. It doesn t always turn out though. The brownie will be very thin no matter what size pan you re using. Try putting wax paper on the bottom so that the brownie can be lifted out to cool and be cut. In order to avoid a crumbly mixture stir the coca and sugar together then add the melted butter and eggs and vanilla and then the flour and salt. Make sure that you melt the butter. If the mixture still seems too crumbly it s possible that your eggs were too small (I use extra large size eggs) consider adding another egg. The mixture will be very thick. I still have problems with the brownie not settling all the way and the middle square has to be discarded. But I still prefer this recipe underdone to overdone. When they come out of the oven at the prescribed time do not test the center for doneness or try to cut them immediately. They will not seem done but they will settle. (I like to put them in the fridge to settle.) If you cook them to long they will be very dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/945013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-22T06:13:13.233Z",
                "reviewBody": "After reading many reviews and making this recipe I can safely say that is one of those recipes that you either love or hate. If you like the brownie mixes this is not for you. I followed this recipe exactly and it turned out wonderful. Not the usual kind of brownies that you might find on a bake sale. These brownies are not cakey they are thin chewy dense moist strong chocolate flavour (even with all the sugar the recipe calls for) and amazing with vanilla ice cream. It is a dessert that you might find at five stars restaurants. It deserves a fancy name! If you love chocolate this is for you. Don't over cook them! I had to use my hands to level and spread the batter as it is really thick. Turned out wonderful - wouldn't change a thing. Thanks for the recipe!!!!! This is my brownie recipe from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DCANT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/500385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-06T05:22:44.5Z",
                "reviewBody": "Yummy!!! For a perfect top and chewy inside, use 1/2 cup of cocoa and 1 1/2 cups of sugar, and follow the rest of the recipe exactly.  I love the flaky top. It cracks beautifully with your fork and has a moist chewy inside. I have made this 4 times already. Absolutely delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "007",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1698670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-04T15:23:23.78Z",
                "reviewBody": "This is my new brownie recipe! We love chewy brownies and these are awesome. They are so easy I have made them three times already....a few tips - rather than trying to spread the dough which is more like a clay than batter press it into your pan by hand working from the middle out to the edges (a 10 inch round cake pan is perfect) the parchment paper is an unecessary step if you grease your pan (i've made them twice now without it - no problems). Lastly a little splash of milk (less than 1/4 cup) can help to make the dough more pliable - without changing the texture. Warning these are addictive!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Spongebob7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/755376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-23T05:10:12.857Z",
                "reviewBody": "THESE BROWNIES ARE GREAT I'M EATING THEM AS I TYPE. READING THE REVIEWS BEFORE I MADE THIS RECIPE HELPED ALOT BECAUSE OF THE OTHER REVIEWS I CUT DOWN ON THE SUGAR AND USED A SMALLER PAN TO BAKE THEM IN. THEY CAME OUT REALLY GOOD AND CHEWY JUST THE WAY I LIKE BROWNIES ( I USED 1 AND 1/3 CUPS OF SUGAR BUT COULD HAVE USED 1 AND THEY WOULD HAVE BEEN JUST AS GOOD) OH YEAH I ALMOST FORGOT I USED ONLY 1/2 CUP OF COCOA THEY CAME OUT TASTING JUST LIKE BROWNIES WITHOUT THE OVER POWERING FLAVOR OF COCOA.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DISHDISH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/775033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-12T23:34:12.17Z",
                "reviewBody": "My family and I did not enjoy this recipe very much at all. First of all I think there was way too much sugar and cocoa in it...that's all I could taste was the sugar. I really like a fudgy brownie but this one just did not do it for me. It took about 20mins longer to ensure it was baked and even then we had to eat it with a spoon just as another person mentioned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "HASGR8BOYZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1428332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-13T00:51:40.283Z",
                "reviewBody": "I changed this recipe some to not use butter but the shortening eq. I also melted this down and mixed the cocoa completely then added the sugar using 1/2c. at a time to taste the sweetness. These are too dense to be baked in a 8x8 pan... you should use 9x13 as stated. Parchment paper is also a must. I did not grease mine mostly because it is parchment paper you aren't supposed to that's the idea. Please view the picture I posted that shows up close along with a measurement of 1/8\". Yes these are thin by height means. They are not spongy like cake. They are very rich. If you are not looking for as described do not make this you won't be happy. I did bake at 300 for 33ish minutes. I always feel airpressure and altitude play a part in things not baking properly for some. I am not much above sea level summer barometric pressure is fair (not rainy or dry)... baked perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KDL1221",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310047/"
                }
            }
        ]
    }
]