[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/854/desserts/cookies/refrigerator-cookies/",
                    "name": "Refrigerator Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11295/white-velvet-cutouts/",
        "name": "White Velvet Cutouts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F639286.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "1999-02-24T00:11:24.000Z",
        "description": "This is an excellent cookie to decorate.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "1 (3 ounce) package cream cheese",
            "1 cup white sugar",
            "1 egg yolk",
            "2 ½ cups all-purpose flour",
            "½ teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cream the butter, cream cheese and sugar together until light and fluffy. Add the egg yolk and the vanilla. Stir in the flour. Gather the dough into a ball and chill overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured board, roll dough out to a thickness of 3/16 inch. Cut into desired shapes and place onto an ungreased baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 12 minutes or until edges are lightly browned. Let cool. Leave the cookies plain or decorate with your favorite icing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Refrigerator Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Glenda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.674603174603175,
            "ratingCount": 126,
            "itemReviewed": "White Velvet Cutouts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "108.2 calories",
            "carbohydrateContent": "12.3 g",
            "cholesterolContent": "21.8 mg",
            "fatContent": "6.1 g",
            "fiberContent": "0.2 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "43.7 mg",
            "sugarContent": "5.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-12-05T14:27:51.547Z",
                "reviewBody": "I make these every year with my children at the request of my entire family.  I suggest rolling them out with a mixture of 1/2 flour and 1/2 powdered sugar for best results.  The frosting recipe that goes with these is as follows: 3 1/2 c. conf. sugar, 3 tbsp. butter softened, 1 tbsp. shortening, 1/2 tsp. vanilla extract, 3-4 tbsp of milk.  This frosting recipe dries quickly and has a nice shine due to the crisco.  Just wanted to share seeing that I would be lost during the holidays without this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIRABLUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/773830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-01T16:33:54.673Z",
                "reviewBody": "Wow are these ever good and just as the submitter describes \"an excellent cookie to decorate\".  This has to be some of the easiest (and tastiest) dough to work with for cut-out cookies.  It's easy to roll out and they hold their form during baking.  I increased the amount of white sugar by 1/4 cup and after adding the flour I added 1/4 cup of confectioners' sugar.  I let chill for two hours in the fridge (overnight seemed a bit excessive).  I rolled the dough out onto parchment paper that I lined with a mixture of flour and confectioners' sugar and these baked up beautifully - light, crisp, and buttery with just the right amount of sweetness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-16T12:06:56.967Z",
                "reviewBody": "I've been making these cookies for years I'm glad to see that someone finally posted the recipe here on All Recipes. I've lost my original recipe so I searched on the internet and ended up here. Thank God! Don't know what I'd do without this recipe. My friends and family absolutely love these cookies! They hold their shape and taste really good with icing (I use royal icing) or plain. I even have a habit of eating the dough. hee hee The cream cheese makes them very soft and rich. This is by far the best cookie recipe I've ever used...by the way they are NOT sugar cookies. Perhaps that's why they are called White Velvet Cutouts...so if you're looking for a traditional sugar cookie these are definitely not it. If your dough is sticky (which sometimes mine is...think it has to do with condensation during refrigeration) just use alot of flour when kneading and rolling. Give them a try you will not be disappointed with these cookies!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RS3560",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1182935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T07:29:32.017Z",
                "reviewBody": "Great cookie! Glad I read the warnings that it was not a sugar cookie or I would have expected it to be sweeter. I actually dipped my cut outs in chocolate. 1c. chips to 2T. crisco. My husband said they reminded him of milano cookies that way. I plan to do them again with my cookie press and sandwich the chocolate like a milano. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDENICOL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1011559/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-30T17:40:49.857Z",
                "reviewBody": "I thought these were exceptionally tasty but my family thought they were only ok. I make many different recipes of sugar cookies and this was not one of their favorites (but I suppose it's not to be thought of as a sugar cookie). I also found the dough to be extremely sticky. Yes refrigeration helps but it's still a very sticky dough. I rolled it between 2 sheets of parchment and used flour. After I rolled it between the 2 sheets of parchment I placed that whole layer on a cookie sheet and placed in the freezer for about 15 minutes - this made the cookie cutter's job alot easier especially since the shapes that I was making were somewhat ornate. If you are decorating your cookies with detail then I think this is a good recipe because the cookie does not lose it's shape while baking. You can definitely taste the cream cheese in these cookies. They are delicious but it does not taste like a true sugar cookie if that is what you are looking for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "nilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1462254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-08T21:28:07.143Z",
                "reviewBody": "This is hands down the best cutout recipe out there! They come out perfect in shape and are great if you want a lot of flavor and not too much sweet. I love to decorate cookies and now use this recipe as my go-to for cut outs. They decorate really well with the sugar cookie icing from this site (which also tastes very good!) or if you want them to taste like little cheesecakes (which my husband begs for) use the cream cheese frosting II recipe also from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "apidaegirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2341040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T16:14:34.84Z",
                "reviewBody": "This is one of the best sugar cookie recipes I've ever made. Many sugar cookie cut-outs that I've tried end up tasting pretty bland but these have a wonderfully rich flavor from the cream cheese that makes all the difference in the world. If I don't want to mess with the precision of frosting I often just glaze them with a mixture of confectioner's sugar a splash of corn syrup and enough milk to make it spreadable. Gets rave reviews every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENSPIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/803037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-29T20:39:06.28Z",
                "reviewBody": "I've had better sugar cookies but I really like the unique flavor that the cream cheese gives these ones. Once you taste the dough it's hard to make yourself make the cookies! Two notes: After refrigerating the dough overnight it was actually TOO stiff to be worked with (but working with it for ten minutes and letting it warm up made it just fine). Also don't let the numbers fool you--you have to make awfully small cookies to get 6 dozen out of this recipe. I used a fairly large pumpkin-shaped cutter and only got just over two dozen. They really are tasty though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1520985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T16:14:47.293Z",
                "reviewBody": "These were the best sugar cookies I have ever made! Much like the shortbread cookies from panera bread. I used them for christmas cookies. but I didn't even frost them. Still have a batch in my fridge to use. Definately refridgerate for at least 5 hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina Hughes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/961852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-19T18:30:26.873Z",
                "reviewBody": "I thought these were average cookies. I also used light cream cheese. They were very easy to roll out and cook. Refrigerate them a bit before putting them in the oven if they get too warm to prevent spreading. I was very pleased that they didn't spread much at all. The negatives for us were: 1) too much butter made for a very crunchy/crumbly cookie and a bit greasy 2) not sweet enough - I didn't want a very sweet cookie but I didn't like these without icing 3) just not a whole lot a flavor. they are a lot like cookie bouquet cookies I think - and I'm just not a huge fan so I guess you just have to like the right kind of cookie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "AGGIEMOM03",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1418063/"
                }
            }
        ]
    }
]