[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11310/cinnamon-sugar-butter-cookies-ii/",
        "name": "Cinnamon Sugar Butter Cookies II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F409063.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-03-26T00:03:32.000Z",
        "description": "This recipe is meant to mimic a Mrs. Fields cookie - for those times you can't get to the mall cookie shop!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "3 tablespoons white sugar",
            "1 tablespoon ground cinnamon",
            "1 cup dark brown sugar",
            "½ cup white sugar",
            "1 cup butter, softened",
            "2 eggs",
            "2 teaspoons vanilla extract",
            "2 ½ cups all-purpose flour",
            "¾ teaspoon baking soda",
            "¼ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the 3 tablespoons white sugar and the cinnamon in a small bowl and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend dark brown sugar and white sugar in a large bowl with mixer on medium speed. Add butter and blend until grainy. Add eggs and vanilla extract, mixing until light and fluffy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk flour, baking soda and salt together in a separate bowl. Add to sugar mixture, mixing at low speed just long enough to combine. Overmixing makes tough cookies!\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough  into 1inch balls, then roll each ball into cinnamon-sugar to coat. Place cookies on ungreased cookie sheets and bake at 300 degrees F (150 degrees C) for 18 to 20 minutes. Remove from sheets and let cool on racks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DARBYANNE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.659863945578231,
            "ratingCount": 294,
            "itemReviewed": "Cinnamon Sugar Butter Cookies II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "239.9 calories",
            "carbohydrateContent": "33.3 g",
            "cholesterolContent": "47.8 mg",
            "fatContent": "11 g",
            "fiberContent": "0.7 g",
            "proteinContent": "2.6 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "169 mg",
            "sugarContent": "19.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-26T22:39:51.967Z",
                "reviewBody": "I feel compelled to review this because it represents the beauty of allrecipes! I needed a cinnamon cookie recipe, found this one, read the rave reviews and gave it a shot. This is a very delicious cookie. I followed the instructions exactly (and I did also chill the dough as others did for at least 30 minutes) and they turned out perfectly. I used a tablespoon to measure out each cookie and the recipe made exactly one less of 4 dozen cookies! The cinnamon/sugar mixture was just right - not too cinnamon-y and enough to cover all the cookies. I see some have experienced dough too difficult to form into cookies - the key is to not have the butter TOO soft when mixing and definitely chilling before forming. The idea others have had to cut the cinnamon and instead add M&Ms is interesting. The difference is this butter cookie recipe has more brown sugar than white sugar which results in a more molasses-tasting cookie and I think chewier too, just FYI. Overall, I would highly recommend this! I'm not a huge fan of cinnamon and I love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOEVLUGSOORD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/412198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-15T23:37:42.373Z",
                "reviewBody": "Great recipe! These cookies are fantastic. I was looking for a recipe to make cookies like the Mrs. Fields' Sugar-Butter cookies with M&Ms in them. I omitted the cinnamon from this recipe and left the rest as is...when the dough was mixed I folded in about a cup and a half of M&Ms. I chilled the dough in the fridge for 30 minutes then rolled it into balls...I wanted my cookies monster sized (for gifts) so this batch made about 18 monster sized cookies. They turned out excellent!! Crispy around the edge soft and chewy in the middle and with a great butter/brown sugar flavor. One caution: don't overbake these! They will be VERY soft in the center when you take them out of the oven but don't be fooled! If the edges are crispy and the cookies are a light golden brown color then they are done....take them off the cookie sheet to cool and the centers will set up to be chewy and wonderful. I am going to try making these again with the cinnamon because I think that would be delicious too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/852064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-08T18:20:39.293Z",
                "reviewBody": "This cookie was delicious. The first time I made these cookies I didn't read the directions very carefully and added in the cinnamon sugar into the batter and had to make an extra amount of it. I thought they might turn out too cinnamonny but they were perfect. These cookies were so soft and moist. I made a batch for my class at school and they were gone in an instant. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sweet Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-04T23:12:24.38Z",
                "reviewBody": "I tinkered with the recipe a llittle but the results sure panned out for it. I wanted a cinnamon cookie with bold cinnamon flavor so I added a teaspoon of cinnamon to the batter as well as a 10 oz. bag (1-2/3 cup) of cinnamon chips. I don't like flat cookies so I made sure to chill the dough well. Finally I was not comfortable baking these at such a low oven temperature so I baked them at the more conventional temperature of 375 degrees for 8-9 minutes. They spread out to just the right thickness neither too flat nor too thin. What did surprise me is how petite they turned out to be only about 2 inches around. They're buttery cinnamon-y soft yet chewy. Mom and Hubs were eating these before they even cooled and immediately proclaimed them a winner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-21T03:42:10.153Z",
                "reviewBody": "Ridiculous! The entire batch was gone in 48 hours and my family only had about a good 6 cookies. Sigh. I ought to be ashamed of my self...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MECHELLE09",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/317018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-02T01:46:03.637Z",
                "reviewBody": "Wow. I was wary with all the reports of flat cookies but these turned out fluffy and rounded much like muffin tops as described by a previous reviewer. I did alter the recipe by using 2 cups whole wheat flour and the remaining balance using white flour. Chilled the dough for an hour before easily forming them into perfect balls. I also added about a teaspoon of cinnamon to the dough. Used a food processor to cream the sugar and for the final addition of dry ingredients to wet processed until just barely mixed. Yummy yummy. Cake-like consistency with a crispy outside. Cinnamon lovers rejoice. Can't stop eating them. HELP! Evil recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1598298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-28T17:17:49.73Z",
                "reviewBody": "Absolutely fabulous! I follow the recipe exactly except for the vanilla. I always add twice the amount of vanilla. So delicious! Over beating really does ruin this cookie so make sure so be careful when mixing! Over all one of my favorites!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2600924/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-17T11:40:16.6Z",
                "reviewBody": "Best cinnamon cookies I have ever made! My boyfriend was teasing me about the fact that my cookies didnt taste as good as store-bought kinds they lacked that \"je ne sais quoi\" and never turned out crispy or chewy enough. Well this recipe showed him! The cookies turned out wonderfully crispy on the outside and moist chewy on the inside irresistable! I had to half the recipe the next time so we wouldnt eat too many of them! The second time around I made a depression in the centre of the cookie after rolling in cinnamon mixture and put in a teaspoon of raspberry jam delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2342788/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-15T03:12:40.597Z",
                "reviewBody": "These cookies were fantastic. So moist and chewy...even after 2 days. I added raisins but other than that I didnt change a thing! Think I am going to make some tonight for my girlfriends! made these cookies again for a second time. This time i used whole wheat flour instead of all purpose flour 1/4 t. of baking powder to make them rise more added a few shakes of nutmeg to the dry mix before adding it to the wet ingredients and baked them in a 375 degree oven for 11 minutes. I also added the raisins again. They came out even better the 2nd time!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "apottsluv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2997682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-17T19:49:55.987Z",
                "reviewBody": "I'm quite sure I fallowed the recipe to a T. But they came out flat and greasy! Next time I would use more flour and chill the doug before baking. Maybe that would help? Had high hopes for these turned out to be a bummer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "mindably",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3892835/"
                }
            }
        ]
    }
]