[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/847/desserts/cookies/fruit-cookies/",
                    "name": "Fruit Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17521/desserts/cookies/fruit-cookies/raspberry/",
                    "name": "Raspberry",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11326/raspberry-and-apricot-rugelach/",
        "name": "Raspberry and Apricot Rugelach",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4576277.jpg",
            "width": 1419,
            "height": 960
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "A yummy and extra fruity version of this traditional cookie.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "1 (8 ounce) package cream cheese, softened",
            "1 teaspoon vanilla extract",
            "¼ teaspoon salt",
            "2 cups all-purpose flour",
            "¾ cup white sugar",
            "1 cup chopped walnuts",
            "¾ cup dried apricots, chopped",
            "¼ cup packed brown sugar",
            "1 ½ teaspoons ground cinnamon",
            "½ cup seedless raspberry preserves",
            "1 tablespoon milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In large bowl, with mixer at low speed, beat margarine or butter with cream cheese until blended and smooth. Beat in vanilla extract, salt, 1 cup flour, and 1/4 cup sugar until blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With spoon, stir in remaining flour. Divide dough into 4 equal pieces. Wrap each with plastic wrap and refrigerate until firm, at least 2 hours or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Prepare Filling: In medium bowl, with spoon, stir walnuts, apricots, brown sugar, 1/4 cup plus 2 tablespoons white sugar, and 1/2 teaspoon cinnamon until well mixed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line 2 large baking sheets with foil and grease foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On lightly floured surface, with floured rolling pin, roll 1 piece of chilled dough into a 9-inch round, keeping remaining dough refrigerated. Spread dough with 2 tablespoons raspberry preserves. Sprinkle with about 1/2 cup apricot filling; gently press filling onto dough. With pastry wheel or sharp knife, cut dough into 12 equal wedges. Starting at curved edge, roll up each wedge,  jelly-roll fashion. Place cookies on foil-lined cookie sheet, point-side down, about 1/2 inch apart.  Repeat with remaining dough, one-fourth at a time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In cup, mix remaining 2 tablespoons sugar with 1 teaspoon cinnamon. With pastry brush, brush rugelach with milk. Sprinkle with cinnamon-sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake rugelach at 325 degrees F (165 degrees C) on 2 oven racks about 30 to 35 minutes until golden, rotating cookie sheets between upper and lower racks halfway through baking time. Immediately remove rugelach to wire racks to cool. Store in tightly covered container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Fruit Cookie Recipes",
            "Raspberry"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.651515151515151,
            "ratingCount": 66,
            "itemReviewed": "Raspberry and Apricot Rugelach",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "115.9 calories",
            "carbohydrateContent": "12.3 g",
            "cholesterolContent": "15.3 mg",
            "fatContent": "7.1 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "54 mg",
            "sugarContent": "7.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-23T02:18:31.937Z",
                "reviewBody": "I tried this recipe for the first time for my Aunt and Uncle for Hanukkah. My uncle is Jewish, my Aunt (and family) are not. I bought a Hanukkah card which had a reference to rugelach, so I found out what it was and decided to try it.\nI find that this recipe calls for speed when handling the dough from frig to oven. Also the amount of raspberry filling had to be cut in half due to the fact that the first batch burnt because of the filling spilling out from the insides while baking. I basically painted the filling on with my pastry brush and that was all I used. I had better luck with the second batch and plan on making it again as with only half the cookies(to give away) there aren't any for me! I did try them and they were delicious!!! \n*****************************************\nOk, I made these again and thought I'd share a tip concerning handling the dough. When I make these, I now separate the dough into 4 equal pieces. I take each individual piece and put it between two pieces of wax paper (before refrigerating), I then roll out the dough, while it's between the wax paper and refrigerate them with the wax paper intact. After 10 minutes or so, just peel off the top layer of wax paper and continue with the recipe. It makes it sooo much easier. Trust me! Good luck:)\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deborah Via Dixon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2646912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-25T20:33:50.337Z",
                "reviewBody": "These turned out FANTASTIC, and were quite addicting. I'm pretty critical about my baking, and these were one of the few things that I was able to call a success--to my roommate's astonishment (\"you've never said that before!\") Be sure to FOLLOW DEBORAH'S ADVICE (see previous review) about rolling out the dough between 2 sheets of wax paper before refrigerating--makes it so easy. I divided the dough into 4 balls, rolled each out between 2 sheets of wax paper, and refrigerated them for 20 min while i made the filling. Make sure that when you peel off the wax paper it isn't sticking to the dough--if so, put it back for another 10 min. For the filling, I only used 2 T of sugar, and it was just right. I used 1 T of raspberry jam and it didn't ooze everywhere, and I baked them on parchment paper lined baking sheets. I followed another reviewer's advice of placing them, rolled up and ready to go in the oven, into the fridge first for another 20 min before baking--this ensured that they were nice and flaky. Mine only needed 25 min in the oven. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINFORJOY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1390647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-03T15:58:08.56Z",
                "reviewBody": "I've used this recipe for years.  It is the best tasting cookie.  Don't let the dough get warm or it will get sticky.  I take 1 ball at a time out of the refrigerator to work with.  I also add 3/4 c of chopped golden raisins to the filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "momofmulli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/499401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-20T04:06:59.627Z",
                "reviewBody": "The taste was spot on for rugelach flaky dough and a delish filling. I used raspberry preserves with seeds which worked fine. I anticipated problems with the dough but it was actually quite simple to roll out place the filling on roll up & cook. The only problem I had was a few of them came undone and the filling spilled out. Those few didn't look good but still tasted great! Next time I will freeze the rolled cookies on cookie sheets for 30 minutes before baking I had success with this trick in another rugelach recipe I tried (after this one). Also be sure to use wire racks not paper towels to cool them the paper towel stuck to the filling. Will definately make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mbark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2217363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-27T23:11:32.76Z",
                "reviewBody": "Superb rugelach. Actually 4-1/2 stars only because the dough is one of the most difficult I have ever worked with. Two things necessary however when working with it - speed and patience. It needs to be chilled thoroughly at all times. As suggested I rolled it into rounds (used a pot lid to mark the 9\" circle on the waxed paper) between two sheets and refrigerated the sheets for over an hour. Once spread with jam and filling the dough warmed fast and became sticky so I couldn't roll the crescents at that time. Had to put the filled circles back into the fridge for another 20 minutes and halfway through shaping each circle had to re-chill for 5-10 minutes. Just know that these are labor-intensive. But you'll be rewarded with a lovely tender pastry better than any rugelach from a bakery. Buying parchment is not necessary. You can easily use foil instead shine side DOWN. Gently loosen them from the foil as soon as they get out of the oven as a bit of the jam and/or sugar will melt out. If you have lots of time you're going to be very happy with the result.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-28T21:04:55.84Z",
                "reviewBody": "Fantastic! I altered it a bit to accommodate my guests. I made three different types: raspberry blackberry and apricot. I only used preserves in each of them so no chopped apricots at all. Very easy and very tasty:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MGienger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4142673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-02T22:25:42.913Z",
                "reviewBody": "Easy as pie! and soo good. I added Almond extract to the pastry dough. You would not beleive the aroma that comes out of the oven!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefSuddeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-03T19:36:28.187Z",
                "reviewBody": "DELICIOUS!! This was my first attempt at making rugelach (I'm not Jewish)--made them for my boyfriend (who is Jewish) and also for my co-workers for Hanukkah. I gave some to my boyfriend to try and he loved them and asked me where I got them. He couldn't believe it when I told him I had made them!!! He was thoroughly impressed (and I was proud as a peacock!) I had Jewish co-workers of mine saying that they were the best rugelach they had EVER HAD!!! What a compliment! This recipe is just incredible. Highly recommended. Happy Hanukkah everyone! =",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZCHAO74",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/511187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-21T18:44:31.997Z",
                "reviewBody": "This is the easiest and the tastiest treat one could make. I am so bad at baking it's not even funny. But these turned out so good my husband couldn't believe that he could actually eat and enjoy things that came out of my oven. I recommend it to everybody.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SIBERIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-24T17:15:44.047Z",
                "reviewBody": "I made these today and was very disappointed. While the taste was delicious the dough was extremely difficult to work with even after being in the fridge before rolling out between two sheets of parchment. It was very soft so after rolling and spreading with the jam (I used Ikea's blueberry and raspberry jam)and apricot mixture I put the triangles back in the fridge because the dough was too soft to roll. After an hour I tried to roll them up and first they started to crack and then became unmanageably soft within minutes. I finally had to just make mounds of dough and filling and bake them. I won't make them again with this dough but I've decided to use pre-made puff pastry sheets. I can get 4 X 4 inch squares here. I will cut each on diagonal and roll them up and bake them. I know they won't be rugelach but at least they will be easier to do and look presentable when finished.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Richard Anthis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6285345/"
                }
            }
        ]
    }
]