[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/720/world-cuisine/european/dutch/",
                    "name": "Dutch",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11433/banket/",
        "name": "Banket",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F677776.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-12-04T02:34:47.000Z",
        "description": "My husband's family is Dutch and this is a recipe from the Netherlands that is a great tasting pastry using almond paste.   Enjoy!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 strips",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "1 cup butter",
            "½ cup water",
            "1 ½ cups almond paste",
            "2 eggs",
            "¾ cup white sugar",
            "¼ teaspoon almond extract",
            "1 pinch salt",
            "1 egg white, beaten"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cut cold butter or margarine into flour until the mixture has a crumb-like texture. Make a well in the center, add cold water. Mix together until the mixture forms a ball. Do not overmix. Chill dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (225 degrees C). Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, blend together almond paste, eggs, 3/4 cup sugar, almond extract and salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough in 4 parts, and roll into 15 inch strips.  Place filling along the center of each long strip of dough. Roll up, and pinch the ends to seal. Place strips 2 inches apart on cookie sheet.  Brush with egg white, and sprinkle with the remaining sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 20 minutes, or until golden.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Dutch"
        ],
        "recipeCuisine": [
            "European",
            "Dutch"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "BKET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7101449275362315,
            "ratingCount": 69,
            "itemReviewed": "Banket",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "201.7 calories",
            "carbohydrateContent": "21 g",
            "cholesterolContent": "35.8 mg",
            "fatContent": "12.1 g",
            "fiberContent": "1 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "64.1 mg",
            "sugarContent": "6.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-05T19:28:15.963Z",
                "reviewBody": "I am Dutch and have been making banket since I can remember with my mom.  Here are a couple of tips that we use to make this:  Make smaller loaves.  The big ones tend to burst easier.  Simply cut the large square you roll out into quarters.  Very simple.  We also use water to seal the seam.  Makes it stick better.  Best thing we discovered with banket is to line the baking sheet with parchment paper to keep the loaves from sticking and help them brown more evenly.  Finally, you can brush the banket with milk instead of egg white.  Hope this is helpful.  I love this pastry and am going to be making a huge batch of it soon!  Oh, and I totally agree with the person who recommended putting the dough and filling into the fridge overnight!  I don't know how you'd roll it out if you didn't.  Also keep the dough you aren't working with in the fridge until you are ready to use it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2658025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-04T05:51:31.903Z",
                "reviewBody": "My mother made banket for years! I finally got the recipe from her about 3 years ago I make it every Christmas and it's gone in a flash. I love making banket and look forward to when I can make it. I place my dough and filling in the fridge overnight it makes it easier to roll out the dough and also wait until the filling is room temperature before spreading it on the dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patience Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1273376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-15T03:23:47.013Z",
                "reviewBody": "After years of making Banket for Christmas and not getting the flaky crust I desired I tried this one and voila it was great. Every time I take a bite I think of my Dutch gramdmother with her yard long braids wrapped around her head and her full apron on working in the kitchen. Thanks for the help.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARILYN GREEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/244208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-23T18:27:07.84Z",
                "reviewBody": "This is such a great recipe. I followed the ingredient list exactly except I used an entire egg for brushing the crust instead of just an egg white. I skipped the almond extract too. ( I actually weighed the almond paste so I don't ever have to measure it in a measuring cup again. I shaped the paste with my hand to fit in my measuring cup. I pushed small parts down into the cup to make sure there were no air pockets. It weighed 14 oz.) I chilled the dough and the filling overnight. I rolled the dough into 15\" x about 6\" strips on the counter using a lot of flour on the dough counter and my hands. Don't be afraid to use too much flour. APRON! Once the dough was rolled out I sprinkled a bit of flour onto the dough's surface before placing 1/4 of the almond mixture onto the dough. Then I sprinkled more flour on top of the almond mixture and my hands so I could roll it into a long snake. Roll the filling towards the edge of the dough and then roll it up like a snake. Scrape excess flour off the roll with a paper towel before placing onto the pan. I dipped my fingers into water to seal the dough to itself especially important on the ends. I cut slits along the entire top of the pastry about 1/2\" apart. Then I brushed the egg on top. I used a Pampered Chef baking stone (rectangle flat one) and baked all of it at 425 for 25 minutes. PERFECT! They browned evenly and slid right off the stone evenly browned top and bottom. (I like stones for this and many other reasons.) ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2870805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-24T18:01:05.637Z",
                "reviewBody": "I have been making these almond pastries for about 50 years. Friends and relations often ask me for more specific directions so I wrote these out and thought I would share it here. 1. Divide the dough into 4 equal parts. 2. On a floured pastry cloth with floured hands roll one part out snake-like about 1\" in diameter. 3. Using a sleeved rolling pin slightly flatten the \"snake\" long-ways until about 20\" long. 4. Continue rolling short ways until the strip is about 5\" wide. The long edges can be a little thinner than the middle part. 5. If you are using a pastry bag or plastic bag for the filling cut about 1\" off of the tip. (Cut edge will also be about 1\" wide.) 6. Fill the bag with the almond filling and squeeze a tube of the filling down the middle of the strip of dough leaving about 1 1/2 inches on each end free of filling. (The \"rope\" of filling should be about 1\" in diameter.) 7. Turn the short ends of the pastry in. 8. Fold one long edge loosely over the rope of filling. 9. Using your fingers apply water to the other long edge. 10. Loosely lap the wet edge over the other edge. (Filling will expand when baking so leaving it some space will help avoid leakage.) 11. Lightly press the edges down with the back of a fork. 12. Transfer the tube to the baking sheet. 13. Form into desired shape. I like to make \"J's\" They are easy and can be a candy cane shepherd's crook or \"J\" for Jesus. 14. Brush the pastry with the egg whites. 15. Bake as directed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joy-in-VA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3056967/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T22:47:00.747Z",
                "reviewBody": "I am in a dilema rating this recipe. If it were only for the taste I'd give it five stars. However I felt that this recipe was really not well explained at all. For someone who doesn't know how to make bankets or never had them b4 wouldn't easily understand what to do. It says to cut the dough in four but does that mean you end up with only four servings? Do we cut them into servings after baking? Also there is no way of knowing how long to chill the dough. I chilled it a few hours. I rolled it kinda thin cut into squares filled the centre of each square with filling and rolled up making sure to pinch the edges well. It was so hard to work with that I ended up making only abt 4 squares into fingers and rolled the rest into a circle placed on cookie sheep lined with parchmint filled with the rest of filling and topped with the rest of the dough as if I were making a pie(without the plate). The filling overflowed while baking came out from everywhere! It was sooo messy but sooooooo deliciously addictive hehe. Anyway I cut into pieces as neatly as I could and served to the family. Everyone loved the taste but thought that maybe there was a little too much butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-03T21:10:54.687Z",
                "reviewBody": "I have a recipe for Banket for years. It calls for 1/4 cup corn starch in the filling. I have also heard people use powered sugar in the filling instead of regular sugar. I don't use almond flavoring the paste is enough. I find it easier to devide the filling into 4 parts and then to role it into a log before putting in the pastry. to picture it think of a stick or log. My husband (German not Hollander like me) calls it log roll. I can't buy it here in Minnesota so I need to make it myself. My family back in Michigan looks forward to my bringing it at Christmas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joannekh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-12T17:39:59.51Z",
                "reviewBody": "This is the only recipe I use or even know of and everyone just loves it. If I don't have fresh almond paste I have used solo almond filling mixed with a tube of solo almond paste with success. I just mixed the two together and added an egg. This crust is flaky and tender and I use it for pies as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adrian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2732220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-23T22:17:13.28Z",
                "reviewBody": "Very yummy recipe! The pastry crust came out nice and flaky. One thing that should be added is to cut vent slits every inch and a half in the top. Also I think it might come out a little better if baked at a slightly lower temperature. 425 perhaps? If you sprinkle the sugar on (or roll it in sugar) before putting it on the cookie sheet you won't get burned sugar spillage while baking either. All over a great recipe though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MELISSAWF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1034717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-15T13:53:40.643Z",
                "reviewBody": "Okay this is the first time I made anything like this. I used to watch my Michigan Grandma make Banket. Heres the thing though there seems to be some ingredients not in the dough. My dough would not hold together to roll out. I tried adding a smidgen of milk and that helped a little. Also with the dough it tasted powdery on the finished Banket. It wasn't flakey either. I don't understand what went wrong. I can't ask my Grandma since she is long passed. The finished Banket doesn't look anything like what I remember. This is so disappointing. Also I didn't understand why the recipe called for more stuff to be added to the chilled paste. That didn't make any sense to me and in fact caused the filling to ooze out during the baking. I'm super disappointed. I wish someone could explain to me about what went wrong all through the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnySabrina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22938902/"
                }
            }
        ]
    }
]