[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
                    "name": "No-Bake Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12959/desserts/pies/no-bake-pies/peanut-butter-pie/",
                    "name": "Peanut Butter Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12130/peanut-butter-pie-i/",
        "name": "Peanut Butter Pie I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5766848.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1998-04-24T20:36:30.000Z",
        "description": "This pie has a chocolate crumb crust and a creamy peanut butter filling. Garnish pie with grated chocolate or chocolate cookie crumbs, if desired.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT4H40M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "1 ¼ cups chocolate cookie crumbs",
            "¼ cup white sugar",
            "¼ cup butter",
            "1 (8 ounce) package cream cheese, softened",
            "1 cup creamy peanut butter",
            "1 cup white sugar",
            "1 tablespoon unsalted butter, softened",
            "1 teaspoon vanilla extract",
            "1 cup heavy whipping cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1 1/4 cup cookie crumbs, 1/4 cup sugar, and 1/4 cup butter; press into a 9-inch pie plate. Bake in preheated oven for 10 minutes. Cool on wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a mixing bowl, beat cream cheese, peanut butter, 1 cup sugar, 1 tablespoon butter, and vanilla until smooth.  Whip the cream, and fold into the peanut butter mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently spoon filing into crust. Garnish pie with chocolate or cookie crumbs if desired. Refrigerate for several hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "No-Bake Pie Recipes",
            "Peanut Butter Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.685082872928176,
            "ratingCount": 362,
            "itemReviewed": "Peanut Butter Pie I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "651.8 calories",
            "carbohydrateContent": "51.9 g",
            "cholesterolContent": "91 mg",
            "fatContent": "46.7 g",
            "fiberContent": "2.5 g",
            "proteinContent": "12 g",
            "saturatedFatContent": "21.7 g",
            "servingSize": null,
            "sodiumContent": "384.8 mg",
            "sugarContent": "39.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-14T10:18:55.2Z",
                "reviewBody": "I needed a quick dessert for an impromptu dinner and decided to try this recipe.  It was absolutely delicious and a big hit.  I did make a few minor adjustments based on feedback from a friend of mine who made it.  I cheated and used a Keebler chocolate crumb crust (something I rarely do but was pressed for time).  I decreased the sugar to 3/4 c and increased the whipping cream to 1.5 c to make it a little fluffier.  I also popped it in the freezer for a few hours before serving.  Wow!!!  I'll certainly be making this again and again and again....well, you get the picture! :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill McLaughlin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20594/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-01T01:05:23.67Z",
                "reviewBody": "Awesome pie!  I did it a little differently though.  I used a deep dish pie crust, baked it, let it cool, then applied melted chocolate chips to the crust.  I put the crust in the refrigerator so the chocolate would solidify.  Then added the peanut butter pie filling.  \r\n\r\nIt was a huge hit with everyone.  Thank you for sharing this one. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LORRIEC13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/464865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-17T23:01:10.21Z",
                "reviewBody": "I just won 1st place (and $50!) at the company's pie baking contest with this recipe.  The only alteration I made was to double the cookie crust (that's the best part in my opinion).  And I decorated the top with reeses peanutbutter cups.  Yee haw!  Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rookiechef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1578215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-18T02:57:28.043Z",
                "reviewBody": "Half an hour after he was done eating it, Hubs was still talking about how “D” good this pie was.  There are a lot of similar peanut butter pie recipes, but the differences in this one pay off in a big way – a homemade rather than purchased cookie crust and real, fresh whipped cream rather than “frozen whipped topping.”  All are easy to make but the couple of extra steps it takes to use these higher quality ingredients are worth it.  This is a dessert for serious dessert and/or peanut butter lovers.  Thick and rich (but not overly sweet), a little goes a long way.  Yet no sooner do you finish it and you’re already thinking about your next piece!  A garnish is pretty – chopped peanuts perhaps, mini chocolate chips, crushed cookie crumbs or, as I did, a drizzle of chocolate syrup and some chopped peanut butter cups. Be careful not to overdo it, however!  The pie is so rich that any more than a sprinkle to dress each slice up would be serious overkill!  Because you’ll cut the slices small, one pie will serve quite a few people! Hubs and I only have two more days in Naples to eat this before we head back home, but I know my plan to have the remaining pie waiting for us in the freezer when we return in a couple of weeks will work out very nicely. Note: For those familiar with the famous peanut butter pie from the Old Ebbitt Grill in Washington D.C. - Hubs said this is \"unequivocally better.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-08T19:00:29.007Z",
                "reviewBody": "Wow...wow. This was so incredible! It was so tasty and just like light, rich silk on the tongue. This is the PERFECT peanut butter pie. I followed directions except for using half brown sugar and a tad more vanilla. I whipped the cream in my stand mixer, put it onto a different bowl,  the heck out of the cream cheese/butter/sugar/PB mixture until it was incredibly light and fluffy, then folded in the whipped cream. It was SO light. \n\nI can think of all kinds of things to do with this. Adding some melted chocolate or white chocolate chips and folding them in, or a tablespoon of chocolate syrup. Or better yet, swirling in some chocolate syrup with a butter knife to create pretty patterns. Adding a tablespoon of chocolate liqeur, chopping up some peanuts and adding them to the crust, using crushed peanut butter cookie crumbs along with the chocolate ones (or doing a layer of each) ... and so on. \n\nThis is going into my \"favourites\" recipe box for sure. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "meatball",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723406/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-04T07:09:18.213Z",
                "reviewBody": "This pie was excellent!! I used a premade graham cracker crust also. I made it the day before and used a tub of cool whip instead of heavy cream I also added a bag of semi-sweet chocolate chips and crumbled reeses peanut butter cups to top I left in freezer over night and then took out and put in fridge until serving that afternoon. It was creamy and decadent. I will be making this one again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSE2MTC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1402750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-19T17:14:42.067Z",
                "reviewBody": "I found that the instructions were not well written.  Being an experienced baker, I should have seen this before I started mixing - but it was late and I wasn't really thinking clearly.  Instead, I ended up with a greasy mess.  You can't just throw the filling ingredients in a bowl at once and expect it to come out right.  First of all, the butter is completely unnecessary. The cream cheese & sugar should be beaten together first, then the peanut butter gradually incorporated.  Even at that, I think this would turn out better using at least baker's sugar - which is a much finer grain - if not confectioners sugar.    That is exactly what I ended up doing after trashing the first attempt and starting over.  It came out very smooth and creamy. For poorly written directions, I can give it only three stars instead of the 4 or 5 that it might otherwise deserve.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JMANSAVAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/621825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-13T14:52:35.903Z",
                "reviewBody": "HEAVENLY......thank you so much for sharing this with me. I made minor changes. Store bought crust and instead of heavy cream I used cool whip. I put this is the fridge and not the freezer and topped with crushed Reese's peanut butter cups. This was so creamy and so rich. A small slice goes a long way but this was so easy and presented beautifully!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bart's Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-29T21:06:43.25Z",
                "reviewBody": "OH MY GOSH! What a pie. This pie will make a puppy pull a train it's that good. I used an Oreo pie crust and put a layer of milk chocolate on the bottom of the crust then put the filling on top of that. I topped with chocolate syrup in lattice pattern. I make 2 pies for a church dinner and got rave reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THEGANGSMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1096230/"
                }
            }
        ]
    }
]