[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
                    "name": "Fruit Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12950/desserts/pies/fruit-pies/peach-pie/",
                    "name": "Peach Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12166/peach-cream-pie-i/",
        "name": "Peach Cream Pie I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5529224.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "1998-05-11T15:12:55.000Z",
        "description": "Yummy Dessert.  Fresh peaches are best, but you can use canned.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 cup white sugar",
            "⅓ cup butter",
            "⅓ cup all-purpose flour",
            "1 egg",
            "1 teaspoon vanilla extract",
            "3 cups fresh peaches - pitted, skinned, and sliced",
            "1 recipe pastry for a 9 inch single crust pie"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a 9 inch pie pan with crust.  Place peaches in the unbaked pie shell.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream together the sugar and butter or margarine.  Add the egg, flour, and vanilla; mix together completely.  Spread this mixture over the top of the peaches.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 300 degrees F (150 degrees C) for 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Fruit Pies",
            "Peach Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mary Douglas"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4523809523809526,
            "ratingCount": 168,
            "itemReviewed": "Peach Cream Pie I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "319.9 calories",
            "carbohydrateContent": "42.3 g",
            "cholesterolContent": "43.6 mg",
            "fatContent": "15.8 g",
            "fiberContent": "1 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "182.2 mg",
            "sugarContent": "28.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-10-18T02:35:28.21Z",
                "reviewBody": "MAKE THIS PIE!   OK, here are some \"tweaks\"...  Reduce sugar to 3/4 C. unless you like it super sweet.  Save yourself alot of time and buy a bag of frozen sliced fresh peaches (just like fresh without the hassle of poaching and peeling fruit).  I also use Marie Callender's frozen pie crust and it has never let me down.  Go the extra step and brush beaten egg over bottom & sides of crust before adding fruit.  Like others, I baked this pie 15 mins at 400, then 45 mins at 375.  Crust was firm (bottom) and flaky around edges.  I also made a streusel topping and sprinkled on top during last 20 mins baking time.  This pie is to die for... thanks Mary!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1214986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-18T22:55:15.497Z",
                "reviewBody": "I made this recipe for 3 men and two teenagers ~ everyone had seconds. I used more peaches than called for (about 4 cups), increased the vanilla to 1 1/2 Tablespoons and added a 1/4 tsp. of cinnamon directly over the fresh peaches. I also added my top crust and baked at my usual pie temperature of 450 degrees for 10 minutes and then 350 for about 45-50 minutes, until the crust was golden brown. I served it with vanilla ice-cream. Everyone raved about this pie. To avoid a soggy bottom crust, try brushing a little beaten egg over it to seal it before adding the fruit filling. This works beautifully with this pie and blackberry pies, too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELLEKW1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1172777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-26T21:30:10.31Z",
                "reviewBody": "WONDERFUL! Very easy pie to make and flew out of the pan. Everyone loved it and everyone wanted the recipe. I did cut the sugar a tad but other than that didn't change a thing. I even used cheap store brand pie crust and was still wonderful. Thanks so much for sharing this one. I've made 3 this week and will make this the rest of the summer. And now that it's fall I subtituted the peaches with apples and added some cinnamin and nutmeg for a wonderful apple pie. I've gotten rave reviews with it. My husband asks me to make it all the time. I also took the recipe and used rolled out biscuits into a muffin tin and diced the apples and placed in the cups on top of the dough and then spooned some of the mixture overtop and it made some wonderful little tarts. Mary thanks so much for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLIE M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1467591/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T19:18:52.717Z",
                "reviewBody": "A great peach cream pie without any cream which was killer because I never have cream around. It tastes luscious (more of a custard than a cream) and it's a good balance of peach to custard amounts. I even happened to have only one frozen pie shell around so this was perfect! Note: The cream mixture is really thick and pasty before baking don't worry it \"melts\" and turns creamy as it cooks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alarose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-04T14:52:26.873Z",
                "reviewBody": "I have always enjoyed peach pie but since my wife passed away it is up to me to make a pie. I used the increased ingredients (vanila spices etc) and baking temperature. I have Parkinsons and have absolutely no sense of smell and so I have to rely on visual inspection to determine doneness It took 10 minutes at 450 degrees plus 50 minutes at 350 to bake. It was perfect!! Yes I will make another Peach Pie (soon)!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KINGSTON434",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1175466/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-12T23:42:00.25Z",
                "reviewBody": "Very nice! I made as a deep dish because I had so many peaches. This pie got rave reviews from hubby and the kiddos. It's a little runny if you try to eat it before it's completely cooled but it's still quite good. Once it had fully cooled it was firm and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MACLEOD26",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/965171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-24T02:48:41.64Z",
                "reviewBody": "I used 1/2 cup Splenda instead of sugar increased the amount of vanilla to about 1 1/2 t. and added about 1t. of almond extract. Also added cinnamon ground ginger and nutmeg. It was delicious crispy on the top and bottom. A keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "becky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1956704/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-15T17:37:41.967Z",
                "reviewBody": "Since something obviously went very wrong with my pies considering all the great reviews (though a couple did mention spillovers) I will give it the highest rating but mine were a disaster and I won't be able to taste them! My friend gave me fresh peaches from her tree and I had enough for two pies. Within ten minutes of putting them in the oven I notice smoke coming from the top of the stove. They were already spilling over! Ten minutes later there were flames. I highly recommend using a deep dish with this pie. I am not new to pie baking and have had pies cook over before but never like this. What a waste of homegrown peaches (I'm feeling sorry for myself). I'm sure if you use a big enough pan they would be wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Connie Beck Schmidt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/679798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T18:37:55.143Z",
                "reviewBody": "This was the perfect peach pie recipe! My 8 year old son asked me to make a homemade fresh peach pie for Christmas dinner dessert. As you can imagine finding fresh peaches in late December is not easy nor cheap. I had to try to ripen them the best I could blanch them to make the peeling easier (although the skin wouldn't come off just from blanching but it DEFINITELY made it easier to peel). I followed the recipe exactly. Note: 5 medium peaches will be more than enough (a little over 3 cups). Also make sure you put little 1/2\" inch foil strips along the edge of the entire pie crust to prevent burning. Take them off after baking and you will have a perfectly lightly browned edging. I will be making this again. I can only imagine how wonderful this pie will be with the big Georgia peaches in season. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K. Andrews",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2204985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-22T13:38:51.94Z",
                "reviewBody": "I chose this pie because similar ones were made with boxed pudding. However the pie was \"SUPER SWEET!\" I thought it seemed like a lot of sugar for the amount of fruit. It took about 4 good sized peaches to make the 3 cups. I used a vegetable peeler and it worked great. I cut the peach slices into about 1/4\" to make sure they were soft after baking. The mixture that is spread on it is kind of thick but does melt down into the peaches. It was almost like a soft sugar cookie dough that goes on top. After it was baked I thought it had kind of a dry looking appearance. To fix that I brushed a light glaze on top and it did look pretty. I wish I would have cut the sugar back considerably and I like sweets. About 2 slices only got eaten unfortunately. I had hopes for a good from scratch peach pie. Possibly cutting back the sugar might help some I don't know.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            }
        ]
    }
]