[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/283/desserts/pies/vintage-pies/",
                    "name": "Vintage Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12187/margarets-southern-chocolate-pie/",
        "name": "Margaret's Southern Chocolate Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F461794.jpg",
            "width": 2896,
            "height": 1944
        },
        "datePublished": "1998-05-18T21:40:39.000Z",
        "description": "A rich, creamy chocolate pie reminiscent of old-fashioned Southern home cookin'!",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "¼ cup unsweetened cocoa powder",
            "¼ cup all-purpose flour",
            "3 egg yolks",
            "1 ⅓ cups white sugar",
            "1 (12 fluid ounce) can evaporated milk",
            "3 tablespoons butter",
            "1 (9 inch) pie shell, baked",
            "3 egg whites",
            "⅛ teaspoon cream of tartar",
            "6 tablespoons white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together the cocoa powder and the flour and pour them into a saucepan. Whisk the egg yolks and 1 1/3 cups sugar. Gradually add the evaporated milk, whisking constantly; slowly pour the milk mixture into the saucepan, whisking until combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook over medium heat, stirring constantly with a flat-bottomed wooden spoon or spatula, until the mixture begins to thicken and coats the back of the spoon, about 15 minutes. Remove the custard from the heat and stir in the butter until melted.  Pour the filling into the baked pie crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the meringue topping: Combine the egg whites and cream of tartar in a clean glass or metal bowl; beat with an electric mixer until foamy. Gradually add sugar, a tablespoon at a time, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks. Spread the meringue over the chocolate filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 10 minutes, or until the tips of the meringue peaks are golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Vintage Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Becky"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.411347517730497,
            "ratingCount": 141,
            "itemReviewed": "Margaret's Southern Chocolate Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "431.6 calories",
            "carbohydrateContent": "62.9 g",
            "cholesterolContent": "102 mg",
            "fatContent": "17.7 g",
            "fiberContent": "1.4 g",
            "proteinContent": "8 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "227.2 mg",
            "sugarContent": "47.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-26T03:03:48.827Z",
                "reviewBody": "I actually made a double recipe of this pie using Splenda instead of sugar and even the meringue turned out great.  I think my Dad ate the pie in less than one day and then wanted the recipe.  One thing I learned (and maybe it's just the case with Splenda substituted) is that using a nonstick skillet is much better than a saucepan.  Even with me constantly stirring, it scorched on two different pans and then did great when I finally moved to the nonstick pan.  One note: If you are subbing Splenda for sugar, you may wish to reduce the Splenda amount slightly from what is called for in sugar quantity - Splenda tends to turn out a little sweeter than sugar.  \n\nGreat recipe - Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TALLGAL21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/671133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-04T04:58:38.903Z",
                "reviewBody": "This recipe is perfect the way it is!  First attempt, I followed other's advice and used 1/3 cup cocoa and omitted the extra 1/3 cup sugar.  The pie tasted allright, but had lots of cocoa lumps and wasn't really presentable.  Second time around I made it according to original recipe and also sifted all dry ingredients - not only was it beautiful, it was delicious (and we didn't think it was overly sweet like others did)!  SO, my advice is to stick with the recipe as is!!  (only thing different I did use Emeril's recipe for meringue).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie Tippit Quimby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/840104/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-10T18:31:51.06Z",
                "reviewBody": "Bullseye! This is a fantastic recipe. The chocolate and sweetness are perfectly balanced. Lumps have always been a major problem with my chocolate pies. Some tips I used to avoid unsightly lumpiness (which is inevitable with recipes like this) was to sift the dry ingredients together stir the liquid mixture constantly and then strain out smaller lumps as it begins to thicken on the stove. The egg proteins will cause some lumps as they cook -- and espcially as you scrape the bottom of the sauce pan with the flat bottom spoon. Fortunately they smooth right out after adding the butter with a little help from the handheld mixer. My end result was a perfectly firm but creamy smooth texture and a delicious flavor. Thanks for submitting this recipe. Reminds me of Mom's chocolate pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scottley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/473745/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-02T20:20:26.67Z",
                "reviewBody": "A very sinfully delicious pie.. Hint: The longer you cook the filling the thicker and fudgier it will be.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1821974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-17T20:01:56.917Z",
                "reviewBody": "Whoever gives this pie less than 5 stars has made a mistake in preparing the pie. The texture is creamy and it is not too sweet. I have been searching for years for a recipe that would rival my mothers'cooks recipe and I have finally found it. The only exception is that Mom's cook used REAL whipped cream (not sweetened with any sugar) instead of meringue.OUTSTANDING. Also be prepared to sit or stand awhile and stir the filling on the stove while it thickens up. Towards the end you might want to have a whisk handy to avoid any lumps.THIS IS A TRUE SOUTHERN RECIPE.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynn Troutman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2316402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-19T16:02:54.33Z",
                "reviewBody": "I tried out this recipe with no modifications. When I cooked the pie filling in a saucepan I stirred constantly cooked it on a medium-low flame and achieved a beautiful non-lumpy mixture. I had no problems with the meringue (although 6TB sugar is way way too sweet 3 or 4 will be much better). The problem is the pie never set. It baked about 20 or 25 min at 325 and even though I knew it was still liquid the meringue was clearly done. The pie filling itself is way too sweet even for my sweet tooth. Honestly just too much sugar. I'm not going to give up on it though. Next time I'm going to 1) cut back on the sugar both on the meringue and the pie filling and 2) use cornstarch to thicken the filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "RedStar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3544563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-12T06:39:42.437Z",
                "reviewBody": "Very good and extremely easy! I like the meringue topping but my kids prefer a whipped topping. Beat 1 c. heavy cream until soft peaks form then add 1/4-1/2 c. confectioners' sugar and vanilla if you like - top with this and it is a sweeter treat - great with coffee:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/107712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-03T00:20:28.5Z",
                "reviewBody": "This was exactly what I was looking for and the whole family said to not change a thing about what I'd done. So what did I do? Per many other reviews saying it was too sweet I reduced the sugar to 3/4 of a cup. I also added a teaspoon of vanilla extract. I cooked the filling on 4 (on a 1 to 8 dial) for exactly seven minutes stirring constantly with a flathead wooden spoon scraping the bottom where the filling wants to thicken up. Then to fight these lumps from the bottom when I pulled it from the heat I used a wire whisk to stir in the butter which I had set out before I began so it would get soft. With the wire whisk I was able to create a completely consistent filling. I poured the filling in into my crust which I had cooked for ten minutes in the 325 degree oven. Then and this is a time the original recipe doesn't give since it uses visual cues to judge I cooked the pie for exactly 24 minutes also at 325 degrees. I cooked it with just the chocolate filling because I prefer whipped cream to meringue. Then I cooled it in the refrigerator over night. It had a perfect texture and a mild chocolate flavor that went great with the crispy flour crust and the sweet whipped cream. My mother father and brother all talked about how great it was.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "goodamateurcook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6995419/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-12T06:37:54.047Z",
                "reviewBody": "This is the best chocolate pie recipe! I have been making the same chocolate pie recipe for over 10 years and this one tops it. This is now the staple for my pies. You can't go wrong with this recipe-its so easy to follow and turned out perfect with no lumping. Thanks for sharing this one Becky.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIXIEGIRL48TH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/640708/"
                }
            }
        ]
    }
]