[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
                    "name": "Fruit Pies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12313/orange-blossom-pie/",
        "name": "Orange Blossom Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F67202.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-07-03T17:27:42.000Z",
        "description": "A delicious and refreshing dessert.  Can also be made with mandarin oranges.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 pie",
        "recipeIngredient": [
            "3 eggs",
            "½ cup white sugar",
            "2 teaspoons orange zest",
            "¼ cup orange juice",
            "4 tablespoons butter",
            "1 cup heavy whipping cream",
            "1 large orange, peeled and segmented",
            "1 (9 inch) vanilla wafer crust"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat the eggs until frothy.  Combine eggs, sugar, orange juice, and rind in a saucepan.  Cook over low heat, stirring constantly, until very thick.  Remove from heat, and stir in butter.  Chill completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whip the cream to soft peaks.  Fold into chilled orange mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange a layer of orange sections in chilled vanilla wafer crust.  Spoon chilled orange mixture into crust, and top with additional orange sections.  Chill until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Fruit Pies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.277777777777778,
            "ratingCount": 18,
            "itemReviewed": "Orange Blossom Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "360.3 calories",
            "carbohydrateContent": "28.2 g",
            "cholesterolContent": "134.4 mg",
            "fatContent": "26.6 g",
            "fiberContent": "0.6 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "12.7 g",
            "servingSize": null,
            "sodiumContent": "191.8 mg",
            "sugarContent": "17.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-15T18:44:42.21Z",
                "reviewBody": "This pie turned out creamy light and delicious with just a few changes I have listed below. When made correctly the filling should be thick enough right away when you finish making it. I will make this pie again! Here are my changes: I only used 2 eggs because 3 eggs seemed like a lot. I used the juice and zest from an entire navel orange. That is about 1 tbsp. zest and 1/2 cup juice. I added a tablespoon of flour to the mixture that I heated on the stove so that it would thicken really well. I cooked and stirred cooked and stirred until the mixture was very thick added the butter and then chilled that mixture for about an hour. I used a Pillsbury pie crust instead of the type listed in the recipe because I have a lot of them in my freezer. I used mandarin orange segments well drained for the bottom. For the whipped cream I whipped it to stiff peaks and added some vanilla and honey for additional sweetness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IndianaAnna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2675180/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-07T15:32:01.89Z",
                "reviewBody": "I made a few small changes. I used mandarin oranges as suggested (large can) no zest and a graham cracker crust--it was what I had on hand. I also substituted 1 1/4 c. whipped cream for the 1 c. whipping cream. It cut down on time. It turned out quite nicely. I will probably be making this alot this summer. It tastes like an orange julius. Yummy. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SKYTONIC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1426239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-18T13:45:50.67Z",
                "reviewBody": "Okay I did not actually get to eat a piece of this pie because I made it for a church function. BUT I did taste the \"meringue\" with a mandarin orange........YUM!!! Wow this pie does taste like an orange julius. I followed the recipe to a \"T\" except I left out the zest and used large can (15 oz.) of mandarin oranges instead. If you use these make sure you drain them WELL. Not just over the sink but dump them on paper towels after that. The reason being you don't want the juice from the slivers to soak the pie crust. It would fall apart when you tried to cut it. Also when cooking the egg/orange juice mixture over the stove really do stir the entire time because you have to watch carefully.....if you dont remove it at the right moment it will be either too liquidy or you will end up with scrambled eggs. You could also save time and cost by using a storebought container of whipped cream instead of whipping it yourself........but I am partial to that \"fresh\" whipped taste. The presentation of this pie is awesome. Little mandarin oranges scattered across the top of the meringue with a layer underneath you cannot see until you slice. I wish I could be at this function to hear peoples reviews but I will definitely make this pie again for the family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MomSavedbyGrace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1366670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-24T22:50:09.017Z",
                "reviewBody": "I used a homemade cinnamon graham crust and a large very WELL drained can of mandarin oranges instead of fresh. I didn't stick mine in the freezer. Mine went right into the fridge until dinner as others suggested. Very creamsicle-like which is wonderful. NOTE: Want a firm pie let it cool in the fridge for a bit before serving. I made mine in the morning and let it set until dinnertime.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-25T18:14:42.243Z",
                "reviewBody": "I would give this 5 stars for taste but like all the others mine ended up a runny mess so I give it a 3 overall. I chilled this for 8 hours then folded in the whipped cream and let it chill over night and it was still ran all over when I cut it. I think I will add a sheet or two of gelatin to the base mixture or perhaps use some cornstarch to thicken up the egg mixture and give it more body next time. It has potential but it's really missing something to keep it from running. In the meantime instead of serving as a pie I layered put it into cups and served it as more of a trifle than a pie. It worked great that way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFBETHPHX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1411508/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-25T17:31:33.56Z",
                "reviewBody": "Great summer dessert. Perfect for a pot luck dinner or barbeque bash. It's fresh tangy and light and quite easy to make. I like it with Nilla Wafers but I prefer to use Pepperidge Farm Chessman Cookies as they don't go mushy and are really pretty on the pie.:o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-24T23:36:46.707Z",
                "reviewBody": "We love this recipe! We have made it several times word for word followng the recipe and it always comes out great! The key to not getting a runny pie is DO NOT FREEZE! As I said we have made it several times and it was always a perfect consistency creamy and fully set. We always chilled it in the refrigerator. The last time I made it it was last minute to bring to a cook-out. I was worried about the timing and being outside so I froze it for a couple of hours before going. By the time dessert came around it had thawed and it was very runny. It was the only time I froze it and the only time it came out runny. So I think the key is chill either to room temperature or in the fridge. An experienced cook at the bbq told me that dairy breaks down when frozen so that's probably what happened it is probably a problem with the cream. We've also tried a few variations that worked out really well - sub lemonade for oj and fresh raspberries for orange slices for raspberry lemonade smoothie pie or mango puree for oj and any tropical fruit (bananas mango slices or stick with oranges) for fresh fruit garnish. I'm making one for a start-of-summer pot-luck at the office tomorrow:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "meredithkd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3810564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-15T01:54:51.617Z",
                "reviewBody": "I added 2 teaspoons of orange gelatin to pie filling to make sure it will not run. I blended filling after i added butter to it and it gave it smooth texture before it was kind of grainy. I used wheeped topping insted of heavy cream.overall very good cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "olgaS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12837034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-01T20:02:48.423Z",
                "reviewBody": "Simple and yummy. My mom made it for Thanksgiving and everyone liked it. She made a cornflake crust (I checked and there is a recipe for such a crust on this web-site if anyone is interested) for it and it complimented it quit nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELIZRA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1469257/"
                }
            }
        ]
    }
]