[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
                    "name": "Fruit Pies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12571/best-cherry-pie/",
        "name": "Best Cherry Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5133434.jpg",
            "width": 2058,
            "height": 1461
        },
        "datePublished": "1999-04-15T07:51:45.000Z",
        "description": "Good ol' cherry pie...",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 pie (6 to 8 servings)",
        "recipeIngredient": [
            "1 recipe pastry for a 9 inch double crust pie",
            "1 (20 ounce) can pitted sour cherries",
            "1 cup white sugar",
            "⅓ cup all-purpose flour",
            "⅛ teaspoon salt",
            "2 tablespoons butter",
            "¼ teaspoon almond extract",
            "¼ teaspoon red food coloring",
            "1 egg yolk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 C). Make pastry and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain cherries, reserving 1 cup liquid. In a saucepan combine sugar, flour and salt. Stir in cherry liquid and bring to a boil, stirring often. Reduce heat and simmer for 5 minutes. Mixture will thicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When mixture is thickened, add butter, almond extract, food coloring and cherries. Cover and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On lightly covered surface, roll out half of the pastry into an 11 inch circle. Put into 9 inch pie dish. Roll other half of pastry into another 11 inch circle. With a knife or pastry wheel, cut eight 1/2 inch strips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour cooled cherry filling into pie dish. Place pastry strips horizontally, then vertically, across the top of the pie and lightly brush with egg yolk. Bake 30 to 35 minutes, and cool before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Fruit Pies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Leia"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.408284023668639,
            "ratingCount": 169,
            "itemReviewed": "Best Cherry Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "400.8 calories",
            "carbohydrateContent": "55.8 g",
            "cholesterolContent": "33.2 mg",
            "fatContent": "18.5 g",
            "fiberContent": "2.6 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "5.8 g",
            "servingSize": null,
            "sodiumContent": "296.6 mg",
            "sugarContent": "30.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-08T18:01:37.47Z",
                "reviewBody": "This is an old chestnut of a recipe. I've been baking it using this same formula for over 30 years now, with the exception of using 1-2 Tb fresh lemon juice, added along with the cherries and extract. Using the lemon juice avoids the cloying sweetness that some have found objectionable. Those who think it's the same as canned cherry pie filling have to be kidding! That stuff is bright red goo with a few cherries floating around in it. This produces a cherry-packed filling that fits best in an 8\" pie pan. For a 10\" pie I always double this recipe, and it comes out nice and full. For those who have trouble with the crust browning too much or burning, just crimp a 2\" strip of foil (you will need 3-4, depending on the size of pie you're baking. Join the strips end-to-end by folding thinly together to make one long strip) around the crust edges. Remove for the last 15 minutes of baking. Voila! Perfectly baked crusts every time. This filling recipe also works beautifully as a topping for cheesecakes, pound cakes, ice cream, etc. Provided you make a quality crust, this truly does produce the Best Cherry Pie you'll ever eat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-29T06:20:32.513Z",
                "reviewBody": "Everyone that I served loved this recipe. Some notes: I used two 10 oz cans of cherries and I thought it was still few cherries... maybe I like a lot of cherries. In addition you really have to watch the sauce-- mine got thick really fast after leaving it for about a minute. Midway through the recipe I was discouraged because I felt I might have burnt it. Either way the pie came out great... one of the best I've had. Hopefully someone else can use my tips however.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Becca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1944355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-13T03:58:14.39Z",
                "reviewBody": "My husband and I love it! I did cut the sugar down to 3/4 cup as recommended by another reviewer. Also shouldn't the crust be brushed with egg white not yolk? (Note: Milk can also be brushed on a pie crust.) I also adjusted the oven temperature: 425 for 15 minutes then 325 until the crust was golden brown. Didn't run AT ALL yay!:)Excellent for those of us who like sweet not tart cherry pie. I would be proud to make this for company!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Puddin'",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1831423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T15:49:40.61Z",
                "reviewBody": "Most important tip: Use arrowroot instead of the flour for a beautiful filling! This is an excellent pie. However like others I changed it up a bit. I couldn't find either 10 or 20oz cans and used 2 14.5oz cans of sour cherries and was glad I did. I was perhaps using a slightly deeper dish than others had but I wanted a pie bursting with cherries. I did NOT cut the sugar. I think some of the other reviewers were using pie filling cherries. You need to use cans of SOUR cherries. They will be labeled as such. The first time I made this I used the flour to thicken but it made the filling look pink. Next time I used 2 1/2 T of Arrowroot instead and it came out a beautiful clear red color. You won't need to use the red food coloring. Arrowroot is a more expensive but you use less and it's worth it! And as others have said brush with egg WHITE not yolk. (To save time I used a ready-made Pillsbury crust.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "C Brannan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3368059/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-23T17:58:32.703Z",
                "reviewBody": "This is the method used by my grandmother and mother two master bakers who lived in the heart of fruit orchard country in West Virginia. Nearly everything I know about baking I learned from them. Last week I went to the orchard to buy some fresh sour cherries to make this pie. It was the best as usual. Fresh cherries are not as readily available as the canned cherries. If you have the chance to get them tryit. The only difference I made in the recipe was to heat the fresh pitted cherries (4 cupe) on the stove to bring the juices alive. I then added slowly while stirring constantly the sugar salt and flour which I had blended together. I proceeded as directed in the remainder of the recipe. It was great. I got enough cherrie to freeze for later pies. Sometimes I use corn starch instead of flour as it make a more translucent filling. I also used almond extract but sometimes use cinnamon or lemon juice. They all create good pie. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1499720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-17T00:50:07.75Z",
                "reviewBody": "I made this pie for Easter and everyone went crazy over it. It was the first thing to go and my husband and daughter were both looking for more later that night. Absolutely highly recommended although I cut the sugar down to 3/4 cup. Thanks for this awesome recipe will be making again soon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pawprints",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1769808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-13T03:38:33.7Z",
                "reviewBody": "Easy to make and tasty to boot. But I'm glad I followed the tip that said to cut down to 3/4 cup sugar -- that certainly was enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FLYLITTLEFEATHER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429382/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-07T21:12:34.837Z",
                "reviewBody": "My mother requested \"old fashioned cherry pie\" for her birthday and this pie was terrific! I followed the advice of others and used corn starch instead of flour ditched the food coloring used 2 14 oz. cans of cherries added cinnamon and nutmeg and since I could only find tart not sour cherries I decreased the sugar to 3/4 cup. I used Pillsbury pie crusts and cut the top crust with a pizza cutter then latticed it brushed with egg white and baked at 425 for 15 minutes then 325 for the rest of the time. It was gone before the day was out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENKENT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1025533/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T19:45:06.89Z",
                "reviewBody": "This pie came out well. It really held its shape (didn't run all over the place when I cut it.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ASCHIFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248437/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-03T21:28:03.647Z",
                "reviewBody": "I am making this for our 31st anniversary dinner dessert tonight and am having to fix it so as not require an emergency trip to the grocery. I used a 24oz jar of tart cherries and the rest of the ingredients as given (I did substituted Splenda for baking as my DH is diabetic)...the filling has the consistency of a roux and one that's far too sweet at that! To counteract the excess sweetness I have added the juice of 1/2 a fresh lemon 2 peeled and sliced apples and 1 tsp. cinnamon and another chunk of butter (to thin out the sauce). I will tell my husband it's \"chapple\" pie and hope for the best.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBORAHARV614",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/807433/"
                }
            }
        ]
    }
]