[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/283/desserts/pies/vintage-pies/",
                    "name": "Vintage Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12957/desserts/pies/vintage-pies/chess-pie/",
                    "name": "Chess Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12581/chocolate-chess-pie-ii/",
        "name": "Chocolate Chess Pie II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4562233.jpg",
            "width": 960,
            "height": 1269
        },
        "datePublished": "1999-04-25T18:53:51.000Z",
        "description": "This is so easy and absolutely delicious!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "1 ½ cups white sugar",
            "3 tablespoons unsweetened cocoa powder",
            "2 eggs",
            "1 (5 ounce) can evaporated milk",
            "¼ cup melted butter",
            "1 teaspoon vanilla extract",
            "1 (9 inch) unbaked pie crust"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix sugar and cocoa together. Beat the eggs then add to the cocoa mixture. Beat in the milk, butter and vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour mixture into 9 inch unbaked pie shell and bake at 350 degrees F (175 degrees C) for 45 minutes or until set. Let cool before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Vintage Pie Recipes",
            "Chess Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan Bern"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.527156549520766,
            "ratingCount": 313,
            "itemReviewed": "Chocolate Chess Pie II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "357.2 calories",
            "carbohydrateContent": "50.8 g",
            "cholesterolContent": "66.8 mg",
            "fatContent": "16.1 g",
            "fiberContent": "1.5 g",
            "proteinContent": "4.6 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "194.3 mg",
            "sugarContent": "39.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-29T18:10:43.75Z",
                "reviewBody": "OMG!!!  This pie is so-o-o good!!  I love chocolate!!! I cut the sugar to 1 cup, increased the cocoa to 5 Tablespoons. and added 3/4 cup of pecans!!   I also put strips of aluminum foil around the edges of the crust to keep them from getting brown too quick.  I baked it for 1 hour at 325 degrees.    No offense to anyone, but some of the expert cooks said they could not get the pie to set!  I followed the directions of another poster and it turned out perfect...no problem setting!!   This is what 'Lillithmaxium' said on Dec. 20, 2009: (The flavor is wonderful, however I think the lower reviews could be because some cooks are unaware of proper custard/homemade pudding-type pie preparation. The ingredients should include instructions for tempering the eggs).   I did exactly as Lillithmaxium instructed, and no problem setting!  Mix all ingredients (EXCEPT the eggs and pecans) and stir over medium heat until the chocolate is blended.  In a separate bowl stir the eggs, while stirring the eggs, slowly add 1/2 cup of the hot pie mixture to the eggs to gradually even the egg temperature.   Now pour the egg mixture into the remaining pie mixture, continue to stir, It starts getting thicker almost immediately.  Add the pecans, then pour into the pie shell.  I used deep dish.  Let the pie set to cool for about 1 hour before cutting.  I hope I explained this where it made sense.  I hope some of the other cooks will try this wonderful pie again...it's really simple and sets perfectly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "panamabev",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5404549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-21T01:35:49.207Z",
                "reviewBody": "Eww, eww, eww. I had such high hopes for this pie. I followed the recipe exactly & it was inedible. The pie filling was so greasy & the pie would not set. You can even see the greasiness in the photos! Sad. If I attempt to make this again I will omit the 1/4c of melted butter. Just remembering my first bite makes me shudder. I feel a little out of place because everyone just raved about this pie in the reviews. I never leave baaad reviews, but I just needed to say something.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebekah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2645839/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-21T14:54:37.57Z",
                "reviewBody": "I have been making this exact recipe for years.  Here is a great tip my grandmother taught me:  First mix the sugar and cocoa together very well first.  Second, don't melt your butter completely.  That is why some are coming up with runny pies.  The butter needs to still have some \"chunkyness\" to it.  Hope this helps!  Mine comes out great most of the time, although sometimes it cracks.  I ususally bake it between 40 and 45 minutes.  And then like others suggested leave it in the oven with temperature off for 10-15 minutes with door cracked.  Love this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin Walker Rueff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5262215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-19T14:26:04.657Z",
                "reviewBody": "I found this recipe after a failed attempt at another Chess pie!! After reading recommendations from others, my alterations were as follows:\nI poked holes in the crust, covered the sides with aluminum foil to keep them from burning, and sprinkled a little coarse sea salt over the bottom. I used only 1 cup of sugar, and 3 1/2 heaping tbls cocoa powder, soft butter (not melted). I slightly beat my eggs in a glass bowl and set them aside. In a seperate bowl, I mixed my sugar and cocoa powder. I then added the milk, and blended with a hand mixer. I next added my butter and vanilla and mixed A LOT!!! I added my eggs at the end and because so many people commented about having problems with the pie rising, I added approximately 1 tbsp of self-rising flour at the very end. I mixed a little more and then poured the mixture over my crust. I baked on 325 for 1 hour. I then turned off the oven, left the pie inside, but opened the door for another 30 minutes. When I took the pie out I dusted it with confectioners sugar. It turned out fabulously!!! I am not a fan of most things that are very chocolately, but this pie was perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KYMEEC70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/603130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-27T01:34:55.04Z",
                "reviewBody": "I make this pie on thanksgiving this recipe is pretty good;however the recipe called for too much sugar and less coco. Next time I will add less sugar and more coco.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-12T21:54:07.157Z",
                "reviewBody": "Classic simple ingredients easy scrumptious. Never had I wanted vanilla ice cream more than last night to have with my warm chocolate pie..It took me 10 minutes to whip together and 50 agonizing minutes of waiting for it to finish cooking. I actually did 3 heaping tablespoons of cocoa to intensify the chocolate flavor and boy was it good; also used a regular not deep dish pre-made pie crust but next time think I will try doubling the recipe for a deep dish crust for a thicker pie or even using mini/individual pie crusts for parties. 50 minutes was perfect cooking time just so you know the pie will still have a slight jiggle to it as it comes out of the oven but don't worry it sets up even more when cooling. I'm guessing because of the butter the bottom crust was almost caramelized a nice contrast from the creaminess of the filling; even the top had a thin layer of crunch. The pie is sweet so be prepared..ice cream or whipped cream would definitely cut the sweetness and be a perfect compliment to this dessert. I loved this and can't wait to make it for friends.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catherine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2271979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-08T16:27:39.02Z",
                "reviewBody": "I have been playing around with the recipe (after the first attempt was not so great) and found that it is better with 2 tablespoons of butter 1/2 cup of cocoa powder and 1 cup of sugar. Also bake at 350 for 1 hr 15 min on the bottom rack and let cool a few hours before cutting. This pie is sooo easy and delicious with the recipe modifications!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JessicaDrucker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4945944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-23T23:51:31.233Z",
                "reviewBody": "This is a classic Southern old fashioned dessert. The key in my opinion is to mix it long enough (at least 5 minutes). I just let my Kitchen Aid do the mixing while I prep the crust. I also bake a little longer 50-55 minutes. And finally after it's completely cooled I put it in the fridge to chill. My boys love this pie and my husband thinks I could sell it. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LA ESPOSA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/871279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-22T21:05:10.2Z",
                "reviewBody": "Very good. Reminiscent of a wonderful chocolate chess pie I used to get at a bakery in Graham North Carolina. Very rich and nice for the Holidays in place of cheesecake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EmtGal60",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1625445/"
                }
            }
        ]
    }
]