[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
                    "name": "Apple Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12583/old-fashioned-apple-pie/",
        "name": "Old Fashioned Apple Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F965259.jpg",
            "width": 2215,
            "height": 2215
        },
        "datePublished": "1999-04-24T23:27:49.000Z",
        "description": "Apple pie ...so American, so delicious. A true classic. Enjoy!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 pie",
        "recipeIngredient": [
            "2 (9 inch)  unbaked pie crusts",
            "7 cups peeled, cored and sliced apples",
            "1 cup white sugar",
            "2 tablespoons all-purpose flour",
            "1 teaspoon ground cinnamon",
            "⅛ teaspoon ground nutmeg",
            "¼ teaspoon salt",
            "2 tablespoons butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl combine apples, sugar, flour, cinnamon, nutmeg and salt. Place mixture in a pastry-lined 9 inch pie plate. Dot with butter and adjust top crust that has been vented.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place in oven and bake at 425 degrees F (220 degrees C) for 10 minutes. Turn oven temperature down to 275-300 degrees F (135-150 degrees C) and bake 40-50 minutes or until crust is golden brown and apples are tender. Let cool and serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Apple Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Arletta"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6,
            "ratingCount": 100,
            "itemReviewed": "Old Fashioned Apple Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "402 calories",
            "carbohydrateContent": "61.4 g",
            "cholesterolContent": "7.6 mg",
            "fatContent": "17.2 g",
            "fiberContent": "3 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "373.5 mg",
            "sugarContent": "35 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-29T21:01:21.873Z",
                "reviewBody": "To avoid wateriness in an old-fashioned apple pie you need to do two things:  Use Cortland or other cooking apples (never use Macintosh!) and add 2 tablespoons of uncooked tapioca right out of the box (more for a 10\" pie).  Spread the first tablespoon over the bottom of the pie crust before you add any apples, then sprinkle the remaining tablespoon throughout the pie.  The tapioca helps absorb the moisture resulting in a perfect pie--don't worry, you can't taste it! :)  You may need to experiment and adjust the amount of tapioca to suit your individual preferences.   This trick was passed down to me by my father whose Swedish grandmother taught it to him as a child... she made the best pies!  Another tip from Nana:  Don't just dump the apples into the pie crust, place them individually in concentric rings.  This takes a LOT longer but your pie will not sink at all--you can have a true \"mile high apple pie\" and you don't  pour in the \"sugar soup\" at the bottom of the mixing bowl that can also contribute to wateriness.  I like my pies a little moist, so I do pour a little of the sugar mixture in, but not all of it.  Also, if you're storing your apples in lemon water to prevent browning between peeling and putting them in the crust, make sure you give them time to drain and shake the colander well to get rid of all the extra water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "eqstokes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5881573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T16:41:46.857Z",
                "reviewBody": "This turned out pretty well.  I needed a recipe quick for Thanksgiving.  After we moved, I couldn't find my recipe book with my usual Apple pie recipe.  Some people liked it some liked the ones I usually bake.  The only things I would change would be adding less butter and more flour.  The juices in the pie did not thicken as much as I like.  All in all a pretty good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Arone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/603600/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T16:41:46.873Z",
                "reviewBody": "This pie turned out horribly! The taste was very good but it was very very watery. I think you should at least triple the amount of flour in the recipe. I would not try this recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CARMEN12345",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/813412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-27T18:20:15.437Z",
                "reviewBody": "This is a very classic apple pie that is excellent! Just the right seasoning!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jane Buck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2083422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-21T17:50:12.997Z",
                "reviewBody": "I made three of these at once for Mothers Day gifts mostly because I wanted to use my entire pound of lard at once which makes 3 double crusted pies. To ensure it was not too liquidy I used 2 heaping tablespoons of flour in my filling mixture. I also added a light sprinkling of cinnamon before laying the top crust down. I over heaped my filling and it did not shirnk much perhaps the apples I used? GALA... made for a sweet yummy pie. I've never made pie before and everyone RAVED over this recipie. I have one of the 3 frozen and can hardly wait to cook it! TIP from my 86 year old Grandmother: Touch the crust as little as possible when it is dough otherwise it will be tough after being cooked. 2nd TIP: Freeze the pie before cooking that way retains it's juicy-ness without becoming soggy once you cook it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SweetKatieL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4894005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-22T02:32:05.04Z",
                "reviewBody": "Hubs and I agree this is a darned fine pie.  While I made a couple of minor modifications, none were necessary.  I most frequently make my apple pies with just white sugar, but this time I wanted a little “caramel-y-scotchy” taste so I used half white and half brown sugar –just fun for something different.  The amounts of cinnamon and nutmeg were just right.  I typically don’t care for nutmeg in apple pies, but the little bit of it that was indicated here enhanced rather than dominated.  As for the flour, I’m always nervous about that – 2 T. is a common amount used in apple pie recipes but you can never know exactly if that will be too much or too little.  The Fuji apples I used were very juicy so I used two HEAPING tablespoons and so far I’m happy with that.  I’ll be interested to see tomorrow morning, however, once the pie has set overnight, if I’m still as pleased!  I’m hoping it won’t have turned to paste! I used a rich pie crust, “Never, Never Fail Pie Pastry,” also from this site, and brushed it with a mixture of one egg yolk and 1 T. half-and-half before baking.  I baked the pie at a consistent 375 degrees – 25 minutes with the crust uncovered, then another 25 minutes or so with the crust edge covered with foil.  This pie recipe and the pastry recipe I chose was a winning combination and lived up to its name. This was indeed a good “Old Fashioned Apple Pie.”",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-23T00:49:35.777Z",
                "reviewBody": "This apple pie was delicious! It was very wasy to make and family loved it. I used Granny Smith apples and brushed the unbaked crust with egg white to make it golden brown after it was baked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LIMAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1282287/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-22T19:18:44.67Z",
                "reviewBody": "Great flavor. I also brushed the crust with egg and covered the edges to prevent burning of the crust. However mine came out watery too. I agree with the reviewer who suggested doubling the amount of flour. I will try this because this pie is worth the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sra. B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2175301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-24T18:16:06.907Z",
                "reviewBody": "This pie tastes good but it really is quite runny while it was baking the juices from the pie poured down in a steady stream onto the pan that i thankfully had under it but after allowing the pie to cool down the juices set and it gets less runny. i would still add more flour. i wont make this again ill try a different recipe next time",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "spicyme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3085821/"
                }
            }
        ]
    }
]