[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
                    "name": "No-Bake Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12619/sinfully-delicious-chocolate-pie/",
        "name": "Sinfully Delicious Chocolate Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F588254.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-06-14T19:19:58.000Z",
        "description": "Very rich. Don't eat this if you are planning to go to heaven. Go all-out and top each slice with a big dollop of whipped cream. Please note, this pie uses raw eggs which should not be consumed by children, pregnant women, or the elderly. Be sure to use only fresh eggs for this recipe.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 pie",
        "recipeIngredient": [
            "1 cup butter",
            "1 ½ cups white sugar",
            "4 (1 ounce) squares unsweetened chocolate, melted",
            "1 teaspoon vanilla extract",
            "4 eggs",
            "1 (9 inch) deep dish pie crust, baked and cooled"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat butter and sugar until light and fluffy.  Blend in chocolate and vanilla.  At medium speed, beat in eggs, one at a time, taking 5 minutes for each egg.  (This is very important, 5 minutes for each egg!)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon into pie shell and chill.  Top with whipped cream before serving, if desired.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "No-Bake Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Joan Spinasanto"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.546218487394958,
            "ratingCount": 119,
            "itemReviewed": "Sinfully Delicious Chocolate Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "573 calories",
            "carbohydrateContent": "53.2 g",
            "cholesterolContent": "154 mg",
            "fatContent": "40.3 g",
            "fiberContent": "2.6 g",
            "proteinContent": "6.2 g",
            "saturatedFatContent": "22.3 g",
            "servingSize": null,
            "sodiumContent": "349 mg",
            "sugarContent": "38.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-12-24T16:43:56.943Z",
                "reviewBody": "This is a great pie and only requires a few preparation “must dos” go guarantee it turns out perfect. I think the texture of the sugar (or lack there of) is critical. As other reviewers noted, the pie may have a “grainy” texture if regular sugar is used. You do not have to go out and purchase “extra fine” sugar if you have a food processor.  I put regular sugar in a food processor and let it go for 7-10 minutes and the result is perfect texture sugar. Check the sugar and process it longer if you detect any graininess at all. I agree that the butter and eggs should be at room temp before mixing. I disagree with some reviewers who cut down on the egg mixing time from the recommended 5 minutes per egg.  I believe the 5 minutes is an absolute minimum to obtain that smooth/fluffy texture. I would stretch it to 6 or 7 minutes if you have a hands free mixer. Also, NEVER make this without pasteurized eggs. Even though the chance of salmonella infection by using non-pasteurized eggs is slim, why take the chance?  You may not find pasteurized eggs in most “chain” groceries, but they can usually be found in specialty groceries. Finally, the first time I made this, I used a graham cracker pie crust. Sweet overkill?  Maybe, but you be the judge. Whipped cream is a must to cut the sweet taste a bit. Garnish with fresh mint leaf. UPDATE 12/23/10. I used extra fine sugar AND I put the sugar in a food processor for 2-3 minutes. Kitchen Aid free standing mixer for eggs @ 7 min. each. Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GUYCHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-04T18:54:13.293Z",
                "reviewBody": "Undescribably delicious!!!  I could smell my motor burning on my hand mixer after the 2nd egg.  This pie definitely encourages me to buy a Kitchen Aid.  The first time I made this pie, I beat each egg for almost 5 minutes.  I have made this many more times since then and have decreased the time to about 3 minutes with the same results. I didn't have the chocolate baking squares so to equal 4 (1 oz) squares, I mixed 12 Tbls of cocoa powder with 4 Tbls of vegetable oil.  Perfect! I used regular sugar but could see where \"superfine\" would be better.  I don't mind the little grittines it had because the taste made up for it.  I've never made a creamier or richer chocolate pie and I highly recommend this for those who have a passion for chocolate.  Will definitley make this again.   Many thanks Joan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-12T23:09:38.39Z",
                "reviewBody": "Oh, man! Is this pie ever amazing!! I whipped up three of them for a party, and two of them were eaten before DINNER was served!! It is vital that each egg be beaten for at least five minutes... I actually beat mine for closer to 6 minutes because I have a KitchenAid mixer to do it for me. If you have one, use it. I also used Ultra Fine Sugar so that it would be that much creamier... this is a great recipe! Truly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AZERINAZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780662/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-22T19:34:31.42Z",
                "reviewBody": "This is THE BEST chocolate silk pie I ve ever made and the photo just does not do it justice. The pie is very firm due to refrigeration but the texture is as smooth as silk and it melts in your mouth like a rich chocolate truffle. To avoid a granular texture you have to devote a little extra time. First you need to let the butter come to room temperature (the eggs too!). Be sure to whip the butter and sugar really well and then let it set for 5 10 minutes. This will give the sugar extra time to dissolve. Then whip a second time before adding the vanilla and warm melted chocolate. I used my KA and beat each egg as directed. I used a standard pie plate and the filling went all the way to the top of the crust making for a thick mouth watering piece of pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIZ&#9829;",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/diz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-25T14:12:43.013Z",
                "reviewBody": "So Delicious! Beating after each egg is essential it changes the texture completely. A friend suggested that I use superfine sugar next time to make it even smoother.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSPEARS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/676842/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-16T17:20:21.61Z",
                "reviewBody": "This recipe is similar to one I used to use from the Better Homes and Gardens cookbook -- but they stopped publishing it because of the raw egg content. Of course I lost the recipe I had! It's a great recipe. I use a graham cracker crust instead of the regular pie shell. And the more expensive finer sugar IS better -- otherwise it can be a bit on the grainy side. Thanks!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAMIESGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248656/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-14T19:49:20.153Z",
                "reviewBody": "I'm giving this recipe 5 stars based on the feedback I received from others who ate it because I personally am not a big chocolate lover. I made it for a co-worker's birthday who is a chocoholic and she thought it was delicious. So did others in our office who love chocolate and several of them asked for the recipe. However when the birthday girl read the recipe she nearly freaked over the raw eggs. I made the pie exactly the way the recipe called for except that I did use the extra fine sugar that other reviewers had recommended. It was very easy to make and turned out perfect so I could definitely recommend this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAMPPJPATTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/968171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-09T20:42:01.157Z",
                "reviewBody": "Great recipe. Followed recipe to the letter. Used regular sugar and was not grainy. Cannot eat more than one piece. Used 16 onces of REAL whipped cream. Perfect for guests.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SALSAMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/562015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-22T04:07:22.763Z",
                "reviewBody": "Awesome pie. Granulated sugar can be put in a food proccessor to make super fine sugar longer the proccssed the fine the sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JUNGYNAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1206704/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-05T00:27:31.183Z",
                "reviewBody": "As a chocoholic I found this too mildly flavored hence the middling rating. If I were to make it again I would increase the amount of chocolate and sugar by at least 25%. I used standard granulated sugar and beat 8 minutes after the addition of each egg; there was no hint of graininess - I see no need to buy a special sugar or to process the sugar if one follows the original instructions on beating time. I would also alter the ingredients to specify 50% unsalted butter. A bit of salt accentuates chocolate flavors but there is too much in a full cup of salted butter. With a stronger chocolate and less salty flavor I think I'd happily rate it a '5'... but not as the recipe is now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Carnivore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3115340/"
                }
            }
        ]
    }
]