[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/818/desserts/pies/pie-crusts/",
                    "name": "Pie Crusts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17716/desserts/pies/pie-crusts/pastry-crusts/",
                    "name": "Pastry Crusts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12678/bakers-secret-pie-crust/",
        "name": "Baker's Secret Pie Crust",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2650246.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-09-26T16:29:03.000Z",
        "description": "I used to be challenged by pie crusts.  After 27 plus years of experimenting, this is the MOST successful recipe that I have developed. If using salted butter, reduce salt to 1/4 teaspoon.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 deep pie crust",
        "recipeIngredient": [
            "¾ cup cake flour",
            "¾ cup all-purpose flour",
            "1 teaspoon white sugar",
            "½ teaspoon salt",
            "⅛ teaspoon baking powder",
            "4 tablespoons unsalted butter",
            "5 tablespoons shortening",
            "1 egg yolk",
            "2 teaspoons distilled white vinegar",
            "3 cubes  ice",
            "½ cup cold water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Measure butter &amp; shortening onto a plate, put into freezer for about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Measure cake flour, all-purpose flour, sugar, salt and baking powder into the bowl of a food processor.  Pulse for a few seconds to mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Take 1/2 of the cold butter and 1/2 of the cold shortening, put into processor with dry ingredients and pulse off and on for about 1 minute.  Scrape down twice while doing this.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Take remainder of the cold butter &amp; cold shortening and cut in very briefly with the processor, leaving visible pea-sized chunks.  Do not over process at this stage!\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a measuring cup, mix egg yolk and vinegar together, add ice cubes and water.  Let this get chilled, about 3 to 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove mixed flours and shortening from processor, put into a large mixing bowl.  Sprinkle approximately 4 to 5 tablespoons of this egg, water, vinegar mixture, a little at a time, mixing gently with a fork. The key to this is, you do not want a wet dough, and you do not want to overmix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place this dough into plastic wrap or plastic bag, chill in refrigerator for a few minutes. (May also be frozen for a few weeks at this stage for future use).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from refrigerator and roll out. This makes absolutely the BEST pie crusts.  I have won County Fair competitions with this pie crust. Double for making a 2-crust pie.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Pie Crusts",
            "Pastry Crusts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CAROLEALANA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.688622754491018,
            "ratingCount": 334,
            "itemReviewed": "Baker's Secret Pie Crust",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "221.5 calories",
            "carbohydrateContent": "20 g",
            "cholesterolContent": "40.9 mg",
            "fatContent": "14.5 g",
            "fiberContent": "0.5 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "5.9 g",
            "servingSize": null,
            "sodiumContent": "155.5 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-31T04:07:40.24Z",
                "reviewBody": "I feel like I've been saved a lot of trouble and time by finding this recipe.  I don't need to look further.  I actually get compliments on the crust.  The butter adds flavor while the crisco adds flakiness.  Also, a couple of hints: After you have molded the pie crust to the pan, rest it in the refrigerator for 40 minutes.  This relaxes the gluten and reduces shrinkage.  After 40 minutes, put it directly into the freezer for 20 minutes (this step increase flakiness).  Add the filling quickly and bake immediately.  Of course,this added step is if you're truly in pursuit of perfection, but isn't essential.  Lastly, I am not very talented at rolling out the dough and peeling it off the counter.  Plus, adding flour to the counter alters the recipe.  I discovered that if I roll it out between 2 pieces of large saran wrap, I can unpeel one piece, flip it onto the pie plate and then unpeel the second piece of saran wrap without ever even having to touch it with my hands.  This was a great discovery!  Thanks for this truly exceptional recipe.  Try this crust with the Apple Crumble Pie recipe on this site!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peripheree",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/215019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-12T21:18:55.067Z",
                "reviewBody": "OMG! This has to be one of the BEST pie crusts I've ever had on this site! It's so delicious, and so flaky yet easy to roll out that I can see why this person has won County Fair competitions with this recipe. I followed the recipe exactly using cake flour which I have to admit I've never used in pie crust before - I doubled the recipe for a deep dish pie \"Vermont Apple Pie\" from this site to be exact. I used butter flavored shortening and found that I only need 8 Tbsp. of the egg yolk, water/vinegar mixture. I chilled the dough in the freezer for a bit and then I rolled the dough out onto wax paper that was lightly floured and it was a breeze to put into a deep dish pie plate. It baked up beautifully! I'm so glad I found this recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-23T02:59:37.127Z",
                "reviewBody": "This is by far my favorite pie crust recipe! It sounds a little labor intensive but it's not too bad. The key is to keep things cold and to handle the crust as little as possible so the gluten doesn't break down (which makes it tough and not flaky). I always just used a fork instead of a food processor and regular AP flour and it turns out wonderful. I've also used frozen butter cut with a cheese grater (easier then a fork) and it worked out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KC192",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1442579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-22T23:37:42.68Z",
                "reviewBody": "Excellent! This is THE very BEST pie crust I have ever made! I didn't use the cake flour...just doubled my regular flour (the ONLY flour I will bake with is White Lily which is ground \"extra fine\") and it turned out perfect! Like some of you I have been searching for a good pie crust recipe for years...and I finally found it. Thanks to Carole for sharing it with us!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHERBH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cherbh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-26T01:13:43.233Z",
                "reviewBody": "Great recipe!  Will not use any others from now on. I was in charge of pies for Thanksgiving this year.  Although I am a pretty good baker, I don't consider pies one of my specialties.  The other problem was I had to work through Wednesday and didn't know how I would have time to make 6 pies Wednesday night after working all day!  I made six crusts with this recipe the weekend before Thanksgiving and froze them.  Wednesday night I pulled them out and added the various fillings and baked.  They came out perfectly!!! Also -- I followed Mindy W's advice about rolling the crust out between saran wrap.  WOW!! EASY AND NO MESS!!! Thank-you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLYNCH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1406249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-10T05:50:41.263Z",
                "reviewBody": "Definitely one of the best pie crusts that I have ever made. I love to bake but I tend to shy away from pies since my crust always comes out tough. Although this recipe requires a few additional steps I think it is well worth the extra effort. As Carole recommends the key is to sprinkle the liquid mixture a little at a time. (I used about 4 Tbsp.) At first mine felt a little too moist but I sprinkled a little flour on the dough prior to rolling it out and it came out just right. I recommend rolling it out between wax paper so that once the crust has been placed in the pan you can peel off the wax paper without tearing the dough. The only additional step I took was to refrigerate the crust for about 15-20 minutes after I placed it in the pan. I've been told you need to let the gluten relax after you've rolled it out to avoid too much shrinkage when pre-baking the crust. All I can say is my pie crust came out pretty close to perfect. My husband gave the crust a thumbs up. Thanks Carole!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lil' menehune",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/483481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-07T11:37:50.7Z",
                "reviewBody": "WOW! I have been struggling to make a decent pie crust for ages...this is the recipe! It made a good size amount of dough and the crust was flakey and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINNYG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/35974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-20T16:23:15.92Z",
                "reviewBody": "Thanks for the recipe. For 35 years I have only made pastry using a pound of lard. The results were good but sometimes I didn't want to make that much. This an excellent flaky pie crust with a perfect flavour. It is definitely a keeper and I will likely be using this most of the time now.:o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alvor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1945495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-02T20:26:13.983Z",
                "reviewBody": "This makes a tasty rich and tender crust. The recipe made enough for a 9.5 in. deep dish single crust. I found I needed only about 1/4 c. of the ice water which I mixed with the egg yolk and vinegar without the extra water and ice cubes. I chilled the dough only slightly then rolled it out between two sheets of waxed paper to keep it from sticking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pamc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/54291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-07T20:59:20.06Z",
                "reviewBody": "This was horrible. I don't know if it was operator error but my dough was very moist (apparently I am still not sure if that was the problem) and when I tried to roll it stuck to everything and by the time I got it on top of my potpie it was in several pieces (appearance was gross). I had to cook it 10 extra minutes on my pie and it still tasted undercooked although it was brown. It was very tender.. too tender... it turned into complete mush! Yuck. I almost couldn't eat... almost.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristine Cassey Hoskins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/581950/"
                }
            }
        ]
    }
]