[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13081/tom-yum-koong-soup/",
        "name": "Tom Yum Koong Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9584.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1999-02-24T06:10:22.000Z",
        "description": "Many of these ingredients can be found in Asian or specialty shops. Chili paste with soy bean oil comes in small jars and can be found in most Asian markets. Galangal,  a member of the ginger family, is a knobby root that tastes like a cross between ginger and pepper. Tom Yum Soup paste can be found in Asian shops, or you can use Thai Red Curry paste. Kaffir lime leaves have an aromatic citrus-like smell and flavor. Garnish with fresh coriander leaves.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "4 -6 servings",
        "recipeIngredient": [
            "½ pound medium shrimp - peeled and deveined",
            "12 mushrooms, halved",
            "1 (4.5 ounce) can mushrooms, drained",
            "4 cups water",
            "2 lemon grass",
            "4 kaffir lime leaves",
            "4 slices galangal",
            "4 chile padi (bird's eye chiles)",
            "1 ½ tablespoons fish sauce",
            "1 ½ limes, juiced",
            "1 teaspoon white sugar",
            "1 teaspoon hot chile paste",
            "1 tablespoon tom yum soup paste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Trim lemongrass and cut into matchstick size pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make stock: Add the shrimp heads and shells to water, then cook for 20 minutes. Turn the fire off. Soak the heads and shells for further 20 minutes before discarding.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Trim lemongrass and cut into matchstick size pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add stock, lemon grass, kaffir lime leaves, galangal, chili padi, fish sauce, lime juice, sugar, and chili paste to a pot and bring to a boil. After boiling for 5 minutes, add shrimps and both mushrooms. Cook for further 10 minutes. Garnish with coriander leaves.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.752475247524752,
            "ratingCount": 101,
            "itemReviewed": "Tom Yum Koong Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "62.8 calories",
            "carbohydrateContent": "3.5 g",
            "cholesterolContent": "69 mg",
            "fatContent": "1 g",
            "fiberContent": "0.6 g",
            "proteinContent": "9.9 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "517.1 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-10T13:21:17.38Z",
                "reviewBody": "Absolutely wonderful- complex and fragrant and quite easy to make! I made only a few modifications and with or without my suggestions this recipe will result in a really interesting mix of hot sour and citrus flavors that is guaranteed to bring you compliments. I highly recommend that you take the time to look for the ingredients and not make substitutions. But if you can't find galangal add 2-3 teaspoons of minced ginger and if you can't find kaffir lime leaves use an equal amount of lime zest. If you have to make substitutions it's a very good idea to include the tom yum soup paste which this recipe suggests is optional. That paste contains galangal tamarind dried shrimp fennel and peanut. It's usually sold in small jars and can be found near soy and Szechuan sauces. Now for my modifications: First I used 4 cups of vegetable stock instead of 4 cups of water. Second I modified the chilis to lessen the heat and the bite-- I did this by halving the amount of chili paste and by delaying the addition of the whole chilis until the very end along with the shrimp and the mushrooms. Third although the recipe does not indicate whast kind of mushrooms to use I recommend either straw mushrooms or oyster mushrooms. Fourth I take out the kaffir lime leaves and the lemon grass before serving because they aren't pleasant to eat. Fifth I add a fresh kaffir leaf to each bowl for garnish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlliePeacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alliepeacock/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-13T04:43:15.657Z",
                "reviewBody": "I made this hours ago, and my lips are still tingling! I am SO happy to have found this recipe. I made a 30 mile round trip to get all the ingredients from the grocers which is attached to our fave Thai restaurant, and all I can say is that is was totally worth the time and effort. I would not recommend making this with substitutions - dried lemon grass, ginger, lime zest, etc are simply nowhere near as good as the real thing. Also, the lemon grass I buy is very thick and woody, so I just strip off the outer layers and cut it in half so that I can easily pick it out when it is done cooking (I cannot imagine actually eating it). Similarly, make sure you pick out the galangal and lime leaves after it's done cooking (sorry if I am stating the obvious, but some people might not know). Oh, and I used canned straw mushrooms because that's what the restaurant uses. Apart from adding a little more fish sauce, and also a shrimp bouillon cube, I made this as written. I can hardly believe it's homemade! Thank you SO much, Michelle!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-27T00:16:23.513Z",
                "reviewBody": "I love Tom Yum soup but not as much as the BF does. So this has been a fun adventure. The only reason I don't give this 5 stars is I have made it 3 times and it still doesn't taste like my fav. restaurant’s. I'm getting closer. The first time we simply couldn't find some of the ingredients. The kaffir lime leaves, galangal, chile padi (bird's eye chiles), and chile PASTE were so hard to find. And unlike what some reviewers have said and other places online the kaffir leaves make a difference, the zest isn't quite the same. The opposite is true with galangal I read everywhere that it had a truly unique flavor you can't quite get from anything else. What a headache. Its literally Thai ginger. A few tips. 4 chiles are too much, and I LOVE spicy food (then again I cut mine in half). DO NOT TRY TO FIND THESE AT YOUR LOCAL ALL IN ONE FOOD STORE GO TO AN ASIAN MARKET THE FIRST TIME.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alisha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1735324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-28T08:39:29.903Z",
                "reviewBody": "This is an excellent soup but I made a few modifications also. First I could not see myself eating anything made out of boiled shimp heads! I totally left the shrimp out and with the tom yum soup paste it still had a great flavor. My favorite Thai restaurant serves this with vegetables so I added them to mine also. I added a cut up tomato baby corn red and yellow sliced sweet pepper bok choy and a little broccoli. Everyone that has this soup loves it!!! Thanks for the great recipe Michelle!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DONNA1000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-15T00:14:54.827Z",
                "reviewBody": "SUPERB!!! This is an old reliable one in my recipe arsenal. It's labor-intensive but the result is fantastic. I substitute slices of ginger for the galangal and lime zest for the kaffir lime leaves. I use small serrano chilies for the chili padi -- I think they're close relatives in the chili family. I didn't expect it but when the shrimp broth is simmering with the other ingredients it makes the kitchen smell incredibly FRAGRANT! This is a cherished recipe for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAJORSKY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415609/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-22T20:20:10.547Z",
                "reviewBody": "This is absolutely delicious. It is wonderfully spicy and the contrasting textures are great. Because the recipe didn't specify a mushroom type I used fresh straw mushrooms which I got at the local Asian store. I'm not sure if they have these at a typical market? I also cooked some Asian noodles and added them to each serving to make the soup more into a meal. In addition I added some more vegetables like baby corn a little sliced napa cabbage and carrots. As others have noted putting the shrimp in 10 minutes before finishing will turn them into rubber. I actually threw them in as I finished/turned the heat off. The soup is so hot that it cooks them perfectly. I couldn't find kaffir lime leaves but I found a website saying that lime zest is pretty close(1 tablespoon lime zest = 6 kaffir lime leaves). Also don't skip on the fresh cilantro (or coriander) at the end it adds great contrast.Hope this helps. Enjoy. Thanks Michelle for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2597043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-06T01:45:15.31Z",
                "reviewBody": "This was a delicious recipe.  I had it at a Thai restaurant, and had to come home and duplicate it!  I searched far and wide for the kaffir lime leaves, galangal and chili padi - and found them at an asian market.  They all freeze well, so I have ingredients for the future.  I am a vegetarian, so I used vegetable broth, and left out the shrimp.  This recipe has such a nice mix of spices.  I'll definatly make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TERRIC3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1393442/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-20T00:37:29.577Z",
                "reviewBody": "Wow!  My family loved this recipe!  Absolutely delicious.  I omitted the chiles and went easy on the chili paste as I am not big on really spicy food.  I recommend adding a little spice at a time and tasting to ensure it doesn't get too spicy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VARUCADARLING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/876275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-15T02:17:29.437Z",
                "reviewBody": "Just made this tonight. My hubby and I loved it. Just like in Tai restaurants. Make sure you leave the soup to simmer to get the flavour out of the spices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TNC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1710428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-14T20:25:07.2Z",
                "reviewBody": "My family and I must not like this type of soup because this was way too spicy (and we love spicy).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFANDERSEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1136754/"
                }
            }
        ]
    }
]