[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14672/desserts/cakes/cheesecake/pumpkin-cheesecake/",
                    "name": "Pumpkin Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13477/double-layer-pumpkin-cheesecake/",
        "name": "Double Layer Pumpkin Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F17%2F13477-double-layer-pumpkin-cheesecake-cristi-2x1-1.jpg",
            "width": 2000,
            "height": 1000
        },
        "datePublished": "1998-10-18T04:24:38.000Z",
        "description": "A great alternative to pumpkin pie, especially for those cheesecake fans out there. Serve topped with whipped cream.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT4H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 (8 ounce) packages cream cheese, softened",
            "½ cup white sugar",
            "½ teaspoon vanilla extract",
            "2 eggs",
            "1 (9 inch) prepared graham cracker crust",
            "½ cup pumpkin puree",
            "½ teaspoon ground cinnamon",
            "1 pinch ground cloves",
            "1 pinch ground nutmeg",
            "½ cup frozen whipped topping, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine cream cheese, sugar and vanilla. Beat until smooth. Blend in eggs one at a time. Remove 1 cup of batter and spread into bottom of crust; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add pumpkin, cinnamon, cloves and nutmeg to the remaining batter and stir gently until well blended. Carefully spread over the batter in the crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 35 to 40 minutes, or until center is almost set. Allow to cool, then refrigerate for 3 hours or overnight. Cover with whipped topping before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "Pumpkin Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie Phillips"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.770924099977069,
            "ratingCount": 4361,
            "itemReviewed": "Double Layer Pumpkin Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "426.3 calories",
            "carbohydrateContent": "35.5 g",
            "cholesterolContent": "108.1 mg",
            "fatContent": "29 g",
            "fiberContent": "0.8 g",
            "proteinContent": "7.2 g",
            "saturatedFatContent": "15 g",
            "servingSize": null,
            "sodiumContent": "354.4 mg",
            "sugarContent": "24.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-04T01:54:30.717Z",
                "reviewBody": "This cheesecake tasted just like the pumpkin cheesecake we used to serve at a 5 star restaurant in washington d.c. years ago.  Their head pastry chef made it every fall to run through the holidays.  I did have to make a few changes to make this recipe more of a creamy cheesecake that most people are used to.  I used 3 8oz packages of cream cheese instead of 2, added 1/2 cup of sour cream (Fold the sour cream in after adding the eggs), and increased the pumpkin puree to 1 8oz can. I also had to adjust the spices a bit for my taste (added 1 tbls of spiced rum to the pumpkin mixture and a bit more nutmeg and cinnamon).  I baked this in a water bath at 350 for 1 hr (till the middle jiggles like jello), then turn off the oven, prop the door open and let the cheesecake sit for another hour, I promise you it will not crack at all. I used a 10in springform pan and a shortbread cookie crust.  I used one of the caramel sauce recipes from this web site and poured it over the cheesecake to give it a caramel glaze like the one at the restaurant had.  It was fabulous!!!  I took it to work, went to answer the phone, came back 10 minutes later and the whole cheesecake was gone!!!  I couldn't believe it!!  Now I have to make another one so my boyfriend can get a piece.  Thanks for sharing such a great recipe!!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bonniejo roberts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/747532/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-01T00:46:53.76Z",
                "reviewBody": "Revamping this review ----\nI've been making this recipe since Thanksgiving of 2002. Since then, its made its way to work potlucks, holiday dinners, and various gatherings I've attended.  I always like to find shortcuts in the kitchen and these are the few alterations I've made to this recipe, which in my opinion is a good base.  :)  First, instead of using the pumpkin puree and all the spices...I simply used a can of pumpkin pie filling...Libby's or the cheap store brand (which i used). I use  3/4 cup.  It boosts the pumpkin flavor overall.  Make sure your cream cheese is room temperature. It blends better. 3/4 cup of sugar.  1 tsp vanilla. 1/2 tsp cinnamon. You can stop there if you're using the filling.  OR..you can continue (even if you're using filling) and add 1 pinch of clove, nutmeg, ginger, and salt. I carefully layered 1 1/2 cup of the cream cheese mixture on the bottom of the crust.  Then added the pumpkin mixture on top carefully.  Make sure your crust is not cracked or out dated when you get it from the store.  Place on a cookie sheet and bake for 50-55 mins or until center of pie is set (center will spring back when touched).  Thanks to Stephanie for a wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill C ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/79shale97/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T22:56:51.623Z",
                "reviewBody": "Instead of buying pumpkin puree, I bought pumpkin pie filling that has all if the spices already in it (the puree doesn't). So, if you don't have all of those spices seperate listed in the recipe, you don't have to buy them just to make this pie. The can of pumpkin pie filling is quite big and you won't use the whole thing (I used 3/4 Cup), but it can be frozen for three months or kept in the fridge for upto a week.  I didn't have a  graham cracker crust on hand, I used a 9in DEEP pie shell and it turned out good and completely filled that shell up. I cooked mine for about 55-60 minutes before it was done. One last thing, on the plain cream cheese layer you put on the bottom, I used a little over a cup of that to make it more pronounced so you could see it better when it was cut..I think you could even go 1 1/2 cups and it would be fine if you want more of a cream cheese flavor. I took this for Thanksgiving and it was a hit. My mom said all she wanted for Christmas was another pie all for herself!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPRING1ONU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/326013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-05T17:16:49.61Z",
                "reviewBody": "LOVED it!  I made the following adjustments in order to fit in a springform pan:  3 (8 oz.) cream cheese (MUST be at room temp!), 3/4 cup white sugar, 1 tsp vanilla, 3 eggs, 1/2 cup sour cream (add after the eggs), 1 heaping cup pumpkin puree, 3 tsp pumpkin pie spice.  I made my own graham cracker crust and pressed into a 10-inch springform pan.  Did NOT bake the crust prior to adding the cheesecake mixture.  Poured 2 cups of plain batter into bottom before mixing in the pumpkin.  Baked with pan of water on bottom shelf at 350 for 1 hour and then turned off heat and propped the oven door open for another hour.  Had one small crack in it but I didn't care because it tasted amazing!!  Will make again and again!  Side note: graham cracker crust: 1 1/2 cups finely ground graham cracker crumbs, 1/3 cup white sugar,  6 tablespoons butter, (melted),  Mix and press into bottom of springform pan with waxed paper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRindell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/917993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-19T16:21:57.607Z",
                "reviewBody": "I made this recipe three times.  The first just like the recipe is printed and it was very tasty but it wasn't like a cheesecake.  So the next time I doubled the recipe.  I made one batch of filling and added that to the crust and then made another batch and added the pumpkin and spices.  This was really like a cheesecake but I had a few lumps.  The next time I made sure the cream cheese and eggs were at room temp. and made it the same way as the second time and what a differance.  I will be making this over and over.  I also made a different crust and cooked it in a springform pan.\r\nThank you so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BELVEAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/279966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T22:59:07.28Z",
                "reviewBody": "I made this recipe as directed the first time and it was wonderful; although, it is more of a cheese pie than a cheesecake.  To make it easier instead of using all the spices individually I used pumpkin pie spice, and I used lots of it.  The second time I made it I made several alterations for a more elegant cheesecake.  I made it in a springform pan with a crust made out of crumbled gingersnaps.  I added more to the cream cheese layer and used more pumpkin for a more pumpkin flavor.  For an elegant top (can also cover up cracks), I bought a folded frozen pie crust and used tiny leaf shaped cookie cutters to cut out leaves which I brushed with butter and cooked separately, and once the cheesecake was cooked I placed the leaves all over the top and then drizzled with carmel.  I left out whipped topping all together.  It was very elegant and still tasted just as good.  However, with the spring form pan and extra cream cheese layer, I had to cook it much longer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carrieannro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/418590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-01T01:59:52.503Z",
                "reviewBody": "It was GREAT!!!! After reading other reviews I used pumpkin pie filling (instead of puree w/ all the spices). I also added some extra cinnamon, sugar and vanilla. To make it ever better I melted together a bag of caramels and a can of evaportated milk to make a caramel sauce. I drizzeled the caramel sauce over each slice before serving with some whip cream...YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2495611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-06T19:05:57.573Z",
                "reviewBody": "Have to admit I'm flummoxed by all the rave reviews. I love pumpkin and I love cheesecake but this didn't do it for me. It was ok. That's about it. Oh and I love the people saying they bought pumpkin pie filling instead of \"having to measure out all the spices\" or whatever. What? How lazy are you? There's three spices!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "GizmoDuck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6827587/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T22:57:34.983Z",
                "reviewBody": "A very tasty dessert!  For cheesecake lovers, you may want to double the amount of cream cheese mix.  Or, atleast add 1/2 more because the pumpkin pie layer is thicker than the cheesecake layer.  It's very rich, but definitely worth it!  Gobble, gobble.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Madame.D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/696553/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Double Layer Pumpkin Cheesecake",
            "description": "See how to make this rich cheesecake, a great alternative to pumpkin pie.",
            "uploadDate": "2012-05-23T02:02:21.218Z",
            "duration": "PT2M50.837S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2cece39a-cf73-43ba-b617-6beb09a721e3%2F1439b4a3-288d-4c7b-a584-5460b43e263a%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1651408831001"
        }
    }
]