[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17284/desserts/nut-desserts/pecan-desserts/",
                    "name": "Pecan Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13564/pecan-pie-bars-i/",
        "name": "Pecan Pie Bars I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1068355.jpg",
            "width": 1282,
            "height": 960
        },
        "datePublished": "1998-10-31T14:51:30.000Z",
        "description": "These pecan pie bars are great for the children and adults in any family.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "½ cup white sugar",
            "½ teaspoon salt",
            "1 cup margarine",
            "4 eggs",
            "1 ½ cups light corn syrup",
            "1 ½ cups white sugar",
            "3 tablespoons margarine, melted",
            "1 ½ teaspoons vanilla extract",
            "2 ½ cups chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 10x15-inch jellyroll pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, 1/2 cup sugar, and salt. Cut in 1 cup of margarine until mixture resembles coarse crumbs. Sprinkle the mixture evenly over the prepared pan, and press in firmly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the crust is baking, prepare the filling. In a large bowl mix together the eggs, corn syrup, 1 1/2 cups sugar, 3 tablespoons margarine, and vanilla until smooth. Stir in the chopped pecans. Spread the filling evenly over the crust as soon as it comes out of the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 minutes in the preheated oven, or until set. Allow to cool completely on a  wire rack before slicing into bars.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Pecan Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARIETA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.658615136876007,
            "ratingCount": 621,
            "itemReviewed": "Pecan Pie Bars I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "232.8 calories",
            "carbohydrateContent": "30.7 g",
            "cholesterolContent": "20.7 mg",
            "fatContent": "12 g",
            "fiberContent": "1 g",
            "proteinContent": "2.5 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "117.5 mg",
            "sugarContent": "15.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-07T03:27:54.497Z",
                "reviewBody": "Excellent recipe! I cater, and my clients asked me to keep these in regular rotation.\n\nPer suggestions, I also used half brown sugar and half white sugar for the filling, plus butter instead of margarine.\n\nI suggest using the large disposable foil pans found at Sam's Club or Wal-Mart. There is no run-over or clean-up required. Pam eliminates sticking troubles.\n\nI did bake the crust for 20 minutes, per the recipe. After topping with the filling, I baked the bars for 45 minutes, rotating the pan halfway through the baking time to ensure even cooking. There is no way that these bars could be cooked in 25 minutes, per the recipe (unless you expect to eat the bars with a spoon).\n\nTo test for doneness, gently shake the pan. If the filling jiggles, keep baking. If you get just a slight bit of movement at the center, the bars are ready to be taken out of the oven. You don't want to cook them until there is no movement. At that point, they'll be too dry. When the bars are done cooking, cool on the counter for about 30 minutes before refrigerating for at least 4 hours, or overnight.  Don't worry about the crunchy edges. As with brownies, lots of people like the crunchy edge. The center is still nice and gooey, yet not requiring utensils or a napkin.\n\nAlso, don't be worried by the texture of the crust when you're mixing it. It seems too crumbly, but once it cooks and the filling is poured on top, it is a wonderful buttery shortbread consistency.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MEleanor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1852381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-16T17:32:38.303Z",
                "reviewBody": "Let me share my thoughts on this really great pecanpie bars.  First, you have to have the right size jelly roll pan!  I used a 12X18 inch dark metal pan.  I lined the pan with parchment paper (Make sure it goes up on all four sides, if not and it 'leaks' it WILL stick! But not where the paper is covered.) DO NOT GREASE/BUTTER PAPER!  Since, my pan was dark, I lowered the temperature to 325.  And I did not have any boil-over.\nNow, here is how I 'tweaked' the recipe.  In the crust I used real butter and had it soft, I used 1/2 cup packed light brown sugar, instead of white;omit the salt.  Then sprinkle into pan and press firmly making as even as possible.  Since the filling was similar to my pecan pie recipe, I used 5 eggs, increased pecans to 3 cups, threw in a handful of left-over chocolate chips that I had on hand.  I baked the crust 15 minutes; then put on the filling and baked it 27 minutes (electric oven).  These are truly a \"keeper\" and were enjoyed by family.  But if your pan is not large enough, please stick to the others who used a 9X13 pan.  Either way, I don't think you will be disappointed.  But do use the parchment paper, it makes a big difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PIELADYB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/692408/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-09T02:11:09.67Z",
                "reviewBody": "This was great.  I did not have a jelly roll pan, so I changed the serving from 36 to 24 (all measurements changed nicely except the 4 eggs which equaled to 2 and 3/4.  I just used 3 eggs.) I made in a 9 x 13 pan and cooked at same temp and time. Everything set and tasted wonderful.  I also lined the pan with parchment paper to prevent sticking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NYBBLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1226872/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T00:30:41.547Z",
                "reviewBody": "I would have given this five stars, but I did make a few revisions.  I used salted butter instead of margarine, and substituted brown sugar for half of the white sugar (in the filling mixture).  Also, I toasted the pecans at about 300 degrees for about 10 minutes or so to bring out the flavor (watch them close so they don't burn!), then tossed them with about 1/2 TBSP of salted butter before I added them to the filling mixture.  I took these to a bake sale at my son's school and got rave reviews!  I am a big pecan pie fan and I think I like these even better than the pie!  I will be making these often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MHENSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/285546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-16T03:00:03.857Z",
                "reviewBody": "First I opted not to use a jelly roll pan as so many said it made a mess. I used a 9 x 13 pan used a lot of cooking spray and did a fast crust by using 1 1/2 roll up dairy case pie crusts. The round crusts had to be manipulated a bit but it worked out fine. They went about 1/2 way up the side of the pan. I prebaked the crust for about 10 minutes. The filling fit perfectly and I also added a couple of handfuls of chocolate chips to the top! ( don't add too many or you will lose the pecan pie flavor!) The filling did not leak at all and the crust lifted easily from the bottom of the pan! Because the volume of filling was deep I cooked it in a 325 convection oven for considerably longer than the recipe stated. Yummy! Fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1119718/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T06:44:26.78Z",
                "reviewBody": "This has to be the best recipe out there! My office insists that I make them. The new Reynold's Wrap Easy Release Foil works well to help get them out of the pan when the carmel sticks to the edge of your pan. The bars freeze well too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shancooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/901401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-26T00:59:10.92Z",
                "reviewBody": "These turned out so good. I toasted my pecans for a few minutes before adding them and I didn't bother chopping them. Also I lined my pan with foil and then greased the foil and had no trouble removing them from the pan. I absolutely love pecan pie but often find that it is made too thick and is thus overly sweet and rich. These were the perfect solution. Not too thin not too thick. The crust was really nice and buttery an excellent texture and the filling was perfectly gooey and sweet. Everything about these was great. I got 32 quite large bars out of mine and they disappeared pretty quickly! I'll be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Extra Foamy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1416137/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-01T00:21:37.827Z",
                "reviewBody": "VERY good. I followed the reviewer's suggestion of changing servings to 24 servings in order to get correct ingrediant amounts for a 9x13 pan. It worked perfectly. I also used half butter half margarine in the crust and all butter in the topping. Very tasty and rich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BRANV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/462844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-14T20:08:39.773Z",
                "reviewBody": "This is a great idea, and serves many, but the crust is all wrong, it simply is not very good. I highly suggest you use my crust recipe instead. (2 cup flour. 1/2 cup powdered sugar (icing sugar). 1cup butter & a pinch of salt)prepared and baked the same way as the recipe. This makes a huge differance, holds together much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTAL88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1315425/"
                }
            }
        ]
    }
]