[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1116/fruits-and-vegetables/",
                    "name": "Fruits and Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1059/fruits-and-vegetables/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1881/fruits-and-vegetables/vegetables/squash/",
                    "name": "Squash",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13741/old-fashioned-pumpkin-fudge/",
        "name": "Old-Fashioned Pumpkin Fudge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2924324.jpg",
            "width": 1762,
            "height": 1757
        },
        "datePublished": "1999-08-03T01:57:22.000Z",
        "description": "A twist on chocolate fudge that uses everyone's favorite Thanksgiving vegetable, pumpkin!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "36 servings",
        "recipeIngredient": [
            "3 cups white sugar",
            "1 cup milk",
            "3 tablespoons light corn syrup",
            "½ cup pumpkin puree",
            "¼ teaspoon salt",
            "1 teaspoon pumpkin pie spice",
            "1 ½ teaspoons vanilla extract",
            "½ cup butter",
            "½ cup chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Butter or grease one 8x8 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 3 quart saucepan, mix together sugar, milk, corn syrup, pumpkin and salt. Bring to a boil over high heat, stirring constantly.  Reduce heat to medium and continue boiling. Do not stir.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When mixture registers 232 degrees F (110 degrees C) on candy thermometer, or forms a soft ball when dropped into cold water, remove pan from heat.  Stir in pumpkin pie spice, vanilla, butter and nuts.  Cool to lukewarm (110 degrees F or 43 degrees C on candy thermometer).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat mixture until it is very thick and loses some of its gloss.  Quickly pour into a greased eight-inch pan. When firm cut into 36 squares.\n"
            }
        ],
        "recipeCategory": [
            "Fruits and Vegetables",
            "Vegetables",
            "Squash"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ginger"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.595744680851064,
            "ratingCount": 141,
            "itemReviewed": "Old-Fashioned Pumpkin Fudge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "107.8 calories",
            "carbohydrateContent": "18.8 g",
            "cholesterolContent": "7.3 mg",
            "fatContent": "3.8 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.5 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "46.4 mg",
            "sugarContent": "17.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-02T01:06:39.56Z",
                "reviewBody": "It took SIX batches to finally get this recipe to turn out right for me.  You have to be EXACT!!!  It carmelized on me twice, didn't set for me twice and turned into granules, pebble like, once.  But, after finally getting it right, it was DELICIOUS.  Two hints that I think helped me are #1- you may not necessarily get the exact temperature on your candy thermometer, but if your mixture turns into a soft ball when dropped in cold water it's ready & #2- when you add the last ingredients, the butter, etc...add them into the pan that you cooked the 1st ingredients. Whatever you do, DON'T remove your mixture out of the saucepan into a different bowl w/ the butter.  I think that by doing that I cooled the mixture way too fast & I turned it into rocks.  \r\n All in all, this experience for me was the first time I ever made fudge & if it is for you too, then have enough ingredients to make a few batches.  I can't tell you how many trips I made to Albertson's that night trying to get it right.  But, it was well worth it, the fudge is delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FEMMEONACR125",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/458581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-15T08:26:12.317Z",
                "reviewBody": "Excellent flavor but texture leaves a little to be desired. Made 3 times. Not a creamy fudge but slightly on the granular side. Tried using half and half in place of milk - no difference in texture. For those who have had problems with the fudge not setting up there are two possible reasons. First off fudge should never be made on a rainy/snowy day nor one with high relative humidity. Water is the enemy of fudge. Save this task for a clear day. Secondly the correct temperature is a must. There is a range between 232-238 for soft ball. Test the calibration on your thermometer by boiling water and checking against 212 degrees. One note on this fudge. Mine never lost its gloss. The first time I beat it for about 10 minutes and although it got thick it was still very glossy. The next 2 times I beat it for about 2 minutes and 1 minute respectively. It thickened up right away. No difference in texture. Still grainy. I never use compound spices as I prefer to make my own mixtures giving greater control over final flavor. Used 1/2 tsp cinnamon 1 tsp ginger and 1/4 tsp cloves. Delicious! Update: Discovered the source of the grainy texture FINALLY! When you add the butter vanilla and spices (after removing from heat ) DO NOT MIX IN as the recipe states (only add them to the pan.) In candy making this step is called \"seeding.\" After seeding WAIT TO MIX THEM IN until the time when you beat the mixture at 110 degrees. Still not super creamy but no longer grainy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-02T00:59:18.28Z",
                "reviewBody": "Okay...  PLEASE don't give up if this doesn't set right the first time.  I thought my recipe was a goner-- it still wasn't set after 5 hours.  So, I figured, what the heck--  I put it ALL back into the saucepan and reheated it to 235 degrees instead of 232.  Maybe it was a fluke, but I let it cool and beat it as usual, and it turned out perfectly!!  So, there's still hope even if it doesn't turn out the first time.  Or you could always use the goop as a dip or icing for gingersnaps.  (I almost want to screw up a batch just for this purpose!!)  It's soooooo tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "allison125",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/351270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-02T01:00:49.437Z",
                "reviewBody": "I am not a chocolate person so this is a great alternative to chocolate fudge. I agree that you need to do the soft ball test in cold water mine was ready a bit before my thermometer said it was -- it depends on the thickness of your pan how evenly it cooks and the placement of your thermometer on the pan. LET IT COOL COMPLETELY to 110 before beating. It did take about 30 minutes to cool. I only had to beat it about 3-5 minutes with an electric hand mixer and it was rady to go. The flavor is incredible!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Connie Schuessler Alkire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/711333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-18T16:42:10.047Z",
                "reviewBody": "Pumpkin Fudge!!! I had never heard of such thing before I came across this recipe while looking for yummy stuff to make for the holidays. Being a lover of all things pumpkin I had to try this - And I was not disappointed. I had never made candy of any sort before but this turned out perfectly the very first time I made it. Just follow the directions exactly and it will turn out. This is one of the yummiest things I've tried in a long time and everybody who has tried it agrees. My ONLY complaint is that it was somewhat of a lengthy process (took me a couple hours) from start to finish but this certainly wouldn't stop me from making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "grandmaman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1562549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-27T03:45:08.81Z",
                "reviewBody": "This recipe turned out quite nicely. If you know how to make fudge you'll have no trouble with it. The pumpkin flavor is a nice seasonal change from chocolate but not something I'd want year-round. I'm cutting it with a tiny pumpkin-shaped cookie cutter to take to a harvest party along with other flavors/shapes (maple fudge cut with a maple leaf cutter and chocolate fudge cut with an acorn cutter).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kris10Marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1574037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-24T19:04:01.14Z",
                "reviewBody": "At first my fudge came out gooey but after I cooked it two more times (at a little higher temp. each time) it set perfectly and tasted great. All who were lucky enough to get a piece loved it. I will definately be making this again - hopefully in one try! Thanks Ginger!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tina P.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1569942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-21T14:29:49.287Z",
                "reviewBody": "What a flavorful fudge! I took the suggestions of BARICAT & had great results. I was a little confused as to her directions though....wasn't sure whether I should add the butter & spices & not mix it in until it had cooled or if I was to wait until it had cooled to add the butter & spices. I went w/ adding but not mixing. It took a very long time to come to 232 & a very long time to cool to 110 so be patient & don't make this if you are crunched for time. It's not difficult at all to make...just time consuming. This set up perfectly w/ no need to refrigerate & I didn't have any problems w/ texture (thanks BARICAT!). My only complaint is that it was a little buttery...and that it makes such a small batch.;o)Hubby loved this fudge & he is not a fudge lover...says the typical fudge is too rich & sweet. Duh! LOL I loved the seasonal flavor of the fudge...hope my family enjoys it on our dessert table Thanksgiving day. Thanks Ginger!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-16T23:48:51.077Z",
                "reviewBody": "Wonderful flavor. Be sure to follow the directions exactly and not stir it while it is cooking. Texture is a little funny will try the suggestion to not stir in the last ingredients until it has cooled.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula Kreft",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/774176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-22T22:14:19.263Z",
                "reviewBody": "I wanted to love this but it didn't work! I followed the recipe exactly but something went wrong. Oh well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DARLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/919751/"
                }
            }
        ]
    }
]