[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2411/desserts/pies/pecan-pie/",
                    "name": "Pecan Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13872/easy-pecan-pie/",
        "name": "Easy Pecan Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4223313.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1999-11-22T02:46:14.000Z",
        "description": "You will enjoy making this traditional pecan pie as much as you will enjoy eating a slice.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 (9 inch) unbaked pie crust",
            "3 eggs, beaten",
            "1 cup dark corn syrup",
            "1 cup white sugar",
            "¼ cup melted butter",
            "1 teaspoon vanilla extract",
            "1 cup pecan halves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat together the eggs, corn syrup, sugar, butter and vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange pecans in bottom of pie crust and pour mixture over.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 1 hour or until knife inserted 1 inch from edge comes out clean. Allow to cool before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Pecan Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jackie Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.662790697674419,
            "ratingCount": 172,
            "itemReviewed": "Easy Pecan Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "500.3 calories",
            "carbohydrateContent": "69.2 g",
            "cholesterolContent": "85 mg",
            "fatContent": "24.8 g",
            "fiberContent": "2.1 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "247.6 mg",
            "sugarContent": "36.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-23T17:30:53.71Z",
                "reviewBody": "Lost my recipe box with my favorite pecan pie recipe & found it here. This is THE BEST pecan pie recipe. A couple of hints: you can substitute light corn syrup-in fact I usually use the light.  If you are using a \"deep dish\" pie crust, you need to increase the filling amount- easy to do with the all recipes conversion - I increased servings to 9 & used 4 eggs. You don't have to lay pecans on the bottom of the crust,just fold into the batter-it works fine. Pecans- I chop some & leave some halved. I also omit vanilla. The real trick is the cooking time - this comes with practice; if it's runny inside, it didn't cook long enough. If I'm sometimes not sure, I'll cook a few minutes more to be safe- especially with a deep dish crust.You learn to recognize when the pie is \"set\" on top. Hope these hints help - this is my favorite recipe & I've been cooking it for 25+ years & my Mom before me. Bon Apetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sandycook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/94220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T18:50:23.42Z",
                "reviewBody": "Ok! Ok!  I guess I should review this recipe since there's a picture of my own pie up there at the top.  LOL  \n\nI've had this recipe now for 3 or 4 years (maybe longer...I can't remember) and I've made it for Thanksgiving every year since.  Everyone RAVES about this pie from the oldest to the youngest.  There's even little fingers vying to get the last little sticky morsel in the bottom of the pie plate.  \n\nJust a week ago I made this pie for our church's annual Harvest Dinner.  The volunteers who were working there before the dinner began were taking the pecan pie pieces BEFORE everyone else got there to make sure they got a piece.  The pie was gone within minutes after the dinner began.  I think next year I'll skip the pumpkin and just take 2 pecan pies.  LOL  \n\nThis pie is one of the easier pies that I've made.  I love the simplicity of the recipe.  There are a few steps, but nothing too elaborate that one couldn't understand.  I've always made this with light corn syrup because that's all I buy and it turns out fabulously!  \n\nMy kids love this pie so much that my daughter asked me to copy the recipe for her to put in her recipe box.  She's just 10.  She says, \"No one can make a better pecan pie than you Mom!\"  \n\nSo, Jackie, thank you for sharing this recipe here for all of us to savor and enjoy.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOMESCHOOLMUMMYX3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1094151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-22T18:47:16.27Z",
                "reviewBody": "This is a simple and straightforward recipe as far as ingredients and preparation, probably the easiest one I've found. However, the cook time drastically varies as I've read some reviews that claim a 50-minute time, while mine took over 80. The filling prior to going into the oven is a little too much for a regular pie crust (it spills very easily since the filling is almost above the height of the pie crust). In my experience the top and crust browned very quickly (30 minutes or so -- in the end the top and crust edges were almost burnt) but the filling never seemed to set properly.\n\nI would give this recipe a 4-star for taste (you can't really go wrong with butter, corn syrup, eggs and sugar) but 2 for the actual cooking process. Maybe it's my oven to blame, but such a wide disparity in cooking time seems problematic...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "trust409",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1515849/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T18:59:46.573Z",
                "reviewBody": "I made this pie as is except I added 1/4 teaspoons salt.   Salt takes the sickeningly sweet edge off of pecan pie and takes it to a whole new level!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gloria Rice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-02T22:52:54Z",
                "reviewBody": "i had never made pecan pies because i thought they were hard. EVERYONE loved these. i used light corn syrup instead of dark. of course i also think the pecans make a big difference i had a whole bag of delicious shelled pecans given to me so i decided to try this. it was all wonderful and easy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1651469/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-18T12:12:56.163Z",
                "reviewBody": "AND THE WINNER IS...Jackie's Pecan Pie!! When I saw the picture that Mummy took, I've got to tell you, it was like stepping back in time! My mama's cooking was like dying and going to Heaven, no lie!  In our family, she gave her recipe for dressing--yep y'all, in the South, we don't call it stuffing--and her pecan pie only to me. I thought I had it memorized until my last pecan pie proved me wrong! I've searched far and wide for something even close to hers and not until I saw Jackie's recipe and Mummy's picture of the finished product did I realize my search was over--that and a little help from reading Jackie's recipe of course!! Thank U, Thank U, Thank U, Jackie!!! I just finished making it, its cooled, its now 7:15 a.m. here in Richmond VA and I've already polished off 2 slices!! Ok, 2 and a \"sliver\" more! ;o)  What a GREAT way to start my Sunday!! Its absolutely, hands down, incredibly DELISH!!!---HEADS UP BAKER'S TIP---Can y'all get \"KING SYRUP\" in your grocery store? There is only 1 kind and \"King Syrup\" is the name of it. Its a cross between light and dark Karo syrup and wonderful!  It will make any pecan pie FLAWLESS when syrup is called for in the recipe. I do have ONE EXCEPTION to Jackie's recipe and that is to test my pie for \"readiness\" I always insert the knife into its center not the rim. Jackie, again, thank you thank you so very much for posting this as it brought back some really wonderful memories of my Mama and me. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "richmondred",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2615890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T19:01:29.233Z",
                "reviewBody": "This recipe is so easy and so delicious. I made it for the first time for Thanksgiving and I'm going to make it again for Christmas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARBG922",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/760597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-25T03:55:09.45Z",
                "reviewBody": "I made two for Thanksgiving and cooked for the time on recipe and temp. and they where not done inside.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "swtemotions",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1633825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-18T16:42:40.903Z",
                "reviewBody": "Quick and easy (a must for busy moms) enjoyed by the entire family.  Reduced the cooking time by 10 minutes(50 minutes instead of 1 hour) was perfectly baked when removed from the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gennivieve65",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1044149/"
                }
            }
        ]
    }
]