[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2255/main-dish/savory-pies/pork-pie/",
                    "name": "Pork Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220515/steak-and-irish-stout-pie/",
        "name": "Steak and Irish Stout Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6342084.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2020-03-05T05:08:39.000Z",
        "description": "This delicious Irish meal may provoke your guests into licking the pie dish clean.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H30M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "2 pounds round steak, cut into 1/2-inch cubes",
            "1 tablespoon all-purpose flour",
            "3 ounces lard",
            "8 slices bacon, finely chopped",
            "5 onions, minced",
            "¼ pound fresh mushrooms, sliced",
            "1 (12 fluid ounce) bottle Irish stout beer (such as Guinness®)",
            "1 tablespoon chopped fresh parsley",
            "1 tablespoon raisins",
            "1 teaspoon brown sugar",
            "1 (15 ounce) package double-crust pie pastry, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place steak cubes onto a plate and sprinkle with flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place lard and bacon into a large skillet over medium heat; heat until lard melts and bacon begins to sizzle. Stir floured steak cubes into bacon and hot lard and cook, stirring frequently, until steak and bacon are browned, 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer steak mixture to a large casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook and stir onion and mushrooms in the same skillet over medium heat until onions are lightly browned and mushrooms are tender, about 10 minutes. Transfer to casserole dish with steak mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir Irish stout beer, parsley, raisins, and brown sugar into steak mixture. Cover dish tightly with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven, stirring occasionally, until gravy has thickened and steak is tender, about 2 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove casserole dish from oven and increase temperature to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a deep-dish 9-inch pie plate with a pie crust and bake in the preheated oven until crust is partially cooked and lightly browned, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon cooked steak filling into the partially-baked pie crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover steak filling with second pie crust; pinch the top crust against the bottom crust to seal tightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake pie until top crust is golden brown, 10 to 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Pork Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Michael St. Laurent"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.46875,
            "ratingCount": 64,
            "itemReviewed": "Steak and Irish Stout Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "597.2 calories",
            "carbohydrateContent": "31.6 g",
            "cholesterolContent": "80.4 mg",
            "fatContent": "38.3 g",
            "fiberContent": "3.2 g",
            "proteinContent": "30.4 g",
            "saturatedFatContent": "12.3 g",
            "servingSize": null,
            "sodiumContent": "498.1 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-04-08T23:02:32.937Z",
                "reviewBody": "I got this recipe from the Guinness website several years ago and I've made it many many times since then. It is our traditional Christmas dinner with Colcannon. Because I always use sweet onions I do not use the raisins. It takes a while to prepare but it's definitely worth it for a special occasion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wisweetp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sogirl_2/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-17T03:59:43.117Z",
                "reviewBody": "Recipe Group Selection:  09, March 2013 ~ I made this for my guys, knowing I would not be trying it.  I used 1 pound of round steak and 1 pound of venison.  I also had to sub green peppers for the mushrooms as they don’t care for them and omitted the raisins for the same reason.  I have never used lard before; therefore I didn’t have any so I used olive oil instead.  So, I made the Steak and Irish Stout Pie using the above ingredients, plus the rest listed and the guys LOVED it!  They took one bite and said, “Give this one 5-stars”.  Because of the length of time it takes to prepare this recipe, I did all the browning and baking of the meats on one night, cooled and refrigerated the dish over night.  The next night, I heated the filling and proceeded with the recipe.  sassyoldlady, another AR member sent out a reminder about piercing the bottom crust when pre-baking it.  That was so helpful, as I would not have done that because the instructions didn’t tell me to do so.  I pre-baked the crust, add the filling, minus some of the broth and added the top crust.  Mine did take about 20-25 minutes to completely bake.  I let the pie rest 10-15 minutes before cutting to let it set up.  As I said before, my guys loved it.  When they reheated the leftovers, they added a dollop of sour cream and enjoyed it even better that way.  Thanks Michael St. Laurent for sharing your recipe – it is a keeper for my family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-12T00:00:30.937Z",
                "reviewBody": "Made this for Recipe Group...I liked it but the guys LOVED it! I did do a few things differently though...I didn't have any lard so I used about 3 Tbsps. butter 2 onions instead of 5 which seemed like A LOT to me and no raisins. IMO this did need some salt and pepper. It's not that this recipe was complicated b/c it was not but I just felt like it took me all day to make it lol...maybe I was just in one of those moods today lol. Oh also it took longer than 15 mins. to finish in the oven once I put the top crust on (took more like 30 mins.) but that was fine b/c I had the extra time. The flavors are great and this cut beautifully. I would most likely make this again! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-23T19:06:53.567Z",
                "reviewBody": "First time I followed recipe exactly; second time I made the following changes: Eliminated lard; Reduced bacon to 5 slices reduced onions to 4 added 2 sliced carrots & 1/2 cup chopped leafy celery hearts replaced white mushrooms with portobellas added 3 cloves garlic 2 tsp low sodium beef bullion 1/2 tsp chili powder and 3 tsp dried thyme. After browning I cooked filling ingredients in slow cooker instead of oven - low for 4-5 hours. I added cornstarch slurry in last hour to aid thickening. I used just a top pastry crust when baking. By my calculation eliminating the lard reducing bacon and using one crust reduces the calories/serving to around 400 & cut fat by more than half and the fatty ingredients weren't missed. That's a win! Next time I'll try a puff pastry top crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tberkley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10172187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-15T21:35:32.8Z",
                "reviewBody": "Have you ever spent so much time making something that by the time it was ready to eat you were sick of it? I think that's what happened to me here. Made it exactly as written. I found it to be very greasy. I just didn't care for the flavor at all. Definitely needs some sort of seasoning to balance out the sweetness of the Guiness sugar and pastry. My family seemed to like it though. I think after spending half of the day preparing and cooking this I just wasn't interested anymore.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "DrMomCooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5581229/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-23T14:53:23.46Z",
                "reviewBody": "This was incredible!!  I made this for St. Patrick's Day and my husband said this is a keeper!!  I followed everything exactly except I didn't have raisins and I only used 1/2 of a very large onion.  The flavor was so good and at the end end of the oven cooking I threw a handful of baby carrots into the pot.  I am going to make this again as a regular stew with potatoes too.  Thanks for sharing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandy Slack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6294856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-16T21:32:16.63Z",
                "reviewBody": "This had good flavor but I don't like needing a side dish for something like this so if I made it again I would add some veggies and more gravy. I made a quarter of this since I had 1/2 pound of very rare steak in the freezer I was looking to use up. I used bacon grease instead of lard and then didn't think the mushrooms were even worth the trouble for such a meager amount so I doubled them(there still weren't too many for me). I didn't know what size/type of onion was intended so I used 3/4 of a large vidalia and that was about right for us. I did not use the raisins. There was a lot of stuck-on \"browned bits and flour\" in the skillet when done so I sort of deglazed it with the beer to get all the flour in the broth. I used 4 oz instead of 3 oz for the 1/4 recipe and the broth was nice and thick. I made individual pot pies and the bottom crust shrunk a little but was nice and substantial. The whole thing popped right out of the pan. I served it with Scottish Bubbles and Squeak Patties which I left in the mashed form rather than make patties. All this for recipe group 3/16/13:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "linda2d",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3733363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-15T16:12:06.107Z",
                "reviewBody": "Made for Recipe Group. I just dusted the cubes with flour until they were all coated. I also salt pepper and garlic powder sprinkled the meat first. Not ever having lard here I put some olive oil in the skillet(by mistake) added about 6 tbsp of bacon grease to go with and browned the meat. I chopped some already cooked bacon added that to it. Sauteed one huge vidalia onion that I sliced instead of minced(more would have been good)and added that to the steak. No raisins (hubby would not have eaten this with them in there) and I forgot to pick up some stout so Bud Lite went in there instead. I didn't remember to put some holes in the crust before blind baking and it split cracked and puffed. Added the steak mix in anyway which I thought was still way too runny. I thickened it with a little flour slurry first. Put on the top crust vented to release steam and baked till brown. Upon cutting to serve the bottom crust had pretty much disappeared into the meat mixture. Beer gives this an excellent flavor much to my surprise. It does need a little something in there maybe a dash of hot sauce and some Worcestershire for next time. And just a top crust. Loved the flakiness of the pie crust with the rich satisfying flavor of the meat part. All in all I'd say it is something I would like to make again. Thanks for the recipe! (I did saute some mushrooms for hubby to add to his part:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-29T22:55:09.89Z",
                "reviewBody": "This pie went down so well people had seconds:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "leti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14490827/"
                }
            }
        ]
    }
]