[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17530/desserts/fruit-desserts/peach-desserts/",
                    "name": "Peach Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15046/easy-peach-cobbler-with-cake-mix/",
        "name": "Easy Peach Cobbler with Cake Mix",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F777288.jpg",
            "width": 2376,
            "height": 1584
        },
        "datePublished": "1999-03-05T14:06:17.000Z",
        "description": "This is a quick but company-worthy cobbler. So simple, yet wins rave reviews.  If desired, use 2 (32 ounce) cans of peaches in place of fresh peaches. If doing this, use peach syrup instead of water and then omit the white sugar from recipe. Also, yellow cake mix can be substituted for the white.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "12 fresh peaches, pitted and sliced",
            "1 cup water",
            "1 cup white sugar",
            "½ teaspoon ground cinnamon",
            "1 (18.25 ounce) package white cake mix",
            "1 (8 ounce) package cream cheese",
            "½ cup butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread peach slices evenly into a 9x13 inch baking dish. If using canned peach juice, pour 1 cup of it over peach slices. If using fresh peaches, combine water and sugar in a small bowl. Stir to dissolve, then pour mixture over peaches.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle cinnamon over peach slices, followed by dry cake mix. Top cake mix with pats of cream cheese. Dot cobbler with butter or margarine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 45 minutes, until golden.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Peach Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rebecca Lentz"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.283536585365853,
            "ratingCount": 328,
            "itemReviewed": "Easy Peach Cobbler with Cake Mix",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "403.8 calories",
            "carbohydrateContent": "56.4 g",
            "cholesterolContent": "40.9 mg",
            "fatContent": "18.8 g",
            "fiberContent": "0.4 g",
            "proteinContent": "3.4 g",
            "saturatedFatContent": "9.7 g",
            "servingSize": null,
            "sodiumContent": "397 mg",
            "sugarContent": "45.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-17T19:27:39.38Z",
                "reviewBody": "I've used this recipe for years and it's always been great.  Well, with a few changes it works out great.\n\nFirst, skip the extra sugar if your peaches are already sweet (most fresh ones are if they're ripe and ALL canned peaches are sweet enough).  If you're using another fruit, like blackberries or raspberries, then you'd need the extra sugar.  Remember, the cake mix has sugar, too.\n\nSecond, cream the cheese and cake mix together with a pastry cutter or a couple forks until it resembles a crumbly granola-type consistency.\n\nThird, melt the butter and pour it over with the liquid (use less liquid if your fruit is really juicy!)  Alternately, cream the butter in with the cheese and cake mix (see above).\n\nAnd last--cinnamon is not always appropriate if you are using this with a different fruit.  Other options that might sound better to you are nutmeg, vanilla bean specs or vanilla-flavored sugar.  Oh, and for a crunchy bonus, sprinkle the top with sliced almonds before baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "funtocook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/503432/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-27T20:04:43.713Z",
                "reviewBody": "OK, I reviewed this before but last night 8/26/07 I made this again and found a better way to make the cobbler.  I mixed the cream cheese with the cake mix in a food processor just until mixture gets crumbly. After putting this mixture on the peaches (used fresh this time) I added the butter (melted) over the top of the cobbler.  My fiance said that was the best cobbler I have ever made. I give the credit to my food processor. This recipe is now 5 stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Danielle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/917095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T05:50:24.64Z",
                "reviewBody": "This is a really great and easy peach cobbler that is a family favorite.  I did do a few revisions though.  I left out the water and suger all together (I used 2 large cans of peaches with heavy syrup instead and added 1 cup of the juice instead of fresh).  I also cut the cream cheese into the cake mix with a pastry cutter (two knives work just as well) and then sprinkled the mixture on top of the peaches and cinnamon.  I also melted the butter and drizzled it on top of the cake mix and increased the baking time to one hour. It comes out great and perfect every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DSRTBLND43",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/730779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-29T19:11:52.92Z",
                "reviewBody": "This was awesome! BUT Im glad I read the reviews before I made it. I used the canned peaches and added the 1 cup of juice. I also cut the cream cheese into the cake mix {excellent tip} and then drizzled the melted butter on top. I cooked it for about 1 hour and it came out excellent. Nothing was undercooked. What a nice easy recipe to whip up in a hurry!! thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDAMAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/614843/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T23:21:57.06Z",
                "reviewBody": "This is such a fast and easy dessert and it is wonderful but I do make it a bit different. We call it\" peach delight\". We use 1 large can peaches sliced in syrup (can use 2 cans, but I never do), 1 box yellow cake mix, 1 stick butter or margarine, 1/2 cup chopped nuts. No cream cheese. Pour peaches and juice into a 9x13 pan. Sprinkle dry cake mix evenly on top, add nuts over top. Cut marg. into thin slices and arrange on top so that it all gets covered when it melts. Bake 350 for 40-45 min. Maybe more depending on how many peaches you use, just watch. Top with cool whip when ready to serve. This may help with those who thought it was watery. It can't get any easier than this and it's such a nice and yummy dish to serve. Thanks Rebecca!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "awesome in tummy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-25T13:42:06.257Z",
                "reviewBody": "The cream cheese and cake mix make this recipe rich and delicious. I used two large can of peaches instead of fresh peaches. Also, I substituted brown sugar for white sugar. I blended the cream cheese, cake mix and butter with a pastry blender to make sure it was well blended. Also, I added 1/2 t. of nutmeg with the cinnamon. Very Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carolina Chick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1011051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-16T00:08:53.453Z",
                "reviewBody": "I made this as a last miniute dessert for a bbq and it was amazing!!!! So good our friends offered to \"clean the pan\" and bring it back to me! Next time I might add a little more cream cheese but the recipe is wonderful just as it is! - Ok I have now made this recipe about a dozen times I have added more cream cheese (2 pkgs instead if 1) and I have used other flavors of cake mix. So far butter pecan cake mix is my favorite with a light dusting of brown sugar over the peaches. The recipe is great as is but is easy and fun to change!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SMILEFROGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/112475/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-18T16:09:00.02Z",
                "reviewBody": "I have mixed emotions about this recipe. For the good side it tastes really good and although I was worried about the cream cheese it gave it a unique twist. On the bad side it is VERY watery. Also the cake mix doesn't cook all the way on the top. My suggestions would be to either not add as much water at the beginning or to mix up the cake mix with the peaches before you cook it. I was rather dissapointed with the appearance but pleasently suprised with the taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "QTPIE22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/679978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-29T19:12:01.39Z",
                "reviewBody": "WOW!! This was the easiest and tastiest dessert! 6 yr. old son and I made this and we used Santa Barbara Peaches from our tree! We ate it hot from the oven with Breyer's French Vanilla Ice Cream. Sooooo good! I sure don't agree with the 2 other poor/bad reviews that DIDN'T recommend this?? Mebbe they just plunked it like a dump cake....? It isn't like that. (I don't understand how theirs came out that way either?) What I do recommend for folks using this recipe is to break up ALL of the \"chunks\" of cake mix with a butter knife as it sits on top of the peaches and h2o/sugar mix BEFORE adding the cream cheese & butter.... and sprinkle an extra 1/8 c. water on top of the finished cobbler (the butter & cream cheese part).... and by doing that we got the yummiest crust with no underdone portions. My son and hubby loved this -- our company raved over this one! Plus I was proud the peaches came from my own tree! Kudos to Rebecca for this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DCROOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/388083/"
                }
            }
        ]
    }
]