[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15057/overnight-blueberry-french-toast/",
        "name": "Overnight Blueberry French Toast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F381517.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2000-01-04T19:25:23.000Z",
        "description": "This is a very unique breakfast dish. Good for any holiday breakfast or brunch, it's filled with the fresh taste of blueberries, and covered with a rich blueberry sauce to make it a one of a kind.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT10H0M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "12 slices day-old bread, cut into 1-inch cubes",
            "2 (8 ounce) packages cream cheese, cut into 1 inch cubes",
            "1 cup fresh blueberries",
            "12 eggs, beaten",
            "2 cups milk",
            "1 teaspoon vanilla extract",
            "⅓ cup maple syrup",
            "1 cup white sugar",
            "2 tablespoons cornstarch",
            "1 cup water",
            "1 cup fresh blueberries",
            "1 tablespoon butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Lightly grease a 9x13 inch baking dish. Arrange half the bread cubes in the dish, and top with cream cheese cubes. Sprinkle 1 cup blueberries over the cream cheese, and top with remaining bread cubes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix the eggs, milk, vanilla extract, and syrup. Pour over the bread cubes. Cover, and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the bread cube mixture from the refrigerator about 30 minutes before baking. Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and bake 30 minutes. Uncover, and continue baking 25 to 30 minutes, until center is firm and surface is lightly browned.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, mix the sugar, cornstarch, and water. Bring to a boil. Stirring constantly, cook 3 to 4 minutes. Mix in the remaining 1 cup blueberries. Reduce heat, and simmer 10 minutes, until the blueberries burst. Stir in the butter, and pour over the baked French toast\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KARAN1946"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.532293986636971,
            "ratingCount": 2245,
            "itemReviewed": "Overnight Blueberry French Toast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "485.2 calories",
            "carbohydrateContent": "51.9 g",
            "cholesterolContent": "279.4 mg",
            "fatContent": "24.8 g",
            "fiberContent": "1.4 g",
            "proteinContent": "15.1 g",
            "saturatedFatContent": "13.3 g",
            "servingSize": null,
            "sodiumContent": "451.2 mg",
            "sugarContent": "33.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-30T21:13:48.577Z",
                "reviewBody": "YUM!  I made this for Christmas morning for my inlaws. It turned out great. I did take a lot of the suggestions and modified this recipe. Here's what I did: Used Italian bread from the bakery (French bread seemed like too much crust). I also whipped 1 1/2 bricks cream cheese w/ 1/4 cup confectioners sugar and spread it over the cubed bread. I used frozen blueberries (thawed) and only 10 eggs. I also made sure to press the bread down so that everything got french toast consistancy. The syrup is delicious!! I made 1.5 times and poured 2/3 of it over the dish and the other 1/3 was put on the table for those who wanted a little bit more. Overall, this is a great recipe!! Will be sure to make at my next brunch. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLARRY32",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1227300/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-27T22:12:55.223Z",
                "reviewBody": "I am only giving this 3 stars because, as written, it needs some work. It is, however, a great basis for a recipe. I try to only give feedback that I think is truly helpful, so here are my suggestions. 1. Make sure you use a good hearty bread like an Italian or French loaf from the bakery. If you use basic loaf bread, it will be way too soggy. You do not want a soft or delicate bread. 2. After placing the first layer of bread, sprinkle with cinnamon for more flavor. 3. After reading many reviews, I decided to mix 1.5 blocks of cream cheese with 1/4 c. of powdered sugar and then spread it on the bread.  I thought it was still hard to spread, so next time I will add a little milk to thin it out. Maybe also a dash of vanilla. 3. I used frozen blueberries (thawed) & they worked well.  You could also definitely use more than a cup in the middle of the french toast. 4. After placing the 2nd layer of bread, sprinkle with cinnamon again. 5. I thought the blueberry sauce was lacking a certain wow factor, so I added a little fresh lemon juice. This definitely gave it what I thought had been missing.  Overall, this was very good with modifications and would be great when you have have company. Next time, I will make this with strawberries instead, and I'm betting it will taste like a breakfast version of strawberry shortcake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "VBHOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/841865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-04T15:54:47.493Z",
                "reviewBody": "Delicious and beautiful, and perfect just as written.  I used a good quality Italian bread, and chose to serve the blueberry sauce on the side. My out of town guests, both of whom are professional chefs, loved this so much they asked for the recipe.  Gooey, creamy and crunchy all at the same time, depending on what forkful hits your mouth! Any leftover sauce (I made a double recipe of it) would be great on waffles, pancakes, pound cake or ice cream.  We all enjoyed this very much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T15:59:33.117Z",
                "reviewBody": "I made this for Christmas Eve Brunch.  I followed the advice of others and decreased the cream cheese to 10 oz.  I added a little milk and whipped the cream cheese and spread it on the slices of bread.  A little messy but it was evenly distributed.  I also took the advice of others and doubled the amount of blueberries in the syrup and in the dish itself.  Atleast use one and a half the blueberries when making it.  I cut the sugar in the syrup to 3/4 cup - it was plenty sweet.  I added a dsh of cinnamon and nutmeg to the syrup too.  I still had a request to get out the regular maple syrup.  All in all, a very easy dish that is a little different from the standard egg casseroles so often served for a crowd at breakfast or brunch.  I would make this again - next time I will try strawberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Makowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-29T00:09:26.2Z",
                "reviewBody": "Tasty. I used cinnamon raisin swirl bread, 10 eggs, and a grating of nutmeg. After reading comments about the blobs of cream cheese I chilled the brick in the freezer and then grated it over the bottom layer, much more efficient than spreading on bread. And then to add a bit more colour and zing I threw in a handful of chopped fresh cranberries. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Deb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2117139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-27T17:39:28.41Z",
                "reviewBody": "My husband REALLY likes this recipe.  I've made it twice now. The second time I tried it with strawberries.  That was good too.  Just like everyone else I've made adjustments to the recipe....I 1) doubled the amount of blueberries, 2) cut the cream cheese to one package and whipped it with a little bit of milk, sugar and vanilla so that it made like a filling (works great!), 3) doubled the \"syrup\" recipe, 4) I've made it with day old French bread and day old croissants.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CRISSYF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/184266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-22T11:50:36.78Z",
                "reviewBody": "This has been one of our favorites for a few years now.  This makes a lot, so be sure to use your largest casserole dish.  If you prepared this way ahead of time and it has been well refrigerated, it will need extra time on the counter \"warming up\" to room temperature before you cook it.  You'll have a more difficult time cooking it all the way through if it's too cold.  Delicious, unique recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AllyJo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1130395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-29T20:44:02.967Z",
                "reviewBody": "I have made this recipe many times as is and it is really great. I now make it with a few minor variations and everyone loves it. For the bread, I use french bread (it gives it a much lighter, fluffier texture than regular bread), I only use 8 oz. of cream cheese, I use 1/2 cup of maple syrup instead of 1/3 cup and I sprinkled cinnamon over it before putting it in the fridge. The cinnamon really makes it smells great baking. Everyone loves it. This is a staple in our house for Christmas morning or anytime I have friends or relatives visiting. It lets me spend more time with them and less time in front of the stove.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "neesienc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/818165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-01T23:05:43.667Z",
                "reviewBody": "I couldn't help myself...I made some changes on my own which turned out to be AMAZING!  ~ I could eat this for desert.  I have a 12 year old, a 10 year old and a 7 year old. ~ They all gave it rave reviews.  I put cubed French bread and croissants into my buttered dish.  Then I added my *\"cream cheese mixture\" over top, then topped with the blueberries.  The next morning I used a knife and very gently swirled some of the cream cheese mixture into the casserole, not to incorporate, just to allow the cream cheese mixture to soak down a bit. It made a beautiful presentation.  I will definitely make this one over and over.  *(cream cheese mixture: 2 8oz Cream cheese and 3/4 c. sugar, cream well.  Add 1 egg and 1 1/2 tsp lemon juice.  Cream well.)  I hope you try this change.  This is now one of my favorite breakfast casseroles.  Of course...fruit is an option.  (with strawberries it would be amazing too!)  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "margaretc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3659129/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Overnight Blueberry French Toast",
            "description": "Make this delicious brunch dish for a holiday, or any special occasion.",
            "uploadDate": "2012-10-08T19:59:51.543Z",
            "duration": "PT3M56.987S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2c975438-99ec-44fa-8ae6-bb0c7e0d6ba2%2F63ec3293-9cb9-40fe-b148-550d31267d6f%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1886536485001"
        }
    }
]