[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
                    "name": "Custard and Cream Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/810/desserts/pies/custard-and-cream-pies/lemon-pie/",
                    "name": "Lemon Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 7,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17489/desserts/pies/custard-and-cream-pies/lemon-pie/lemon-meringue-pie/",
                    "name": "Lemon Meringue Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15093/grandmas-lemon-meringue-pie/",
        "name": "Grandma's Lemon Meringue Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F20%2Fimage.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-05-05T22:01:04.000Z",
        "description": "This is a very fun recipe to follow, because Grandma makes it sweet and simple. This pie is thickened with cornstarch and flour in addition to egg yolks, and contains no milk.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 cup white sugar",
            "2 tablespoons all-purpose flour",
            "3 tablespoons cornstarch",
            "¼ teaspoon salt",
            "1 ½ cups water",
            "2 lemons, juiced and zested",
            "2 tablespoons butter",
            "4 egg yolks, beaten",
            "1 (9 inch) pie crust, baked",
            "4 egg whites",
            "6 tablespoons white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Lemon Filling: In a medium saucepan, whisk together 1 cup sugar, flour, cornstarch, and salt. Stir in water, lemon juice and lemon zest. Cook over medium-high heat, stirring frequently, until mixture comes to a boil. Stir in butter. Place egg yolks in a small bowl and gradually whisk in 1/2 cup of hot sugar mixture. Whisk egg yolk mixture back into remaining sugar mixture. Bring to a boil and continue to cook while stirring constantly until thick. Remove from heat. Pour filling into baked pastry shell.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Meringue: In a large glass or metal bowl, whip egg whites until foamy. Add sugar gradually, and continue to whip until stiff peaks form. Spread meringue over pie, sealing the edges at the crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 10 minutes, or until meringue is golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Custard and Cream Pies",
            "Lemon Pies",
            "Lemon Meringue Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Emilie S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.631837536849001,
            "ratingCount": 3053,
            "itemReviewed": "Grandma's Lemon Meringue Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "297.7 calories",
            "carbohydrateContent": "49.7 g",
            "cholesterolContent": "110.1 mg",
            "fatContent": "10.3 g",
            "fiberContent": "1.5 g",
            "proteinContent": "4.4 g",
            "saturatedFatContent": "4.3 g",
            "servingSize": null,
            "sodiumContent": "229.2 mg",
            "sugarContent": "35.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-24T03:56:04.293Z",
                "reviewBody": "This was a great pie after some tweaking as follows: for the filling I used 1 1/4 cups of extra fine sugar, 3 1/2 tbsps of cornstarch 2 oz of lemon juice 1 1/2 teaspoons of lemon extract and 1 tsp of vanilla extract (I don't like the way rinds feel when eaten).After I added the sugar mixture into the yolks,I turned down the temp on the stove and cooked the filling for 14 mins it turned out nice and thick.As for the meringue I turned the mixer on high and beat the whites for about 2 mins than I added 1/2 tsp of cream of tarter and 1/2 tsp of vanilla extract.Then I added the sugar (extra fine) and let the mixer do it's magic for about 14 mins. After baking I cooled the pie for and hour on the counter and put it in the frig. It turned perfect, the filling was just right and the meringue did not pull away from the pie and there was no liquid underneath the meringue.Happy baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARTHECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1318989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-07T09:50:35.013Z",
                "reviewBody": "Excellent recipe! Nice and lemony, not too sweet with good proportions of curd and meringue. My second attempt on lemon meringue pie.\r\nI recommend stirring the curd very frequently to prevent burning. Remove the curd from heat only after it becomes really, really thick. Meringue to be added onto hot curd, such that the meringue bottom will cook. If the meringue bottom is not cooked the meringue will liquify and the pie will fail. Also let the pie sit for an hour at room temperature after baking, then 3 hours in the fridge to ensure everything has solidified, else upon cutting it the curd will ooze. Simple ingredients, but requires some understanding of how the meringue cooks ...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AUDREY25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1435629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T01:56:45.937Z",
                "reviewBody": "Update 12/03:  I still think this is a great recipe.  In perfecting my technique, I'd like to suggest mix in one bowl the water, lemon zest, and lemon juice; mix in another bowl the sugar, flour, cornstarch, and salt. 12/02: This is a successful recipe for a delicious pie.  I tried another recipe twice before for this kind of pie but the results were less than desirable.  This recipe came out just right.  The filling was firm, not runny!  I zested 1 lemon rather than 2, but used the juice of 2. I'd like to offer the following: The recipe doesn't tell you about cooling and refrigeration.  I let my pie cool 1 hr on a cookie rack, 3-6 hrs uncovered in the refrig before slicing, after 6 hrs in refrig, cover the pie (I used foil rather than plastic wrap.)  Thanks Emilie S for passing this along.  My hubbie and I are very grateful.  I'll be making 3 of these for Christmas dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRUDY WOLCOTT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/759025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-25T03:25:09.687Z",
                "reviewBody": "Finally I have found the perfect recipe for lemon meringue pie!  I made this tonight for my dad and it came out great.   The only thing that I wasn't clear on was the amount of lemon juice to use. 2 lemons can mean different things to different people.  I used 1/2 cup of lemon juice(about 3 lemons) and 1 tablespoon of zest.  It was the perfect balance of sweet and tart.  Also, it doesn't mention how to cool it.  I left it at room temperature for about an hour and then put it in the refrigerator for about 5 hours.  One tip I have is after the lemon filling starts to boil, only boil it for 1 minute so the cornstarch doesn't lose its thickening power.  Then, after you add the tempered eggs back into the hot mixture, boil one more minute and it will be a perfect thickness.  Also, when you fill the pie crust with the lemon filling, the crust should still be warm and when you top the pie with the meringue, the filling should still be pretty warm.  This will help seal the meringue after it cools so it doesn't separate from the crust.  I will definitely keep this recipe and I have a feeling I will be making this again very soon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mamazilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1488733/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-22T01:47:49.7Z",
                "reviewBody": "this pie was fantastic...after two tries of making it.  the first try, it didn't make nearly enough to fill the pie plate (a deep dish 9\" plate).  also, it made kind of a gelatinous, almost clear jelly type substance.  the flavor was good, but not at all what i was expecting.  so, i dumped it and tried again the next day.  after reading ALL the reviews, i followed Angela's suggestions from page 10.  I changed the servings to 12, used milk instead of water (huge difference), used the zest from 3 lemons and the juice i got from them, which was 1/2 c., which was perfect, i also used about 1/2 tablespoon more cornstarch.  making those changes yielded a yellow custard that i am used to seeing in lemon pies.  after whisking the egg mixture back in, i lowered the heat to medium low and stirred until i felt it was thick enough.  (maybe 10-15 minutes of constant stirring).  after i spooned it into the pie shell and topped with meringue i let it cool to room temperature for over an hour then put it in the fridge for about 4 hours before i served it.  i used Pie Crust IV and Meringue II from this site.  it was, as my, self-proclaimed-lemon-meringue-pie- connoisseur father said:  \"pretty damn impressive\".  (he had thirds)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TTROELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/692115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-17T21:58:11.24Z",
                "reviewBody": "I'm an experienced baker but never tried lemon meringue pie because it's not my favorite. The ones I've tried were either sour or gummy or both. A friend requested a lemon pie so I gave it a shot. This recipe turned out perfectly, even I was surprised how much I love the taste. Took the suggestions to use 1/4 c. lemon juice, and milk (2%) instead of water. The filling was beautifully creamy, not too sweet, not too tart. I piled the meringue high on a hot filling. Make sure to nudge the meringue all the way to the edge of the crust to seal the filling. Was very happy with the results. No shrinking meringue, no watery layer, no seepage of the filling after the pie was cut. Even after refrigeration there were just a few little beads of sugary moisture dotting the meringue, but the filling held up and didn't sog up the bottom crust. I used Martha Stewart's Pate Brisee recipe (all butter).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MZMUFFIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-17T15:19:11.203Z",
                "reviewBody": "Everyone who is having problems with water in your pie **you cannot cover a lemon meringue pie with plastic wrap to store it, condensation forms and will leave you with a puddle in your pie** to store very loosely cover it with tented aluminum foil leaving a little opening for moisture to escape",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVECED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1280465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T21:40:13.18Z",
                "reviewBody": "If you are even thinking about making this pie, READ THIS REVIEW!!  This pie is fantastic!  Wonderful lemon flavor, as it's just the right balance of sweet and tart.  However, I did make a few minor adjustments.  First of all, while I'm sure experienced bakers picked up on this, this recipe does not specify that the crust must be pre-baked before adding the filling, otherwise you will end up with either a raw crust or a burnt meringue.  I pre-baked mine for 9 minutes.  2)DO NOT try to sub bottled lemon juice for the real thing.  It definitely changes the taste.  I used the juice of 3 lemons, which came to 1/2 cup, and the zest of 1.  3)I used milk instead of water and it gave the filling a delicious creamy texture.  4)I always double the recipe to get a nice, thick layer of lemon custard, if you make the recipe as shown, your custard layer will be only about half an inch thick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "703wifenmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5594781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-07T11:07:50.81Z",
                "reviewBody": "This is a good, but fairly standard lemon meringue pie with a rich, tart filling, and fluffy meringue.  I prefer lemon meringue pie recipes like this one that call for water, rather than recipes using milk.  I used three small lemons, which yielded about 1/2  c. of lemon juice and 1 T. zest. I would have preferred a thicker pie, however, so were I to make this again I would increase the recipe overall by half. Tip: a weepy meringue is sometimes a problem, but can generally be avoided by not overcooking the meringue.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Grandma’s Lemon Meringue Pie",
            "description": "See grandma’s sweet-and-simple recipe for tart and tangy lemon meringue pie!",
            "uploadDate": "2012-05-22T21:06:52.976Z",
            "duration": "PT3M33.333S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7fdf6d1c-8a71-44eb-9742-cb0a4d6a4fc4%2Fd4c55db8-303d-46a4-91e4-6fba33a97eb0%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1651107286001"
        }
    }
]