[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17472/trusted-brands-recipes-and-tips/mazola/",
                    "name": "Mazola&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236475/sweet-and-spicy-salmon-with-grapefruit-salsa/",
        "name": "Sweet and Spicy Salmon with Grapefruit Salsa",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1109399.jpg",
            "width": 2592,
            "height": 2592
        },
        "datePublished": "2014-02-03T19:48:09.000Z",
        "description": "Moist salmon with a sweet but savory rub that is perfectly complemented by the fresh, tart grapefruit salsa.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 ½ teaspoons paprika",
            "1 teaspoon onion powder",
            "1 teaspoon garlic powder",
            "¼ teaspoon salt",
            "¼ teaspoon oregano",
            "¼ teaspoon thyme",
            "¼ teaspoon finely ground black pepper ",
            "⅛ teaspoon cayenne pepper",
            "1 ½ teaspoons brown sugar",
            "1 pound salmon fillet",
            "2 teaspoons Mazola® Corn Oil",
            "2 cups grapefruit sections",
            "⅓ cup chopped green onion",
            "¼ cup chopped red bell pepper",
            "¼ cup chopped fresh cilantro",
            "1 jalapeno pepper, diced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine paprika, onion and garlic powder, salt, oregano, thyme, black pepper, cayenne pepper and brown sugar in a small bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut salmon into 4 portions and brush with oil.  Distribute the rub over the salmon generously coating all surfaces. Place salmon on a shallow baking pan with sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 20 minutes, until fish flakes easily.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Coarsely chop grapefruit into bite size pieces.  Combine all salsa ingredients and serve with salmon.  Grapefruit salsa can be made ahead and refrigerated until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Mazola&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mazola"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.280898876404494,
            "ratingCount": 89,
            "itemReviewed": "Sweet and Spicy Salmon with Grapefruit Salsa",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "248.4 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "50.4 mg",
            "fatContent": "9.3 g",
            "fiberContent": "1.6 g",
            "proteinContent": "25.6 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "199.2 mg",
            "sugarContent": "13.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-03-07T20:51:06.21Z",
                "reviewBody": "The rub is a solid 5 stars - it would be good on just about anything! Instead of Salmon I used Steel Head trout. (A firm red fish like salmon.) Hubby cannot eat grapefruit so I made the salsa with Cara Cara oranges which was perfect. (blood oranges would be great). I lined a sheet pan with parchment paper and placed the fish on one side and asparagus on the other end. I did change the cooking time and temperature to 400 degrees convection setting for 10 minutes. Both the fish and the asparagus were done at the same time. Fast easy delicious and healthy too. Served on a bed of rice with a spinach salad side. Even the fish hating hubby like this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-26T00:58:37.88Z",
                "reviewBody": "Unfortunately I was unable to buy fresh wild Alaskan sockeye salmon (my favorite) so I settled on farm-raised salmon which I knew wouldn't measure up in flavor. It was very fresh it cooked perfectly at 20 minutes and although the salmon itself wasn't all that flavorful the rub really kicked it up a notch. For our tastes we could have used a little more jalapeño in the salsa but we enjoyed the pop of citrus flavor that came with the grapefruit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-09T00:41:11.26Z",
                "reviewBody": "Great recipe - the rub was fabulous! I subbed tilapia for the salmon to give it a try and no matter how much I pleaded with my husband to at least try fish he wouldn't...(maybe next time)so I ended up using the rub on pork for him which actually turned out very good. Since I wasn't a fan of the grapefruit salsa after making it I ended up going with a mango salsa instead. Overall it was a nice blend of \"sweet and spicy\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-08T21:17:15.03Z",
                "reviewBody": "I actually really liked the salmon on this with the rub. Based on reading the other reviews and about the heat with the rub I only did a pinch of cayenne. I just don't care for hot food. It seemed like a lot of seasoning but it was a nice amount after it was baked. I also made sure to do a packed but leveled amount of brown sugar so it wasn't too sweet either. I lined a baking sheet with heavy duty foil sprayed it with PAM well and baked it on that. I didn't precisely measure the corn oil. I just drizzled it. I liked the mild taste of the corn oil compared to others I typically use. I think the extra amount may have given it a nice crispiness. I have never baked salmon in the regular oven and really liked the ease of this method. I usually use a broiler or sauté pan. I kept it in for 30 minutes and it seemed like a good amount of time. 1 lb is really not a lot of salmon. I got 4 really small pieces. So I would make more next time. I used skin on salmon but might try the skinned kind next time. The salsa I was really not excited about. I made 1/2 recipe of it and it was plenty. It makes an interesting combination when a bite of it is eaten with the salsa. Grape fruit has also really gotten sweeter from what I remember as a kid. I bought what my local grocery store had called cocktail grapefruit. I made sure to cut off all of the outer peel the white pith and seeds before chopping to help with bitterness. I am rating this a 4 as I plan to make the salmon again. ty",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-04T03:56:59.353Z",
                "reviewBody": "I had to change the salsa a bit none of us like cilantro so I used parsley. My grapefruit was really tart so I added about 1/2 tsp of honey and let the flavors meld for a few hours while I prepared the rest of our meal. This was a treat I splurged on wild caught sockeye salmon and the rub was a terrific blend of sweet and spicy enhancing the flavor perfectly. All in all a great meal. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-05T16:29:05.273Z",
                "reviewBody": "My review pretty much dittos all the rest of the reviews. A winning recipe! The only two deviations I made were to halve the recipe for the two of us and change out grapefruit for mandarin oranges due to a meds conflict with grapefruit. The salmon spices are spot on. The salsa was perfect and necessary for the salmon. This recipe is restaurant quality company worthy and week day friendly! Thanks to the Mazola chefs for a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Myers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2079610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-10T02:23:55.693Z",
                "reviewBody": "This rating will reflect the salmon only. It was wonderful. Just make it as written unless you are a little iffy about the heat from the cayenne---then start with just half that amount and see what you think. The salsa would be really good if it had some kind of liquid in it---olive oil lemon or lime juice---anything. It just needed something. I had to use something other than grapefruit because of my husband's meds so I chose to use an orange that came from a friend's tree. That worked well. You could easily get by with 1/4 of the salsa for this amount of fish. I have leftover salsa so I'll add something to that and make this same dish again this week. It's that good. Thanks Mazola!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-06T00:52:50.757Z",
                "reviewBody": "This review is mainly for the rub it was very good on chicken. If I could eat Salmon I am sure it would have been goon on that as well. Do to medication interactions I could not use grapefruit so I subbed with cucumber instead. I also used red onion instead of green onions because I forgot the green onions. I added a bit of garlic salt and lime to the salsa after initially tasting the salsa and it was perfect. It paired well with the chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "My Hot Southern Mess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/myhotsouthernmess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-09T20:21:57.1Z",
                "reviewBody": "I really like this recipe! The rub adds a smoky savory and gently sweet crust to the salmon--a great way to add flavor to the fish. I opted to use red grapefruit in the salsa made it a few hours in advance and it's delicious. It was just sweet enough and tasted very fresh. I felt healthy eating this recipe and will definitely make it again. This would be fantastic over a bed of citrus-flavored vegetable quinoa. YUMMM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-02T04:31:12.62Z",
                "reviewBody": "Followed the recipe as written except replaced cilantro with parsley because we can't stand the stuff. The dish got mixed reviews. Hubby liked it he said he would give it 4 stars would have been 5 if it had instructed to remove the skin. One daughter liked the fish but not the salsa the other liked the salsa but not the fish. My son took one look at it and refused to even taste it and I didn't care for it at all. In fairness I'm not much of a salmon fan. The rub and salsa would probably be great on chicken. I won't make the salmon again but might try the rest with chicken sometime especially since there was so much salsa left over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl King",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mommasangelbaby/"
                }
            }
        ]
    }
]