[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
                    "name": "Custard and Cream Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17202/desserts/pies/custard-and-cream-pies/meringue-pie/",
                    "name": "Meringue Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15173/lemon-meringue-pie-iii/",
        "name": "Lemon Meringue Pie III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4498266.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1999-05-10T03:12:50.000Z",
        "description": "Wonderful lemon meringue pie from one of our local restaurants.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 (9 inch) pie crust, baked",
            "1 ½ cups white sugar",
            "½ teaspoon salt",
            "1 ½ cups water",
            "½ cup cornstarch",
            "⅓ cup water",
            "4 eggs, separated",
            "½ cup lemon juice",
            "2 teaspoons lemon zest",
            "3 tablespoons butter",
            "¼ teaspoon salt",
            "½ cup white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1 1/2 cups sugar, salt, and 1 1/2 cups water in a heavy saucepan. Place over high heat and bring to a boil. In a small bowl, mix cornstarch and 1/3 cup water to make a smooth paste. Gradually whisk into boiling sugar mixture. Boil mixture until thick and clear, stirring constantly. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, whisk together egg yolks and lemon juice. Gradually whisk egg yolk mixture into hot sugar mixture. Return pan to heat and bring to a boil, stirring constantly. Remove from heat and stir in grated lemon rind and butter or margarine. Place mixture in refrigerator and cool until just lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large glass or metal bowl, combine egg whites and salt. Whip until foamy. Gradually add 1/2 cup sugar while continuing to whip. Beat until whites form stiff peaks. Stir about 3/4 cup of meringue into lukewarm filling. Spoon filling into baked pastry shell. Cover pie with remaining meringue.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 minutes, until meringue is slightly brown. Cool on a rack at for at least 1 hour before cutting.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Custard and Cream Pies",
            "Meringue Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rhonda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.589928057553957,
            "ratingCount": 417,
            "itemReviewed": "Lemon Meringue Pie III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "382.9 calories",
            "carbohydrateContent": "66.7 g",
            "cholesterolContent": "104.4 mg",
            "fatContent": "12 g",
            "fiberContent": "0.3 g",
            "proteinContent": "4 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "386.5 mg",
            "sugarContent": "51.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-19T21:09:42.767Z",
                "reviewBody": "I have been making Lemon Meringue pies for many years, trying different recipes, following the \"directions\" to top the pie with meringue when the filling was hot...and you know what? Topping the pie when it's hot is the WORST possible suggestion EVER!!!!  It will always weep if you do this...ALWAYS. FINALLY I figured out a fool proof way to get the meringue NOT to weep: Allow the filling to cool at room temperature until completely cooled and firm.  And NEVER put the pie in the fridge.  Once it's cooled, make your meringue.  Be sure to have the meringue cover the pie to the crust completely and then place it in the oven at 350 degrees (immediately) for 10-15 minutes or until the meringue is brown (careful, keep a close eye on it, because the meringue can go from \"brown\" to \"black\" very quickly--especially if you are someone who likes to have \"peaks\" in your meringue.)  Now, once the pie comes out of the oven let it cool completely at ROOM TEMPERATURE...NEVER place a Lemon Meringue Pie in the fridge UNLESS you want it to weep and get all watery.  I don't know where this urban legend about covering a hot filling with meringue started, but it's WRONG, WRONG, WRONG!!!!!\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2615900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-25T15:25:18.17Z",
                "reviewBody": "Excellent flavor; I also used slightly less sugar than the recipe states for a little more intense lemon flavor.  I don't think I'd made a lemon meringue pie before and I was extremely pleased with the way this one turned out; I will definitely use this recipe again!\r\n\r\nSome notes to prevent shrinkage of the meringue and \"weeping\" (extra moisture under the meringue.  (These tips are from a section on preparing meringue in one of my cookbooks.)  Don't let the lemon filling cool too much; instead of putting it in the refrigerator til lukewarm, after preparing it make the meringue and spoon the designated amount of meringue into the hot/very warm lemon mixture.  Spoon the filling into the baked pie crust, and cover with the remaining meringue while still very warm.  Make sure to spread the meringue well, to the edges, touching the crusts.  These steps should prevent the meringue from shrinking away from the crust and getting soggy underneath!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIAHAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/554778/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-13T17:50:25.4Z",
                "reviewBody": "This was delicious!  As a previous reviewer stated about meringue, don't follow the directions to let the lemon custard cool before putting on the meringue.  To achieve a perfect seal, you must add meringue while the filling is still warm.  Use the \"Meringue II\" recipe from this site -- it's a perfect meringue recipe.  Everyone who ate this wanted a second piece.  The consistency was awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AEVANS28",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1372087/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-06T22:30:31.693Z",
                "reviewBody": "This pie was amazing! I actually have a ponderosa lemon tree (it gets lemons the size of grapefruits) and my first lemon was ripe. I wanted to make something using it and found this recipe. Everything turned out perfectly I did add a small bit more of the cornstarch as suggested in other reviews and if I would change anything I would put a cup of sugar instead of a cup and a half in the filling mixture. It came out a bit sweet. But I would definitely recommend this recipe otherwise as it is....it turned out great and I WILL be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1598640/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-07T17:59:23.843Z",
                "reviewBody": "Look no further for an awesome Lemon Merangue Pie. I read the reviews before I made this but decided not to alter the original recipe at all and it turned out wonderful! My husband liked it too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1625717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-26T16:03:06.17Z",
                "reviewBody": "This waS VERY GOOD HOWEVER I EXPERIENCED SOME OF THE SAME PROBLEMS AS FAR AS THE RUNNYNESS(IS THAT A WORD?) ANYWAY DESPITE THAT IT WAS REALLY GOOD. tHE SECOND TIME I MADE IT I LET THE FILLING COOL COMPLETELY HOPING THIS WOULD CREATE LESS \"JUICE\" IF YOU WILL AND IT DID BUT IT WASNT AS FIRM AS I WOULD HAVE LIKED I THINK I'LL ADD A LITTLE MORE CORNSTARCH NEXT TIME. oVERALL THE TASTE WAS EXCELLENT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "savory bites",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/844171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-06T02:51:13.217Z",
                "reviewBody": "Everyone at my work said this was a wonderful restaurant tasting pie. The only problem I had was were it says mix cornstarch and 1/3 cup water to make a smooth paste. There was no such thing as a smooth paste with 1/2 cup cornstarch and 1/3 cup water it was concrete so I just added some of the boiling sugar/water mixture to try and make it a smooth paste. I did add a little yellow food coloring for the color. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly O'Hara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T06:15:45.913Z",
                "reviewBody": "I made this over the weekend for my daughters' best friends birthday as it's her favorite. I took MARIAHAN'S advice and did not cool the sugar mixture before adding the rest of the ingredients. I had no separation problems and the texture was perfect. Not rubbery or chalky. I did need to add two extra egg whites as there didn't seem to be enough meringue for the top of the pie. I like my meringue pies high and \"peaky\". I also cut back on the sugar a bit and added more lemon juice. My only slight problem was when I cut into it. There was a small amount of liquid on the pie plate just under the crust. I don't know if this is a typical or if it was because the pie had to travel 45 minutes to it's final destination. It was still somewhat warm when we left the house. Other than that everyone absolutely loved it. Thanks Rhonda!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-22T22:26:26.45Z",
                "reviewBody": "This was my 1st lemon meringue pie in 25yrs. The recipe was easy and my pie turned out beautiful. This pie is so good that I could eat the whole thing. My family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pikkivikki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/545729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T18:11:33.370Z",
                "reviewBody": "Followed this recipe TO THE LETTER. Was rewarded with a gloopy, gloppy lemon Thanksgiving soup! Had some misgivings about folding some of the meringue into the filling and I wonder if this is where this recipe failed for us. Wasted perfectly good Meyer lemons from my little tree. Will not be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Erinn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/759894/"
                }
            }
        ]
    }
]