[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/677/main-dish/pork/pork-roast/",
                    "name": "Pork Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15306/special-occasion-stuffed-crown-pork-roast/",
        "name": "Special Occasion Stuffed Crown Pork Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F27643.jpg",
            "width": 2304,
            "height": 1728
        },
        "datePublished": "1999-12-31T23:06:26.000Z",
        "description": "A special crown roast with a regal cranberry apple stuffing. This roast will turn any dinner party into a special occasion and your guests will feel like royalty!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "7 pounds crown pork roast",
            "2 cups chopped cranberries",
            "½ cup white sugar",
            "½ cup butter",
            "2 onions, chopped",
            "2 cups chopped celery",
            "2 teaspoons salt",
            "¼ teaspoon ground black pepper",
            "8 cups white bread cubes",
            "2 apples - peeled, cored, and chopped",
            "½ cup apple juice",
            "1 egg",
            "1 teaspoon poultry seasoning"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season pork roast with salt and pepper to taste, then place on a rack in an open roasting pan, rib ends down.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 375 degrees F (190 degrees C) for 2 hours. Roast will be only partially cooked.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a medium bowl, combine cranberries and sugar and mix well; set aside. Melt butter or margarine in a large skillet over medium heat. Add onions and celery and saute until tender, about 10 minutes. Add cranberry mixture, 2 teaspoons salt, 1/4 teaspoon ground black pepper, bread cubes, apples, apple juice, egg and poultry seasoning. Toss well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After the two hours, remove roast from oven. Turn rib ends up and fill cavity with cranberry/apple stuffing. Insert meat thermometer between two ribs in the thickest part of the meat, making sure that end of thermometer does not touch any bone.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return stuffed roast to oven and continue roasting at 375 degrees F (190 degrees C) for about 1 1/2 hours, or until internal temperature of meat reaches 175 degrees F (80 degrees C). (Note: If stuffing becomes too brown, cover it with aluminum foil.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Serve: Place roast on warm platter and let stand for 15 minutes for easier carving. Slice between ribs to carve, and serve with stuffing.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3088235294117645,
            "ratingCount": 68,
            "itemReviewed": "Special Occasion Stuffed Crown Pork Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "712.7 calories",
            "carbohydrateContent": "43.8 g",
            "cholesterolContent": "192.7 mg",
            "fatContent": "36.9 g",
            "fiberContent": "3.9 g",
            "proteinContent": "50 g",
            "saturatedFatContent": "16.6 g",
            "servingSize": null,
            "sodiumContent": "1046.1 mg",
            "sugarContent": "22.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-29T04:21:02.733Z",
                "reviewBody": "This recipe is a real crowd pleaser. I added 2 1/2 cups of the whole cranberry sauce instead of the cranberries, apple juice and sugar. The dressing was delicious. I used a rub of sage, rosemary, salt, garlic, shallots and olive oil on the roast.  The house smelled great! My roast didn't take as long to cook either, at 7.75 pounds, but I was keeping an eye out, so it turned out moist and tender.  I laid some apples cut in half on the rack with the roast when cooking, and put them on the outside of the platter when serving.  Made quite the presentation, bone booties and all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANICER8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1275952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-23T16:44:44.14Z",
                "reviewBody": "One Rib per person was fine,  Delete the egg and apple juice in the stuffing if the bread crumbs are fresh.\r\nI found the roast overcooked when it reached 175 internal temperature.  Next time I would take it out at 155-160 and let it rest for 15 minutes.  The temperature should go up 5 degrees in resting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JUANN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1289071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-27T05:00:47.003Z",
                "reviewBody": "The dressing recipe here was good. I have always loved roast pork and crown roasts for the festivity of it. As I read the recipe it seemed 375 degrees was a high temperature for cooking meat. I cooked it for the exact amount of time since I did not have a meat thermometer. My roast was 10 lbs and it still came out quite dry. My oven has an accurate temperature for baking. Next time I will cook it at the high temperature the first hour and then reduce the heat to 325.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Witzig",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1299908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-27T08:04:24.107Z",
                "reviewBody": "This recipe was perfect in every way. Easy to do tasted absolutely wonderful and was as tender and moist as you could possibly want.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DLSRZBB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T15:44:41.77Z",
                "reviewBody": "This is a special \"family\" gathering entree. Namely because it is simple enough yet fancy or elegant enough to make your family and friends feel as if you \"really\" care and out did yourself! I opted not to include the apple juice too much moisture can be just as bad as too little. I also sauteed the onions and celery in the butter and used Ocean Spray Jelled Cranberry sauce. I whipped the sauce and then added it into the onion/celery sautee allowing it to melt/meld. I added three cloves of minced garlic to this mix at the end of the cooking time (right about 10 minutes before the end of cooking)and added everything to a large bowl mixing with a wooden spoon. I also deleted the egg there is no need for this binder if you do not use the apple juice. If you find your stuffing to dry for your liking add a little apple juice a little at a time until you achieve the desired level of moistness. Nontheless your family and friends will feel warm and fuzzy and you will feel pretty darn good yourself when you serve this roast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LUEWANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/251062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T02:43:17.89Z",
                "reviewBody": "I skipped the crown roast because of cost and used a boneless pork loin roast. The review here is for the fabulous stuffing. It's too bad it's not in a cagagory by it's self because people may not find it. So if your looking for a roast I suggest you do a loin roast and follow the recipe I found on this site with 1/2 cup vinegar plus 1 tsp thyme and go directly to the stuffing. I followed the recipe as directed and it got rave reviews from everyone. I never thought anything could replace my mother's stuffing but this will come close at least some of the time. This is great! A",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WELSH5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/768028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T23:05:54.92Z",
                "reviewBody": "FANTASTIC. Made for mother in laws birthday and it turned out beautifully. Being a self-taught cook I wasn't aware that with crown pork roast it's sometimes better to tell how much you're getting with number of ribs not weight. I got a 12 rib roast to feed my crowd and it worked out very well. I rubbed it before putting it in the oven with a rosemary garlic pepper and little but of thyme mixed with olive oil to make a paste. It smelled so good while cooking and the dressing was beautiful and tasted great. It is so easy to prepare and looks so elegant that you can't go wrong!! Keep in mind however that it is NOT an inexpensive dish..definitely for special occasions only.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAVIST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/491160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-07T20:28:37.67Z",
                "reviewBody": "I give it five stars!Fantastic roast and presentation.Talk of the table! I modified the stuffing by using canned whole cranberry sauce omitted adding sugar and apple juice replacing the liquid with water.Baked it in a covered casserole.Recipe is a keeper.Thankk you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SEWCOOKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1210397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-23T16:55:13.747Z",
                "reviewBody": "I did not make the stuffing for this roast however I followed the cooking method (rib ends down to start with.....I was VERY skeptically) when I cooked my first crown roast. It was BEYOND amazing. I cannot believe I was too intimidated to try one of these for so long....and yes it can be pricey for a single piece of meat but per person it is quite reasonable. I followed other reviewers who said I should only allow the internal temp to reach 155-160 before removing and it was perfectly cooked. I also made a light sauce to go with. I sauted shitaki mushrooms then used the liquid that cooked out of the mushrooms to add to a tbsp of butter & flour to make a light roux. After a could minutes I added a cup of chicken stock 2 tbsp balsalmic vinegar & about 1/4 cup of drippings from the roast & salt/pepper to taste. It was wonderful!!! It was one of the best pieces of meat I ever tasted.....and I MADE IT! Thank you so much for teaching me how to do it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2792496/"
                }
            }
        ]
    }
]