[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14671/desserts/cakes/cheesecake/chocolate-cheesecake/",
                    "name": "Chocolate Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15339/toffee-chunk-cheesecake/",
        "name": "Toffee Chunk Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F48848.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "1999-12-29T19:30:05.000Z",
        "description": "This takes a little time to put together but the cake is the reward all in itself!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 inch spingform pan",
        "recipeIngredient": [
            "2 cups vanilla wafer crumbs",
            "6 tablespoons butter, melted",
            "14 ounces individually wrapped caramels, unwrapped",
            "1 cup semisweet chocolate chips",
            "1 (5 ounce) can evaporated milk",
            "3 (1.4 ounce) bars chocolate covered English toffee ",
            "4 (8 ounce) packages cream cheese",
            "1 ½ cups white sugar",
            "4 eggs",
            "2 egg yolks",
            "2 tablespoons all-purpose flour",
            "⅓ cup heavy whipping cream",
            "2 teaspoons vanilla extract",
            "3 (1.4 ounce) bars chocolate covered toffee, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine wafer crumbs with the melted margarine. Mix well. Press onto the bottom and half-way up the side of 9 inch springform pan. Bake for 10 minutes in preheated oven. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Increase oven temperature to 400 degrees F (200 degrees C). In a saucepan over low heat, melt the caramels together with the chocolate chips and evaporated milk stir until smooth and pour into crust. Break candy bars into small pieces. Sprinkle over the caramel layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat cream cheese until smooth. Add sugar and flour; beat until smooth. Add eggs, then yolks, one at a time. Blend in heavy cream and vanilla. Pour over caramel and toffee layers. Wrap outside of pan with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Set in a large pan that has been filled with 1 inch of hot water. Bake at 400 degrees F (200 degrees C) for 15 minutes; reduce oven to 225 degrees F (110 degrees C) and bake 1 hour. Remove from water. Cool to room temperature, then chill overnight in the refrigerator. Top with 3 more Heath Bar candy bars that have been chopped.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "Chocolate Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BUCHKO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5046728971962615,
            "ratingCount": 107,
            "itemReviewed": "Toffee Chunk Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "924.2 calories",
            "carbohydrateContent": "97 g",
            "cholesterolContent": "218.6 mg",
            "fatContent": "56.5 g",
            "fiberContent": "1.7 g",
            "proteinContent": "13.3 g",
            "saturatedFatContent": "31.3 g",
            "servingSize": null,
            "sodiumContent": "536.7 mg",
            "sugarContent": "67.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-06T11:12:07.403Z",
                "reviewBody": "If you cook the cheesecake only an hour - it will NOT work and will run all over. We did this without looking at the other reviews! We had to throw most of it out as it did not set. Also, you NEED to let this COOL at least 24 hours (found this out the hard way too).\n\nWhat I did when I cooked it the second time - I used a 10 inch springform, I cooked it at the 400 for 20 minutes and then I cooked it at 235 degrees for an 1 hour and 35 minutes and it came out perfect. \n\nI took everyone's suggestions - I put some toffee in the cheesecake, and saved some chocolate for on TOP of the cheesecake. I had one SMALL crack, and the chocolate hid it, and then I topped with toffee bar bits.\n\nI made this for someone's birthday at work. Everyone said it was the best cheesecake they have ever had and they all told me their birthday's and begged me to make it for theirs. I work with one lady who bakes all the time, and she said she was throwing out her cheesecake recipe and wanted this one. It's sure to please if cooked all the way!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DESIGNSBYBRIANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/832196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T18:15:02.14Z",
                "reviewBody": "Second time I've made this & won Grand Prize at Local contest. Found that these modifications make it a winner. First layer is too mcuh so use just half the amount of caramel & choc mixture then fold chopped toffee bits into cheesecake mxtr b4 pouring into crust (that way it actually has toffee chunks!). Bake at 425 for 20 mins then 250 for 1 hr (total for me was 1hr 10 mins). Use water bath and check center w/inst read therm for 160-165 degrees and will be perfect!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nhbaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/791298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-09T20:52:52.407Z",
                "reviewBody": "Rich and delicious! I posted a photo at the end of the recipe. This cheesecake is a beauty! I used chocolate wafers for the crust and drizzeled 1/3 of the caramel mixture on top prior to topping with toffee bars. I used 3 Skor bars over bottom caramel mixture, 3 bars folded into cream cheese and 3 bars on top. Baked for time allotted in recipe then turned oven off and let cake remain in oven for an additional hour. It came out PERFECT!\r\n* Tips at end of recipe were very   helpful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURAOUDINOT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1199152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-27T15:18:52.39Z",
                "reviewBody": "TEN STARS! This was the MOST wonderful cheesecake I've ever made and I make lots of cheesecakes! I followed another reviewers suggestions and some of my own and did the following: (1) Used a 10inch springform pan (it filled it all the way to the top). (2) Reserved 1/4 choc-carmel sauce for topping (had to warm it up before drizzling over top). (3) Mixed about double the amount of toffee chips into the cheesecake batter instead of putting them on top of the choc-carmel sauce layer. (4) Cooked the entire time at 225 until the internal temp reached 160-165 (If your temp doesn't reach this range the interior of the cake will be uncooked all the way and will appear sloshy). (5) You'll have to bake longer than the 1 hour suggested - mine took over 2 hours at this temp. Next time I'll try raising the temp to 250 so I'm not waiting so long. These tips really made a difference. I also used about double the amount of toffee chips on top of the cheesecake than what the recipe called for. It is a beautiful cheesecake and the taste is amazing. Definitely water bath the cake while baking - it really does help. Thanks for a fabulous post! A new family favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONARCH38",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1047736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T18:13:47.483Z",
                "reviewBody": "I made this for a dinner party and it was a huge hit! Many even said it was the best cheesecake they have EVER had! I used a chocolate cookie crumb crust 8 Skor bars and drizzled melted caramel and melted milk chocolate over the top to make it look 'finished'. I also baked it for 2 hours instead of the one hour that the recipe calls for. I recommend it be refrigerated for 24 hours before eating and you cut it only when it is extremely cold to avoid crumbling. Delish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHEBANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/511111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-15T18:58:01.28Z",
                "reviewBody": "I took the advice from others and used a 10 in pan.  I also used half the caramel/chocolate mixture on top of the crust and then the remainder on the top of the cheesecake.  I folded some of the crumbles in the cheesecake mixture, but it could have used even more.  Suggestions:  Use more than 2 cups of wafers for the crust if using a 10 inch pan.  Also the back time for me was around a total of 2 hours and it turned out great.  Use as much toffee bar as you can, the more you use the better it will taste.  Overall, it was worth the time and effort.  Everyone loves it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AG02CHAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1239245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-22T23:50:30.2Z",
                "reviewBody": "I used a whole 250g box of vanilla wafers for the crust and exactly 50 caramels for the sauce. And as per reviewers suggestions 1)I used a larger (9 1/2 inch) springform pan. 2)I used 3 1/2 skor bars instead of 3 and mixed it in the cheesecake batter rather than under it. (I still used pieces from 3 bars for the top though) 3)I put 3/4 of the sauce on the crust and used the other 1/4 for drizzling over the top and sides of the cake. 4)I used a thermometer to get the internal temperature between 160 and 165 degrees and it took 1 hour and 45 minutes at 225 degrees rather than the 1 hour listed in the recipe. It came out perfect in every way and everyone was so impressed they were taking pictures of it. Thanks to Nancy and the reviewers for making this my favorite cheesecake ever.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER72_00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-25T23:00:58.84Z",
                "reviewBody": "If I could give this more than five stars I would. Oh my this was soooo good! I did take some other people's advice and used only half the chocolate/caramel mixture in the bottom used a 10\" springform pan and it did take about two hours to bake. I've also never put a cheesecake in a water bath but I think it made all the difference. My hubby liked this so much he actually took a picture of it - don't ask me why. Anyhow thank you very much for this recipe. It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GrammarDiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/grammardiva/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-02T02:31:33.18Z",
                "reviewBody": "Incredible cheesecake thank you for sharing the recipe Nancy!!! I took this to an out of balance potluck (there were only 2 entrees a few side dishes and the rest were desserts) yet this dessert went first!! Like others I did make changes: 10 1/2\" spring form pan (cuts down cooking time)but the pan was so large I did not do a bath--Ijust put a pan of water underneath and there were NO cracks put 4 bars in cake mixture-3 on top put 1/2 carmel/chocolate mixture over crust--half on top with 3 crushed candy bars and last--I bake it at 350o for a half hour then turned the heat down to 250 to finish for about 1 1/2 hours--cooking it slower reduces the chance of cracks. Simply wonderful!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEVITICUS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1131579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-28T01:18:06.29Z",
                "reviewBody": "If this cheesecake was possible to cook in this method it would be delicious. I followed the recipe exactly accept for mixing the toffee pieces into the cheesecake portion instead of sprinkling it onto the caramel layer. As for the baking portion following previous reviews I baked it for 2 hours instead of one it still did not completely cook all the way through. The center was too soft and slightly runny. The taste however was great and I will make it again. The next time I will cook it at a higher temperature. EDIT Tried this agin this time I baked it at 350 degrees for 1 hour with a jelly roll pan of water on the lower rack and then left it in the oven for another hour. It came out perfect!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KBark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2380281/"
                }
            }
        ]
    }
]