[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15426/cranapana-bread/",
        "name": "Cranapana Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F556430.jpg",
            "width": 1673,
            "height": 1675
        },
        "datePublished": "2000-01-02T20:58:59.000Z",
        "description": "Cranberries, apples and bananas make for a moist, flavorful quick bread. Great for breakfast or dessert!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "1 9x5-inch loaf",
        "recipeIngredient": [
            "2 ½ cups self-rising flour",
            "1 cup white sugar",
            "2 tablespoons vegetable oil",
            "¾ cup milk",
            "2 eggs, beaten",
            "1 cup chopped cranberries",
            "1 apple - peeled, cored, and chopped",
            "1 banana, peeled and mashed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the flour and sugar. Add the oil, milk and eggs, mix until well blended. Stir in the cranberries, banana and apple, mix until fruit is evenly distributed. Pour into the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 1 hour in the preheated oven, until a toothpick or knife inserted, comes out clean.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ruth T. Rogers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.357142857142857,
            "ratingCount": 56,
            "itemReviewed": "Cranapana Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "215.4 calories",
            "carbohydrateContent": "41.7 g",
            "cholesterolContent": "32.2 mg",
            "fatContent": "3.7 g",
            "fiberContent": "1.7 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "0.8 g",
            "servingSize": null,
            "sodiumContent": "349 mg",
            "sugarContent": "20.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-31T18:41:29.933Z",
                "reviewBody": "Took 65 minutes in my oven, but this bread turned out perfectly.  RECIPE CALLS FOR SELF-RISING FLOUR- please pay attention before under-rating a recipe.  If you don't have self-rising flour, which I never do... use 1 1/2 tsp baking powder and 1/3 tsp salt PER CUP of flour called for.  Voila! Instant self-rising flour.  Because of the mixed reviews, I made this recipe exactly as written (except using half whole-wheat and half all-purpose, because that's just what I do).  So I can tell you for sure, there is nothing wrong with this recipe.  At all.  The time is fine, the ingredients are right on, the texture of the finished product is good... I even posted a photo as proof.  It's a muffin-y kind of bread, like banana bread is.  Sweet and tart and great with a schmear of cream cheese.  PS - someone suggested adding spices, and although I didn't, I might next time, just for a change.  But really, it's fine as it is - a sweet fruity bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "moxie & mirth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3148162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-10T20:05:17.977Z",
                "reviewBody": "This recipe has been underrated. If you read the recipe carefully and FOLLOW THE DIRECTIONS it will turn out perfectly. You do have to allow for oven differences. My oven is pretty close to perfectly calibrated, but even then, it varies by 10-20 degrees during a baking cycle. Buy an oven thermometer and resist the urge to open the door repeatedly (this drops the temp up to 25 degrees each time.) I followed this recipe to the letter. I checked the bread at 50 minutes and promptly gave it the remaining 10 minutes the recipe called for. At that check, I decided to give it 4 more minutes (total bake time 64 minutes). I let it sit for 10 minutes before removing it from the pan and cooling completely on a rack. The resulting bread is delicious, moist, and fruity. I didn't feel that cinnamon or other spices were necessary with three different types of fruit. The fruit is one variable that could affect the outcome. The recipe calls for 1 apple and 1 banana. Go for medium sized fruit here, and use fresh or frozen cranberries, not dried. And for Heaven's sake USE SELF-RISING FLOUR. I was amazed reading other reviews that people used regular flour, then rated the recipe one star because it didn't rise.  I will definitely be making this again, and I hope that others won't be afraid to try it due to a few negative reviews. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-02T17:17:41.657Z",
                "reviewBody": "I thought this was very dry even though I used an extra banana. I won't be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "bellydancer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2846356/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-14T19:12:18.763Z",
                "reviewBody": "The bread would not cook for me. I doubled the time just about and it was still gooey in the center. Aside from still being raw it was very dense. I was disappointed that I had to throw everything (time money ingredients) in the garbage. The worst part was that I doubled the recipe without trying it first. Maybe it was a problem with my flour. Or maybe there should be salt added to the recipe. I don't think I'll try it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "MinxyBaby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T19:24:41.08Z",
                "reviewBody": "Since several people said they could not get the bread done, I decided to bake them in a muffin tin and they turned out beautifully!  I sprayed the pan generously with Baker's Joy and baked them at 350 degrees for 18 minutes.  Just start testing at 18 minutes, since all ovens are not alike.  I used my mixer to make the primary batter, because stirring just wasn't getting it smooth; I then stirred in the fruits.  Filling the pans about 3/4 full will yield 18 muffins.  Since that's too many for two people, I placed the remaining ones in a plastic bag in the freezer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DTROMM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-24T01:57:18.997Z",
                "reviewBody": "My family loved it this is very good. I added about half a cup of chocolate chips to give it more a dessert appeal for the kids - turned out great! Very tasty and moist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EESOJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/717995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-01T19:19:28.727Z",
                "reviewBody": "This bread turned out perfect, a firm dense packed with flavor treat. I did have to cook it an extra 10 minutes but that could have been my stove.\nDon't understand all the negative reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lee Cuppett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/229369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-29T17:14:44.6Z",
                "reviewBody": "Meh. I loved the name so I just had to make it. The texture is nice and moist. No problem with its rising and no problem baking it through in 60 minutes. Not dense at all relatively light/airy for a quick bread presumably because of the high proportion of baking powder in self rising flour. We liked the burst of tart cranberries in it as well as the hint of banana flavor. The apples are lost in the flavor but they contribute moisture and that's about the extent of their role. In fact the overall taste is rather bland and unexciting in its totality. It's not very sweet when you consider that those cranberries are pretty darned tart. 3-1/2 stars would be more appropriate as 3 is too low and 4 is too high. There are so many other quick bread recipes on this site that are knock-outs that it makes no sense to go with one that only offers a mediocre taste that goes nowhere. Not bad but certainly unremarkable and for us just not worth the calories. For this reason after a slice to sample the finished product sadly the rest was trash can fodder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T00:13:22.833Z",
                "reviewBody": "Excellent.  All you have to do is either use self-rising flour or look on allrecipes.com for the substitute ... duh!  Living in one of the top cranberry producing states, I had to try out the recipe - lovely recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TheGumper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1489784/"
                }
            }
        ]
    }
]