[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/752/desserts/candy/divinity/",
                    "name": "Divinity Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15652/old-fashioned-divinity-candy/",
        "name": "Old-Fashioned Divinity Candy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F813297.jpg",
            "width": 1692,
            "height": 1581
        },
        "datePublished": "1999-11-22T01:44:55.000Z",
        "description": "This is a soft white candy made with light corn syrup.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "1 1/2 dozen",
        "recipeIngredient": [
            "2 cups white sugar",
            "½ cup light corn syrup",
            "½ cup hot water",
            "¼ teaspoon salt",
            "2 egg whites",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a heavy, 2 quart saucepan, combine the sugar, corn syrup, hot water, and salt. Cook and stir until the sugar dissolves and the mixture comes to a boil. Then cook to hard ball stage without stirring, 250 degrees F (120 degrees C.) Frequently wipe crystals forming on the sides of the pan, using a pastry brush dipped in water. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Just as the syrup is reaching temperature, begin whipping egg whites: In a large glass or stainless steel mixing bowl, beat egg whites until stiff peaks form. Pour hot syrup in a thin stream over beaten egg whites, beating constantly with the electric mixer at medium speed. Increase speed to high, and continue beating for about 5 minutes. Add vanilla; continue beating until the mixture becomes stiff and begins to lose its gloss. If it is too stiff, add a few drops hot water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Immediately drop by teaspoonfuls onto waxed paper. For a decorative flair, twirl the top with the spoon when dropping. Let stand until set. Store in an airtight container at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Divinity Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lisa H."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.438095238095238,
            "ratingCount": 105,
            "itemReviewed": "Old-Fashioned Divinity Candy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "114.3 calories",
            "carbohydrateContent": "29.3 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": null,
            "proteinContent": "0.4 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "44.3 mg",
            "sugarContent": "24.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-16T01:28:06.633Z",
                "reviewBody": "Good recipe for old fashion divinity---I have a couple of suggestions to make it fool proof.  These always work for me. \n1. Cook just as the recipe says until you reach 250 degrees, pour just HALF of the syrup SLOWLY over the egg whites beating continuely, return the other half of the syrup and continue to cook to hard crack stage, 285 to 290 degrees and pour the rest slowly over the egg white mixture.  Beat until mixture starts to lose it's gloss, add flavoring, vanilla, almond, etc and 1 tbls. butter or margerine.  drop or pour and cut in squares or roll like a log and slice or use log as middle of caramel nut roll.  I've even added some chocolate chips after the syrup and made it chocolate flavored.  Good with chopped marachino cherries and pecans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aunt nayne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2680359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T13:41:54.64Z",
                "reviewBody": "This is BY FAR THE BEST divinity recipe!  Contrary to what one reviewer stated, this recipe is very specific.  I was very happy with the end product.  Candy making is a very tedious and sometimes difficult process.  Have a deep bowl when you start the 'hot pour' and pour slow in a thin stream.  Make it take about 3 to 4 minutes to pour it all.  Thanks for a great recipe!  :-)))))))))  A+++++++++",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "REBEKAH39",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/659974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T04:00:50.34Z",
                "reviewBody": "This is like my mom's recipe I used for along time. Divinity is a challenge, but well worth the effort. When I am pouring the hot syrup into my egg whites, be sure and pour it slow, I pour it into the beaters alittle at a time, if you pour it to fast it will cook your egg whites. If in the 5 minutes it hasn't lost the gloss, keep mixing, and if your mixer gets to hot, I stir by hand until the divinity just starts to loose its gloss and it is time to drop on your waxed paper. In rainy weather I have had to stir by hand for quite some time, but I have never had trouble making it when it rains except for having to stir it longer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAREN1250",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/656941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T13:36:14.163Z",
                "reviewBody": "This is very close to the recipe I have used for years. (Mine calls for 2 1/2 cups sugar) It really is wonderful. The most important thing to remember when making divinity (actually most candies) is NEVER attempt it during rainy weather or whenever the humidity is high. I live in Louisiana so that limits the days for candy making. If you try to make divinity during high humidity, you will end up with nothing but a white gooey glop of glue! Trust me it's worth waiting for more favorable conditions. Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nona",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646926/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-30T23:23:39.107Z",
                "reviewBody": "I've made this recipe 5 times now.  Only once did I use a stand alone mixer (Xmas present!).  The hand mixers worked ok for me, though the last time I used a hand mixer, I could smell the motor burning.  Oddly enough, I didn't need to mix it as long with the hand mixer.  The divinity turned out every time.  I've made it with & without nuts (prefer pecans).  I've also used various extracts instead of vanilla (coconut, orange, cherry, etc).  I'm the farthest from Martha Stewart, and this was an easy recipe for me to follow with good results!  Thanks for the keeper!  My co-workers adore it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GOLDILOX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookingwithcyanide/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-06T21:30:45.983Z",
                "reviewBody": "This recipe worked great.  But it took a few tries.  The first time I used pasturized egg whites from a carton and it flopped.  You can't uses pasturized eggs!!  The next time I used real egg whites, followed the instructions to the letter except that I allowed the sugar mixture to cool to 110 before adding it to the egg whites.  You must pour SLOWLY.  I had a couple changes to the ingredients:I did not have any light corn syrup, so I used dark, still worked fine and tasted wonderful.  I also added walnuts just before I scooped it out for crunch and that worked great.  It does take patients and a good stand mixer, but it is worth all the work.  I plan to do this again and experiment with different flavors and colors.  Maybe some pink and blue for Easter, green for St. Patty's!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Luyet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742709/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-19T13:47:51.513Z",
                "reviewBody": "Mine didn't exactly turn out, but that wasn't any fault of the recipe....my ancient mixer gave up on me. I'll wait to try this again when I've finished moving and have access to my nice stand mixer. However, the directions in this recipe were crystal clear and correct, based on my memories of making divinity in my childhood! I will use this again when I have the right equipment on hand.\r\n\r\nSuggestion for anyone else who is left with glop that won't set....stick it in the oven on low heat (about 250) for 20-30 minutes. They bake up a lot like meringue, although gooier in the center. At least that way they're not a total waste...you can serve with fruit or other toppings as a dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LLIGETT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/632128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-17T22:21:56.437Z",
                "reviewBody": "Perfect Recipe!!! I takes about 20 min. though to loose it's gloss and then it doesn't totaly loose it. Wonderful!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hannah H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1817680/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-01T19:05:15.593Z",
                "reviewBody": "I think I found a fix for gooey divinity flops after 4 different attempts from various Divinity recipes, the first attempt I burned up my mixer! SO I got a Kitchen Aid. Needed one anyway. Anyway like others have said the key is pouring in the cooked syrup very slowly in a slim stream while beating with the eggs whites. Pouring too much at once will cook the eggs.\nThen keep beating the sucker (in my case it took 15 minutes) until it starts to lose its gloss. But if it is still gooey, here's how to save it:\n\nReheat the mixture - microwave if you have a glass bowl or put metal pan in very hot water, so it gives your mixer a rest and makes the candy warmer and more pliable. Then start mixing again. If you still think it wont set up, add about 1/2 to 1 tsp of hot water to the mix then sprinkle in about 1/2 to 1 cup powdered sugar while mixing ON SLOW. It will start to set up much faster now.\n\nALSO: Try this for a new flavor twist:\nWhen it's time to add the Vanilla, instead of 1 tsp, add the following: \n 5 - 7 drops Yellow Food Coloring\n 1/4 tsp. Peppermint Extract\n 1/4 tsp. Butter flavor Extract \n 1/2 tsp. Vanilla Extract\n(more or less peppermint or butter extract to taste)\n\nBUTTER MINT DIVINITY! You won't go back to plain.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "T. Tranum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2315786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T16:46:29.577Z",
                "reviewBody": "Tasty but goopy and made me a little sickish... hmm.. should it be cooked? We tried cooking it (I forget how much/long) and it was somewhat better..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Joey Byrtus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/156486/"
                }
            }
        ]
    }
]