[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/749/desserts/candy/chocolate-candy/",
                    "name": "Chocolate Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15710/cracker-candy/",
        "name": "Cracker Candy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F918853.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This recipe is simple, quick, and can be made with many ingredients you have on hand.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "¼ (16 ounce) package saltine crackers",
            "½ pound butter",
            "¾ cup white sugar",
            "2 cups semisweet chocolate chips",
            "¾ cup chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a saucepan over medium heat. Stir in sugar, and bring to a low boil. Continue boiling, stirring constantly to prevent burning, approximately 3 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange crackers on a cookie sheet in a single layer, and drizzle with sugar mixture. Bake at 425 degrees F (220 degrees C) for 5 minutes, or until edges begin to brown.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from oven and spread chocolate chips evenly over the top as they melt. Sprinkle with nuts, gently pressing into the melted chocolate. Cool until chocolate has hardened, and break into pieces. Store in refrigerator until ready to serve. Allow to cool, and break into pieces. Refrigerate until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Chocolate Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Debbie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.597938144329897,
            "ratingCount": 194,
            "itemReviewed": "Cracker Candy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "598.1 calories",
            "carbohydrateContent": "58.2 g",
            "cholesterolContent": "48.8 mg",
            "fatContent": "39 g",
            "fiberContent": "0.9 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "20.9 g",
            "servingSize": null,
            "sodiumContent": "251 mg",
            "sugarContent": "15.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-31T13:04:13.997Z",
                "reviewBody": "I am giving this four stars because it needs just a bit of tweaking. I have made this recipe several times, ALWAYS with a request for the recipe. Having said that, I do have some changes to make this recipe a definite winner!  First, use brown sugar. I have tried it with both types of sugar, and white not only tastes different, but the end product doesn't even LOOK appetizing.  I use normal saltines, not anything fancy. Do not overcook your sugar/butter, it WILL burn.  3 minutes is plenty. Do not overcook in the oven...5 minutes is just fine.  I have tried different flavored chips (Reese's, milk chocolate, etc) as well, and have learned to stick with semi-sweet chocolate chips. Just sprinkle onto the hot crackers after removing from the oven, and let them sit for a couple of minutes....they will melt enough to spread over entire pan of crackers from corner to corner. Here is a trick of mine that works for an easier, prettier finished product: Once they have cooled slightly in the pan, score slightly with a knife right down the dotted lines of the cracker edges to make squares.  Once they are cooled completely, use the scored lines to cut into neat squares! I have never failed with these, even when they weren't as \"pretty\" as I'd like...they still taste wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "1BUSYMOMNTX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/660293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-22T21:36:10.95Z",
                "reviewBody": "I highly recommend making the toffee layer with light brown sugar.  It truly gives the candy a Skor taste.  The first time I made this tasty treat, it didn't turn out quite so tasty.  I had used white granulated sugar and followed the recipe exactly.  The consistency of the toffee seemed odd even after 5 minutes.  I decided not to rate the recipe based on that experience, since I'm sure I was largely at fault.  I saw a recommendation for brown sugar and decided to try it out.  The end result was absolute perfection.  Make sure that you use the salted saltines.  The saltiness helps to balance the sweetness of the toffee.  I only used one cup of chocolate chips and it was enough for me.  I prefer more toffee anyway.  I also used crushed, toasted almonds.  One very important thing...make sure to lay wax paper under the crackers.  The toffee soaks through and was a pain to wash.  Let the candy sit for about 10 minutes on the counter, then slide it into the freezer for about 20-30 minutes.  Pick the candy up by the wax paper and break away pieces.  Store the candy in the fridge or place a few pieces in the freezer for 20 minutes for extra crunchiness.  Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms.Jackson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1209800/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T21:02:32.31Z",
                "reviewBody": "I tried this but it wasn't the same as the recipes using brown sugar. Try this with 1 c firmly packed light brown sugar instead if the white and you'll be amazed at how good this is!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MOM2AARON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-08T17:54:35.853Z",
                "reviewBody": "I have been making this for about 30 yrs now..we never knew the name of it originally so we called it \" I can't Believe it's already Ready Candy\". It is excellent made w/ the white sugar ( tho' many seem to prefer brown who rated this). MY RECIPE of it directs you w/ specific times for EVERYTHING! You LINE a broiler pan w/ foil and arrange your crackers ( my recipe called for unsalted saltines). Melt butter and sugar and boil for \" 3 minutes\". Pour over saltines and bake at 400 degrees for \" 5 minutes\"..Immediately sprinkle the choc chips over this evenly..pop back in oven for 2 min or less. This spreads the chocolate very easily over entire top of candy.. Sprinkle your choice nuts on top. FREEZE.. ( have to FREEZE them solid)..then break into pcs and store in airtight containers. The odd shapes they come out when broken up make them even more interesting. I always make these for Christmas baskets w/ a copy of the recipe attached. EVERYONE loves them. Oh...and when you take them out of freezer.. lift foil sheet out.. invert and peel candy off foil. Put pan away.. hey i'ts clean!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "shylakay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3762887/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-14T22:50:54.873Z",
                "reviewBody": "I made this with both brown sugar and sugar i also use a half a cup almonds that i put in the blender into the mix i used tin foil sprayed it with pam then i put the crackers in the pan poured the mix on top and melted the chocolate in the microwave and spread it on top makes it look better. Then i sprinkled almond dust on top the chocolate while it was hot it came out of the pan really easy tin foil is the way to go also it lasted no more then 15 mins at a pot luck dinner i went to lots of people wanted the recipe when i told them it was crackers they were shocked:-0.... thanks for the yummy idea it was a hit:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sher247",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/923702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T13:49:22.793Z",
                "reviewBody": "My roommates and I used to make this all the time but when I moved I never got the recipe!! I was so glad to have finally found it!! I use 1 cup of brown sugar in place of the white. I prefer using milk chocolate chips but you have to melt them before putting them on the crackers. Also it's really good too if you just skip the chocolate and press chopped almonds into it. It's always good no matter what you do with it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M4PERKINS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-21T03:51:16.873Z",
                "reviewBody": "Make sure you grease the pan before you start. The stuff we could get out of the pan was TERRIFIC and the rest we needed a jackhammer to get out of the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LOOOBEEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/474271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-13T05:53:47.077Z",
                "reviewBody": "I have been making this recipe for years and was so happy to see it has made its way to this website! Every time I make it it vanishes. I always include these in a basket I make for my husbands office every Christmas and they request it again every year! BTW - You do have to boil the butter/sugar mixture well otherwise the sugar doesn't melt and it has a grainy texture!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "buggymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1077512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T13:50:07.997Z",
                "reviewBody": "EXCELLENT AND VERY TASTY-NOT SWEET! It was fun and easy to make. Brought it to a party and it was gone it no time. Nobody knew it was saltines!! I used the BROWN SUGAR-- Will be making it again soon-many request and it's easy to bring along. It's a Keeper!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NPTMAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/852985/"
                }
            }
        ]
    }
]