[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
                    "name": "Fruit Pies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15834/plum-pie/",
        "name": "Plum Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F709578.jpg",
            "width": 3277,
            "height": 2636
        },
        "datePublished": "1999-06-02T09:54:27.000Z",
        "description": "This pie has a decorative and tasty streusel topping on it. If using apples in this pie be sure to add 1/4 teaspoon of ground mace in streusel topping. Substitutions: walnuts may be used instead of hazelnuts; few drops of lemon oil may be used instead of lemon zest; also apple or cherries can be used in place of plums.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 pie",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "¾ cup white sugar",
            "2 ½ teaspoons baking powder",
            "⅛ teaspoon salt",
            "⅔ cup butter",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "3 tablespoons milk",
            "½ teaspoon lemon zest",
            "½ cup all-purpose flour",
            "¼ cup packed brown sugar",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon salt",
            "⅓ cup chopped hazelnuts",
            "1 teaspoon lemon zest",
            "3 tablespoons butter",
            "5 cups plums, pitted and sliced",
            "1 cup white sugar",
            "¼ cup all-purpose flour",
            "1 teaspoon ground cinnamon",
            "½ teaspoon ground nutmeg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Crust: In a large bowl combine 3 cups flour, 3/4 cups white sugar, baking powder, and 1/8 teaspoon salt. Mix thoroughly, then cut in 2/3 cup butter or margarine with a pastry blender, until pieces are the size of small peas. Stir in eggs, vanilla extract, milk and  lemon zest. Mix just until all ingredients are combined. Allow dough to rest in refrigerator.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Streusel Topping: In a medium bowl mix 1/2 cup flour, brown sugar, 1/2 teaspoon cinnamon, 1/4 teaspoon salt, chopped nuts, and grated lemon zest. Work in butter or margarine with fingers until all ingredients are well combined. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Fruit Filling: Place pitted and sliced fruit in a large bowl. In a small bowl, mix remaining sugar, flour, cinnamon, and nutmeg until thoroughly combined. Pour over fruit and stir gently until all fruit is evenly coated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out pie crust and place in a 9 inch pie pan. Trim and flute edges, then pour in fruit filling. Evenly cover fruit with streusel topping and bake in preheated oven for 45 to 55 minutes. Serve warm, or at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Fruit Pies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.306451612903226,
            "ratingCount": 62,
            "itemReviewed": "Plum Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "685.3 calories",
            "carbohydrateContent": "109.1 g",
            "cholesterolContent": "99.1 mg",
            "fatContent": "24.9 g",
            "fiberContent": "3.8 g",
            "proteinContent": "9.5 g",
            "saturatedFatContent": "13.3 g",
            "servingSize": null,
            "sodiumContent": "424.1 mg",
            "sugarContent": "61.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-08T16:51:52.17Z",
                "reviewBody": "This recipe worked very well for me despite the fact that I was missing a couple of ingredients. I had to omit the nutmeg and I used 1/2 tsp bottled lemon juice instead of the zest wherever it was called for. Also, I went with the walnuts instead of hazlenuts, again only because that was what I had on hand.  Instead of using a pie pan, I used eight 1 cup baking dishes, so I ended up with eight deep dish tarts, each one equal to 1/8 of a pie. The recipe filled them perfectly.  To make things easier, I just dropped the crust mix into the cups and pressed it to the bottom and sides with my fingers instead of rolling it out. There is a bit of rise in this crust, so it bakes out just as evenly as if it had been rolled. And, the streusal topping meets the crust to cover any uneven edges. I would bet you could do the same thing with a pie pan as well and save yourself the mess of rolling out.  If you do tarts, put them in the middle of the oven and start checking after about 20 minutes. Mine took about 24 to bake.\n\nI was quite dubous about all the vanilla in this recipe, as it seemed an odd flavor to pair with plums, but it was very tasty. I think it is important to use plums which are sweetly ripe but not mushy. The pie really does taste a lot like cherry and plums are so much cheaper to get at this time of year. I am making it again today, and trying Splenda instead of sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-07T00:48:56.73Z",
                "reviewBody": "I had never had plum pie before.  I was pleasantly surprised at how delicious it was.  The filling had just the right consistency.  I liked the struesel topping as well, although I substituted oatmeal for the nuts (kid's preference.) I also omitted the lemon whenever it was called for. I followed another reviewer's suggestion and patted the dough into the pie plate instead of rolling it.  It worked well, although I ended up making two pies because there was so much dough.  I'd suggest either cutting the crust recipe in half, or double the filling and topping and make two pies.  In my opinion the crust was just ok.  It was easy to work with, but was more cake-like than I prefer for pie.  I will make this recipe again, but with a different crust.  Next time I may just use a frozen pie crust.  I hope you enjoy your plum pie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie62",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/558873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T12:54:48.903Z",
                "reviewBody": "If plums are the only fruit used in the pie it is a bit tart. Mixing a sweeter fruit with the plums will balance the flavours.  Enjoyed the lemon zest in the crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LITTLE POOH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/73311/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-12T03:36:04.81Z",
                "reviewBody": "I made this pie for a potluck tonight.  There wasn't a single crumb left!  The other reviewers are correct there is enough crust for 2 pies.  I liked the crust; it reminded me of cookie dough.  I used a deep dish pie pan so I needed more fruit than 5 cups.  I ran out of plums so I used 2 peaches.  Its a great combination.  I just added a bit more sugar to compensate for the additional fruit.  I made the streusel topping just as listed and thought it was delicious.  Be sure to use a pie shield on the crust so that it doesn't get too brown while baking.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BOOKWORKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/706839/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-02T03:29:09.53Z",
                "reviewBody": "Yummy! The Italian plums worked well with this recipe.  My family loved it, especially the combination of plums and the topping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer J",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/curlygirl/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-13T17:07:01.417Z",
                "reviewBody": "This pie was more like a tart or streusel or even a shortcake with the cake-like crust. My family favored the cake the best. On the results page for this Plum Pie the description mentioned there was sour cream and heavy cream in the recipe. I wonder if those ingredients were left out because they are not listed in the recipe's ingredients. That would make a difference in the crust giving it more flavor and a moist texture. I thought the lemon was added a nice flavor to the dish. I put a pinch extra in the cake. There is enough dough for two pies so we made one with plums and the other apple.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JMSPARTRIDGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1358090/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-17T20:47:24.18Z",
                "reviewBody": "FANTASTIC!!!! This recipe was very easy to follow and the pie turned out very nice.  I used a 9.5in. pie pan and a little more than 4c of plums because i wanted my pie to be full and have a mound on top.  I used the basic flaky pie crust recipe from this site, its the easiest crust and came out good (i doudbled the recipe for a top and bottom, used butter instead of shortening, a little more flour for when rolling out). Used both bottom and top pie crust and topped it with the brown sugar crumble from this recipe.  Took to work and everyone absoulutley LOVED it.  It tasted amazing, will definately used again.  Highly recommended. Thanx ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nata",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2915414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-31T20:31:22.17Z",
                "reviewBody": "If you like rubarb or strawberry crisp you will like this pie.  Made for a family function and it went fast.  I didn't think that the plums were too tart.  Next time, I will mix in another fruit, raspberries, blackberries, or even some blueberries.  You have to have it a la mode!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "beckacarr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1629856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-23T15:16:11.607Z",
                "reviewBody": "This filling was simple and good, but the crust was only okay - the flavor was bland and the texture was too dry.  I think next time I will use a shortbread cookie crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/576287/"
                }
            }
        ]
    }
]