[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15995/ruths-grandmas-pie-crust/",
        "name": "Ruth's Grandma's Pie Crust",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4197810.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This recipe is over 100 years old. My sister-in-law's grandmother said it was a no-fail recipe. It's the best I ever had.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT0H10M",
        "recipeYield": "4 crusts",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "1 ¾ cups shortening",
            "3 tablespoons white sugar",
            "2 teaspoons salt",
            "1 egg",
            "½ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, combine all-purpose flour, shortening, sugar, and salt. Blend together with a pastry cutter until crumbly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix egg with water. Blend into flour mixture. Chill in refrigerator until ready to use.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "barbara castodio"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.781712813908564,
            "ratingCount": 1553,
            "itemReviewed": "Ruth's Grandma's Pie Crust",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "162.7 calories",
            "carbohydrateContent": "13.1 g",
            "cholesterolContent": "5.8 mg",
            "fatContent": "11.5 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.8 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "148 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-02T01:34:10.013Z",
                "reviewBody": "This is a flavorful crust, perfectly suited to fruit pies. My only criticism is that it makes ALMOST enough for two, 2-crust pies...but not QUITE enough. This recipe as written, in my view, would make 3-single crust pie crusts. It was a stretch to make two double-crust pies, and I think this would have been particularly difficult for a novice baker. It would be better had the recipe indicated the yield.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-26T18:48:45.31Z",
                "reviewBody": "I've recently entered the world of pie making and this was my first pie crust ever (with my first apple pie - Grandma Ople's found in Allrecipes as well). I've heard so many horror stories and thought I'd just use the store bought ready made dough that you just lay in a pan and bake - it was good (enough) when I used it for my first pie (pecan). But my friend urged me to just try to roll out my own. And,  I am no longer afraid! This was so easy to make and handle, and I am still shocked it came out so pretty (I posted a pic). I used butter flavor Crisco shortening as suggested and brushed the pie with lightly beaten egg before baking. Crust was super flaky, but sturdy enough. I am going to use this again and again - have plans for a pot pie dinner using this crust. (I do agree this recipe only makes enough for 1 double crust and 1 single crust pie. I'm making another pecan with the single crust I have left.) Anyone want the remaining ready-made pie crust I have in the freezer? :-) EDIT: I've now made 5 pies using this crust - and EVERYONE raves about this crust. I'm SO happy that I used this in my first attempts with pie crust because I don't need to keep trying recipes. Seriously, I'm not even a bread/crust person but i CRAVE this pie crust! A pie crust CAN totally make a pie!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-19T03:55:00.403Z",
                "reviewBody": "This makes a very tender, flaky and flavorful crust. I had used the same pie crust recipe for 25 years with only good results and compliments. Very similar, but mine did not include the egg.  But I like to try new things sometimes, so I thought I would give this recipe a try.  Now, I will be using this recipe all the time.  \n\nI found that since my eggs were extra large, I did not need to add all the liquid.  Next time I will beat the egg into only 1/4 cup ice water, sprinkle into the flour mixture, mix lightly and then add more ice water, if needed. \n\nThank you for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tea and honey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2550562/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-26T18:11:44.74Z",
                "reviewBody": "This crust is simply perfect! The first time I tried it, I had no shortening on hand and so I used unsalted butter instead. The result was a very nice flaky crust. The second time around I used animal shortening (the vegetable kind is not available in the country I live in and I personally don't use it anyway because it is simply so bad for you). The crust came out perfect! It was very flaky and so very tasty! I tried other recipes but the difference with this recipe is the 3 tablespoons of sugar and the egg: this gives the crust a nice flavor, just perfect for fruit pies! I was able to roll it out pretty thin (0.2-0.3 inches) and so I got two 11\" crusts and one lattice top out of the dough the recipe yielded. I used my dough roller to pick up the crust and lay in my extra large pie pans and it worked pretty well as long as I was quick to transfer. The crust baked nice and golden and the pies looked great. I wanted to make a note of the difference between the crust made with butter and the one made with shortening. The one made with shortening is definitely flakier, but if you don't have shortening or don't like using it, you can safely use unsalted butter instead. The crust made with butter is slightly denser and tends to harden a bit after a day, but the difference is not so big as to discourage you from using butter in your recipe. Besides, who would want to let the pie stay on the shelf for so long? We gobble up ours as soon as it is cool enough to eat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kyra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3372597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-21T21:39:19.653Z",
                "reviewBody": "Ruth's Grandma and I must have been related.  I use this recipe and love it - I also divide the crust (if not using all), wrap in plastic wrap and put in freezer bag for later use.  Good to have on hand!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy McBee Miller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1035015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-24T18:42:44.937Z",
                "reviewBody": "Awesome awesome awesome awesome! I will never use another recipe. I followed the recipe and the crust was easily the best I've had in my life (and I've had a lot of pie in my day) Helpful tip of the day! Freeze your butter/shortening, then grate it into the flour mixture. The little pieces are the perfect size and you don't have to fuss with it! The frozen bits don't get creamed into the flour so the pastry puffs up perfectly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "StevenMaGeven",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3374517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-16T13:57:54.09Z",
                "reviewBody": "I don't often remember to come back and rate and/or review recipes after I print them out and make them. I either like them and add them to a pile of recipes that I occasionally make (the pile of recipes for an excess of some fruit or veggie, the need something special for guests, or recipes for party food, etc. OR I don't like it and toss it. But this recipe is one that is do good, I simply couldn't NOT come on the site and rave about it. The recipe is perfect as it. Don't touch it, don't mess with it. Period. I have never been able to make a good pie crust ever. I always seemed to mess it up and make it too dry or too mushy, no matter how careful I was about adding the water a teaspoon at a time. This recipe is the best thing I have ever seen in terms of foolproof. If you take this recipe and just add everything and follow the directions, you will have the best pie crust you have ever tasted. Add to that the fact that it is by far and away the BEST tasting pie crust I have ever eaten (and I have french grandmothers and have lived in Italian bakery neighborhoods of NYC) bar none. If you are reading this, throw away every pie crust recipe you have and put this one in your heirloom recipe book. And then thank the lady who submitted this!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Clay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2204829/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-22T21:06:48.263Z",
                "reviewBody": "I made a peach pie with this crust recipe, and everyone raved about it!  I used butter-flavored shortening, and the crust was tender and flaky.  The total baking time for my double crust pie was around 46 minutes.  This has gone into my recipe box!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HANESSM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/366430/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-01T00:40:48.357Z",
                "reviewBody": "Absolutely Fabulous! Sugar gives the crust a great crunch and makes sure it isn't tasteless like some other recipes i've tried! Try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "becca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T18:56:37.697Z",
                "reviewBody": "I found this difficult to work with, and not all that tasty. I'll stick to my butter crusts ...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Candace Gallagher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candacegal/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Ruth's Grandma's Pie Crust",
            "description": "This recipe is more than 100 years old--tried, true, and oh so tasty.",
            "uploadDate": "2012-11-02T16:02:57.812Z",
            "duration": "PT2M37.949S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fef37dbfb-0366-448c-96bc-afc7b3eb9072%2F5904bfbf-c4b3-45f7-b696-18e8f804f000%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1942239966001"
        }
    }
]