[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16250/overnight-cinnamon-rolls-i/",
        "name": "Overnight Cinnamon Rolls I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5939580.jpg",
            "width": 2048,
            "height": 1463
        },
        "datePublished": "2000-03-05T23:29:06.000Z",
        "description": "Make the night before, rolls rise in the fridge overnight and bake the next morning.  Easy and delicious.  Enjoy!",
        "prepTime": "P0DT1H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "12 rolls",
        "recipeIngredient": [
            "1 cup milk",
            "⅓ cup butter",
            "1 (.25 ounce) package active dry yeast",
            "½ cup white sugar",
            "4 ½ cups all-purpose flour",
            "1 teaspoon salt",
            "3 eggs",
            "¾ cup brown sugar",
            "1 tablespoon ground cinnamon",
            "½ cup raisins",
            "1 teaspoon light corn syrup",
            "½ teaspoon vanilla extract",
            "1 ¼ cups sifted confectioners' sugar",
            "2 tablespoons half-and-half cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the milk in a small saucepan until it bubbles, then remove from heat. Add the butter and stir until melted; let cool until lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, dissolve the yeast in the milk mixture. Add the sugar, 3 cups of flour, salt and eggs; stir well to combine. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Deflate the dough and turn it out onto a lightly floured surface and roll into a 10x 14 inch rectangle. Lightly brush the far edge with water. In a small bowl combine the cinnamon and 3/4 cup brown sugar and sprinkle over the rectangles. Then sprinkle the raisins and chopped nuts over the dough. Roll up the dough into a log and seal the seam.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the dough into 12 equal pieces; place the pieces in a greased 9x13 inch baking pan, or 12 inch deep dish pizza pan. Cover with plastic wrap and place in the refrigerator to rise overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "The next morning, preheat oven to 375 degrees F (190 degrees C). Take the rolls out of the refrigerator and let stand at room temperature for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the rolls for 25 to 30 minutes or until golden. Meanwhile, combine the corn syrup with the vanilla in a small bowl. Whisk in the powdered sugar and enough cream to make a thick glaze; set aside. Drizzle the glaze over the rolls and serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DENDES5238"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.426008968609866,
            "ratingCount": 446,
            "itemReviewed": "Overnight Cinnamon Rolls I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "388.3 calories",
            "carbohydrateContent": "73.2 g",
            "cholesterolContent": "62.6 mg",
            "fatContent": "7.6 g",
            "fiberContent": "1.9 g",
            "proteinContent": "7.7 g",
            "saturatedFatContent": "4.1 g",
            "servingSize": null,
            "sodiumContent": "262 mg",
            "sugarContent": "34.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-09-07T15:21:18.45Z",
                "reviewBody": "I have made these twice and so far I think it would be safe to say that they are nothing short of wonderful! \r\n   I do have a few modifications of my own. I made the dough in my bread machine on \"dough\" cycle. I add a little bit of vanilla into the dough for those of us who choose not to have frosting. ( I think cream chese frosting would also be very tasty) I sprinkle a little olive oil on the dough before adding the filling. I also find that when rolling into the log, the more times you can roll it the better the buns come. I think that thats the true trick to making these. They will have more filling and stay more moist. So put a little extra effort into rolling it into a log and they come out doubly better! And to make them SUPER moist put a VERY small pat pf butter on top of each roll before baking.\r\n   One more thing- when i made these the second time, when I tool these out of the fridge in the morning I found that some of the filling had liquified and there were little puddles of it around each bun. If this is the case try to scoop this up and put it on the buns BEFORE cooking them! If you do it after it will carmalize into a rock hard tooth-breaker. And to top my review off- baking them for 20 minutes makes for a much better out come!\r\n   Once again- Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Italiana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1020783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-22T02:35:13.64Z",
                "reviewBody": "to avoid flattening the rolls when cutting, use a length of thread, place under the roll where you want to cut it holding the ends. Tie a knot... easy as pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacqui",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-17T12:59:28.873Z",
                "reviewBody": "Very good recipe-the dough is easy to work with and they raised very nicely.I save my tuna fish cans and use them as pans instead of a muffin tin.They form perfectly shaped rolls every time. My yield(with the tuna cans) was 18 for this recipe. I also use the tuna cans for  making large muffins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER62",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1031645/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T01:07:01.497Z",
                "reviewBody": "Wonderful, charming comfort food, and easier than I thought it would be to cook.  I particularly enjoyed checking on them in the morning and seeing how plump and delicious-smelling they had become overnight.  I also like the fact there are no weird or expensive ingredients.  I'll use a little bigger pan next time because they were a bit overcrowded, and I'll add just a little more brown sugar & cinnamon.  Be careful not to let them overheat during rising or they will stop rising too soon and be like little hockey pucks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANNYANNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/715751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-13T19:30:59.713Z",
                "reviewBody": "i made this recipe twice. first time i followed the directions to the letter(following the advise to use cream cheese frosting). it was ok but the second time i made some changes. i added an extra 1/4 cup sugar, 1/2 tsp. more salt, and a 1 tsp. cinnamon to the sort of bland dough. i slathered a generous layer of soft butter to the dough before adding cinnamon-sugar mix.  i bake it at 350 because 375 is just too high for a tender dough like this. this came out fantastic!!!! still with the cream cheese frosting. it gets easier to make the more you do it. please note that my dough didn't rise during the first rest period or in the fridge...but in the oven..MAN OH MAN! PERFECT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pamelascakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6326585/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T01:08:11.717Z",
                "reviewBody": "I doubled the amount of cinammon and thought that a little less brown sugar in the filling would still have been plenty.  The recipe calls for one 9x9 pan but two are required.  Some tasters wondered if I was a baker !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NIALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T01:08:39.013Z",
                "reviewBody": "This is excellent for \"prepare ahead cinnamon rolls! Easy to prepare and best of all it's done the night before! A keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/32834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-13T23:37:47.173Z",
                "reviewBody": "Outstanding!!  This is a GREAT recipe.  It was about 87 percent humidity when i made the dough and had my doubts as to whether it would rise properly  but it did and they baked up gorgeous and cinnamony.  My boys were actually quiet for the full 15 min they were eating these delectable doughy delights!!  Next time I make them, I'm going to make an extra batch to freeze!!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LOGANBENN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/671994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T13:27:50.59Z",
                "reviewBody": "Like some others I did find the dough a little goopy but I added a bit more flour at a time and kneaded it the whole 8 minutes advised and it was smooth and supple by then. I did add about 1 Cup more of flour in the kneading process. I used all the brown sugar the recipe called for but there was SO much filling it ran out the sides so next time I will use less. I included chopped pecans in with my brown sugar...not listed on the ingredients list but nuts are mentioned in one step. I highly recommend the pecans! Next time I will try a different frosting; this one was good but just shy of what I wanted. Overall a big hit with my whole fmaily!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Martha LaCroix",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1299340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-11T15:06:26.213Z",
                "reviewBody": "I made this one to spec to be fair and found a number of serious problems:\n\n1. The dough comes out extremely dense for a cinnamon roll - I even cut back by almost a full 1/2 cup and, while the rolls rose in the oven, they were still quite heavy.\n\n2. The filling was terribly dry - I think this could have been influenced by the consistency of the dough, but while the lack of any kind of fat (i.e. butter) in the filling may make these a little healthier there was nothing to allow the cinnamon/brown sugar mix to properly melt and give that gooey consistency you tend to crave in a cinnamon roll! (Besides, who's going for healthy in a cinnamon roll anyways?)  \n\n3. The icing needs some major work - this is little more than a basic sugary glaze. Combined with the sand-like brown sugar/cinnamon filling which dissolved into pure sugar in your mouth, this topping was the sugary straw that broke the camels back and simply overpowered the entire recipe.\n\nI was interested to try a new recipe, but know now that I'll stick with my original cinnamon roll recipe  - \"Clone of a Cinnabon\" - also from Allrecipes",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefHouse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefhouse/"
                }
            }
        ]
    }
]