[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/398/desserts/cakes/tortes/",
                    "name": "Torte Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16480/fourteen-layer-chocolate-cake/",
        "name": "Fourteen Layer Chocolate Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5651866.jpg",
            "width": 1536,
            "height": 1536
        },
        "datePublished": "2000-01-25T01:01:03.000Z",
        "description": "Fourteen very thin layers with chocolate between each layer. Hope you enjoy this! I am from Georgia and make it all the time for church functions and family reunions.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "1 - 14 layer 8 inch cake",
        "recipeIngredient": [
            "½ cup shortening",
            "½ cup butter",
            "2 cups white sugar",
            "6 eggs",
            "3 cups milk",
            "3 cups self-rising flour",
            "2 teaspoons vanilla extract",
            "3 cups white sugar",
            "1 cup butter",
            "½ cup unsweetened cocoa powder",
            "¼ cup water",
            "2 cups evaporated milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 4 or 5 - 8 inch round cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the shortening, 1/2 cup butter and 2 cups sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then stir in the vanilla. Add the flour alternately with the 3 cups milk; beat well. Pour 1/4 cup of batter into each prepared pan, and spread evenly.  You will need to bake the layers in two or three batches.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 5 to 7 minutes in the preheated oven, just until the layers are dried out. Do not brown.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the frosting: In a saucepan over medium heat, combine 3 cups sugar, 1 cup butter, cocoa, water and 2 cups evaporated milk. Bring the mixture to a rolling boil, stirring frequently, then boil for 2 minutes. Remove from heat and beat for one minute with an electric mixer. Stack cake layers with icing in between, letting the icing run down the sides of the cake. Smooth the sides and top with the remaining icing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Torte Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "NELL 2"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.4489795918367347,
            "ratingCount": 49,
            "itemReviewed": "Fourteen Layer Chocolate Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "725.4 calories",
            "carbohydrateContent": "99.3 g",
            "cholesterolContent": "150.7 mg",
            "fatContent": "33.6 g",
            "fiberContent": "1.7 g",
            "proteinContent": "10.3 g",
            "saturatedFatContent": "18.7 g",
            "servingSize": null,
            "sodiumContent": "570.6 mg",
            "sugarContent": "77.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-11-16T05:27:34.583Z",
                "reviewBody": "I definatly Love this recipe Nell Thank You. For the Persons having trouble with this cake... First off, her measurements in this recipe is to the Science no adjustments with the amounts. First the batter- you should put 3/4 cup of batter per 8 inch pan; I assume she made a type-O. Next the frosting; before you begin you should understand the meaning of a ROLLING BOIL. A rolling boil is when all liquid is bubbling and breaking at the surface and liquid is rising. When you have reached a rolling boil then time 2 full minutes for it to continue to boil then take off heat and blend for 1 minute.(If you don't do this frosting precisly as stated you will have a runny mess that want set). Immediatly pour a layer of frosting in-between each layer of warm cake (I work with 3 layers at a time; I cook 3 then frost them while I'm cooking more). Of course this is a time consuming creation but let me tell you the outcome is raving. One more pointer: after you have finished the layering of all 12-14 layers let the remaing frosting sit to thicken a little (but still pourable) before you frost the top and sides. After the frosting has set on the cake Nearly like store bought icing then smooth the sides with the frosting that has oozed onto the plate. I suggest using a plate that is at least an inch in depth (A tupperware cake-taker is great using the deep-well side). I am also a Southern Cook/baker from North Carolina and believe me this is a Wonderful Cake To Create.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAROLINAGIRL34",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1074227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-15T14:53:34.75Z",
                "reviewBody": "My 89 year old grandmother has been making a cake similar to this for many years.  Her batter recipe differs slightly - only use 1 cup of milk and 3 1/2 cups of self rising flour.  To make the batter: cream the oil, margarine, vanilla & sugar together; add the 6 eggs; add 3 1/2 cups flour then add one cup of milk only mixing for a minute after the addition of the milk.  \nTo make the filling (chocolate icing), use 3 cups of sugar, 6 heaping tablespoons (use a serving spoon) of cocoa powder and add enough water to make a paste (just eyeball it).  Then add 1 can evaporated milk and 2 sticks of margarine.  Bring mixture to a boil, cooking until just thick and stirring occasionally.  Turn off heat and let sit on burner.  \nYou put this filling between each layer and to the remaining filling you add powdered sugar to make it thick (eyeball it).  This becomes the icing for the cake - allow sit out uncovered so the icing will harden.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "E. Shuman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2427636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-24T02:49:31.013Z",
                "reviewBody": "For all of you out there having trouble with the icing here is another alternative. This is the icing recipe I use for my 14 layer cake which does come out a little thicker (not that there is anything wrong with the one already listed!)But you do need to make the icing first. 1 stick margarine 3 1/2 blocks unsweetened Bakers Chocolate 2 cups evaporated milk 1 tsp vanilla 3 cups sugar & a dash of salt. Melt sugar & chocolate in saucepan then add other ingredients. Cook until thick stirring constantly. Ice each layer as it comes out of the oven. Hope this helps! From another Carolina Girl!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carolina Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2260482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-24T16:49:55.543Z",
                "reviewBody": "I wanted to impress my husband for his birthday. A chocolate layer cake is his favorite and spending more time or working more than the writer indicated was fine so I ignored that in other reviews. Do NOT ignore however those upset about the recipe not working. It states a 1/4 cup of batter for each layer it should be 1/4 inch of batter. The recipe for the batter is the only thing you should take from this disaster. That was fine. I read what everyone had to say and took my time with the ingredients measured everything out before baking and mixing and it still turned out terrible. It is true the frosting NEVER set. After 24 hours of being soupy frosting the cake was so terrible I had to throw it away and alas my hubby had not birthday cake. 24 HOURS!!!! And it never set!!!! In the end I had a very gummy mess on my cake plate and will never try this again. My advice don't walk but run from this recipe. wshooter",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "WSHOOTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/548403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-21T19:03:20.583Z",
                "reviewBody": "If you follow the directions by CarolinaGirl34 this recipe is perfect. I have never made this and my boyfriend's parents were going to order it from somewhere for Thanksgiving. Instead of them ordering it I volunteered to make it and made my 'Practice Cake' for my office Thanksgiving party. It was a huge hit with a big 'wow' factor. If you adjust the measurements as indicated and make sure to bring the icing to a rolling boil it will be fine. It's delicious. And when you cut into the cake it's beautiful. I sprinkled chopped pistachio's on top. I would recommend something like that to make it prettier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GABaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2172757/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-16T21:36:31.387Z",
                "reviewBody": "I had baked cakes for 30 years but had never heard of the 14 layer cake before I moved to Georgia. It's all the rage down here! This cake recipe is great but as with many other reviewers I don't recommend using this icing recipe as there is way too much liquid in it for it to ever set. I am submitting a recipe to help you all achieve success. Look for it titled: Chocolate Buttermilk Frosting. It's easy smooth versatile and is fluid enough to spread but will not be runny. By the way cook time is longer than 30 minutes when you have to bake 14 layers 3 at a time for 12 minutes each. You also have to wash pans and re-grease them in between baking each batch which adds to your cook time. Give yourself a good 3 hours at least and I loved the idea of using parchment paper in the bottom of the pans even after greasing and flouring them. No sticking problems with that but a few extra minutes cutting paper to fit the pans. It's worth the time. I get rave reviews when I bake this cake for my friends and family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MagicalMarilyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5199029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-03T16:51:27.03Z",
                "reviewBody": "I love this recipe! We have it every year at holiday gatherings but I've never had the recipe. I followed all of the suggestions submitted by CAROLINAGIRL34 and had no problems whatsoever. I did adjust the recipe to accommodate 9\" cake pans and plain flour. To do so the list of ingredients changed as follows. For the batter: 1/2 cup 2tbs 2 tsp butter flavored shortening; 1/2 cup butter; 2 1/3 cups white sugar; 7 eggs; 3 1/2 cups milk; 3 1/2 cups all purpose flour; 2 1/2 teaspoons vanilla extract; 2 tbs 1 tsp baking powder; 3 1/2 cups milk. For the icing: 3 1/2 cups white sugar; 1 cup 2 tbs. 2tsp. butter; 1/2 cup 1 tbs. 1tsp. unsweetened cocoa powder; 1/4 cup 2 tsp. water; 2 1/3 cups evaporated milk. I increased the amount of batter in each pan to 1 cup. My cake was the hit of our Thanksgiving table and everyone was astonished the cake was as moist as it was. Thanks to Nell and CAROLINAGIRL34!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TSIMS001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/208173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-24T16:50:30.92Z",
                "reviewBody": "I have always been considered a pretty good baker I'm always the \"dessert bringer\". This recipe was the worst baking disaster I have ever had. The frosting recipe needs adjusting too it was more like chocolate soup. NEVER thickened.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "BTYLU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/270335/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-24T16:50:52.513Z",
                "reviewBody": "I made this recipe with much success and garnered raves from friends and family during the holidays. This is a bit of confusion in the amounts and what type of milk to use in the list of ingredients but I made the adjustment by following the written directions and met with no problems at all. A labor intensive creation that's worth every bit of the effort. Nell was very generous to share this wonderful southern secret with us! (By the way I'm from North Carolina and have had it many times. This one is the best!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSALENE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/235710/"
                }
            }
        ]
    }
]