[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16668/adzimka-bread/",
        "name": "Adzimka Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7411642.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-11-28T16:27:54.000Z",
        "description": "This delicious pinwheel shaped bread is stuffed with cheese and potatoes. It's the perfect accompaniment to a bowl of soup and a crisp salad.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "1 ¾ cups warm water (110 degrees F)",
            "1 tablespoon vegetable oil",
            "2 teaspoons white sugar",
            "6 cups all-purpose flour",
            "2 teaspoons salt",
            "6 potatoes, peeled and cubed",
            "¾ cup shredded Cheddar cheese",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "1 egg yolk, beaten",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, dissolve yeast in warm water (110 degrees F, 45 degrees C). Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the vegetable oil, sugar, 3 cups of the flour and the salt to the yeast mixture; stir well to combine. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Generously oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the dough is rising: Place the potatoes in a small sauce pan, cover with water, bring to a boil and cook until tender; about 15 minutes. Place the drained potatoes in a bowl and mash. Combine with the shredded cheese and season to taste with salt and pepper. Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Grease a 14 inch pizza pan of baking sheet. Deflate the dough and turn it out onto a lightly floured surface. Knead for a few turns, then form it into a round, cover and let rest for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface roll the dough out into a circle slightly larger than the pan, and place onto the prepared pan with the dough draped over the sides. Spoon the potato filling into the center of the dough, leaving a 2 inch space around the edges. Stir together the egg yolk and water to make an egg wash. Brush egg wash around the exposed edge of the circle. Fold dough from the edge into the center about every 6 to 8 inches, until the whole edge has been folded in to form a pinwheel pattern. Press to seal after each fold. Brush the top of the loaf with the remaining egg wash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F (200 degrees C) for 15 minutes then lower the temperature to 350 degrees F (175 degrees C) and bake for an additional 20 to 25 minutes or until golden brown on top and bottom. Remove the bread to a wire rack and let cool for 15 minutes before slicing into wedges and serving.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.823529411764706,
            "ratingCount": 17,
            "itemReviewed": "Adzimka Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "215.1 calories",
            "carbohydrateContent": "40.9 g",
            "cholesterolContent": "14.7 mg",
            "fatContent": "2.8 g",
            "fiberContent": "2.1 g",
            "proteinContent": "6.3 g",
            "saturatedFatContent": "1.1 g",
            "servingSize": null,
            "sodiumContent": "378.8 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:24:43.577Z",
                "reviewBody": "I read the earlier review and added about 1/2 cup chopped onion as well as additional cheese. It was really delicious and everyone had seconds. Overall it was time consuming but worth it for a treat. The bread itself was also great. It makes enough for six to 10 people depending on the size of the pieces. Although I still don't know what a pinweel looks like!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZDALY54",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/504187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:24:43.013Z",
                "reviewBody": "This was a fun project but it turned out to be somewhat bland. I am going to add lots of GARLIC ONIONS and whatever else to my next batch to give it some more character! I recommend that you do the same!!! Also it makes a LOT of food so be prepared for that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSLUCIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:24:42.123Z",
                "reviewBody": "Well I was skeptical when I looked at the recipe but I always just always try new ones and so I did. I've been baking breads for 38 years now and love it.This recipe was a complete waste of my time but I'm glad I tried it because now I know. I added carmelized onion and baked garlic to enhance what appeared to be a rather bland dish. The dish was still very bland and the idea of mashed potatoes encased in a dough didn't sound appetizing and it wasn't. No one in our family liked it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Rosas Daughter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:24:42.497Z",
                "reviewBody": "I tried this recipe quite a while ago and I still haven't calmed down to give it even a bland review. I suppose it could always be user failure but I followed this recipe to the T I didn't change a thing. The crust of the bread was VERY hard after the egg wash the inside of the bread did not even cook at all. The potato mixture yes I changed that a tad added some bacon bits and some cheese for personal perference a good thing too the bread was not fit to eat and was tossed out. We had mashed potatoes for dinner. Like the other reviewers I had no idea how to do the pinwheel shape so I was on my own for that...could have been the whole problem together. I will admit to having 'bread related' issues I don't bake fresh breads well and this did nothing to boost my tiny fragile ego. I will not be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "EMERALDSEYE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/696026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-11T16:46:14.903Z",
                "reviewBody": "I gave this 4 stars instead of 5 only because I doctored the mashed potatoes up quite a bit. Like other reviewers suggested I added garlic bacon onions and extra cheese. That being said the dough was FANTASTIC and in addition to being tasty it was so pretty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Natalie Clevenger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2206942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-19T17:18:55.16Z",
                "reviewBody": "I divided the dough in half to have a thin crust bread using honey for the sweetener and only whole wheat flour. Then when I got ready to cook the potatoes I thought about leaving them in raw slices. I also read the reviews that suggested to add onions. I don't know if I'm qualified to leave an excellent review because I made so many changes! I have raw potato slices fresh jalapeno slices sliced Bermuda onion and sliced garlic under all the cheese. It was a wonderful meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sueb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2719400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:24:41.403Z",
                "reviewBody": "This was very tasty! The bread came out perfect - soft near the potatoe filling and the right amout of firmness on the shell. I am unsure about the pinwheel shape as well -- just made my own version of a pinwheel. I did add onions minced garlic and some garlic powder to the potatoe filling. YUMMY! Definitely worth the afternoon it took to prepare it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEHUAREDDEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/801105/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:24:42.793Z",
                "reviewBody": "This was certainly different and interesting. And I liked it just as is without adding anything. I used red potatoes as that's what I had so I'm not sure how that would compare to \"6\" regular potatoes but I have a feeling that would be too many. A hearty bread. I do know what a pinwheel is but it didn't really seem to work right but the attempt at one still made for an interesting looking loaf. Unfortunately quite time consuming or I'd make it more often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Erimess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/erimess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-08T19:34:27.623Z",
                "reviewBody": "this was great exactly as described. it was chewy but soft but definately a meal in itself!! tastes exactly like a mash potato sandwich!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PaulaM11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1390120/"
                }
            }
        ]
    }
]