[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16935/pizza-dough-ii/",
        "name": "Pizza Dough II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F811890.jpg",
            "width": 1366,
            "height": 1366
        },
        "datePublished": "2000-02-23T00:32:46.000Z",
        "description": "Makes three hearty pizza crusts. This dough can also be used to make calzones or can be frozen for later use.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "3 pizza crusts",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "1 tablespoon white sugar",
            "2 ½ cups warm water (110 degrees F)",
            "2 tablespoons olive oil",
            "1 tablespoon salt",
            "½ cup whole wheat flour",
            "5 ½ cups bread flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, dissolve yeast and sugar in the warm water. Let sit until creamy; about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the olive oil, whole wheat flour, salt and 4 cups of the bread flour into the yeast mixture. Mix in the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and put in a warm place to rise until doubled in volume; about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into three equal pieces and form into rounds. Cover the rounds and let them rest for about 10 minutes. Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use a rolling pin to roll the dough into the desired shape, cover it with your favorite toppings and bake at 425 degrees F (220 degrees C) for about 20 minutes or until the crust and cheese are golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephen Carroll"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.69761273209549,
            "ratingCount": 754,
            "itemReviewed": "Pizza Dough II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "202 calories",
            "carbohydrateContent": "37.8 g",
            "cholesterolContent": null,
            "fatContent": "2.6 g",
            "fiberContent": "1.7 g",
            "proteinContent": "6.3 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "437.4 mg",
            "sugarContent": "0.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-06T21:13:22.34Z",
                "reviewBody": "I have not made this recipe yet, but while reading the reviews I noticed many people having trouble ending up with a soggy crust and overcooked toppings.  To avoid this, you must work with a pizza stone and a pizza peel.  Place the stone in your oven, preheat the oven to 500 degrees.  Allow the pizza stone to heat for 30 minutes at this temperature.  Meanwhile prepare your pizza on your floured pizza peel (be sure to give your pizza crust a little shake on the peel prior to putting on your toppings so that you can add more flour if necessary - doing this will ensure that it will slide off easily onto the stone ).  Once you are sure your pizza will slide off easily, top it however you want and then slide it very carefully onto the stone in the oven.  Heating the stone for 30 minutes prior to baking the pizza will ensure a thoroughly cooked crispy pizza crust.  Watch your pizza very carefully as it will cook fast at this temperature.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1910875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-28T22:20:46.153Z",
                "reviewBody": "The dough is beautiful and tasty.  I divided it into 3, and made a 16\" pizza.  But I think just dividing it in half for a pizza that size would be good too.  It just depends if you like thinner or thicker crusts.  After I rolled it out and let it rise for 10 or 15 minutes, I prebaked it for about 10 minutes at 350F.  That helps keep the crust from getting soggy and you don't have to bake it so long with the toppings, which can easily burn at 425F.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSIFIVE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/160638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-19T21:10:15.043Z",
                "reviewBody": "I woke up this morning with the first thing on my mind being RATE THIS DOUGH!\nLast night I used this recipe to make pizza and calzones and it was PERFECT. I don't know if it was entirely this recipe or the new whole grain flour I used from Healthy Choice, but the taste and texture were very good. So, yes, I used the whole grain all-purpose in lieu of the bread flour (which I never use these days).  I used the dough cycle of my bread machine and when I began to roll out my dough it was an absolute pleasure. It was doughy and yeasty, but no too sticky. I added parmesan cheese and pizza herbs and garlic to the dough which yielded a flavorful, flexible dough that rose slightly (not too thick).  When I have used other pizza doughs, they have been rather hard to manage in comparison and have risen so much during baking that the recipe for pepperoni bread (also found on this site) was too \"bready\" in a lot of spots.  I may still alternate w/ other pizza dough recipes, but at this point, this is by far my favorite, especially for calzones and pepperoni breads.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DigginDiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1501904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-20T21:05:50.937Z",
                "reviewBody": "This is our favorite crust from all the recipes here. My husband asked me to just make this one every time from now on. This one gets even better after we freeze it and thaw it for later use. I made these thin and crispy. Directions were easy to follow, dough was easy to handle. It made 3 large crusts as stated, I froze two, so I'll update later as to how they worked out. I did not prebake this and it turned out great. An awesome crust recipe, I am pleased in how this turned out and I do highly recommend this. This is even better that Jay's signature crust.\nUPDATE: I thawed one crust out for lunch today and the pizza that resulted was fabulous! The crust came out very light with a crispy crunchy outside and soft inside. This was better than any pizza chain pizza crust ever thought to be! I cooked this for only 16 minutes, it would have burned in 20. This dough is so easy to work with, it is incredible. *****5 stars***** I still have 1 crust left in the freezer, yippee! I am so delighted with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~TxCin~ILove2Ck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1197175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T18:03:43.75Z",
                "reviewBody": "I'm very disappointed by this recipe.  Since it was featured in an Allrecipe's cookbook and had such high rating, I had to try it.  I had no problem with the prep, rising, etc., but when we tasted it, it was more like wheat bread with pizza toppings.  If you're looking for traditional pizza dough, this is not it.  The consistency is like bread, not dough...maybe from the bread flour.  Also, dough takes longer to cook than toppings and is puffy and soggy.  I won't be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Sell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-11T16:48:52.293Z",
                "reviewBody": "I make this dough in my bread machine, and it turns out great.  You just put the liquid ingredients first and the yeast last, and allow first rise in the machine.  After, roll it out, top, and bake as in the recipe.  Just a tip if you divide by three to make only one crust, 1/2 pack of yeast, not 1/3.  It rises better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsSid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1642583/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T12:13:41.263Z",
                "reviewBody": "Perfect pizza dough!  It keeps in the refrigerator, too.  I made this five days ago, and baked half of it right away.  I baked the other half today, and it was great.  I baked it for 10 minutes, and then took it out to add the toppings, and continued baking for another 10 minutes.  My guests loved it (as did I)!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/592997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T15:47:28.903Z",
                "reviewBody": "I have made this recipe 3 times and each time it has been perfect.  My husband used to work at a pizza place where they made dough from scratch. He had a great time tossing it and it ranked high on his standards!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TEACHER/2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/393908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-29T04:04:32.547Z",
                "reviewBody": "This dough is so good and inexpensive. I make enough for 3 pizzas and freeze 2 of them. Good recipe for breadsticks too. Thank you for sharing it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SEVERINEG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/597497/"
                }
            }
        ]
    }
]