[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/359/bread/quick-bread/fruit-bread/",
                    "name": "Fruit Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16932/lemon-poppy-seed-bread/",
        "name": "Lemon Poppy Seed Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6705975.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-10-05T19:32:57.000Z",
        "description": "A delicious and easy poppy seed bread made from scratch.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "3 - 8x4 inch loaves",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "1 ½ teaspoons salt",
            "1 ½ teaspoons baking powder",
            "1 ½ tablespoons poppy seeds",
            "2 ½ cups white sugar",
            "1 ⅛ cups vegetable oil",
            "3 eggs",
            "1 ½ cups milk",
            "1 ½ teaspoons vanilla extract",
            "1 ½ teaspoons lemon extract",
            "¼ cup orange juice",
            "¾ cup white sugar",
            "½ teaspoon lemon extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease three 8x4 inch bread pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, stir together the flour, salt, baking powder,  poppy seeds and 2 1/2 cups white sugar. Add the eggs, milk, oil, vanilla and lemon extract; mix until smooth, about 1 minute. Pour batter evenly into the prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 50 to 55 minutes, or until a toothpick inserted into the center of the loaves comes out clean. Cool loaves in the pans for 10 minutes before removing to a wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine orange juice with remaining 3/4 cup sugar and desired flavor of extract; stir well. Pour this mixture over the loaf while it is still hot. Allow loaf to cool completely before serving.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Fruit Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Margie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.411522633744856,
            "ratingCount": 243,
            "itemReviewed": "Lemon Poppy Seed Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "330.3 calories",
            "carbohydrateContent": "48.3 g",
            "cholesterolContent": "29.4 mg",
            "fatContent": "14 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "229.6 mg",
            "sugarContent": "33.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-27T15:40:31.03Z",
                "reviewBody": " I have made this recipe many times now and after tweaking with ingredients, I think I finally found perfection! I found that I had to increase/decrease some ingredients: I cut the sugar by 1/2C, increased the Poppyseeds to a 1/4C and I used 1/2C of real lemon Juice instead of the extracts as it has more flavour. I also put the rind of a lemon into the batter.(I also always mix my ingredients by wet then mix dry into it) I baked mine in a bundt pan for 1 hour & 10 min. It baked beautifully and turned a nice golden colour! Instead of the glaze I sifted Icing sugar on top.  It was very pretty and tasted nice too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1837326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-05T02:40:48.157Z",
                "reviewBody": "Good recipe, but please use REAL LEMON JUICE.  The extract doesn't impart any lemon flavor.  I use a full 1/2 cup of lemon juice (the bottled juice is perfect for this), 3 teaspoons of poppy seed and buttermilk instead of regular milk.  The buttermilk improves the texture of the bread, creating a lighter, fluffier version.  If you like your bread a little denser, than stick with regular milk.  I baked mine in 2 loaf pans instead of three.  For the Glaze: 1/4 cup orange juice, 4-5 tablepsoons powdered sugar.  Don't use original recipe for the glaze, it's way too sweet.  Always use powdered sugar when making a glaze for ANYTHING. (3 star for original recipe, 5 stars for alterations.  Great base recipe though)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-11T17:47:50.077Z",
                "reviewBody": "My whole neighborhood raves about this one!  Personally, I like bigger loaves so I use this recipe and pour it into 2 standard bread loaf pans (I personally really like the silicone ones for this recipe too) and I just have to keep checking with a toothpick in the center to make sure they're done after about 1 hour 10 minutes.  Also, it helps to microwave the OJ cocktail at the end before applying to the hot loaf right as it comes out of the oven....otherwise you'll never get the sugar to dissolve in 1/4C of OJ!!  \n\nAdded 8/11/07 - OK I have made this recipe about 30 times by this point and I can say each time I tried cutting back the oil, it came out dry and excessively dark on the sides.  Now I actually increase the oil slightly and the milk as well by maybe 1/4C each, and I have dropped the temp to 325.  For Jumbo sized Muffins this recipe will make exactly one dozen and you MUST increase the oil to 1 1/2C and the Milk to 1 3/4C and bake for 50 min at 325.  For bread, I don't do the 3 loaves, I pour it all into 2 pans and just bake it a little longer, checking with a toothpick.  Oh - I also increase the vanilla and lemon extract to 2 tsp each.  with the glaze hot and completely melted after heating in the microwave, I use a pastry brush and paint it on top, not once, but twice!  Enjoy...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tasman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1500702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-15T16:39:51.133Z",
                "reviewBody": "Excellent! I like this type of bread very lemony and very moist so I added the juice and zest of one lemon to the batter in addition to the lemon extract. I divided the glaze into two parts. The first I used the 1/4 cup orange juice the juice of one lemon and 1/3 cup sugar. I poked holes in the top of the bread and poured the glaze on top. Once the bread was cool I made a simple powdered sugar glaze of about 1-1/4 cup powdered sugar 1-1/2 Tbsp. water and 1/2 tsp lemon extract. I was attempting to make the bread like what I always get at Caribou Coffee. It came out soooo good. Very lemony and moist and the frosting on top is a nice treat! I found that this recipe only made two loaves of bread and I baked them for 55 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-19T01:05:21.923Z",
                "reviewBody": "I've always believed the real fruit gives better flavor than extract so I omitted the lemon extract and used the rind of 1 lemon extracted the juice and added the milk to fill 1 1/2 cups. This gave the cake a delicate lemon flavor just right for my family's taste. If strong lemon taste is desired use 2 lemons. I've also tried making an all-orange version using the rind of the orange in the cake and the juice for the glaze. Still good but the lemon-inside orange-outside contrast was more interesting. Lastly make this cake in a 12-cup bundt pan. The cake comes out large and if baked to golden perfection it turns out so pretty! Lastly because other people said they had problems with the cake sticking to the bottom of the pan I use a brush to put on the glaze.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTMAS8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1338078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-14T02:04:30.717Z",
                "reviewBody": "I've tried several lemon poppy bread recipes over the years and this one is the winner!  It is SOOOOOOOOOO good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "padutchy2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/263328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-16T02:19:09.313Z",
                "reviewBody": "Yummy! I did a few changes. Cut sugar to 2 cups. Cut the vanilla to 1 tsp. Cut the oil to just 1/2 cup (saves on calories). Used juice of 1 lemon plus enough milk to make 1 1/2 cups. Plus added the zest of 1 lemon. These came out so delicious and moist! I made 12 muffins and 1 loaf. Loaf took about 65 mins and the muffins took about 25 mins. I added poppy seeds to the loaf only and left them out of the muffins for my kids. This is a keeper for us! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JLLEWIS1214",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1280855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:51:24.543Z",
                "reviewBody": "Wonderful bread!!! Made it last night and didn't use the glaze as I was freezing two of the three loaves for the holidays. It was still great! Wish I had followed one reviewers advice however and only made two loaves. My three are not as high as I would like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KONOWALSKI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/729463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:51:24.78Z",
                "reviewBody": "I make this bread every Christmas for family and friends and they love it! The only thing I do differently is omit the almond extract and use only the lemon extract in the bread and add 2 TBSP of melted butter and lemon extract to the topping. It is best poured over loaves when warm. My friends love it so much that they give me big bottles of poppyseeds for my birthday!! :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "STBELLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/747652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-08T23:20:57.957Z",
                "reviewBody": "Not sure what went wrong with this recipe or if I made it the way it was supposed to be. I reduced the sugar 1/4 cup and the oil 1/8 cup. This cake had an off taste to it. I think it had way too much oil. I used real lemon juice instead of extract. The cake had a play dough like taste to it. The consistency was dense. No one in the house liked it. I made it because I had no lemons or butter defrosted and I believed the reviews. But it was awful. I went to Martha stewart on line and got a different recipe with real lemon juice and butter which was a winner. Have used many recipes off here and this one was the worst so far.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Vancouver mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2162367/"
                }
            }
        ]
    }
]