[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/399/desserts/cakes/white-cake/",
                    "name": "White Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17129/easter-lamb-cake-ii/",
        "name": "Easter Lamb Cake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5281367.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "1999-03-30T22:20:51.000Z",
        "description": "This white cake is baked in a lamb mold for Easter and can be decorated to look like a little lamb. If desired, spices can be added just before adding the egg whites.  Some good choices are anise, nutmeg or cinnamon.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 lamb mold",
        "recipeIngredient": [
            "2 ¼ cups cake flour",
            "2 ½ teaspoons baking powder",
            "½ teaspoon salt",
            "1 ¼ cups white sugar",
            "½ cup butter",
            "1 cup milk",
            "1 teaspoon vanilla extract",
            "4  large egg whites egg whites"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "First, prepare your mold. Coat with vegetable oil, let sit for a few minutes then wipe clean with a paper towel. Then grease and flour your mold, making sure to get all the little areas.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Sift the cake flour, then sift again with the baking powder and salt; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until light and fluffy.  Add the flour mixture alternately with the milk. Stir the batter until smooth after each addition. Add the vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large glass or metal mixing bowl, beat egg whites until soft peaks form. Fold 1/3 of the egg whites into the batter to lighten it, then quickly fold in the remaining whites.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill the face side of the mold with batter. Move a wooden spoon through the batter GENTLY, to remove any air pockets.  Make sure not to disturb the greased and floured surface of the mold. Put the lid on the mold, making sure it locks or ties together securely so that the steam and rising batter do not force the two sections apart.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Put the mold on a cookie sheet in a preheated oven for about 1 hour. Test for doneness by inserting a skewer or wooden toothpick through a steam vent.  Put the cake, still in the mold, on a rack for about 15 minutes. CAREFULLY, remove the top of the mold.  Before you separate the cake from the bottom let it cool for about 5 more minutes so that all the steam can escape and the cake can firm up some more. After removing the rest of the mold, let the cake cool on the rack completely. DO NOT sit the cake upright until completely cooled.  Frost with Seven Minute Icing or any other white icing of your choice and decorate to look like a lamb.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "White Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Patricia Taylor"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.583333333333333,
            "ratingCount": 60,
            "itemReviewed": "Easter Lamb Cake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "260.5 calories",
            "carbohydrateContent": "42.2 g",
            "cholesterolContent": "22.4 mg",
            "fatContent": "8.6 g",
            "fiberContent": "0.4 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "5.3 g",
            "servingSize": null,
            "sodiumContent": "254.2 mg",
            "sugarContent": "21.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-15T21:46:09.607Z",
                "reviewBody": "I have had my grandmother's lamb pan for over 30 years and have yet to find a recipe that held it's shape and tasted good - UNTIL NOW! Thanks for this wonderful recipe that is now a family favorite. It holds it's shape comes out of the pan well and looks pretty frosted or unfrosted. I added some lemon extract to mine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookie22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1461956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-26T15:24:54.933Z",
                "reviewBody": "I am so happy to see that other families have this tradition! In my family we've nicknamed it \"Lambie cake\" and we've had the molds forever...! We always do a chocolate cake but I'm excited to try a white cake (especially for my grandma who can no longer eat chocolate) this year. Our traditional way of decorating includes white frosting with coconut for fleece and sit the lamb in a bed of bright spring green-tinted coconut grass surrounded by jelly beans and chocolate foiled eggs. It looks so adorable! We also use jelly beans for the eyes and nose. Tradition: half of a black jellybean for each eye and half of a pink jellybean for the nose. Black works fine for the nose too. When I was little my mom would also add a flower made of icing or hardened sugar with or without a slim pretty ribbon around the little lamb's neck.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/894428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-10T18:35:43.81Z",
                "reviewBody": "This recipe was really easy and tasty. It baked in the mold perfectly with no problems. It came out of the mold fine. I frosted it using a pastry bag. Frosting it took about 5 minutes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cheryl wisniewski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-25T20:30:53.257Z",
                "reviewBody": "The best recipe I've tried with my old cast iron lamb mold. It's a firm cake that holds up well. The only modifications I made were 1) I used Baker's Joy cooking spray to \"grease & flour\" the mold and 2) I flavored the batter with a couple of Tblsp. of finely grated lemon zest. Came out great --Grandma would be proud!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/746305/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-19T18:08:10.557Z",
                "reviewBody": "This recipe is very similar to the one that came with our Lamb \"heavy formed aluminum\" cake pan from the 1960s. It is perfect for that mold which is 7 3/4\" by 11 1/2\" by Nordic Ware. I highly recommend the 7 minute frosting for this cake as its brittle sugary sweetness is the perfect complement. Put coconut on the frosted cake and color some green to go around the base as grass. Don't forget the jelly bean nose and eyes (use just a 1/2 jelly bean for each eye). To make it look more like a lamb and less like a dog you can put a ribbon or some flowers around the neck. Also keep the coconut off the head so it stays more delicate looking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brenda in NJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3300681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-11T14:15:07.153Z",
                "reviewBody": "Great! I've been looking everywhere for a good recipe for my new lamb cake tin and this one worked really well. I made my lamb ginger flavoured with some ground ginger. The cake is firm enough to stand upright and not droop or break and very well defined. I could decorate it with icing but it looks really very pretty without it. My family are most impressed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sophie R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1597134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-08T02:35:23.92Z",
                "reviewBody": "This cake tastes wonderful. Next time I will be more careful with greasing the pan - my cake did stick a bit. I added a little coconut extract (1/4 to 1/2 tsp) along with 3/4 tsp vanilla extract to the cake batter and I think it gave the cake a nice flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Batgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2135417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-05T16:42:37.01Z",
                "reviewBody": "I made this cake yesterday and it turned out great! I used the aluminum lamb mold and an electric oven at 375 for 55 minutes. Had some batter leftover enough for a couple of cupcakes. Don't skimp on greasing the pan. Mine came out almost perfect but cracked a little. The cake tasted great--springy and not too sweet. We don't like coconut so I made an almond buttercream and decorated the cake with a star tip a jellybean cut in half for the eyes and pink icing for the ears nose and mouth that I used a writing tip for. A lemon buttercream would also go great with this cake. My family really loved this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AngelaMarie85",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4758406/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-08T21:02:00.447Z",
                "reviewBody": "Made this cake for Easter this year. Very good flavor. Not too sweet but just sweet enough and the middle cooked as well as the outside. Held it's shape from the mold very nicely. Will make again for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LouisianaLady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2102686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-06T00:47:24.927Z",
                "reviewBody": "I made this to bring to the inlaw's for Easter but I chickened out at the last minute and made cookies to bring instead. I was too nervous we wouldn't like the cake part and wanted to try it for the first time with just us and the kids. I'm glad I did. I followed the recipe exactly I even bought the cake flour just to use for this cake. My family of four all agreed this was just a very dry flavorless cake. My 5-year old actually gave it one star:( I know the cake needs to be able to hold up so it can stand and be frosted but we just did not care for this. No one finished their slice. It did hold up nicely to being frosted and it's looks got big grins from my kids. We just didn't care for the taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "luvmykids",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2926455/"
                }
            }
        ]
    }
]