[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
                    "name": "Pasta and Noodles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/521/pasta-and-noodles/pasta-by-shape/",
                    "name": "Pasta by Shape Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/515/pasta-and-noodles/pasta-by-shape/tortellini/",
                    "name": "Tortellini Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17166/sauce-rosee/",
        "name": "Sauce Rosee",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F434017.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2000-03-10T00:23:01.000Z",
        "description": "Restaurants BEWARE this sauce can top you! Try it with tortellini pasta and  shrimp and top with a Caesar salad, if desired.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 tablespoons olive oil",
            "½ teaspoon dried basil",
            "½ teaspoon dried thyme",
            "½ teaspoon dried oregano",
            "½ teaspoon dried parsley",
            "¼ teaspoon dried red pepper flakes",
            "2 tablespoons minced onion",
            "2 tablespoons minced green bell pepper",
            "1 tablespoon minced garlic",
            "7 ounces tomato sauce",
            "½ teaspoon chicken soup base",
            "1 tablespoon white sugar",
            "½ pound cheese tortellini",
            "6 fluid ounces heavy cream",
            "½ cup white wine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat olive oil over medium-low heat and add basil, thyme, oregano, parsley and dried red pepper flakes; stir together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add onion, bell pepper and garlic and cook until onions are transparent; add tomato sauce and bring to a boil, stirring well. Add chicken bouillon and sugar; stir.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the sauce is cooking, bring a large pot of lightly salted water to a boil. Add pasta and cook according to the package instructions (fresh tortellini take less time than dried). Drain and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce heat, add cream and wine; bring close to a boil, stirring constantly. Add pasta and serve.\n"
            }
        ],
        "recipeCategory": [
            "Pasta and Noodles",
            "Pasta by Shape Recipes",
            "Tortellini Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "YGBELAND"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.548172757475083,
            "ratingCount": 301,
            "itemReviewed": "Sauce Rosee",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "343.9 calories",
            "carbohydrateContent": "18.3 g",
            "cholesterolContent": "49.7 mg",
            "fatContent": "27 g",
            "fiberContent": "1.4 g",
            "proteinContent": "5.2 g",
            "saturatedFatContent": "10.2 g",
            "servingSize": null,
            "sodiumContent": "344.1 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-08-27T12:48:03.61Z",
                "reviewBody": "First of all thanks for a fantastic recipe!  My husband loves seafood and creamy sauces, so to begin I sautee some fresh shrimp and scallops in a pan just lightly seasoned with salt and pepper.  Once those are just done (do not overcook) I remove them from the pan (to be reheated in the sauce).\n\nFor the sauce, I cut the olive oil in half as per other reviews.  When I add the spices in the oil to heat; I have found that the longer you heat them the more flavor your sauce will take on.  I heat them for about 5 - 7 minutes (stirring often) before I add anything else.  I also add the wine before the tomatoe sauce to give the alcohol a chance to boil out.\nI also cut the sugar out.  I guess this depends on your taste, but I find the sugar makes the sauce too sweet for us.  We like spicy/savoury food.  Once the cream has been added and starts to heat up I put my shrimps and scallops in the sauce and reheat(only a few minutes).  I toss this with Fettucini and I get RAVE reviews all the time!!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mwbabe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1483575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:54:44.64Z",
                "reviewBody": "This sauce is FANTASTIC. I made it for a food demo in a grocery store. Everyone who tried it liked it. I usually do not like what I make but as soon as I took one bite I knew this sauce was a winner. I didn't bother with the peppers or onions. Instead of pasta I had cut boneless skinless chicken breasts into chunks; then I breaded the chunks in flour and oregano then sauteed the floured chicken chunks in olive oil. After sauteeing the chicken I prepared the sauce in the same pan. I could not believe how good this sauce is. I'll definitely make this again and again and again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CSANDST1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/115553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-19T00:25:22.653Z",
                "reviewBody": "This is a family hit! I have made this recipe several times using it as a sauce over lobster ravioli. My only recommendation is to add good quality wine before the tomato sauce bringing it to a boil to evaporate off the strong alcohol flavor. It will also help to thicken the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHARONPA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1351302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-21T23:04:02.543Z",
                "reviewBody": "YUMMY – very delicious!  A great blend of seasoning makes this sauce a definite keeper.    Plus, it’s very quick and easy to prepare.  I followed the previous reviewers’ advice and used 3 T. olive oil and 1 lb. Tortellini.  I also reduced the thyme to ¼ t., the sugar to 1 t. and the pepper flakes to just a dash or two (this sauce comes out quite spicy with the recommended ¼ t.).  Lastly, since tomato sauce comes in EIGHT oz. cans and heavy cream comes in EIGHT oz. cartons, I used the full 8 oz. of both and the sauce came out perfectly (hey, why have unnecessary leftovers?)  And speaking of leftovers, this sauce tastes EVEN better a day or two later.  I now can’t wait to make more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINGIRLLJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/451423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-26T00:39:57.84Z",
                "reviewBody": "With all the rave reviews I'm a little surprised that we're not falling out of our chairs in delight with this recipe. I'll make this again but next time I'll cut the wine and sugar in half - there was just too much tang with the sweetness and alcohol taste for our liking. (We used chardonnay by the way.) I will re-review this recipe after I try that. By the way I would say this only serves 2-3 as a main course. The recipe reads that it serves six but I can only see that in side-dish proportions. UPDATE: The key to five stars is using a pinch of sugar no wine and a little less heavy cream (more like 4oz). MUCH better that way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Dare Wolak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2107966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-16T18:21:59.59Z",
                "reviewBody": "I used fresh herbs left out the sugar and chicken bouillon as I needed it to be vegetarian. I used it on tortellini as suggested. Everybody loved it so much they were using bread to mop the last bit off their plate. Will make again. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-30T23:04:07.483Z",
                "reviewBody": "I did not care for this recipe. I followed the recipe exactly. While it is possible that my husband and I don't like sweet food and that is why we intensely disliked this I think it has more to do with the fact that it was just not good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "SHCMEOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/313595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-05T03:04:41.31Z",
                "reviewBody": "Four stars bedause this is a good base for a rose sauce but the seasoning is off and more basil and marjoram works better than thyme. However individuals can tweak the seasoning to their own taste. For those who didn't like the sweetness note that the better (and more authentic way) to 'sweeten' a too acidic tomato based sauce is to increase the amount of ONION and sweat them down in the oil well at the beginning of the cooking. Balance of sweetness is also dependent on the white wine used and DON'T leave it out if you want authentic rose sauce. if you prefer a less \"sweet\" sauce use a fruity pino grigio not chardonnay which is much too assertive and astringent or a blended white table wine. If you do want a bit LESS acidic sauce use a slightly sweeter wine like a Riesling. It should definitely be added in sooner rather than later also to mellow the flavor before adding the cream. Don't use a wine you would not drink -- especially not 'cooking wine' which is bad wine with salt added. All that said yes if you are not going to use more onions and (RED)bell peppers then definitely cut back on the oil. Using more of those two veggies will help incorporate the oil better. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HYPATIA1219",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/403216/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-21T22:57:38.053Z",
                "reviewBody": "As per other reviewers decreased the oil to 3 tbsp and omitted the red pepper flakes. My husband added the pepper flakes at the end. We also served with pieces of cooked turkey bacon and grated parmesan cheese. Also boiled the wine and the tomato sauce together to lighten the taste of the wine and because I am pregnant. Next time will decrease the sugar by half (this was way to sweet for us) and will use 4 cloves of garlic instead of 3. Will make again. Thanks for the good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pepm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1596831/"
                }
            }
        ]
    }
]