[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15489/desserts/cakes/cake-mix-cakes/white-cake/",
                    "name": "White Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17354/coconut-cream-cake-i/",
        "name": "Coconut Cream Cake I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2486680.jpg",
            "width": 2608,
            "height": 2389
        },
        "datePublished": "1999-10-01T03:14:01.000Z",
        "description": "An easy cake using a white cake mix, and moistened with a creamy coconut sauce. You may reduce the amount of sauce if you prefer, and it will still be delicious.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT8H50M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "1 (18.25 ounce) package white cake mix",
            "3 eggs",
            "⅓ cup vegetable oil",
            "1 cup water",
            "½ teaspoon coconut extract",
            "1 (14 ounce) can sweetened cream of coconut",
            "1 (14 ounce) can sweetened condensed milk",
            "1 cup heavy whipping cream",
            "1 tablespoon white sugar",
            "1 cup flaked coconut"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together cake mix, eggs, oil, water and coconut flavoring. Beat for 2 minutes and pour into 9x13 inch pan. Bake for 30 minutes, or until a toothpick inserted into the cake comes out clean.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine coconut cream with sweetened condensed milk and stir until smooth. When cake comes out of the oven, poke holes into it in even rows using a large fork or chopsticks. Pour milk mixture over, allowing it to soak into the cake. Refrigerate for several hours or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whisk cream until soft peaks form. Add sugar and continue whipping until stiff. Spread over cooled cake. Sprinkle top with flaked coconut.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "White Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GPAIN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.70197486535009,
            "ratingCount": 557,
            "itemReviewed": "Coconut Cream Cake I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "287.9 calories",
            "carbohydrateContent": "36.6 g",
            "cholesterolContent": "42.4 mg",
            "fatContent": "14.6 g",
            "fiberContent": "0.5 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "189.6 mg",
            "sugarContent": "30.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-04-07T20:21:10.387Z",
                "reviewBody": "Wonderful, creamy coconut cake.  Just one tip to sort out the Coconut CREAM/ Coconut MILK enigma. Some people here use these terms interchangeably.   Look at the ingredients on the can, and if you see sugar FIRST, and then coconut milk (plus some other fillers) then DO NOT add the condensed milk.  Just use it straight up. If you're can has the ingredients listed as: coconut milk, water, etc (but no sugar), then DO use the condensed milk to sweeten it, but even then try half a can of condensed milk first and keep tasting it until it is to your desired level of sweet.  Then proceed to drizzle this over your warm cake as per the recipe.  I bought  both, I found coconut milk in the sauce aisle at the grocery store, it was just coconut milk and water.  I also bought coconut cream in the alcoholic drink section, and it was already sweetened.  I'm glad I bought both, I warmed them both up separately, and the coconut MILK sweetened with 1/2 can of condensed milk, kept the true tasted of sweet and coconut.  The sweet coconut CREAM is way too sweet (because it's manufactured mainly for pina coladas and needs to offset the alcohol and pineapple juice...)  So, all this to help one soul from making the mistake of adding sweet condensed milk to already overkill sweet coconut cream.  Also, whip your cream with just a hint of sugar, don't try to make it sweet, sweet cream.  The cake will be very sweet as is, and you can make or break it with the whipped cream.  Happy baking!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NancyDos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4133198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-07-15T02:34:58.993Z",
                "reviewBody": "This is such an easy cake, but so good that people will think you have some God-given baking talent. I didn't have any coconut extract and it wasn't missed one bit. I made this for my father-in-law's 80th birthday and it went over so well that within a day I got emails asking for the recipe! My mom and sister have  Crohn's disease that prevents them from having too much roughage in their diets; flaked coconut bothers both of them, as it does many people. You can skip the flaked coconut on top and not miss the coconut flavor at all. YOU SHOULD FOLLOW other reviewers' suggestions and let this cake cool to room temp on the counter after you pour the coconut cream mixture over it, before chilling. If you put the cake in the fridge to cool, it will get soggy. REMEMBER ALSO not to let holes poke all the way through to the bottom of the cake or you'll get a  little puddle of coconut cream on the bottom, which means it didn't absorb into your cake and won't be as moist as you want. Bigger holes work better, so find something as big as a chopstick if you don't have one handy. I used unsweetened coconut cream and just half a can of sweetened condensed milk and it was plenty sweet. I frosted the cake with the Cool Whipped Frosting recipe on this site that has a billion good reviews, and that worked very well. Nice and light tasting. This was such a fantastic cake and so easy to make. Don't miss this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-23T04:30:20.703Z",
                "reviewBody": "The flavors really come out in this cake after 2 days and it continues to get better. I agree with another reviewer this is a bit like a tres leche cake. I added coconut extract to the whip cream and toasted the coconut. It is just wonderful but make 2 days ahead for best results. Coconut cream is used in mixed drinks and will be found in the liquor section of your grocery store.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-23T03:29:52.953Z",
                "reviewBody": "Just to clear up the confusion on the coconut cream vs. cream of coconut- Coconut cream is NOT sweet, it is called COCONUT CREAM, NOT cream of coconut. This product mixed with sweetened condensed milk is perfect and not too thick OR too sweet. IF you bought cream of coconut instead and mixed it with sweetened condensed milk it would be very sweet and very thick and probably ruin this cake. Coco Lopez and the brands found in the mixed drink section are incorrect for this recipe. Most stores carry all 3 kinds of canned cocnut product; coconut cream, coconut milk, and cream of coconut. The coconut cream is usually located in the Thai/Asian food section with the coconut milk. I did not use quite all of my cream mixture but I used most of it. I also drained some of the excess from the bottom of the pan out before it soaked it all up. Other than this I think the recipe is perfect as is, as long as you know the difference between the coconut products.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Meldaniel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6202220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-05T19:00:26.57Z",
                "reviewBody": "Instead of using the oil and eggs as indicated on the recipe, I just followed the instructions on the white cake mix box.\r\n\r\nAlso, I've made this 3 times each time splitting the recipe into half cupcakes and half into a cake.  It is much tastier as cupcakes and everyone at my work agrees.  Just be careful not to poke the hole all the way down to the bottom of the cupcake so the cream stays inside the center.\r\n\r\nEach time I ended up using only half of the cream mixture.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUGAHMAG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/214557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-05T02:17:16.36Z",
                "reviewBody": "Nice and coconutty! All I could find at my store was Coco Real brand cream of coconut (in the \"mixers\" section for pina coladas). I don't know if that's the correct ingredient, but it worked. I'd suggest not refrigerating the cake until it most of the condensed milk mixture has a chance to soak in before chilling stiffens the mixture up and slows absorbtion. I used the specified quantity of condensed milk/coconut cream and my cake was moist, not wet, and not too sweet at all. Instead of plain whipped cream, I topped mine with \"Easy Whipped Cream\" from this site, which is half whipping cream half sour cream. I didn't toast the coconut as some suggested because I prefer the softness of it when it is untoasted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-06T13:55:15.583Z",
                "reviewBody": "One word - sensational!!!\n\nI toasted the coconut as suggested by others - just put it in a tray in the warm oven (turned off) after I had taken the cake out.\n\nI did make a day earlier than needed (as suggested by others) and it was fantastic.  I made in 2 cakes rather than one and put the cream and coconut between the cakes as well as on top.  It looked professional and cream and all it was still perfect to serve at my party the next day.\n\nThis is a keeper.  Only problem was when one of my guests kept asking where I bought it becase she couldnt believe it was home made it was so good.  Now that is what I call a high class problem to have!\n\nThanks for submitting",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tassygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1752175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-20T19:40:50.107Z",
                "reviewBody": "I made this cake for Father's Day and everybody loved it. It is a very moist cake. I personally  think that all the sauce should be added. It is the right amount of sauce. Once I added the sauce to the hot cake, I let it come to room temperature so it could absorb all the sauce that way. After it cooled completely that is when I refrigerated it. Thanks for a great recipe.\r\n\r\nSincerely,\r\nChristina",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEO070866",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/651638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-17T00:24:35.58Z",
                "reviewBody": "Personally I was a little disappointed after reading the rave reviews of this recipe. I thought the cake was way overly sweet and mushy. I've made similar cakes that incorporate pouring a warm sauce over the cake after baking but I've been happier with other recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "muttluvr76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2427629/"
                }
            }
        ]
    }
]