[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/399/desserts/cakes/white-cake/",
                    "name": "White Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17481/simple-white-cake/",
        "name": "Simple White Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F26%2Fsimple-white-cake.jpg",
            "width": 1244,
            "height": 1244,
            "caption": "Simple White Cake"
        },
        "datePublished": "2000-01-09T00:41:25.000Z",
        "description": "This cake was sent home from our children's school. It is the simplest, great tasting cake I've ever made. Great to make with the kids, especially for cupcakes.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "12 cupcakes or 1- 9x9 inch pan",
        "recipeIngredient": [
            "1 cup white sugar",
            "½ cup butter",
            "2 eggs",
            "2 teaspoons vanilla extract",
            "1 ½ cups all-purpose flour",
            "1 ¾ teaspoons baking powder",
            "½ cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x9 inch pan or line a muffin pan with paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the sugar and butter. Beat in the eggs, one at a time, then stir in the vanilla. Combine flour and baking powder, add to the creamed mixture and mix well. Finally stir in the milk until batter is smooth. Pour or spoon batter into the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 to 40 minutes in the preheated oven. For cupcakes, bake 20 to 25 minutes. Cake is done when it springs back to the touch.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "White Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SCOTTOSMAN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.222276146566367,
            "ratingCount": 4121,
            "itemReviewed": "Simple White Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "208.6 calories",
            "carbohydrateContent": "29.4 g",
            "cholesterolContent": "52.1 mg",
            "fatContent": "8.9 g",
            "fiberContent": "0.4 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "5.3 g",
            "servingSize": null,
            "sodiumContent": "141.8 mg",
            "sugarContent": "17.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-04-26T00:46:48.437Z",
                "reviewBody": "This cake is fabulous! And it actually tastes just like a really good sugar cookie!  I doubled the recipe and used 2 tbsp. of vanilla and 1 & 1/2 cups of milk.  This cake is moist, dense and above all delicious! Plus it only took 35 minutes to bake.  It was perfect for a cookies n cream cake.  I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T16:22:12.683Z",
                "reviewBody": "This recipe is SO WONDERFUL!  \n(Be advised that this recipe as it stands is for a 9x9 cake not a 9x13 large cake.)  \nI \"taste-tested\" it this past weekend to see if it was good enough to use at my daughters B-Day party... and OH MY GOSH everyone loved it!  It is a dense cake, so if you are looking for light and fluffy, keep looking.  But If you are looking for really good 'wedding cake' type of cake... here it is! \nI put on the \"Buttercream icing\" from LISKAGIRL on this site and it was really good combo!!  One person said the cake with the frosting tasted almost like a really good sugar cookie!  But it was not overpowering sweet.\nI followed other reviewers and added an extra 1/4 cup of milk.  I also beat the heck out of every step.  MAKE SURE you beat the sugar and the butter for 8-10 minutes!!  BUT IT IS SOOOOO WORTH IT!!  I couldn't keep away from it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAZSIL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1375256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-22T19:55:56.933Z",
                "reviewBody": "This recipe actually deserves 4 1/2 stars.  I made it twice in the same night.  The first batch was perfect!  5 stars all the way.  The batter was rather fluffy.  I made it the second time around (I don't think I let the eggs  beat as long) The batter was a lot thinner (although both times I added about 1/4 cup of extra milk).  After baking, The first batch was fantastic!  Great cake, easy to frost.  The second time around, however, deserves about 3 stars.  As others have said, it had a cornbread type element to it.  It was bad, but it was incredibly hard to frost.  I made 9x13, 8x11, 9x9, and 4x9 of this cake and it cooked well and evenly in every pan. All I can say is, pay very close attention to the directions, sift your ingredients, and let your eggs beat awhile.  If your batter looks somewhat like yellowish coolwhip, you're gonna have a great cake :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cassandra B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2201905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-23T05:34:16.893Z",
                "reviewBody": "I thinks it pretty crazy that 1280 people actually reviewed a baking recipe that doesn't have vanilla extract and salt, the two most crucial ingredients. I think this recipe is great with following changes: 1-2 tsp vanilla, 1/2 tsp salt, increase milk to 3/4 cup and use buttermilk if you have it. Also if you want a lighter texture you really need to use cake flour, if you don't have any make you own by replacing 2 tbsp of cornstarch in 1 cup of all purpose.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "clegg_connie@yahoo.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3750784/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-21T00:35:16.32Z",
                "reviewBody": "I've long ago learned to be skeptical of the results with white cake recipes. They can be dry, tasteless, or have what some call a similarity to cornbread.  I wanted a white cake that was moist, sweet and flavorful, without having to resort to a pound cake recipe, which would be heavier.  I wanted a light, fluffy cake with a tender crumb.  Butter isn't going to necessarily get you that, nor is a shortage of eggs or sugar.  In this recipe I was tempted to reduce the amount of flour, and increase the amount of sugar and eggs but decided to leave it alone, especially for the sake of properly accessing this recipe - except for one small change, which probably was an important one. I used half butter for flavor and richness, and half shortening, to help ensure moistness.  Cream the shortening and butter very well with the sugar, a good few minutes, add each egg separately and beat  well after each addition.  I added the WHOLE milk alternately with the flour mixture, beginning and ending with the flour, and mixing lightly, only enough to combine the ingredients. I made cupcakes, and dropped about 1/2 tsp. raspberry jam in the center of the batter before baking.  I frosted them with pink buttercream frosting.  I tasted one before I frosted them to make an accurate judgment of their quality. Perfect.  Moist, yes moist! Tender, flavorful and pleasantly sweet.  The failure or success of this recipe is hugely dependent upon proper mixing technique and not overbaking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-23T18:22:52.013Z",
                "reviewBody": "I made this twice last week, for both my daughter's birthdays. The first time I followed the recipe exactly, and the cupcakes were a little dry, but still edible. The second time, I upped the vanilla to a full tablespoon and added about 1/8 cup more milk. They came out very moist and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLACKRAYNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/410047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-15T20:32:12.767Z",
                "reviewBody": "This is by far the simplest and tastiest cake recipe I've ever tried. I like to add a bit extra milk which keeps it soft and moist. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sonia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2295443/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-24T00:38:33.263Z",
                "reviewBody": "Yum! i just made cupcakes with this recipe and they're delicious! I don't know why many people said that their cake was dense and dry, mine turned out fluffy and moist and yummy! This is a great recipe as long as you cream the butter til it's VERY fluffy and light, as well as when you add the eggs. I added a touch more milk, but other than that i followed the recipe exactly. It was great, way better that a mix, it's not as sugary and sticky. Thank you for this recipe, it's delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Georganne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2808677/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T16:45:33.623Z",
                "reviewBody": "As advertised, it is simple to make and easy to change into whatever is needed for the occasion.  We started this one off without changing the recipe and it came out nice.  Can't wait to start fiddling with it.\r\n\r\nIt's been a nearly a year and we've changed this up a few times for the better.  If you want to stick as close to the recipe try this variation out.  \r\n\r\nAdd 1 egg yolk, 1 teaspoon of butter flavoring and substitute half and half for the milk.\r\nIf you have a kithenaid mixer, break out the whip instead of the batter blade.  It produces a fluffier batter.  Mix it until it puffs up a bit and bake it for the 30-40 mins.  We used a 9x9 glass pan.  Now if you have gotten to the 40 min mark and the center is still a bit liquidy, turn the oven down to 250 and let it sit on the top shelf of oven for an addtional 10 mins.  It will set up well this way and you don't risk burning the edges of the cake.  \r\n\r\nThis cake was gone in 1 setting when my in laws dropped in.  We've also mixed strawberry jam into the butter/egg mixture and gotten great results and we've done a chocolate version by making the milk into a cocoa mixture.  Next up to try will be spumoni.  We love to experiment!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FEEDMENOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/189418/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Simple White Cake",
            "description": "See how to make a versatile white cake that’s perfect for cupcakes.",
            "uploadDate": "2012-04-13T18:28:11.326Z",
            "duration": "PT3M24.538S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F76aab5ed-39b7-4d62-b626-16c2bbedad74%2Ff3739bb1-66ec-4153-be66-9568d3ac8ada%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1560928328001"
        }
    }
]