[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17528/extreme-chocolate-cake/",
        "name": "Extreme Chocolate Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F693494.jpg",
            "width": 2815,
            "height": 2130
        },
        "datePublished": "2000-01-03T16:15:20.000Z",
        "description": "A rich moist chocolate cake with a chocolate buttercream icing. This is the best cake in the world!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "1 - 4 layer 9 inch cake",
        "recipeIngredient": [
            "2 cups white sugar",
            "1 ¾ cups all-purpose flour",
            "¾ cup unsweetened cocoa powder",
            "1 ½ teaspoons baking soda",
            "1 ½ teaspoons baking powder",
            "1 teaspoon salt",
            "2 eggs",
            "1 cup milk",
            "½ cup vegetable oil",
            "2 teaspoons vanilla extract",
            "1 cup boiling water",
            "¾ cup butter",
            "1 ½ cups unsweetened cocoa powder",
            "5 ⅓ cups confectioners' sugar",
            "⅔ cup milk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use the first set of ingredients to make the cake. In a medium bowl, stir together the sugar, flour, cocoa, baking soda, baking powder and salt. Add the eggs, milk, oil and vanilla, mix for 3 minutes with an electric mixer. Stir in the boiling water by hand. Pour evenly into the two prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 to 35 minutes in the preheated oven, until a toothpick inserted comes out clean. Cool for 10 minutes before removing from pans to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the frosting, use the second set of ingredients. Cream butter until light and fluffy. Stir in the cocoa and confectioners' sugar alternately with the milk and vanilla. Beat to a spreading consistency.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Split the layers of cooled cake horizontally, cover the top of each layer with frosting, then stack them onto a serving plate. Frost the outside of the cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "RACH56"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.690931523750771,
            "ratingCount": 3242,
            "itemReviewed": "Extreme Chocolate Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "654.8 calories",
            "carbohydrateContent": "111.1 g",
            "cholesterolContent": "64.2 mg",
            "fatContent": "24.6 g",
            "fiberContent": "5.8 g",
            "proteinContent": "7.3 g",
            "saturatedFatContent": "10.5 g",
            "servingSize": null,
            "sodiumContent": "524.3 mg",
            "sugarContent": "87.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-05T21:00:42.95Z",
                "reviewBody": "WOW!!!  Follow the instruction and hand-stir the boiling water VERY thoroughly.  You will end up with a somewhat soupy, but uniform, batter.  I had no problem, as some did.  I used two 9\" pans, but only filled them 2/3 of the way and had some batter left, which I tossed out.  (I was afraid of overflowing the pans.)  This batter cooked up high and perfect!  To avoid problems de-panning it: make sure you use the toothpick test and also touch the top to make sure it springs back.  If you take it out too soon, you'll have a wet mess.  And follow the instructions and let it sit AT LEAST 10 minutes before de-panning it.  The frosting was an amazing consistency!  Creamy and easy to work with.  Add a little extra milk if it is not creamy enough and alternate the milk/cocoa/sugar as recommended.  I measured the 10X sugar per the recipe, but then added it a little at a time \"to taste.\"  I ended up with about a half cup of 10X left.  If you split the layers, you will have sufficient frosting.  I did not split the layers and had a ton leftover.  This cake was UNBELIEVABLE.  Moist, dense cake - not too sweet - and creamy delicious frosting.  I made it the day before a party and covered it tightly and it was perfect the next day.  Better than bakery cake.  Better than any chocolate cake I have ever had!!!  My guests' eyes were rolling back into their heads, this cake was THAT good.  This doesn't get 5 stars, it gets 10!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1790812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-04T16:09:41.22Z",
                "reviewBody": "I made one change based on an old tradition that was passed on to me; instead of using boiling water I used freshly brewed hot coffee.  The cake was the best thing I have tasted and it stayed fresh and moist in a cake keeper for a full week.  I used a silicone bundt pan rather than round pans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patti Nelson Grønborg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1343340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-02T14:06:55.31Z",
                "reviewBody": "This cake is so moist and dense!  It was a great tasting cake, and practically foolproof. Don't worry about the thin consistency of the batter.  This is made more like a pudding (lava) cake, and it WILL bake into a normally textured cake, just especially moist.  Instead of 9 in. pans, I used a 13x9 and baked it for 45 minutes, and that worked beautifully, too.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mollyjwan/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-31T19:33:22.77Z",
                "reviewBody": "READ BEFORE MAKING:  I followed the recipe accordingly.  It smelled great, looked great, etc.  However, when you take the cakes from the oven, DO NOT remove them from the pan after 10 minutes.  This recipe is a little misleading.  After 10 minutes, I tried to shake the cakes from their pans and they broke all over.  I would wait at LEAST 20 minutes before removing because the cake is very soft and moist, it needs time to cool and get firm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara Rajan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2197563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-24T16:56:25.673Z",
                "reviewBody": "This recipe is nearly identical to a recipe I have been using for 20 years. The only difference is that my recipe calls for 1 cup of cold water and 1 cup of piping hot coffee in place of the milk and boiling water. This time, I tried it with the milk and hot coffee, and I loved the result. There are 2 tricks to getting the layers out of the pan intact. The first is to use the right kind of pan. I use extra-heavy Wilton 9\" round cake pans. They have slightly higher sides than conventional cake pans and they are made of pale aluminum with a dull finish. This helps the cake cook evenly, but it also ensures that the cake develops a crust flexible enough to withstand turning the cake out onto the cooling racks. The second trick is to grease the pan heavily and then flour it. A light wipe with a greasy paper towel might make the flour stick, but it won't be enough to keep the cake from sticking to the pan. I lied. There is a third trick. Turn the cake out onto a cooling rack precisely 10 minutes after it comes out of the oven. That gives the cake time to firm up a bit, but not enough time for the shortening you used to grease the pan to adhere to the cake. And yes, the recipe yields a soupy batter. It's supposed to be that way. Don't use a springform pan. If your cake overflows the pan, you are probably using dutch process cocoa instead of regular unsweetened cocoa powder or a premium cocoa. Don't. You need the acidity of Hershey's regular to offset all that baking soda.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ruth Tannahill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3585522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-07T03:03:07.337Z",
                "reviewBody": "this recipe is excellent! I bake alot and this is the BEST chocolate cake recipe i have ever tried! Instead of butter icing, try a chocolate glaze over the cake just before its completely cool so the glaze soaks in YUM! Glaze: 1 cup sifted icing sugar\n2 tablespoons cocoa\n2 tablespoons milk\n½ teaspoon vanilla",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rashika",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2338789/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T16:34:36.07Z",
                "reviewBody": "This cake has become my \"go to\" dessert and is now referred to by my family and friends as \"the cake.\" I took \"the cake\" to a function where there were 10 different desserts and it was the talk of the evening.  The secret is to bake and frost this cake one day ahead of time. It's good/great the first day, but unbelievable the second day. I have also substituted part or all the regular unsweetened chocolate with Hershey's Special Dark cocoa powder when I make it for dark chocolate lovers. Hint: do NOT grease the sides of the pan so that your cake can \"climb\" up the sides. Your cake will bake level without puffing in the middle and you wont have to cut off the hump to level it. Just run a very sharp knife around the outside of the pan when fully baked and cooled for 15-20 minutes and remove it. This method gives you more crumbs on the sides, but a much nicer shaped cake. You can control the crumbs when you frost  by \"dirty icing\" the cake. To dirty ice, split the layers horizontally and place back together with icing in between each layer. Then, frost the whole cake with a very thin layer of icing  to \"cement\" the crumbs. Wait a few minutes for the dirty icing layer to harden slightly, then frost the cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "margie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4134214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-27T00:35:57.003Z",
                "reviewBody": "Wow,very tasty! I LOVE the frosting!!!  I use the frosting on my home made ice cream cakes since it is so thick and holds up very well! I have also made this recipe into an ice cream cake and it worked wonderfully. Just remember not to overbake it. For an ice cream cake, pour batter into 2 identical springform pans. Bake as directed, coolcompletely, then slice in half horizontally so you have 4 cake layers. Then place the bottomlayer back in the springform pan, top with softened ice cream, anotherlayer ofcake, more ice cream, another cake, more ice cream, then cake! Takes about a half gallon of ice cream. Freeze completely, prob overnight, open sides of pan. Then I ice a thin layer, put back in freezer for an hour or so, then frostcake as usual! Store in freezer until right before serving! It's been a hit several times over!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "snugglepunkin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1101702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-10T21:19:26.85Z",
                "reviewBody": "Hi, I just made this cake and was also concerned about how very thin the batter was after adding the hot water but it turned out great the cake was very moist but(warning) be sure to put your cakes in the oven on a cookie sheet in case they boil over I did not and one boiled over a bit and I had a lovely mess to clean up :(  I also made the the frosting and it turned out great as well the whole family enjoyed this cake.. :)  \nThanks for a nice recipe :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SUGARPLUM03",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1249827/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Extreme Chocolate Cake",
            "description": "A chocolate cake that goes to the extremes of deliciousness.",
            "uploadDate": "2013-07-19T19:29:18.594Z",
            "duration": "PT3M54.833S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F75769fa5-16a7-4eb4-a299-12f19837d4b9%2Fd4ee449f-4bd9-4ce4-b7e5-b14d5b63e733%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2555495646001"
        }
    }
]