[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17626/sweet-and-sour-pork-i/",
        "name": "Sweet and Sour Pork I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7691921.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-03-12T13:41:31.000Z",
        "description": "This is a very popular dish in Singapore. Tender pork pieces combined with peppers, tomatoes, pineapple and onion in a sweet and sour sauce. I hope you will like it.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound boneless center-cut pork loin chops",
            "1 teaspoon salt",
            "½ teaspoon baking soda",
            "1 tablespoon water",
            "1 egg",
            "¼ cup white sugar",
            "½ teaspoon salt",
            "1 ½ tablespoons cornstarch",
            "¼ cup white vinegar",
            "3 tablespoons ketchup",
            "2 tablespoons plum sauce",
            "5 tablespoons water",
            "¼ cup tapioca starch",
            "1 cup oil for frying, or as needed",
            "1 green bell pepper, cut into 1-inch pieces",
            "2 tablespoons vegetable oil",
            "1 red chile pepper, minced",
            "½ cup crushed pineapple",
            "1 onion, chopped",
            "1 tomato, coarsely chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the pork into 1-inch cubes. In a medium bowl, combine the salt, baking soda, and 1 tablespoon water. Whisk in the egg. Place the pork pieces in the bowl and turn to coat. Set aside while you prepare the other ingredients.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk the white sugar, salt, and cornstarch together in a small bowl. Stir in the vinegar, ketchup, plum sauce, and water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the tapioca flour in a large, resealable plastic bag. Place the pork pieces in the bag with the flour and shake the meat around until all the pieces are coated with the flour. Discard the marinade and excess tapioca flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 cup oil in a large skillet or wok over medium high heat. Working in batches, place the pork pieces in the oil and fry for 5 to 10 minutes, or until golden brown on all sides. Remove the pork from the oil and drain on a paper towel-lined plate. Carefully pour out the frying oil into a separate container to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 2 tablespoons fresh cooking oil into the pan. Over medium-high heat, stir-fry the green bell pepper, red chile pepper, pineapple, onion and tomato until the vegetables are tender, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the reserved sauce mixture. Bring sauce to a boil, stirring constantly, until thickened, about 3 minutes. Return pork pieces to the skillet, mix well, and serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "JENNWONG"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.663157894736842,
            "ratingCount": 95,
            "itemReviewed": "Sweet and Sour Pork I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "899.8 calories",
            "carbohydrateContent": "39.6 g",
            "cholesterolContent": "116.9 mg",
            "fatContent": "71.1 g",
            "fiberContent": "1.8 g",
            "proteinContent": "27.1 g",
            "saturatedFatContent": "11.4 g",
            "servingSize": null,
            "sodiumContent": "1281.5 mg",
            "sugarContent": "22.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-01T06:42:05.827Z",
                "reviewBody": "We really liked this recipe.  Even my picky teenager came back for seconds!  I totally skipped dipping the pork in the egg and dredging it - still turned out fantastic and crip!  Not big on green peppers, so I chopped them up fine.  Except for the flavor they added, no one really noticed they were there...  For those of you who looked for \"Tapioca Starch\" and failed - look for \"Tapioca Flour\" instead.  It is actually one and the same!  Bob's Red Mill is the brand I came up with and it is found in most of your health food aisle of your grocery store.  The Tapioca Starch/Flour adds an additional slight sweetness to the recipe.  You can substitute corn starch for this tho'.  Use 1-Tbsp corn starch to every 2-Tbsp Tapioca Starch/Flour.  If you have problems finding \"Plum Sauce\", you can usually find that in the Asian aisle of your grocery store by the other speciality sauces they offer...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LILREDCV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/883810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-04T10:05:25.27Z",
                "reviewBody": "This is a fantastic recipe and as I'm Singaporean, I can tell you that it's certainly authentic! I think one step was missed out, as pointed out by another reviewer - after the water, salt and baking soda mix, dip the pork pieces in beaten egg before drenching in tapioca flour (which, incidentally, is easy to find and fairly cheap in Singapore). The oil will turn cloudy and blacken while deep-frying and I had to change the oil in the wok several times. Oh, and I also recommend halving the amount of plum sauce and vinegar,as well as adding more sugar, as I personally found the sauce a bit too sour/tangy. If you don't have plum sauce, you could use the pineapple juice in the can (if you're using canned pineapples).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AIINGEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/851796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:43:30.983Z",
                "reviewBody": "This was really great, and I am one who makes a lot of Asian food. Don't worry if you don't have tapioca starch, regular cornstarch (or sweet rice flour) works fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLIE2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/701869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:43:32.937Z",
                "reviewBody": "Delicious recipe and easily adjustable to what you have on hand. I think you are supposed to beat the egg into the salt, soda, water mixture-then put the pork to it and then drop it in the cornstarch or flour. Don't worry if you don't have tapioca FLOUR, use cornstarch or all-purpose flour (do NOT use regular TAPIOCA it is for making pudding or thickening pies)! I used pork sirloin chops cubed-then fried them til well browned over medium,not high, adjusting the heat accordingly to avoid burning, this takes about 20-30 minutes depending on your heat etc. To make sure they are done cut open one of the larger pieces and check it. I used only pinapple chunks, thinly sliced carrot, and green bell pepper& yellow onion cut in a one inch dice.For extra zip I added some pepper. I did not add tomato, red chili pepper or plum sauce, because I didn't have it on hand and the recipe turned out just fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRAMMA GORGEOUS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/714149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:43:30.247Z",
                "reviewBody": "I made this several days ago and the family is already asking for a repeat! I dredged the meat in corn starch rather than tapioca and I omitted the tomatoes. Thank you for sharing this one Jennifer!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JACKIEAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/678476/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-01T03:31:55.997Z",
                "reviewBody": "This turned out to be really good. I didn t have any tapioca starch (I hear they have some in Singapore but I couldn t afford to fly there) so I used corn starch instead. I also beat an egg and dipped the pork pieces into it before breading even though the recipe left this step out. Otherwise I followed the recipe to the letter. I m giving it 5 stars because it really is that good. Next time I will add some crushed red pepper and use 2 red chili peppers instead of one because I like the heat. Then I ll give it 6 stars. This was easy to prepare and tasted great. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DBERREY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700104/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:43:33.797Z",
                "reviewBody": "total and absolute yumminess!!! just tried it tonight and was glad I made double. This is definately a 5 star or more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GLORIA2003",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:43:30.827Z",
                "reviewBody": "Wonderful dish but it involves a lot of care! I used flour instead of starch (didn't have any handy at the time)... keep your skillet clean flour will brown and burn after a while giving your dish a blackish tone. Also drain the excess oil and burnt flour before you add the vegetables I don't recommend simply using the same skillet right out... Cut the fat out of the pork... it tastes terrible when cooked!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MMELENDEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/792457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T17:26:45.92Z",
                "reviewBody": "We love this recipe! It was quick & easy to prepare and the sauce is delicious. I didn't have plum sauce so I used the syrup/juice from the pineapple instead. I first made this recipe several years ago. Now I double the sauce component and use dried red pepper flakes in place of the whole pepper and omit the tomatoes. The pepper flakes give it a nice zing I think.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TROCKVAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/635386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-18T18:03:29.297Z",
                "reviewBody": "This dish was way too salty for me. I don't usually have that problem but the salty flavor seemed to be way overpowering. I was suprised how easy the recipe was though. I used regular flour like some other users said because I couldn't find tapioca flour. I also couldn't find plum sauce but I made do with what I had.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBORAHM4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/443656/"
                }
            }
        ]
    }
]