[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16208/desserts/cakes/chocolate-cake/german-chocolate-cake/",
                    "name": "German Chocolate Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17644/german-chocolate-cake-iii/",
        "name": "German Chocolate Cake III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1308496.jpg",
            "width": 1300,
            "height": 978
        },
        "datePublished": "2000-03-23T04:59:53.000Z",
        "description": "A spectacular German Chocolate cake made from scratch, using cake flour.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 - 3 layer 9 inch cake",
        "recipeIngredient": [
            "½ cup water",
            "4 (1 ounce) squares German sweet chocolate",
            "1 cup butter, softened",
            "2 cups white sugar",
            "4 egg yolks",
            "1 teaspoon vanilla extract",
            "1 cup buttermilk",
            "2 ½ cups cake flour",
            "1 teaspoon baking soda",
            "½ teaspoon salt",
            "4 egg whites",
            "1 cup white sugar",
            "1 cup evaporated milk",
            "½ cup butter",
            "3 egg yolks, beaten",
            "1 ⅓ cups flaked coconut",
            "1 cup chopped pecans",
            "1 teaspoon vanilla extract",
            "½ teaspoon shortening",
            "1 (1 ounce) square semisweet chocolate"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 - 9 inch round pans. Sift together the flour, baking soda and salt. Set aside. In a small saucepan, heat water and 4 ounces chocolate until melted. Remove from heat and allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream 1 cup butter and 2 cups sugar until light and fluffy. Beat in 4 egg yolks one at a time. Blend in the melted chocolate mixture and vanilla.  Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large glass or metal mixing bowl, beat egg whites until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly  fold in remaining whites until no streaks remain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into 3 - 9 inch pans Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool for 10 minutes in the pan, then turn out onto wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the Filling:  In a saucepan combine 1 cup sugar, evaporated milk, 1/2 cup butter, and 3 egg yolks. Cook over low heat, stirring constantly until thickened. Remove from heat. Stir in coconut, pecans and vanilla. Cool until thick enough to spread.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread filling between layers and on top of cake. In a small saucepan, melt shortening and 1 ounce of chocolate. Stir until smooth and drizzle down the sides of the cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes",
            "German Chocolate Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dean"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.641988950276243,
            "ratingCount": 905,
            "itemReviewed": "German Chocolate Cake III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "735.4 calories",
            "carbohydrateContent": "88.3 g",
            "cholesterolContent": "187.4 mg",
            "fatContent": "40.6 g",
            "fiberContent": "2.9 g",
            "proteinContent": "9.1 g",
            "saturatedFatContent": "21.7 g",
            "servingSize": null,
            "sodiumContent": "457.9 mg",
            "sugarContent": "62.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-31T18:08:28.057Z",
                "reviewBody": "This cake is the best!  I read a lot of reviews and here is the advice I followed:  Do Not Over Mix the batter or it will fall apart!  Check cake 20 min. into baking, didn't take the 30 min. the recipe called for.  Make 1 1/2 amount of frosting.  Add more cornstarch to thicken up frosting or add instant Vanilla pudding.  I didn't add pudding, because I wasn't sure WHEN to add it in.  Frosting took approx. 30 min. to cook and longer to cool.  Plan on investing a good amount of time into it.  (But it is well worth it!)  Toast the coconut and pecans.  Something new I discovered while making this:  I must have over mixed because I had trouble getting the cake out of the pan.  The bottom layer began to crumble.  I stuck the other two pans in the freezer for approx. 1 hr?  To remove the frozen cake I placed a towel soaked in very hot water on the pan and it came right out!  The cake is easy to handle while frozen and thawed out in the time it took to me to frost it. (I took a good amount of time frosting it)  Freezing it didn't dry it out.  It tasted and looked amazing!  Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hope Hardwick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2400284/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-03T23:59:40.95Z",
                "reviewBody": "My son and I made this cake for a friend whose favorite cake is German Chocolate.  He's a great cook himself, and so is VERY fussy about his food.  This cake turned out GREAT, and my friend was very complimentary of it!  Since a mixer part was missing in action, we did all the mixing and beating by hand, and it still turned out just fine.  It was very moist, had great shape and texture, and looked beautiful after adding the chocolate drizzle. \r\n\r\nThe next time I make it, though, I will ADD TWO EXTRA OUNCES OF CHOCOLATE TO THE CAKE MIXTURE, to make it just a touch chocolate-ier.  Also, IT'S VERY IMPORTANT TO MAKE ONE AND A HALF RECIPES OF THE FILLING/FROSTING. One recipe of it would not be enough, and 1 1/2 is just right.  Also, TOAST THE COCONUT AND PECANS.  That makes them much, much better.  Be careful about burning the coconut.  It toasts very quickly.  A great cake that we will probably make a lot!  Well worth the trouble.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elaine Nash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1569679/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T07:29:31.657Z",
                "reviewBody": "This cake was awesome.  I had a profesional baker make my wife a german chocolate cake for her birthday.  This cake tasted so much better than that one.  My wife loves german chcolate cake and she said is was the best she has ever eaten.  I dobled the icing it looks like alot when you make it, but it turned out just right.  Also I used a little more chocolate on the top of the cake.  I had to turn the heat up to get the icing to start boiling, but it turned out great.  I recomend this cake very highly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DHAWKINS2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/720641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-28T19:16:28.99Z",
                "reviewBody": "Upon researching for hours for a German Chocolate cake recipe worth the time to make and choosing this one, I bought the \"Bakers\" German sweet chocolate bar for use in this cake.  After opening the box of chocolate, there are recipes in there for frosting, cake and a few others using this chocolate.  Lo and behold the cake recipe they print is exactly the same as this one except this one says to use cake flour and 1/2 cup more of it.  Other than that it's exact.  I know this will be delicious as I've made this (the one off the box) years ago and it was awesome.  German Choc. cake is my all time favorite cake but is very time consuming to make by scratch so I don't make it often.  The frosting on the box is also worth the mention as there isn't one on this site that really stands out for such an exceptional cake.  It appears to resemble the Ger. Choc. cake frosting II on this site but it makes more which you would need for a proper 3 layer cake. I would suggest using the frosting recipe on the box and you won't be dissapointed. At least Dean knows his recipe for German Chocolate Cake!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKIN4FIVE05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1315779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-02T01:47:01.19Z",
                "reviewBody": "Great Cake! I read the reviews and agreed with these suggestions. It's a must to toast the coconut and pecans. A little salt to the icing would bring out the flavor better...so I added 1/4 teaspoon. I should mention that I mixed 1-1/2 times the icing recipe. I had no problem getting the icing to thicken, but it's important to bring your initial ingredients to a boil while stirring constantly. As soon as it starts to boil you can see it's thickening. Once it's cools and you add the coconut and pecans...it's plenty thick. I also put mine in the refrigerator to set up even better. The cake batter provides enough to more than fill 2- 9\" pans. Make sure you use CAKE flour not all purpose flour, it does make a difference. If you can't find cake flour, try bulk bins or go to your instore bakeries and ask them to sell you some. I found that the recipe produces too much batter and the cake rose over the edges of the pan and got crispy. ( not what you want on a cake )This also increases your baking time which is also what you do not want because it will make your cake drier. Next time I will remove 1/4 to 1/3 cup of batter off each 9\" pan, that should make it perfect. The cake rises high and beautiful, I was very impressed! Lastly, I agreed that the cake was much better the next day..it got even more moist.I would make this cake the day before a special event to maximize the pleasure of this moist cake. I now believe I can make a cake from scratch with the moistness of a \"box\" cake! ..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chuck Sampson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lifetastegood/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T17:42:16.437Z",
                "reviewBody": "I decided to make this cake for our anniversary after my husband told me that this was his favorite cake. This cake was very good, light and moist. However, I did follow the advice of others and made more filling. I used 1 can (12 oz) evaporated milk, 1 1/2 cups sugar, 3/4 cup butter, 4 slightly beated egg yolks, 1 1/2 tsp. vanilla, 2 1/3 cup coconut, 1 1/2 cups chopped pecans, and 2 tbsp. instant vanilla pudding. I followed the directions except I cooked on medium heat for about 12 minutes. The coconut and pecans were added after removing from heat.  This made enough filling/frosting for between the layers and on top. Next time I will double Dean's recipe (adding the vanilla pudding and cooking on medium heat) so that I can have enough to frost the cake and omit the chocolate drizzle. We were not too crazy about that part.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NENA BELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/726842/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T07:29:30.53Z",
                "reviewBody": "Let me tell you - FIVE stars doesn't do justice! This was the first time I made a cake so involved, but it was well worth it. I made this for my Grandmother's 71st birthday. My Grandma and Uncle fought over the last piece. I left with an empty cake platter and was told not to return without another cake! Just follow the recipe exactly! Also, I couldn't find 'German' chocolate at my market, So I used Ghirardelli's Bittersweet Chocolate and it was perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stacie anne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/663473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-22T22:10:59.68Z",
                "reviewBody": "I have made this cake for the cafe and my family over a hundred times now. You can make it as is, and it is excellent, or you can deviate. First word of advice: DO NOT FROST THE SIDES OR TOP OF THIS CAKE. It has a wonderful rustic look if you frost ONLY the internal layers. The chocolate topping is made with FAR too few squares of chocolate. Add extra, and for each extra you add, add an additional 1/2 teaspoon of shortening. I like to create a ganache shell on top of my cake, so I pour chocolate there and spread it super thin, then drizzle chocolate down the size. It gives it a beautiful, rustic-artisan look. You can decorate the top of the cake by SPARINGLY sprinkling raw or toasted coconut (or chopped nuts) on top of the cake and then drizzling additional chocolate in a crisscross pattern over the top of that. Feel free to deviate in nuts you use - I often use hazelnuts along with pecans. I also often toast my coconut instead of using plain raw coconut. This will drastically change the flavors of the cake, but it's always fun to deviate once in a while. Also, when you make your layers, place parchment paper on the bottom of your pans. Put the pan, cake and all, in the freezer until frozen. Place the bottom of the pan in hot water for about 10 to 20 seconds. This will warm the bottom of the cake. Remove the layers, remove the parchment paper, and cut the bulb off the top of each layer to make a perfectly round, flat layer. This will increase presentability by 100%!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Philip Shores",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/phillard/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-28T04:05:46.477Z",
                "reviewBody": "The recipe for German Chocolate Cake is on the bar of the Bakers German Chocolate Bar.  Everything is the same except this recipe calls for 1/2 cup more flour(cake) and 1/4 teaspoon more salt.  This recipe was ok, not as moist, flavorful or buttery as the recipe calling for 2 cups of flour. I did use cake flour, recommended.  I was quite disappointed and everyone said that my old recipe was so much better.  i definitely agree.  The chocolate color was not as intense (lighter brown) and cake tasted dry.  I also toasted the pecans but I  like the non toasted taste better for this cake.  Will not try this recipe again but rather will stick by my old recipe.  It is so much better.  The frosting can be made the day before (used the recipe on the German chocolate bar).  It is delicious, ample enough to frost the entire cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "missruth1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8232249/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "German Chocolate Cake III",
            "description": "This rich, authentic cake is dense with chocolate, coconut, and nuts.",
            "uploadDate": "2012-09-05T20:03:12.266Z",
            "duration": "PT5M12.229S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F91e88809-9a4f-43a3-b8e0-4bd68d4200f9%2Fa5550cda-5550-4445-9127-a7ca0caa8554%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1824721872001"
        }
    }
]