[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17683/spiced-applesauce-bread/",
        "name": "Spiced Applesauce Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F570983.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "1999-11-03T21:01:49.000Z",
        "description": "With applesauce and spices, this bread is moist, delicious and great in lunch boxes. I also like it spread with cream cheese or peanut butter.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "1 - 9x5 inch loaf",
        "recipeIngredient": [
            "1 ¼ cups applesauce",
            "1 cup white sugar",
            "½ cup vegetable oil",
            "2 eggs",
            "3 tablespoons milk",
            "2 cups all-purpose flour",
            "1 teaspoon baking soda",
            "½ teaspoon baking powder",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon ground nutmeg",
            "¼ teaspoon ground allspice",
            "¼ teaspoon salt",
            "½ cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the applesauce, sugar, oil, eggs and milk; beat well. Sift in the flour, baking soda, baking powder, cinnamon, nutmeg, allspice and salt; stir until smooth. Fold in the pecans. Pour batter into prepared loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 60 minutes, or until a toothpick inserted into center of the loaf comes out clean.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LOUISE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.469512195121951,
            "ratingCount": 328,
            "itemReviewed": "Spiced Applesauce Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "281.2 calories",
            "carbohydrateContent": "36.6 g",
            "cholesterolContent": "31.3 mg",
            "fatContent": "13.9 g",
            "fiberContent": "1.4 g",
            "proteinContent": "3.8 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "187.8 mg",
            "sugarContent": "19.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-02T23:54:47.73Z",
                "reviewBody": "I have to give this bread a four star rating as written, but by incorporating some different reviewers suggestions, this bread is definitiely a 5+!!  First of all, I used 1 1/2 cups of chunky applesauce and only 1/4 cup of oil.  I also used 1/2 cup of white sugar and 1/2 cup of brown sugar.  I doubled all the spices- this was definitely a must for me.  I didn't think the bread was even that spicy like that, especially for a recipe called SPICED Applesauce Bread.  I added a crumb topping of 1/4 cup brown sugar, 1/4 cup chopped pecans and 1/2 tsp. cinnamon as well.  This turned this bread into a real treat!  I loved how moist the bread was, and it made my house smell amazing while it baked.  I'm definitely not a baker (cooking is much more my cup of tea), so if I can make an amazing applesauce bread with this recipe, anybody can!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CTCOOK1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1224726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-27T05:50:24.327Z",
                "reviewBody": "Good, very moist, but as others mentioned, the original recipe lacks sweetness and spice.  This is a great base recipe and making it better is quite simple.  It does need more sweetness, so the 2nd time, I increased the sugar by a 1/4 cup.  Use all brown sugar for more flavor.  And doubling the cinnamon and nutmeg is a must.  I also sprinkle the top with brown sugar b4 baking, which makes a nice, crunchy sweet crust on top.  Cooking time is definitely longer than 1 hour considering how much moisture is in this.  I baked mine for 1 hour, 15 min.  Was perfectly moist.  And add 1 cup chopped apples.  The apples will cook down and be tender and adds more flavor to this.  1 cup = 1 medium sized apple. Kids love this bread and with slight alterations, it's 5 stars.  Tip -cover tightly with foil to let it steam for 30 min. or more.  This locks in the moisture and a trick for all loaf breads.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-25T02:44:58.757Z",
                "reviewBody": "I'm going to give this recipe five stars even with my changes. Seems only fair.\n\nI've been doing my best to use what I had on hand so making this bread was a challenge. I used half brown/half white sugar (I only had a half cup of white on hand) and added in another 1/4 c. of applesauce as I only had one egg. (I used homemade slow cooker applesauce that I made yesterday, a recipe also from this site.) Since I had little white flour on hand, I did a cup of white, then ground a half cup of oats in my blender and added that to a half cup of whole wheat flour to make a full cup.\nI also used a stick of margerine in place of the vegetable oil to make the batter fluffier.\n\nBefore I put the loaves in the oven, I \nsprinkled some brown sugar over the top.\n\nThey turned out beautifully. Not exactly according to the recipe, but workable with what I have on hand. Plus, they smell divine!\n\nFor those of you who are thinking of making this, use a homemade chunky applesauce. You'll appreciate the flavor and texture better with homemade over storebought.\n\nBTW, this made two loaves that were a bit on the thinner side, to decrease cooking time.\n\nEDITED TO ADD: This bread turned out SO good. Try it with my changes. You'll thank me. We've already eaten one of the loaves.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-24T20:48:01.327Z",
                "reviewBody": "Great bread!  I used unsweetened applesauce, and only 1/2 c. of sugar and it was still sweet enough to please my kids!  I substituted a cup of whole wheat flour for a cup of the all-purpose, increasing the spices by a bit.  I baked it for the directed time (at 325 since I was using a glass pan) and it came out very moist and tasty!  Thanks! **I make this recipe almost every week now for my kids to snack on and I think I've perfected it to suit their taste -- I add 3/4 c. chopped apples, 3/4 c. chopped pecans and I'm down to 1/3 c. of BROWN sugar.  Super duper yummy**",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AggieFan92",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1104445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-25T22:42:36.937Z",
                "reviewBody": "Wow! This is one fabulous applesauce bread! It's so moist and delicious, it's definitely one I'd make again. Plus it's a great way to use up the last of the applesauce. It's also a great base to \"tweak\" this to whatever you have on hand or whatever your tastebuds desire.  I opted to use butter vs. veg. oil and creamed that will all brown sugar until nice and fluffy. I used chunky applesauce and added an additional chopped apple.  The more apple flavor the better, right?  I doubled the amount of cinnamon and nutmeg and added 1 heaping tsp. of vanilla.  I left out the nuts as I didn't have any on hand.  I topped this with some turbinado sugar before topping it into the oven to give it some added crunch and baked for a little over an hour.  It smelled heavenly and tasted wonderful - perfect with a cup of tea!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-10T17:07:59.607Z",
                "reviewBody": "A sweet, homey treat. I am not usually happy with loaves made with oil, so I substituted 1/2 cup of shortening and creamed it with the sugar before adding the wet and then dry ingredients. It is also good when you add 3/4 cup of raisins (soak in hot water for 15 minutes and then drain well). And I always add a struesel crumb mixture made from 1 cup flour, 1/2 cup sugar, 1/8 tsp salt, 1/4 tsp baking soda, 1/4 tsp cinnamon, 1/2 cup soft butter.  Cut all ingredients together until crumbly.  Top loaves with about 1/4 inch of topping and press lightly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-11T22:26:56.38Z",
                "reviewBody": "With other reviews I knew to expect that this recipe be bland.  When I used the milk I also added 1tbs of apple vinegar to it, it increases the sweetness and spiciness of the bread.  I also doubled the spices as recommended and added a crunchy oat and brown sugar topping to the bread.\n  Also, I greased the pan and dusted it with a cinnamon sugar mix. \n  It made the bread magnifique. My finace' who normally hates applesauce bread, and begrudingly tried this 'new' recipe, ate the enitre loaf before it had cooled completely.   Needless to say, I'm saving it with my alterations. ;-P",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6867288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-21T00:46:12.577Z",
                "reviewBody": "I found the perfect recipe to use up some extra applesauce I had in the frig! I made muffins out of this recipe to take into work for a Monday morning treat. I used half white sugar/half light brown sugar and only a 1/4 cup of oil. You can also use Apple Pie spice which combines all the spices in this recipe into one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. Chef Esh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mschefesh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-10T21:45:21.687Z",
                "reviewBody": "Fantastic recipe. It stays moist for a few days when covered and is nice for a quick breakfast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "findingfood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2858388/"
                }
            }
        ]
    }
]