[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17842/pizza-crust-for-the-bread-machine-ii/",
        "name": "Pizza Crust for the Bread Machine II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6352950.jpg",
            "width": 3264,
            "height": 1836
        },
        "datePublished": "2000-01-31T01:34:21.000Z",
        "description": "Nothing beats a homemade pizza crust! Crispy on the outside and tender on the inside. Using your bread machine makes mixing the dough a breeze.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H5M",
        "recipeYield": "1 pizza crust",
        "recipeIngredient": [
            "¾ cup water",
            "1 tablespoon vegetable oil",
            "1 teaspoon lemon juice",
            "½ teaspoon salt",
            "1 tablespoon white sugar",
            "1 tablespoon dry milk powder",
            "2 ¼ cups bread flour",
            "1 teaspoon active dry yeast"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Dough cycle; press Start.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove dough from pan after rise cycle and use for your favorite pizza recipe.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "THEO72"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.732342007434944,
            "ratingCount": 269,
            "itemReviewed": "Pizza Crust for the Bread Machine II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "21 calories",
            "carbohydrateContent": "1.8 g",
            "cholesterolContent": "0.1 mg",
            "fatContent": "1.4 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.4 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "121 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-10T14:09:35.14Z",
                "reviewBody": "This an a most excelllent recipe for pizza crust(( FIRST I DOUBLE the recipe..))\r\nI use olive oil instead of vegetable. add 2 tsp. of vital wheat gluten and 1 tsp oregano to the dry ingredients.Hands down the best crust ever.Easy to work with and delicious.I skip the lemon juice though.The dry milk powder is essential, it helps to relax the dough.After the machine is done, take out the dough, divide into 2 portions,roll into 2 balls and let rest on the counter for a few minutes covered.Roll out, I use my rolling pin, into two circles.Dont worry if they are small. Cover and let rest again.The resting is important! Try rolling again, you should be able to get 2 14-16 circles of dough,If not let rest again.You can do it.Then I place the circles on lightly sprayed pizza pans and set aside to rise a few minutes.When it starts to puff up, brush wa little olive oil, poke with a fork all over and place in a preheated 400 to 500 oven on the lowest rack.When the crust is puffy and light brown take out and continue with the sauce and toppings.You can also cool and freeze for instant pizza any night you want.This is a lifesaver in my house!We just add toppings and bake frozen.I have made hundreds of doughs and this is the best!I also roll out into 8 bersonal pizzas for the kids.I prebake the crusts,cool and place in a large rubbermaid in the fridge or freezer.Kids can make their own pizzas during the week, by just adding toppings.They love it and so do their friends!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MillerMomof4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18079/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-07T00:49:30.063Z",
                "reviewBody": "This is by far the best pizza crust I've done in my bread machine. It came out perfect. I made the recipe as listed, only added a teaspoon vital wheat gluten and some spices (oregano, crushed red pepper). After the dough cycle, I let the dough ball rest (covered) for a few minutes, then punch out into a little circle. I stop, let it bounce back a little bit and rest (covered) for a few minutes, and punch it out bigger. Do several of those cycles and you can easily get 14-16\" out of it. The object is to give it some TLC and gradually get the crust to take shape, not forcing it. I don't toss my crusts, but I'm sure you can do that too. When the dough is formed, I brush a mixture of olive oil and italian seasoning on it, and poke the crust all over with a toothpick (to prevent massive bubbles, unless you like those). The oil and holes prevent the crust from rising super high. I then put it in the oven's bottom rack until the bottom is just crispy, remove it, and lightly sprinkle fresh parmesan and romano cheese on it, put it back in the oven until the cheese cooks a bit. Remove and put your sauce, cheese, and toppings on it. Best pizza ever. Even if your sauce is terrible, people will comment on how good the crust is. And much cheaper than delivery!\n\nUPDATE: I have made pizza using this crust more than 50 times now, and you really can't even mess it up with substitutions and additional ingredients. I typically add spices to the dough itself, and also put some spices onto the cru",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "daveharris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2102823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T01:02:24.793Z",
                "reviewBody": "WONDERFUL!!! I'll never order home-delivery pizzas again nor would I buy frozen ones. This crust is worryless tasteful and has a wonderful texture. I have a pizza dough setting on my bread machine which I used for this dough and it only took 45 minutes from putting ingredients in the pan to having a smooth and fresh smelling pizza dough. A piece of advice though: transfer dough from bread machine pan to a lightly floured board before patting in a pizza pan or rolling or dough will stick to your fingers. Will make it often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IVANDIEPART",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/805237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-12T20:50:59.547Z",
                "reviewBody": "First time I made a pizza crust, and this was excellent.  Made it as written except that I subbed buttermilk powder and olive oil, and, since my dough seemed dry in the mix cycle, I added 3 cloves of minced fresh garlic; it needed no further adjustments.  My machine takes 1:40 to finish its dough cycle, so when it was finished, I used floured hands to knead it a bit on a floured board.  Then I let it sit about 5 minutes before patting it into a large circle.  A little at a time I patted it into a larger and larger circle, letting it rest a bit in between.  At some point in time I turned it over and continued the process until I had a 13-inch diameter crust that I could fold in half and ease into my pizza pan that had been sprayed with no-stick cooking spray.  After letting it sit a few more minutes in the pan, I patted it into a nice uniform crust.  After taking the dough out of the machine, forming the crust took about 15 minutes.  The trick with this crust is to not get in a hurry.  I chose to pre-bake it at 450 degrees F. (increased for 4600 ft. in elevation) for 8 minutes.  After the 8 minutes, it had RAISED ALMOST TO THE TOP OF THE OVEN!!!  Poking it with a fork and pressing on it made it come down flat so that I could add the toppings.  SO, IF YOU DO PRE-BAKE THIS CRUST, DO WATCH IT!!!  Extremely SIMPLE and NATURAL crust.  From starting the bread machine to being ready to top the crust took about 2:10 the way I made it.  But it was worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKER476",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1268404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T15:14:24.107Z",
                "reviewBody": "I have made many recipes for bread and doughs, etc. This is by far the best homemade pizza dough that I have experienced. When the kneading was done, I let it rise in the  machine for 1 hour. \r\nI shaped it and stretched it out into a 14 inch circle and placed it on my round pizza stone that was dusted with cornmeal. I let it rise for an additional 15 minutes on the stone, than half baked it at 450 for 10 minutes.\r\nI topped it with a BBQ sauce, cooked chicken chunks, fresh cilantro, chopped red onion, garlic powder, basil, salt and mozzarella cheese. That was baked for 15 minutes at 350. OH MY GAWD!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SugarMogill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T18:34:34.793Z",
                "reviewBody": "Best bread machine recipe for pizza dough I've found. I used olive oil instead of vegetable oil. Texture of the dough made it easy to roll out and it tastes great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacklyn Robbins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/495611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-27T02:28:35.637Z",
                "reviewBody": "This recipe is fantastic! I've used it every time we make Pizza at home and it turns out perfectly everytime! I skip the lemon juice as it is not something we normally have on hand and it doesn't seem to make a lot of difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1597577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-20T23:00:48.733Z",
                "reviewBody": "Fantastic! I have a 1.5 pound machine. I multiplied the recipe by 1.5 (customized the recipe for 15 servings) and it was not too much for the machine. Made one big pizza for me and husband and 2 smaller (9 inch) for each of the kids. I cooked the crusts at 425 until risen and dry topped and baked until cheese browned. Really wonderful crust-crispy on the outside and chewy on the inside. Kids went nuts said \"thanks mom.\" Don't get that every night! We'll be having home-made pizza often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Durden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/181956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-27T13:30:23.967Z",
                "reviewBody": "Really nice pizza crust. I look forward to trying it again to see if it's consistant! Update: Has been successful 3 times now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RueBarbe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/249361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-10T13:41:44.793Z",
                "reviewBody": "this did not turn out well at all:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "nicki1110",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7480224/"
                }
            }
        ]
    }
]