[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17853/peasant-bread/",
        "name": "Peasant Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8648400.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-01-27T21:54:08.000Z",
        "description": "A delicious bread machine bread great for french toast, grilled sandwiches, or toast. It has no fat and very little sugar.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT2H55M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 - 1 1/2 pound loaf",
        "recipeIngredient": [
            "1 ½ cups water",
            "1 tablespoon white sugar",
            "1 ½ teaspoons salt",
            "3 ½ cups bread flour",
            "2 ½ teaspoons active dry yeast"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Light or Medium Crust cycle; press Start. For a crispier crust, use the French cycle or turn machine off after first rise and start the cycle over.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LOVEKANSAS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.453237410071942,
            "ratingCount": 139,
            "itemReviewed": "Peasant Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "6.5 calories",
            "carbohydrateContent": "1.4 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": "0.2 g",
            "proteinContent": "0.3 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "291.1 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-10T11:48:01.773Z",
                "reviewBody": "This bread is actually perfection!  Sooooo good!  And sooo super easy too.  I do not have a bread machine so here is how to make it without one:  First mix the yeast, sugar, and water and let that proof for about 10 minutes.  Then, mix in the flour and salt and knead until smooth (okay, so I DO have a KitchenAid Mixer, which helps immensely), about 5-7 minutes with the dough hook in the KitchenAid.  Place in a greased bowl (make it a BIG bowl, this rises sooo much) and cover with greased plastic wrap, and let rise until doubled (about an hour).  Then punch down and knead another two minutes or so on a lightly floured surface, flatten slightly (maybe an inch thick) and roll once into an oval shaped loaf (be sure to pinch the seal closed).  Make three diagonal slices on top of bread, place on greased cookie sheet, cover and let rise another hour.  Bake at 350 for about 40 minutes.  Bread is done when it sounds hollow when thumped on the bottom.\nOh, also, I used an extra 1/2 cup of flour, but my house must be extra humid because I always have to add extra flour to my bread recipes.  You are looking for the dough to pull completely away from the edge and bottom of the bowl when you are doing your first knead.  This bread is soooo good it is really a must try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dandyell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1540105/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-29T21:55:53.013Z",
                "reviewBody": "The posted recipe is nearly the exact recipe for French Bread that was included with my bread machine.  I agree...it's the BEST french bread!  I read that some people's loaves were falling...it may be that the proportions are off a bit.  My recipe says (instead of 1 1/2 cups of water) there should only be 1 cup + 2TBL for 3 1/2 cups of flour.  1 1/2 TBL of vegetable oil is an optional add.  I always make the 2 LB loaf, bake it on the French Bread cycle and it comes out perfect every time!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "countrymyst",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-23T20:22:16.693Z",
                "reviewBody": "I'm smiling ear-to-ear over how wonderful this bread turned out!  I didn't change a thing to the recipe and baked it on medium crust on the french bread cycle.  It turned out a nice golden brown color and was very crispy on the outside and soft and tender on the inside.  I love how the end pieces are really crunchy.  This is my very first time ever baking in my bread machine too!!!  My husband was so impressed.  A great way to eat it is to slice it and dip it in some balsamic vinegar with olive oil and fresh cracked pepper.  It's also one of those breads that is so good you can eat it plain!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jjkmy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1143012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-15T18:01:05.953Z",
                "reviewBody": "Simple tasty bread! Thanks for the recipe! If you're having problems with your bread here are some things to consider: 1. Double-check the settings on your bread machine--and if you've never used it before be aware that your first loaf will probably be a \"throw-away\" loaf (don't worry it's not you it's the machine). 2. Check your ingredients. They should be at room temperature when added not cold--especially the yeast. Also if your yeast is not fresh enough your bread may not rise enough or at all. 3. If the top of your bread consistently falls check the seal on your bread machine or try setting it in an area that has no drafts. Failing that you can adjust the ingredient amounts using the recipes given by the manufacturer as a guide. 4. Be sure you're using BREAD flour not \"all-purpose.\" Bread flour has added gluten which helps the rising and the texture of the bread. 5. Don't expect this to come out tasting or feeling like purchased sandwich bread or those \"brown-and-serve\" breads. It won't. HTH!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RAVEN9653",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1179645/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T01:18:17.607Z",
                "reviewBody": "I was unsure of a bread with no fat but since I am watching my weight and love (and we are talking addicted) bread I gave it a shot. I am so happy that I did. This bread does not lack in flavor and texture. It is one of the best basic white breads I have made. I am so glad to have found this and so is my diabetic father!! Many thanks!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GothicGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/650837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T01:18:18.043Z",
                "reviewBody": "Fantastic bread. Very crusty and crunchy (although very pale and odd looking when used French cycle). Most tast and crunchy recipe made. Makes wonderful extremely crunchy toast!! A bit much for children but great for those wantoing tasty very crunchy bread. DOesn't keep well - but doesn't need to!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SIANFROSTIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/642454/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-01T23:57:33.64Z",
                "reviewBody": "This is a very tasty bread. I did not use a bread machine so I had to make a few changes. To fit my 2 qt bowl I was baking in I reduced the ingredient amounts to:1 tsp active dry yeast 1 cup water 1/2 tbsp sugar 1 tsp kosher salt and 2 cups all purpose flour. I proofed the yeast in the sugar & 110 degree water for about 10 minutes then added to the dry ingredients and mixed well. I covered with saran wrap and let rise for about 2 hours in a warm place 75 degrees. I then used two forks to punch down the dough basically by pulling the dough off the sides of the bowl into the middle. I buttered bottom and sides of a pyrex oven safe bowl with 1 tbsp butter room temp. Then raked the dough into the prepared bowl. Preheated oven to 425 (then turned off so I could warm the stovetop a little). Sit bowl on stove top to rise a second time I left mine uncovered this time this rise took about 45 minutes. I let mine rise about 1 inch under the top of the bowl. Then I baked on 425 for 15 minutes reduced heat to 375 and baked an additional 15. Removed from bowl onto cooling rack immediately. Turned out delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "laceyworks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4843161/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-19T23:29:08.573Z",
                "reviewBody": "Very disappointed with the loaf that came out of my older model bread machine. Top was sunken and the texture was rubbery.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Deborah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7706618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-03T20:53:07.783Z",
                "reviewBody": "great recipie. it tastes like english muffin bread. the loaf isn't that big but it packs a lot of flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "beebo26",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2233358/"
                }
            }
        ]
    }
]