[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17918/focaccia-bread/",
        "name": "Focaccia Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8070903.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-10-04T17:21:52.000Z",
        "description": "A wonderful, quick alternative to garlic bread. Lots of herbs and lots of flavor!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 focaccia",
        "recipeIngredient": [
            "2 ¾ cups all-purpose flour",
            "1 teaspoon salt",
            "1 teaspoon white sugar",
            "1 tablespoon active dry yeast",
            "1 teaspoon garlic powder",
            "1 teaspoon dried oregano",
            "1 teaspoon dried thyme",
            "½ teaspoon dried basil",
            "1 pinch ground black pepper",
            "1 tablespoon vegetable oil",
            "1 cup water",
            "2 tablespoons olive oil",
            "1 tablespoon grated Parmesan cheese",
            "1 cup mozzarella"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, salt, sugar, yeast, garlic powder, oregano, thyme, basil and black pepper. Mix in the vegetable oil and water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the dough has pulled together, turn it out onto a lightly floured surface, and knead until smooth and elastic. Lightly oil a large bowl, place the dough in the bowl, and turn to coat with oil. Cover with a damp cloth, and let rise in a warm place for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C). Punch dough down; place on greased baking sheet. Pat into a 1/2 inch thick rectangle. Brush top with olive oil. Sprinkle with Parmesan cheese and mozzarella cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 minutes, or until golden brown. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Terri McCarrell"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.62420830401126,
            "ratingCount": 1421,
            "itemReviewed": "Focaccia Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "170.6 calories",
            "carbohydrateContent": "23.4 g",
            "cholesterolContent": "5.4 mg",
            "fatContent": "5.8 g",
            "fiberContent": "1.1 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "252.5 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-04-05T19:25:17.493Z",
                "reviewBody": "Quite simply put...wow! Left out garlic powder, because 1) it's not an authentic Italian ingredient (only fresh garlic is used in Italy) and 2) it would give an ersatz flavor. Doubled the basil and used milk for the liquid, to give a moister crumb. The result was a soft, perfectly chewy bread.  Dimpled  the dough deeply with my thumb after rolling out. Then, sprinkled the top liberally with chopped fresh rosemary leaves from the garden and lightly with coarse kosher salt, after painting with extra virgin olive oil. Then applied a mix of mozzarella, Parmigiano, and genuine imported Italian Asiago halfway through baking time so the cheese would not become overly brown. The result was ambrosia, a golden feast for the eyes and a delectable treat for the mouth. This is the real deal. Outstandingly simple and simply outstanding! To those who had trouble with the texture of the dough, either it's your yeast or your rising technique. Make sure to use only yeast that's new or that has been stored in the fridge/freezer. Also, do not dissolve in hot water, only lightly warm to the inside of your wrist. If the yeast has been stored in the freezer or is new, proofing is an unnecessary step. Proofing yeast does nothing magical like people think - it just \"proves\" that it's still good by bubbling. Do not allow the dough to overrise, (in other words, to rise so high that it sinks back down on itself) and ferment. Set a timer so that you don't forget to check on it. Light dough rises quickly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-23T22:51:33.577Z",
                "reviewBody": "I read this recipe twice and wondered how on earth the dough was supposed to rise without proofing the yeast first, and then I read the reviews and found that it has been a problem for many people who have made the focaccia.  ALWAYS proof your yeast!  Just heat the water to 110 degrees and stir in the sugar, then dissolve the yeast and let the mixture sit ten minutes or until your yeast mixture is nice and foamy.  Add the salt and oil, then your dry ingredients.  My focaccia rose beautifully, but it definitely needs some salt in the topping.  The next time I make it, I will sprinkle garlic salt before adding the mozzarella.  This is a great recipe, it just needs to be a little more clear for the cook who isn't all that familiar with bread baking.  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "My4NonBlondes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rebecca/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-30T03:27:12.14Z",
                "reviewBody": "Great flavor, but the directions could use some help!  I read some reviews that helped me.  I proofed my yeast with the sugar and (115 degree) water first for 10 minutes, then added the salt, oil, and herbs (using fresh basil).  Then I stirred in the flour (using one cup whole wheat flour, the rest unbleached white).  Kneaded for about 5-6 minutes, and let rise for about 40 minutes.  I then shaped the dough into a rectangle on a greased cookie sheet and let it rise for 30 more minutes.  Then I brushed on my olive oil, and sprinkled on my parmesan cheese.  Skipped the mozzarella, but I'm sure it's good that way too.  Baked at 400 for about 20 minutes.  Delicious!!!  Served with Rich and Creamy Tomaoto Basil Soup from this site, and a layered lettuce salad.  Beautiful!  I had no problems with it not rising, and it tasted light and yummy, even with the whole wheat flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-24T21:49:02.01Z",
                "reviewBody": "The herb combination is great. Use a little more salt (or sea salt) and a little less garlic powder. \n\nThis recipe leaves two crucial things for focaccia bread.\n First, the water needs to be warm (110- 130 degrees ) when you add it to the yeast for the rise. \n Second, after you punch down the dough, it needs to rise a second time for about 30 minutes. If you fail to let it rise again the bread will be too dense. \n\nIt is also advisable to bake at a slightly lower temperature for longer, but the second rising of the bread will help to take care of that. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "meliska",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2955457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-08T00:29:02.39Z",
                "reviewBody": "Great tasting focaccia. Like many of the previous reviewers, I adapted the recipe for my needs. It was a hit with my family, but next time, I would add more than 1 tsp. of salt. I used 1 Tbs. (each) FRESH oregano, basil, thyme, & added rosemary. Also used 1 1/2 tsp. garlic powder, and added about 2 T. of some leftover pesto I had on hand. Placed all of this in my bread machine (dough cycle), and forgot about it. After the machine beeped, took the dough out and proceeded with the focaccia as instructed. Sprinkled cornmeal on the bottom of my baking sheet before placing dough on top, shaped, and used toppings. Sprinkled with the 2 cheeses, tomatoes, garlic, and olives. Baked in the oven at 450 F. Family devoured the whole thing! Yikes... ;o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WhirledPeas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-18T18:47:24.2Z",
                "reviewBody": "This is such a great tasting, easy to make, bread!  I make the dough in the morning, then after it rises, I punch it down, throw it in a lightly floured ziploc, and put it in the refrigerator until I'm ready to make it!  It has come out great every time I've made it.  And my 2 year old loves it too! (And I even use 1 1/2 tsp. of garlic in the recipe!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURA42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/625837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:43:48.873Z",
                "reviewBody": "Fabulous! So delicious and easy. I added 1 tablespoon of salt instead of 1 teaspoon, sprinkled rosemary and sea salt on top of the bread and left off the mozzerella cheese. I also put a little cornmeal on the pan before putting the dough on. I served it with olive oil and balsamic vinegar to dip it in and it was just as good if not better then the focaccia bread I get from the bakery. It comes out flatter then most loaves (almost like a thick pizza crust) so you wouldn't be able to make a good sandwich unless you cut off a big piece and sliced it through the center. It would make a great pizza crust too. I can't wait to try that next time. Yum. No need to buy focaccia bread again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER72_00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:43:48.843Z",
                "reviewBody": "I have made this bread about 50 times and every time it comes out wonderfully!!!  It is so simple and fast and is sooooo moist and flavorful.  I like to add diced kalamata olives to the bread dough and top it with finely sliced tomatoes and grated parmesan cheese.  Today, I used it to make assorted finger sandwiches for my friends and they just couldn't get enough!  It was a beautiful presentation.  Thank you for sharing this wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISARAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/445880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-29T18:34:45.02Z",
                "reviewBody": "This made a very nice focaccia.  I have been making bread for years and I noticed some errors in the instructions.  If you are having problems it may be because you need to BLOOM the yeast in the water first.  Some others have called it proofing but when you place the yeast in water and it foams up it is blooming.  This is necessary because the yeast is in a suspended state when it is dried.  Only the \"fast acting\" powder yeast may be added directly to the dry ingredients. (this may have been what the author used)  After the ingredients are incorporated and kneaded you ferment (first rise),  then you punch down and do any scaling or panning (if you are making multiple products from the dough like rolls...)  after all that is done you PROOF the dough to double its size and bake it.  You will have some oven spring where it grows a little in the oven, and once it hits about 140F the yeast dies and the bread sets its shape.  good luck and don't buy any more overpriced artesian bread when you can make it yourself!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chefn24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7992453/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Focaccia Bread",
            "description": "See how to make quick-and-easy flatbread flavored with garlic and herbs.",
            "uploadDate": "2013-12-03T20:32:53.399Z",
            "duration": "PT3M39.456S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3bded845-513f-44c8-8b3e-9d17a1f2543e%2Fba42d77a-d87f-45fb-8559-a8dc7a20a074%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2890034033001"
        }
    }
]