[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17924/colleens-potato-crescent-rolls/",
        "name": "Colleen's Potato Crescent Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6053863.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "1999-05-12T00:32:07.000Z",
        "description": "Between family, friends and co-workers, I get requests for these rolls about every weekend. They have a terrific flavor! Mix garlic or cinnamon into the butter topping for more variety.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT9H40M",
        "recipeYield": "32 rolls",
        "recipeIngredient": [
            "2 potatoes, peeled and cut into 1 inch cubes",
            "1 (.25 ounce) package active dry yeast",
            "1 ½ cups warm water (110 degrees F/45 degrees C)",
            "⅔ cup white sugar",
            "⅔ cup shortening",
            "2 eggs",
            "1 ½ teaspoons salt",
            "6 ½ cups all-purpose flour",
            "¼ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place potatoes in a  saucepan, and cover with water. Bring to a boil, and cook until tender, about 15 minutes. Drain, cool, and mash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When yeast is ready, mix in 1 cup mashed potatoes, sugar, shortening, eggs, salt, and 3 cups flour. Stir in the remaining flour, 1/2 cup at a time, until dough has become stiff but still pliable. Turn dough out onto a lightly floured surface, and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl, and turn to coat with oil. Cover with plastic wrap, and refrigerate for at least 8 hours, and up to 5 days.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Deflate the dough, and turn it out onto a lightly floured surface. Divide the dough into two equal pieces, and form into rounds. Roll out each round to a 12 inch circle. Brush generously with melted butter, and cut each circle into 16 wedges. Roll wedges up tightly, starting with the large end. Place on lightly greased baking sheets with the points underneath, and the ends bent to form a crescent shape. Cover, and let rise for 1 hour. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 to 20 minutes, or until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Colleen Wollenberg"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7799352750809065,
            "ratingCount": 309,
            "itemReviewed": "Colleen's Potato Crescent Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "174.4 calories",
            "carbohydrateContent": "26 g",
            "cholesterolContent": "15.4 mg",
            "fatContent": "6.3 g",
            "fiberContent": "0.9 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "125.1 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-09T18:33:43.077Z",
                "reviewBody": "Folks, you can add this wonderful recipe to your breakmaker repertoire!   After mashing and measuring the potatoes, I cut all the ingredients in half, put everything in the breadmaker and processed on the \"dough\" cycle.  I did use one full tablespoon of yeast as per my machine manufacturer's recommendations, and I exchanged whole wheat flour for half of the flour, and the rolls were soft and delicious.  I've made these twice, and I find that I need to cover them loosely with foil before I put them in the oven, and remove the foil about a minute before they're done so they brown nicely.  Otherwise they were darkening too fast.  My family loves these.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAEMARIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/845780/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-21T12:46:52.327Z",
                "reviewBody": "I just sampled one of these from the oven; yes I burned my tongue but it was so worth it. I've been baking rolls for 30 years and these rolls top any I've ever baked. The texture is melt in your mouth and the taste is old fashioned and delicious. Except for supplementing the potatoes with potato flakes, I followed the recipe exactly. I made a dozen big fluffy crescents and then a dozen & a half cinnamon rolls from the rest of the dough, using a brown sugar, cinnamon, and pecan filling and topping them with a powdered sugar glaze flavored with maple. These are a perfect 10!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANNYLOOHOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/953764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:38:16.577Z",
                "reviewBody": "This is a TREMENDOUS bread dough recipie!  I didn't have baking potatoes on hand, so I made a cup of instant potatoes, and it was just as wonderful!  I even used this as a basic bread recipie instead of making rolls, and it was great.  I didn't let it rise in the fridge as specified, I let it rise in a warm place until it doubled--I was too impatient for it to rise overnight or for days!  :)  It is nice to know you can make it ahead, though.  It is very kid-friendly--my kids had fun rolling up the crescent shapes, and they loved the soft rolls after they were cooked.  Thanks, Colleen, for a wonderful recipie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSIEQ_IN_NJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/465496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-29T01:37:45.107Z",
                "reviewBody": "Made these rolls for Thanksgiving 2004. Fabulous. I made the basic dough using my the dough hook on my Kitchen Aid mixer, instead of kneading for 8 minutes & it worked fine. Two potatoes were too many. Recipe should read \"enough cooked potato to make one cup.\" A rolling pin isn't necessary--just pat the dough out with flour-coated fingers. The dough is too soft to cut with a knife--do this instead & it'll work great: take a pizza cutter & roll it in flour, then cut the dough into 16 pieces. Fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CONCRETEBLONDE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1268349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-05T22:25:03.517Z",
                "reviewBody": "I made these for Thanksgiving and the result was exactly what I was looking for, a light, fluffy, rich tasting roll.  I recommend baking at 375. I scaled the recipe in half so I could do it in my bread machine.  I used 1 mashed yukon gold potato, butter flavored shortening (I use butter with a good result as well) and added 2 Tbsp. dry milk powder.  Even though I scaled the recipe in half I used an entire packet of yeast.  I added the ingredients according to the instructions for my bread machine and ran it on the dough cycle.  When it was done I sprayed a 9 x 13 pan with Pam, shaped the dough into balls and put them 4 across in the pan.  Covered with plastic wrap and stored in my refrigerator overnight.  On Thanksgiving I took the pan out of the refrigerator about 3 hours before I was ready to bake them and put them on my counter covered with a kitchen towel to let them come to room temperature and rise up (they will need at least 3 hours to do this).  I brushed the tops with butter once while cooking and again right after removing from the oven.  Amazing result!  I will make this frequently.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T21:32:47.497Z",
                "reviewBody": "The instructions did not say to cream the shortening and sugar and when I mixed it with everything else it was really lumpy looking. I just knew I had messed up the whole recipe.I decided to use my mixer for a few minutes on low to blend the liquids and potato together. That worked out real well. I wanted a dinner roll instead of a sweet type roll so I reduced the sugar to 1/3 cup. It was definetely the hit of our Thanksgiving dinner this year. These were absolutely the best rolls I have ever made! Incredibly awesome! The recipe is one that I will use from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LCATHCART",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/945621/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-25T03:09:36.467Z",
                "reviewBody": "Very tasty and high risers! The dough is very easy to handle. I would suggest cutting out some of the sugar if you intend to serve them as dinner rolls but keep it as is if you want to make them into a sweet roll.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TGFROST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/737746/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-01T17:23:56.573Z",
                "reviewBody": "This recipe turned out great for me and it is so easy to tweak. I had to watch them in the oven closely because they can brown too much on the bottom if you are not watching. I made dinner rolls and cinnamon buns(just coated with melted butter and cinnamon and sugar on one side before rolling)from the same batch. It is a really big help around the holidays when like me you have several places to take food too; you need variety. The recipe is simple and quite versatile. You can add minced onion garlic or herbs to change things up. I served the regular rolls with honey herb and orange-cranberry butter... but who is to say that you can't add these ingredients to the batter? I look forward to trying a variety of additives to this 5 star winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M.Blake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2226008/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-05T16:31:08.923Z",
                "reviewBody": "Dinner roll nirvana. Light tender buttery moist yeasty little mouthfuls of deliciousness. The one and only recommendation I would make is to cut the sugar if you're looking for a dinner roll and not a sweet roll. I used 6 Tb which gave a subtle hint of sweetness to the flavor but stopped short of defining it as more appropriate for a sweet breakfast roll. Easiest way to cut? Use a pizza cutter to cut your rolled circle into quarters then divide those quarters in half to make eighths then subcut those in half to get 16. All cuts need to intersect at one point in the center of the circle. After cutting spread with the butter (I don't melt - just use softened butter. Melting is an unnecessary extra step and one more item to wash) then roll up each wedge as described in the directions. Be sure to wait sufficient time after shaping the refrigerated dough into individual rolls for a complete rise. For me that took about an hour and 20 minutes (your timing could be more because of kitchen temp. I'm in south FL so it's always pretty warm.) This step yields the maximum lightness of texture just as rushing things will contribute to a heaviness in your finished product. I've made these countless times now. Perfect every time. Superb heirloom recipe. Thank you for posting it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-23T21:50:38.450Z",
                "reviewBody": "Most of my bread recipes use the yeast starter method of mixing water/milk, yeast, sugar and ~1/2C of flour then letting sit overnight in the refrig.  I am not sure I would leave raw eggs to sit in this recipe for the 'up to 5 days' mentioned.  Not sure that is a good idea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Goodfood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2897463/"
                }
            }
        ]
    }
]