[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/400/desserts/cakes/yellow-cake/",
                    "name": "Yellow Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17957/tandy-cake/",
        "name": "Tandy Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3573552.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2000-04-05T17:02:14.000Z",
        "description": "Baked in a 10x15 inch jelly roll pan, Tandy Cake is a yellow cake with a layer of peanut butter and a hard chocolate glaze. This recipe takes a couple of hours to make but it's worth it! It tastes so good!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "1 - 10x15 inch pan",
        "recipeIngredient": [
            "4 eggs",
            "2 cups white sugar",
            "1 teaspoon vanilla extract",
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 cup milk",
            "2 tablespoons margarine",
            "1 ¼ cups peanut butter",
            "2 pounds milk chocolate candy bar, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10x15 inch pan. Sift together the flour and baking powder; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine eggs, sugar and vanilla. Beat on high speed of an electric mixer until light and lemon-colored. Beat in the flour mixture. Microwave milk and margarine about 2 minutes, or until it begins to bubble. Stir into batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into 10x15 inch pan. Bake in the preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the cake comes out clean.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When cake is cool, plop peanut butter all over and spread evenly to the edges. Refrigerate to set, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a microwave safe dish, melt chocolate and spread evenly over peanut butter layer. Refrigerate to allow chocolate to harden.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Yellow Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rebecca Harrison"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.594405594405594,
            "ratingCount": 143,
            "itemReviewed": "Tandy Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "616.5 calories",
            "carbohydrateContent": "75.5 g",
            "cholesterolContent": "61.1 mg",
            "fatContent": "30.3 g",
            "fiberContent": "3.6 g",
            "proteinContent": "13.1 g",
            "saturatedFatContent": "12.3 g",
            "servingSize": null,
            "sodiumContent": "197.8 mg",
            "sugarContent": "56.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-26T13:06:19.093Z",
                "reviewBody": "Great idea for topping a cake. I used a box mix yellow cake, I ended up using about 1=1/2 cups of creamy peanut butter, dolluped onto the hot cake and gently spread. I started with 1-1/2 pounds of Hershey bars{the giant ones}and only used about 1-1/4 pounds, one pound will be plenty next time....Definitely score the chocolate before it is completely set.....Great bars for a picnic, the chocolate holds everything together to make a cake finger food. I rated it 4 stars because the expense of buying so much chocolate and not needing but half of it is a real downer in my book. This recipe{adjusted} is most definitely a keeper",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "melis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-10T20:04:55.567Z",
                "reviewBody": "I was initially leary of this recipe because I don't feel that the picture makes it look very appetizing, but then I notices a better pic under the 'related photos' and decided to give it a try and I'm glad I did. It turned out really good, it definately turned out like a homeade version of the Tastycake brand. I used a 9 x 13in. pan instead, I also didn't measure the peanut butter I just spread it on evenly when the cake was right out of the oven, using Reese's brand peanut butter. I melted 5 hershey bars and that was perfect, and it spread smoothly.  The cake was very moist. I waited untill the cake was room temperature untill I cut it because the chocolate was to hard right out of the fridge. Next time I think I'll use the 10 x 15inch pan to make this more of a bar type dessert. This recipe's a keeper, will definately make again!  Thanks, Rebecca!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill Murphy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2454745/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-04T17:06:04.613Z",
                "reviewBody": "This recipe is very similar to one that has been in my family for years.  It started as a way to use chocolate bunnies at Easter time.  Try 2 teaspoons of baking powder and a dash of salt in the cake mixture.  Also, use oil instead of butter.  The cake part comes out very moist this way.  DO NOT use chocolate chips!!  When it's not Easter time I use melted Hershey's bars.  Also, 2 lbs of chocolate is way to much.  One pound of chocolate is plenty!  Try it the way I have said and you will not be disappointed, I promise!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4100204/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T18:53:23.64Z",
                "reviewBody": "Do not substitute the chocolate bars with chocolate chips - it hardens too much and makes it difficult to cut.  Take this to your next potluck or picnic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michele Bart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/354994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-30T20:04:33.677Z",
                "reviewBody": "Follow this recipe and it is great I use Hershey's Milk Chocolate Bars. Just place them on top of the cake cover most of the surface. Place cake in oven @ 350 for 2 or 3 minutes checking until you see the bars melting remove from oven spread bar over top and sides. Remove from the frig about 30 minutes prior to cutting. Use sharp knife and enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2867871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-17T21:31:55.103Z",
                "reviewBody": "Delicious! I made it with 2 tsp vanilla and 2 tsp of butter but the same otherwise. For the topping I used one regular size jar of PB and one regular sized bag of milk chocolate chips mixed with 1 Tbsp oil. I will make this again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "klzee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1762697/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:53:25.473Z",
                "reviewBody": "If you love those little snack cakes that come in a package you'll love this big cake as well. I made this for my daughters' birthday and it was a huge hit with the gang. Definitely spread the PB while the cake is still warm. Due to total lack of time I had to cheat and use a box cake mix. It was still awesome and I thank you Rebecca for making the peanut butter and chocolate freaks in my house jump for joy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-02T19:13:55.423Z",
                "reviewBody": "This photo doesn't look like the recipe.  I've made this cake for years and have rave reviews every time I serve it.  I started using a box yellow cake mix and bake in a cookie sheet at 350 for 15 minutes.  It's just as good. Melt the chocolate and spread entirely over the peanut butter (after it's been chilled).  You shouldn't see any peanut butter.\n\nA fast desert to feed a gang.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyn N Barbour",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1595006/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-17T04:19:48.703Z",
                "reviewBody": "Mixed feelings about this one. Loved the flavor but the texture left something to be desired. Now mind you I never grew up with tandy cakes and had never heard of them before finding this recipe so I have nothing with which to compare nor anything that can say this is authentic or not. That said the cake has a somewhat chewy texture which I found off-putting. I followed the cake recipe exactly as written but used only half the chocolate as others recommended. Also applied the peanut butter when the cake came out of the oven followed immediately by the melted chocolate. Those ingredients combined when spread and they tended to separate from the cake top when cut (yes I did score the topping as suggested.) The flavor is wonderful but just can't get past that somewhat rubbery cake texture. I even made sure not to overbeat after adding the flour. I would not make this recipe again as written however substituting any other conventional yellow cake recipe or even a boxed mix would represent a substantial improvement in my purview. Anything that gets you away from that chewy cake would and allows you to enjoy the chocolate/peanut butter combination while giving you a tender cake as a vehicle should be a winning combination. Good theory not so hot in practice so only 3 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            }
        ]
    }
]