[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218671/whole-grain-breakfast-cookies/",
        "name": "Whole Grain Breakfast Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F885973.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-03-05T05:08:14.000Z",
        "description": "My sister and I love something sweet with our coffee in the morning. We created this recipe to make a wholesome  breakfast. I generally double the batch and keep them in the freezer. They taste even better frozen (still soft!). Whole grains, fiber, and protein and no butter! Can it really be delicious? Yes! My kids can't keep their fingers out of the batter. I decided to add it to Allrecipes because everyone keeps asking me for the recipe. Enjoy!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "18 cookies",
        "recipeIngredient": [
            "1 cup walnuts",
            "1 ½ cups old-fashioned rolled oats (not instant)",
            "⅓ cup whole wheat flour",
            "½ cup ground flax meal",
            "1 teaspoon baking soda",
            "½ teaspoon salt",
            "1 teaspoon ground cinnamon",
            "½ cup almond butter",
            "¼ cup canola oil",
            "¼ cup blue agave nectar",
            "⅓ cup brown sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "½ cup dried cherries",
            "1 cup semi-sweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pulse the walnuts in a food processor several times to chop; continue processing until the walnuts are ground into flour; transfer to a bowl. Mix in the rolled oats, whole wheat flour, flax meal, baking soda, salt, and cinnamon until thoroughly combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the almond butter, canola oil, agave nectar, brown sugar, egg, and vanilla extract in the food processor and process a few seconds to blend the ingredients well; transfer the almond butter mixture to a large bowl and fold in the dried cherries and chocolate chips. Mix the walnut-oatmeal mixture into the almond butter mixture (dough will be very thick).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scoop up heaping teaspoons of dough, and form into balls; lay the dough balls onto the prepared baking sheets, about 2 inches apart.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until lightly browned, 8 to 10 minutes. Remove from oven and flatten the cookies with a spatula. Allow to cool for about 5 minutes on the baking sheets before removing to finish cooling on wire racks.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "IrisMac"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.782234957020058,
            "ratingCount": 349,
            "itemReviewed": "Whole Grain Breakfast Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "259.1 calories",
            "carbohydrateContent": "26.1 g",
            "cholesterolContent": "10.3 mg",
            "fatContent": "16.3 g",
            "fiberContent": "3.8 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "173 mg",
            "sugarContent": "15.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-09-10T21:51:23.75Z",
                "reviewBody": "I had to make a few substitutions, but these are just awesome.  I used honey instead of agave nectar, applesauce instead of oil, and peanut butter instead of almond butter.  I'm sure they would be even better with no substitutions, but this was a winner with my husband and my 17 month old!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Em",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3871116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-03T01:55:04.483Z",
                "reviewBody": "**second batch note** i made a double batch and froze the dough in large cookie-sized balls by placing plastic wrap over a cookie sheet, allowing them to freeze and then placing them into a ziplock. then all week, i took a few out at a time, baked them at 350 for 10 minutes, gave them a gentle smush as i took them out of the oven to flatten them a bit and let them cool completely on the pan. PERFECTION! NO CRUMBLING AND MY 7 YR OLD DAUGHTER GOBBLES THEM! Pretty dang good. I had to make a few changes, like raisins instead of the dried cherries, but if you had them the cherries would have given a nice pop of flavor (I suppose you could try Craisins or even the cherry flavored Craisins as an alternative too). I added a small gala apple to the food processor (minus stem and seeds) for a little extra fruit content, and my cookies came out very moist (a bit crumbly like many other comments). I think I might add another egg next time? I love the walnuts being ground up. My daughters chomped away on an omega3 & 6 rich, high fiber snack and never once caught on to my diabolical plan to give them something healthy. Possibly my new favorite cookie recipe. I wonder how coconut oil would do instead of the canola?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KaraBara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3341968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-06T01:25:13.99Z",
                "reviewBody": "Awesome cookies! I didn't have any walnuts so I subbed whole wheat flour, and also subbed honey for the agave. Very versitle recipe, thanks so much, we'll be using this one often:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jog Dish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2967134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-27T10:05:19.847Z",
                "reviewBody": "Loved these cookies! I made a few changes based on the other reviews. I used Honey instead of Agave. 2 eggs. Left out the cinnamon. Used natural organic peanut butter instead of almond butter. Left out the dry cherries. And used Coconut oil instead of canola oil. My husband ate 6 and my kids devoured them after school!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gabriella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6340675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-22T18:25:05.21Z",
                "reviewBody": "Really good! Can't wait for my kids to try them! For those of you who like to weigh ingredients, this is for you: Walnuts (7 oz.) Oats (9 oz.) Wheat Flour (3.75 oz.) Flax (3.75 oz.) Almond Butter (9 oz.) Walnut Oil (4 oz.) Canola is NOT healthy! Agave (5.75 oz.) Brown Sugar (5.5 oz.) Chocolate Chips (12 oz.) Next time I'd use half the chocolate chips. Next time I'd like to try all honey and coconut oil. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TEANCUM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1202478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-03T18:58:34.163Z",
                "reviewBody": "Awesome and super flexible to meet dietary needs.  I used two eggs, replaced the brown sugar with 1/3 cup Stevia (cup for cup style), added 2 tbls chia seeds to dry ingredients, and subbed melted coconut oil for canola.  I used gluten free oats and gluten free flour.  I, too, ground the oats in the food processor, and everything mixed really well.  Flatting the cookies before baking them worked best for me.  I can hardly make them fast enough to keep up with the family.  \r\n\r\nI've been experimenting with breakfast cookies for a while, and I love the fact that these use so little regular flour.  These are the best I've tried yet, and they are really healthful as well.  Thanks so much for sharing this recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bookworm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2496702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-10T19:40:11.783Z",
                "reviewBody": "Thanks for a great recipe. These are delicious and nutritious. Because I didn't have all of the ingredients on hand I needed to make some subsitutions. I used almonds instead of walnuts peanut butter instead of almond butter ommitted the cinnamon used 1/4 c brown sugar and 1/8 c honey (instead of the agave). I used 1 1/2 c raisins instead of the cherries and chocolate chips.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MCMARY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/275445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-03T03:23:15.897Z",
                "reviewBody": "I love these cookies! The only thing I changed in this recipe was omitting the chocolate chips. Honestly I don't think it needs them but the chocoholics among us will disagree. I was curious what the \"flattening\" does so I left one cookie unflattened as my control. The unflattened cookie tasted delicious as well but the flat versions travel well. I baked half of the batch right away and put the other half in the fridge and baked them up a few days later. I couldn't save these just for breakfast; I ate them all day long.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "E^3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3722342/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-15T10:43:09.04Z",
                "reviewBody": "Sorry, I don't know why I seem to be the only one who cannot rave about these cookies. I really stuck with the recipe, since I also want a wholesome cookie with my coffee that includes fiber and protein.  I did leave out the chocolate chips because it sounded too sweet.  But the cookies just didn't seem sweet enough, and they were heavy.  I wish I had NOT flattened them with the spatula.  I plan to retry this, with a bit more sugar, more cherries, and maybe more soda to make them lighter, crispier. I do appreciate the recipe, anyway.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Karennina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2843441/"
                }
            }
        ]
    }
]