[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18082/norwegian-lefse/",
        "name": "Norwegian Lefse",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1075174.jpg",
            "width": 4320,
            "height": 3240
        },
        "datePublished": "1999-12-20T23:12:21.000Z",
        "description": "I was raised on Lefse as a special treat for the holidays.  We still make it every holiday season, and this is the best recipe ever. We eat ours with butter and sugar. Note: you will need a potato ricer to prepare this recipe.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "60 Lefse cakes",
        "recipeIngredient": [
            "10 pounds potatoes, peeled",
            "½ cup butter",
            "⅓ cup heavy cream",
            "1 tablespoon salt",
            "1 tablespoon white sugar",
            "2 ½ cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cover potatoes with water and cook until tender. Run hot potatoes through a potato ricer. Place into a large bowl. Beat butter, cream, salt, and sugar into the hot riced potatoes. Let cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir flour into the potato mixture. Pull off pieces of the dough and form into walnut size balls. Lightly flour a pastry cloth and roll out lefse balls to 1/8 inch thickness.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on a hot (400 degree F/200 C) griddle until bubbles form and each side has browned. Place on a damp towel to cool slightly and then cover with damp towel until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DEBBA7"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.376623376623376,
            "ratingCount": 77,
            "itemReviewed": "Norwegian Lefse",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "367.6 calories",
            "carbohydrateContent": "71.2 g",
            "cholesterolContent": "16.3 mg",
            "fatContent": "6.6 g",
            "fiberContent": "5.5 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "522.7 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-12-12T17:24:27.64Z",
                "reviewBody": "This is the real deal. It is important to make sure the potatoes are cold before adding the flour and other ingredients and be sure to keep the uncooked lefsa cold before rolling out. I also use bread flour - the lefse turns out much more tender. Lefse can also be frozen too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EMERALDCITYJEWEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/654148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-27T23:08:00.877Z",
                "reviewBody": "This is the closest to my mom's recipe that I have seen.  One suggestion I would make is if you are not eating it right away (we make 20 lbs. of potatos at a time and freeze it) cool your lefse between two towels, inside a plastic garbage bag.  It will be moist and even the lefse that come off the grill a little crispy and dry will be soft and moist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "katie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1791126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-14T10:44:20.64Z",
                "reviewBody": "I have been looking for a lefse recipe for over a year. Well no more this is the one I will use forever. My 81 year old father in-law said it was just like his mother used to make. And I found it very easy to do.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PEGGY ANDERSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/198692/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-27T19:51:18.027Z",
                "reviewBody": "This is an authentic recipe for lefse, very similar to my Norwegen Mother in Law's.  The flour amount is correct, it is scant because it takes into account that quite a bit of extra flour is needed for rolling out the lefsa.  My MIL's tip was not to add the flour all at once.  Divide the potato mixture into enough for 10 lefsa per batch and add the proportionate flour to mix in just before you roll the dough.  You won't have to add as much flour to the rolling surface and will have more tender lefse.  Also..if your potatos are very moist, either dry them in the oven or cut back on the amount of cream you add to the dough.  You don't want to develop too much of the gluten in the flour which makes the lefsa rubbery or tough.   Lefsa it easiest to bake with two people; one to roll out the lefsa and one to mind the griddle!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2512568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-02T04:38:38.217Z",
                "reviewBody": "This recipe was terrific! I love making lefse and this was one of the best I have tried in fact I have decided that in the future this is the only recipe I will use. I am all Norwegian so it's in my blood. I also like that Allrecipes makes it possible for me to select the amount of servings. I made this recipe for 45 servings - 90 lefse - that will be enough for all the holidays. Thanks D. Brockman!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MYRNA DEHMER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/497643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-13T19:01:53.303Z",
                "reviewBody": "I made this recipe last year for my family at Christmas. My grandpa was 100% Norwegian. He has passed away but my grandma tried the lefse from this recipe and said it tasted just like the lefse my grandpa's mother used to make. One thing I found with the recipe is that the amount of butter cream salt sugar and flour is enough for 5 pounds of potatoes (not 10). If you want to do 10 pounds you will need twice the amount of other ingredients. Excellent recipe! Thank you!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacy Minch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2522574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-20T04:14:09.083Z",
                "reviewBody": "I grew up in a Norwegian family where we ate lefse 3 times a day for the whole Christmas season! My mom & I make lefse every year. We're always frustrated with our recipe not rolling out properly. This is the best recipe we have used to date! Here are some tips we've learned through the years...hope this helps other's trying to make this yummy treat!!!\n- The flour amount is perfect!! But use LOTS of flour in a sifter to sprinkle on your pastry board, rolling pin and dough to prevent sticking. That extra flour used for rolling probably doubles the flour amount used. Too much flour makes the lefse rubbery. \n- Divide dough up into several logs rolled in wax paper and keep the extra's in the fridge. Cold dough is easier to work with.\n- Use a kitchen scale and weigh each hunk of dough before rolling.\n- Use a cloth cover over your pastry board and rolling pin to prevent dough from sticking.(can be purchased or make your own with unbleached cotton) Keep extra's on hand to swap if they get too moist (hand wash them...or use mild detergent & no fabric softener)\n- Have lots of patience, a friend to work with and cushy slippers to stand on! This full recipe with 2 people will take about 6 hrs & yield about 80-100 8\" pieces if rolled 1/16\" thin. (1/8\" is too thick)\n- Practice! Your first few may not turn out so well. \n- BTW...A pizza stone makes a great lefse rolling board!\n- If you want to make lefse often...invest in a good corrogated rolling pin - it does make a difference!\n- Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wire Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10553065/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-02T04:38:30.153Z",
                "reviewBody": "Perfect lefse! I've been looking for a good lefse recipe for a long time and this one has the most traditional taste and texture. Wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Rogstad Peterson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/532047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-27T00:29:09.517Z",
                "reviewBody": "I am wondering if Saraphine is my cousin? Because that sounds just like my story! Our grandma was a 5th-generation immigrant from Norway who settled in WA she brought this family recipe with her. Interestingly we ate it the same way as you do: Rolled up with butter and sugar! According to Wikipedia this is a variation called tynnlefse or \"thin lefse\" and rolling it up with butter and sugar is called \"lefse-klining\". The lefse griddle I purchased also came with a similar recipe but it called for 4 cups of flour! I believe I ended up splitting the difference and using about 3 cups: When it had the consistency of Play-Dough that was the time to stop adding flour. It does want to stick to EVERYTHING: I found that to get it really thin like Grandma's you have to spread flour over it GENEROUSLY both on your work surface and on the top which contacts your rolling pin. Which is fine because I remember the lightly floury texture the lefse always had. Thank you so much. The picture looked JUST like my grandma used to make! I'm afraid I cried into my lefse it brought back so many wonderful family memories!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSYKENDER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/538444/"
                }
            }
        ]
    }
]