[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18061/egg-free-dairy-free-nut-free-cake/",
        "name": "Egg-Free Dairy-Free Nut-Free Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5991191.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2000-03-22T16:05:37.000Z",
        "description": "This chocolate cake is so good, you'll never miss the dairy products! Check at your health food store for tofu or nondairy chocolate chips.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "1 - 8x8 cake",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "½ teaspoon salt",
            "1 cup white sugar",
            "¼ cup unsweetened cocoa powder",
            "1 teaspoon baking soda",
            "5 tablespoons vegetable oil",
            "1 tablespoon white vinegar",
            "1 teaspoon vanilla extract",
            "1 cup cold water",
            "½ cup semi-sweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8 inch baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine flour, salt, sugar, cocoa powder, and baking soda. Mix well with a fork, then stir in oil, vinegar, and vanilla extract. When dry ingredients are thoroughly moistened, pour in cold water and stir until batter is smooth. Stir in chocolate chips and pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 to 35 minutes, until a toothpick inserted in center comes out clean. Cool on a rack.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Bridget Brooke-meer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.645038167938932,
            "ratingCount": 262,
            "itemReviewed": "Egg-Free Dairy-Free Nut-Free Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "318.9 calories",
            "carbohydrateContent": "51.2 g",
            "cholesterolContent": null,
            "fatContent": "12.2 g",
            "fiberContent": "2.3 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "303.7 mg",
            "sugarContent": "31.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-22T04:20:13Z",
                "reviewBody": "My daughter suffers severe allergies to many products including dairy, egg, nut and soy.  I prepare this recipe excluding the chocolate chips and end up with a lovely, moist cake which doesn't need frosting and keeps for a couple of days (if it gets the chance).  I've cooked the batter in every shaped pan imaginable, including a shaped birthday cake for my daughter, without any problems.  Obviously the cooking times varies slightly depending on the pan.  It even works well in muffin tins or patty pans - these are great to keep in the freezer!  Our favorite way to serve it is to cook it in a fluted ring tin, when cool fill the centre hole with with berries or cherries and dust with icing sugar.  It lookes as luscious as it tastes.  Most family and friends who know about my daughter's allergies cannot believe this cake is allergy friendly, and many use the recipe themselves.  In addition, while it may not be fat free, it is easily made cholesterol free by using the right kind of oil.  A thousand \"thank you's\" to the person who submitted this recipe - you've ensured that we have an option for a delicious cake for a little girl whose diet is restricted in so many ways.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANIELLE  STOKELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/383881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-12T06:35:33.14Z",
                "reviewBody": "My first go at this cake was not good at all - it broke up to bits....Then I decided to add what is called No Egg replacement by Norgran...which helps bind the cake a bit more....The cake was a huge success. Thank you for this recipe! I have a son that is Allergic to eggs & dairy and it was nice to be able to make a cake that tastes so wonderful. I have passed this recipe on to other mothers in the same boat as me who also wish to say thank you. Best Regards from Sydney Australia.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RPERRI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1397448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-28T14:10:23.42Z",
                "reviewBody": "This is some tasty stuff! Vinegar is an interesting surprise ingredient in this but you can't taste it at all in this recipe. I have tried this cake recipe without the chocolate chips but instead of 1 cup of water I used 1 cup of Chocolate Soy Milk. This makes an incredibly moist cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Ingram",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/421373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-13T16:17:13.797Z",
                "reviewBody": "This is a ridiculously good chocolate cake recipe. I didn't tell my family this had no eggs or dairy and they all said it was amazing. For my personal taste it needs a bit of frosting the sweetness will accentuate the chocolate perfectly. To everyone who had trouble with gritty cake I would tell you that you didn't mix it enough. I whisked mine for at least 3 minutes. If it doesn't look just like normal cake batter you need to mix more if it looks oily on top with bits of crumbs inside keep mixing. This is a new keeper recipe for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NaperThriller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2615126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-12T02:03:30.18Z",
                "reviewBody": "Awesome recipe. I made this for my daughter's 1st birthday party as she has a cow's milk allergy. It was a hit! I did think there was too much oil so instead of 5 TBSP of oil I substituted 3 TBSP of oil and 3 TBSP of applesauce. When I make this again I will leave out the (non-dairy) chocolate chips as they really didn't add to the cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JenJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2344107/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-03T01:41:24.56Z",
                "reviewBody": "Tried this for my boyfriends 22nd birthday. He's allergic to everything including dairy egg nut and soy. Did not expect it to turn out half as good as it did. Surprised me when it tasted just as good if not better then a normal chocolate cake! Was a big hit and would definately make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TINKERBELL187",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1340698/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-04T22:22:16.787Z",
                "reviewBody": "I was like everyone else skeptical. But this recipe is perfect! My daughter's class has a student allergic to eggs and nuts and I have no experience with this at all. Her teacher recommended this recipe to me and it worked great! I didn't use the choco chips but the cake was beautiful. It works great for cupcakes too. The only problem I found was that no one really said how much it made. This will make the 8X8 pan listed but that is only about 12-14 good sized cupcakes. I ended up having to go back and make a whole new batch for the 24 I needed. Well worth the effort. Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cynomin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2522282/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-11T23:04:13.85Z",
                "reviewBody": "This cake was soooo yummy! I used Pillsbury Milk Chocolate Flavor icing (contains no dairy) and my family loved it! My daugher is highly allergic to milk eggs & nuts. Now I have a cake to make her when she goes to birthday parties. She can have her chocolate cake and soy ice cream and be \"one of the regular kids\" without feeling left out. It was very easy to make and economical too. Thanks so much to Bridget for sending this in!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARALEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/710813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-07T12:59:26.513Z",
                "reviewBody": "I made this as a snack for my friend whose daughters have egg allergies.  I couldn't believe how quick, easy and tasty this was!!  Both girls seemed to like it, and we adults really liked it.  It was very light and nice and chocolatey (I did use Ghiradelli choc chips).  The center did puff up, and it was well done at the minimum cook time in my oven, so I would suggest checking the cake maybe after 25 minutes so you don't over do it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYRETTIG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/118673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-29T13:39:00.293Z",
                "reviewBody": "A MAJOR FLOP! Don't waste your time or your ingredients (even though they're inexpensive ingredients). Save time and bake an apple pie or something like that which can also be egg-free dairy-free and nut-free. This cake was rediculous. The preparation was easy the batter didn't look bad but the cooking took forever and after over 40-45 minutes of just plain baking!! I ASSUMED it was done (which it should have been) and it was all gooey and gummy on the inside and bottom. I followed the directions perfectly and it turned out horrible! A WASTE OF TIME! The only person who would like this cake is a person who is utterly starving or out of their senses. Sorry but I must be honest...this cake just SUCKED! On a happier note Happy Holidays!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "TKP123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/752648/"
                }
            }
        ]
    }
]