[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
                    "name": "Custard and Cream Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12958/desserts/pies/custard-and-cream-pies/coconut-pie/",
                    "name": "Coconut Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18374/coconut-haupia-and-chocolate-pie/",
        "name": "Coconut (Haupia) and Chocolate Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F675769.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2000-05-26T01:41:52.000Z",
        "description": "This pie is a chocolate coconut lover's dream, very rich and delicious.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 (9 inch) unbaked pie crust",
            "1 cup milk",
            "1 (14 ounce) can coconut milk",
            "1 cup white sugar",
            "1 cup water",
            "½ cup cornstarch",
            "1 ¼ cups semi-sweet chocolate chips",
            "1 ½ cups heavy cream",
            "¼ cup white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Bake crust for 15 minutes, or until golden brown. Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, whisk together milk, coconut milk and 1 cup sugar. In a separate bowl, dissolve the cornstarch in water. Bring coconut mixture to a boil. Reduce to simmer and slowly whisk in the cornstarch. Continue stirring mixture over low heat until thickened, about 3 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a glass bowl, microwave chocolate chips for 1 minute or until melted.  Divide the coconut pudding evenly into two bowls. Mix chocolate into one portion. Spread on the bottom of the pie crust. Pour the remaining portion of pudding on top of the chocolate and spread smooth. Refrigerate for about an hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whip cream with 1/4 cup sugar until stiff peaks form. Layer the cream on pie; if desired garnish with chocolate shavings.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Custard and Cream Pies",
            "Coconut Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "HOKU3"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.35064935064935,
            "ratingCount": 231,
            "itemReviewed": "Coconut (Haupia) and Chocolate Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "653.7 calories",
            "carbohydrateContent": "69.9 g",
            "cholesterolContent": "63.6 mg",
            "fatContent": "42.5 g",
            "fiberContent": "2.4 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "25.6 g",
            "servingSize": null,
            "sodiumContent": "179.1 mg",
            "sugarContent": "47 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-15T23:15:52.157Z",
                "reviewBody": "this is a classic hawaiian dessert and a great recipe.  i am from hawaii and have had countless chocolate haupia pies, the most famous are from ted's bakery, but thought this tasted even better.  my husband doesn't like whipped cream, so i actually made it without that and it was still very good.  the only thing was after being in the fridge for a few days, the coconut top started to brown on the edges, but i cut it off and it tasted as good as ever.  do be careful how much chocolate you use, i didn't think the recipe called for enough so i added 1/4c more and the chocolate flavor was very strong.  this pie should have a very light and creamy flavor.  i also used a premade graham cracker crust and that turned out very well, it didn't compete with the pie's flavors, but really enhanced it.  i noticed others complained about the gelatinous texture of the coconut pudding - FYI, haupia is SUPPOSED to look like that, so have no fear.  haupia is a coconut dessert that is often called pudding but thick enough to cut into squares, almost like jello.  i know the recipe says to refrigerate for an hour but i would chill in the fridge for at least 4.  i say this because when i sampled a piece of pie after one hour, i noticed the texture of the haupia was slightly lumpy and still a little warm.  after a few hours in the fridge, the haupia and chocolate pudding was smooth in consistency.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "es",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2104407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-25T18:29:25.17Z",
                "reviewBody": "We all loved this pie! I followed the recipe exactly and it turned out beautiful. Very easy to make and it slices beautifully. I bought the pie crust ready made and this recipe filled two of the tenderflake deep dish pie crusts perfectly (hint - they are not very deep). I am making this again today and the only thing I will do differently is add a tsp of coconut extract to the white layer as I found the flavour very mild also I will put white layer in the bottom then chocolate then whipped cream so it looks more layered. I really loved this pie because it was more of a coconut cream and had none of the gritty taste from chunks of coconut which my kids don't like in other coconut pies. Great recipe - thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALBIANNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1172365/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T17:33:49.06Z",
                "reviewBody": "This must be the most delectable chocolate haupia pie on Earth. My family and I have enjoyed haupia pies from the famous Ted's Bakery in Hawaii before, but my family believes this is just as good, if not better, than Ted's!! (Which is hard to believe!)  My only advice: Be sure to refrigerate it for a few extra hours before serving. It is best when the haupia is really firm. It sliced wonderfully and it has the smoothest, creamiest texture! I recommend making a sweet graham cracker crust for it, it seems to work beautifully. Also, I read some reviews where people added coconut extract, but I did not. The coconut milk gave it plenty of that delicious Hawaiian flavor I was looking for. This is a refreshing treat that is sure to impress everyone who loves the wonderful combination of coconut and chocolate. The coconut flavor is subtle but definitely present and the amount of chocolate the recipe calls for is perfect.  And lastly, some of my family members aren't terribly fond of coconut but they still loved the pie. Five Stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookaburra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3648122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-01T17:54:06.513Z",
                "reviewBody": "This pie is amazing. I used an oreo crust and didn't bother with making whipped cream. I just used Reddi Whip and added it right before eating. I also added a tsp of coconut extract and a small handfull of coconut flakes to the plain coconut pudding. It was pretty easy to make and very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cbaknapp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1154689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-18T16:24:15.1Z",
                "reviewBody": "OMG This pie is amazing. If anyone really knows what this pie is supposed to taste like and knows Ted's Bakery, you have to try this recipe out. It's super easy & all my Hawaii friends loved it! I used a vegetable peeler and put Trader Joe's dark chocolate shavings with organic coconut flakes that I toasted myself (about 5 or more minutes in oven on 350 deg) & the chocolate & coconut mixed a bit which some said tasted like a candy topping. YOU GOTTA TRY THIS! Out of the world :D!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TKAV23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/937869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T17:45:34.653Z",
                "reviewBody": "People need to make this!! It was so good the layers are beautiful when cut and it was surprisingly light! Next time I may use a little bit less chocolate because I love the cocunut so much! Bravo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMMERSANN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/259938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-22T03:05:46.997Z",
                "reviewBody": "Made a good pie but I would like more coconut flavour. Did not want to add shredded coconut because I felt it would ruin the velvety texture of the pie. I'm not a fan of extracts or artificial flavouring. I will definitely try again next time I'll probably experiment with using twice the coconut milk and reducing it by half. Also I topped the pie with a mountain of meringue to save a butt load of the fat and calories the recipe contains with the whipped cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "laughingmagpie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3045250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-24T22:12:40.357Z",
                "reviewBody": "This recipe was a hit. I added about a cup of shredded coconut to the white layer and to the chocolate layer I added about 3/4C of slivered almonds (I'm a huge fan of Almond Joys!). It was excellent. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SALLYANNE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1255091/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-17T18:06:01.03Z",
                "reviewBody": "this recipe is AWESOME! it tastes just like teds bakery chocolate haupia pie in hawaii! thanks traci.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSMALIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1460222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-05T01:11:57.723Z",
                "reviewBody": "Not the greatest and not a lot of flavor. Only change: used milk and coconut extract instead of coconut milk. Also topped with toasted coconut. It had a strange texture but was a LOT better after chilling for a few hours. I guess after only one hour it hadn't had enough time to set.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "hazelnutty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2735179/"
                }
            }
        ]
    }
]