[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18382/christmas-casserole-cookies-i/",
        "name": "Christmas Casserole Cookies I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5134880.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2000-05-30T05:45:23.000Z",
        "description": "This is a good way to use up leftover ingredients from Christmas baking. The amounts of dates, nuts and coconut can be varied - just use a total of 3 cups.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "5 dozen",
        "recipeIngredient": [
            "2 eggs",
            "1 ¼ cups white sugar",
            "1 cup coarsely chopped walnuts",
            "1 cup chopped dates",
            "1 teaspoon vanilla extract",
            "1 cup flaked coconut",
            "¼ teaspoon almond extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a mixing bowl, beat eggs with an electric mixer. Add  1 cup sugar and beat well. Blend in nuts, dates, vanilla, coconut and almond extract. Transfer mixture to an ungreased 2 quart casserole.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated 350 degrees F (175 degrees C) oven for 30 minutes. Remove the mixture from the oven while still hot and  beat well with a wooden spoon. Cool until the mixture can be handled then form into small balls and roll in the 1/4 cup remaining sugar.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Peggy McCormack"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.857142857142857,
            "ratingCount": 35,
            "itemReviewed": "Christmas Casserole Cookies I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "120.8 calories",
            "carbohydrateContent": "16.9 g",
            "cholesterolContent": "17 mg",
            "fatContent": "5.9 g",
            "fiberContent": "1.5 g",
            "proteinContent": "1.6 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "6.6 mg",
            "sugarContent": "15 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-30T03:29:03.357Z",
                "reviewBody": "Terrific Old Fashion Recipie!\r\nOk...first I want to say that the last person who left a review for this said they barely got 3 doz out of it and that it was messy...I am wondering if you maybe covered it while it was cooking?...leaving it to sticky. Also how big of balls did you make? \r\n\r\nI made balls the size of large marbles and I got around 6 dozen...also my dough was not messy at all...I had to press it to make it stick together into balls (once pressed they stayed formed very well...not crumbly at all)\r\n\r\nAnyway...I just made these and they are very good and very christmasy :) I must say though, that when I took the \"dough\" out of the oven I was suprised at the consistancy. It was a  dry \"casserole\" (looked like dressing) that I wasn't expecting. Better words could be used in the directions to save confusion. (the directions say to beat well with a wooden spoon...it should say to break up or loosen)  I almost discarded it but I took my wooden spoon and \"beat\" it as best I could. (I just stired and got it all loosened and broken up) As long as you aren't thinking of typical cookie dough you'll be ok. \r\nAfter the mixture cooled I pressed the dough into balls and rolled them in sugar assembly line style. It was very easy but a bit time consuming...they are good though...and very Grandma-ish  :) thanks for sharing Peggy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MRSJEN2U",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1407298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-14T04:52:13.67Z",
                "reviewBody": "Peggy, thank you for posting this recipe.  I've been looking for it for years.  Folks this is a wonderful holiday cookie.  I top mine off with half a candied cherry to make them look festive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PNLewis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-20T20:31:13.677Z",
                "reviewBody": "I needed to use up some dates that I bought for a different recipe and didn't make.  And gluten free was a bonus.  These were perfect.  I did stir a couple times while baking, but I don't think I needed to.  Just at the end would work fine.  I followed another reviewers suggestion and left it overnight before working with it.  And thank you to the reviewer who formed the mixture into logs using plastic or paper and then cut off pieces to form into balls and roll in the sugar.  That made it go super fast and really contained the stickiness.  The first person to try them asked for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carolann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1137090/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-04T12:47:54.443Z",
                "reviewBody": "Thank you so much for this recipe. My Mom made these for us when we were little so they definitely are an old fashioned Christmas cookie. Mom always made them into little logs instead of the balls but they are really wonderful cookies no matter what shape you form them into. Thanks very much Peggy for posting this recipe. They will be on my cookie tray this year!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris Lidberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769936/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-12T18:44:49.08Z",
                "reviewBody": "I got this recipe more than 30 years ago from a Christmas cookie exchange party in Denver. It has become a tradition in my family to make them at Christmas. My recipe says to take the casserole out of the oven every 10 minutes and scrape the sides with a fork to keep the coconut from getting burned on the edges. (The problem is that it tastes so good that I have to eat a forkful each time I stir. Yummy!!) I usually let it cool overnight and roll them into small balls the next day. You can freeze them after you roll them into balls. I then roll them in powdered sugar not granulated. They are best just big enough to pop in your mouth not bite. (powdered sugar can be a little messy to eat.) Everyone loves these. My daughter-in-law made them with dried cherries when she didn't have dates. Yes these are messy to make....but worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Moonsong",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4843033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-14T18:59:00.877Z",
                "reviewBody": "I would make these again. They're pretty good for the little effort required. Dough was crusty on the outside and gooey on the inside when it came out of the oven but it all stirred together to form a sort of crumbly mixture. It is certainly easier to roll into balls if you wait until the dough is completely cool. I had a sticky mess when I started too soon and found it much easier when I followed the directions and waited for it to cool.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRAMMABEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1094994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-10T17:38:38.5Z",
                "reviewBody": "I usually don't goof but I still give this a 5 because it was my fault. Be careful. It calls for 1 1/4 cup sugar but you are to use only 1 cup in the batter. It made them a tad bit sweet so I added some coco powder and it reduced the sweetness a bit. I put the batter in a 9\" brownie pan and that was fine. Yes they do get a bit sticky but I just put some sugar in my palm and rolled away. It makes a large quantity and they are delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JTIMBAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/150695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-06T00:54:11.78Z",
                "reviewBody": "I made this recipe late last night expecting to write a negative review today but when I woke up I found a note from my husband on the cookie plate - \"Best Cookie in the World.\" I have to admit that they taste pretty good. My only complaint is that it's a mess to work with( I had to spray Pam on my hands to keep the dough from sticking) and it only makes barely 3 dozen. I don't see how she got 5 dozen! Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CAKELADY7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1275843/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T17:33:16.53Z",
                "reviewBody": "Honestly I expected to hate these due to the coconut but my husband likes it and I had all these odd ingredients left over after cleaning my cupboards out. They turned out really well and we ended up fighting over who got the last cookie. I used sweetened angel flake coconut candied cherries candied ginger walnuts and after the mixture had cooled down I also added chocolate chips. They were sticky to roll so I ended up using parchment paper to roll the mixture into a log and then sliced off equal portions which didn't require quite as much handling. Next time I will skip rolling them in sugar as they are pretty sweet already. I will definitely make them again as the whole family loved them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALBIANNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1172365/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-28T14:40:05.687Z",
                "reviewBody": "really good! a little time consuming though..but worth it. i wouldn't advise rolling them in sugar though...they are already sweet enough! great recipie",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1924953/"
                }
            }
        ]
    }
]