[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/250/main-dish/pizza/",
                    "name": "Pizza Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18875/chicago-style-stuffed-pizza/",
        "name": "Chicago Style Stuffed Pizza",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F526471.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2000-04-22T14:30:00.000Z",
        "description": "For this tasty Chicago-style stuffed pizza, a deep-dish pizza is stuffed with cheese, sausage, pepperoni, onions and green pepper. It's excellent!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "4 to 6 servings",
        "recipeIngredient": [
            "2 teaspoons white sugar",
            "1 cup warm water (110 degrees F/45 degrees C)",
            "1 teaspoon active dry yeast",
            "3 cups unbleached all-purpose flour, divided",
            "½ cup warm water (110 degrees F/45 degrees C)",
            "½ cup yellow cornmeal",
            "1 ½ teaspoons salt",
            "2 tablespoons olive oil",
            "¼ pound spicy Italian sausage - browned, drained and crumbled",
            "9 ounces shredded mozzarella cheese",
            "¼ cup grated Parmesan cheese",
            "⅓ cup diced pepperoni",
            "¼ cup chopped onion",
            "⅛ cup chopped green bell pepper",
            "1 teaspoon dried oregano",
            "3 cloves garlic, sliced",
            "½ cup tomato sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To Make Dough: In a small bowl, dissolve sugar in 1 cup warm water; in a separate small bowl combine the yeast, 1/2 cup flour, and 1/2 cup warm water. Mix together and let rest in bowl for about 20 minutes, until foamy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a medium bowl mix together remaining 2 1/2 cups flour with cornmeal and salt; remove half of this mixture from bowl and stir 1 cup sugar water into bowl. When well mixed, return second half of flour/cornmeal mixture to bowl and mix all together; then stir in yeast mixture. Knead dough on a lightly floured surface until smooth and elastic, about 8 to 12 minutes. Place dough in a lightly oiled bowl and cover with plastic wrap. Let rise until doubled in volume.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C).  To Make Stuffing: In a large bowl combine the sausage, mozzarella cheese, Parmesan cheese, pepperoni, onion, bell pepper, oregano and garlic. Mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Press half of the dough in the bottom and up the sides of a lightly greased deep dish pan. Bake crust in preheated oven for 4 minutes, then add the stuffing mixture to the bottom crust and cover with top crust; seal edges together with fingers, and trim excess. Slit top crust to allow steam to vent during baking; top with tomato sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake on lower rack at 450 degrees F (230 degrees C) for 45 minutes, or until crust is golden brown. Remove from oven and allow to cool for 5 minutes, then cut and serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pizza Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mark"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.152777777777778,
            "ratingCount": 72,
            "itemReviewed": "Chicago Style Stuffed Pizza",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "702.9 calories",
            "carbohydrateContent": "75.8 g",
            "cholesterolContent": "70.2 mg",
            "fatContent": "30 g",
            "fiberContent": "3.4 g",
            "proteinContent": "30.5 g",
            "saturatedFatContent": "11.8 g",
            "servingSize": null,
            "sodiumContent": "1646.2 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-19T15:50:15.2Z",
                "reviewBody": "My son goes to college at Northwestern in the Chicago area, so when he was home for a visit, I wanted to make an authentic stuffed pizza like the ones he enjoyed so much there.  This was a good recipe but we have some suggestions for improvement.  We thought the pizza dough would be better without the cornmeal and prefer our traditional pizza dough recipe.  Also, there was a complaint that there was not enough mozzarella cheese.  My sister, who lived in Chicago for years, said, \"Whatever it is, it's good,\" which suggested it was not quite like the Chicago stuffed pizzas she'd had. Also, I think it would be better to add the tomato sauce on during the last 5 to ten minutes of cooking so it retains the rich red color and does not look browned and dry, and it could use a sprinkle of parmesan on top.  As I made the recipe, my son advised me that sliced tomatoes must be included in the filling, and that was very good.  The next night, I tried it again, and this time made a sauteed fresh spinach, onion, and mushroom filling (not forgetting the sliced tomatoes), my usual pizza dough recipe, and a spaghetti sauce topping added during the last 10 minutes, more cheese, and it was given far better reviews.  Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Avocat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1968352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T09:30:18.977Z",
                "reviewBody": "I came up with a great idea! Use a springform (aka cheesecake) pan! This recipe is a little big for a 9 inch springform so don't use all of the dough. When the pizza is done all you have to do is take off the side of the pan and slide the pizza on a cutting board.  I used onion, red bell pepper, mushrooms and thawed, drained frozen spinich in my pizza. YUM This recipe took me much longer than the estimate given, but I will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KSKEMP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/116764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-07T09:37:34.223Z",
                "reviewBody": "Because I read a previous review stating that there wasn't enough dough for a deep dish pan I used the recipe that came with my pan for the crust. Everything else was the same and I loved it. My husband who isn't that fond of pizza even liked it. This is great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-22T18:35:36.577Z",
                "reviewBody": "I was born and raised 20 min. outside of chicago and stuffed pizza is my absolute fav.  this recipe is really good.  those who are comparing their results to a restaurant aren't really being fair.  most chicago restaurants have special ovens.  it makes a difference.  the only changes i would make is to add red peppers and fresh garlic and basil.  The cornmeal is essential to a crisp crust.  I get the best results using a cast iron skillet.  Thanks for the recipe. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Conchmom33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1870481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-10T15:58:40.37Z",
                "reviewBody": "My children LOVED this pizza! I am however wondering when to use the 2 tbsp of oil...as it's not stated in the directions. I am from a suburb of Chicago (born & raised) and frequent the city quite often (especially in my younger days) and I am TOTALLY going to have to disagree with MEMIAN that Chicagoans have to eat tomatoes on their pizza....wrong that's like saying that we ALL love the cold & snow. There are plenty of pizzarias that serve pizza like this here in Chicago. This is a great recipe I again used my corning ware quiche pan however I think it's about time for me to invest in a pizza pan. The kids & I thank you Mark!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-18T18:52:15.09Z",
                "reviewBody": "Too bad there is no stars! The dough is over raised and gummy and the filling isn't very creative and sort of gloppy. I've been making deep dish using Uno's and Lou Malnetti's recipe for years and the proper way to make deep dish is a richer crust cheese tiled on top Italian sausage toppings chunky seasoned crushed whole tomatoes and sprinkled with Parm.cheese. This is the pizza Chicago is known for(the top crust is an infatuation with some pizza places for variety).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Patricia Rourke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2471139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-07T09:38:15.973Z",
                "reviewBody": "i am from chicago and this is a good recipe just about as good as geodarnos they have the best stuffed pizza. a good pan to use is a basic cake pan my deepdish pizza pan was way too big for this and i also used a differnt sauce i used the \"easy pizza sauce\" recipe by Frank Sweterlitsch found on this site it makes a little more then needed but you can save the rest for your next pizza. also in the stuffed pizza you can change the stuffing and take the meat out and make it vegi or justall meat or just all chease i have had it may ways from the restraunts. vegi is my favorte. (even though i dont like vegis that much) you can put the onins green pepres and other vegis. its basicly just a pizza so put what you want in it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPOUNG45",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/606091/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-23T16:38:52.543Z",
                "reviewBody": "Fantastic! Instead of using the crust recipe included I used Jay's Signature Pizza crust in my 10 inch springform pan (it makes serving a snap.)My only change was to garnish the top with another cup of cheese a few green onions and peppers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-08T15:55:16.673Z",
                "reviewBody": "The pizza I made using the filler from this recipe (though tweaked just a bit) turned out great! I did use the \"Jay's Signature Pizza Crust\" recipe for my pizza crust and I used the \"Easy Pizza Sauce III\" recipe for my pizza sauce (though I tweaked the sauce a little by only using 2 teaspoons of oregano adding 2 teaspoons of basil and adding 1/2 teaspoon of white sugar). I also used about 14 to 15 ounces of mozzarella cheese instead of the 9 ounces this recipe called for. And I put a layer of ricotta cheese down on the pizza crust before adding the rest of the filler. Finally I only made a pepperoni pizza instead of using all of the vegetables this recipe called for. The combination of these three recipes with the few minor tweaks I made made for an EXCELLENT pizza!!! Very very tasty!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Donnie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2394173/"
                }
            }
        ]
    }
]