[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/77/drinks/",
                    "name": "Drink Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1555/drinks/liqueurs/",
                    "name": "Liqueur Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18963/portuguese-licoro/",
        "name": "Portuguese Licoro",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F399260.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-04-29T05:13:35.000Z",
        "description": "This homemade liqueur recipe originates from the island of St. Michael in the Azores. It is a family favorite at Christmas time.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT0H15M",
        "recipeYield": "2.5 quarts",
        "recipeIngredient": [
            "1 quart whiskey",
            "½ lemon",
            "4 ½ cups white sugar",
            "1 quart milk",
            "6 (1 ounce) squares unsweetened chocolate",
            "2 vanilla beans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a gallon container combine whiskey, lemon, sugar, milk, chocolate squares and vanilla beans. Keep at room temperature for 10 days, stirring once a day.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After 10 days, remove the lemon half, chocolate and vanilla beans. Insert a coffee filter into a large funnel. pour the liquid through the filter into a gallon jug. Change filter as needed. A clear yellow solution should result. This liqueur can be stored in a sealed bottle at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Drink Recipes",
            "Liqueur Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "John Pacheco"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3,
            "ratingCount": 10,
            "itemReviewed": "Portuguese Licoro",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "143.2 calories",
            "carbohydrateContent": "19.9 g",
            "cholesterolContent": "1.6 mg",
            "fatContent": "2.1 g",
            "fiberContent": "0.6 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "8.8 mg",
            "sugarContent": "18.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-12-20T06:18:37.06Z",
                "reviewBody": "my purpose -- to make cool unique x-mas gifts for my friends. the result- 50 and 8 hours WASTED no gifts lots of empty bottles. i followed the recipe perfectly mixed the ingredients stirred the liquor kept it in a dark space... at the end of 10 days it was a milky white color and smelled devine. THE PROBLEM-- when I poured it into a coffee filter it did not filter-- at all. I got 2 or 3 droplets. SO... I bought cheesecloth -- and filtered it 7 or 8 times. 2 hours later I thought \"now that I've rid it of most of the slimey milkey substance it's time for the filter.\" NO. So far i've had 1/4 cup sitting in 2 different coffee filters (the cheapest and most porous mind you) and have gleaned 1/8 of an inch of \"clear yellow liquid.\" At this rate it would take me at least a month and a weeks worth of labor to get less than a cup. I don't know what kind of coffee filters they have in portugal... So now I have a gallon's worth of a cloudy (albeit nice smelling) substance that may or may not send my friends to the hospital... Do I bottle it and say \"A Portuguese Baileys?\" I tried everything to make this work and it didn't. I wish the instructions were clearer prehaps and more specific and I feel like an idiot for chosing this ONE because I thought it would be different. Should have made the stupid coffee liquor that everyone else does. At least that would have turned out. I am VERY mortified and disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "HEYTHEREIMFAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1270415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-18T21:02:20.153Z",
                "reviewBody": "I have made this twice now and both times I ended up with a milky liquid. The first time I made it with full cream milk the second with 2%. Not wanting to dispose of a second lot without trying something drastic I squeezed the lemon and left it overnight. The following day I noticed a slight change in the liquid surrounding the lemon and decided to try filtering some (After all I had nothing to loose.) The end result is a pale yellow liquid that does in deed look and taste like what it is supposed too. Why did it not perform in the manner that I was told it would prior to squeezing the lemon I don't know. Both times I had kept the mixture stored in a dark place. Your guess is as good as mine. All I can say is squeeze the lemon at the end if all else fails.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "EmJane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1818902/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-10T18:27:26.217Z",
                "reviewBody": "I have made this recipe twice and it is divine. Try using a jelly bag over a bowl to get the liquid away from the solids. You must be patient...it takes a bit of time (like overnight). The leftover chocolate is nice in a \"grown-up\" hot chocolate drink.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RedHed52",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1806839/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-18T18:30:25.33Z",
                "reviewBody": "I am going to make this again for the holidays. As the other reviewers mentioned be patient especially with the filtering process. It does come out perfectly and tasty. It brings back memories of the Azoes - esp around the holidays - Feliz Natal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John Pacheco",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2769856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-12T18:51:22.057Z",
                "reviewBody": "I have made this recipe twice now and its great although a little tricky. I find that it takes quite a while to strain/ a couple of days. You need to change the filter often. I have used about 6 filters. Also I wet them first...this seems to help. If you try to squeeze it through it will be cloudy. Good Luck.its worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kabie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2156551/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T16:13:29.26Z",
                "reviewBody": "THis is an excelent gift decorate the bottles and filter the drink through a thin strainer NOT A FILTER. The drink stays good up to 5 months bottled so far. Do not squeeze the lemon when making.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danny4299",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4859098/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-30T08:26:22.31Z",
                "reviewBody": "First off I have no patients what so ever. So this is what I did. After ten days I strained it through a large colander then a large strainer. Then I did a few other things that failed LOL. I ended up pushing a metal coffee filter down about and ladle out the licoro in to mason jars. I filled several mason jars about full. I then put a paper coffee filter on top and attached it with the ring lid. I then flipped it upside down on top of another mason jar. Then I sat down watched football all day and changed filters every quarter. I gave it 4 stars cus it took so long to make LOL",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "maccordeiro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/maccordeiro/"
                }
            }
        ]
    }
]