[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1227/everyday-cooking/vegan/",
                    "name": "Vegan",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1664/everyday-cooking/vegan/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19000/sweet-candied-orange-and-lemon-peel/",
        "name": "Sweet Candied Orange and Lemon Peel",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1553279.jpg",
            "width": 2127,
            "height": 2127
        },
        "datePublished": "2000-05-10T12:15:17.000Z",
        "description": "With this easy-to-follow recipe, orange and lemon peel become an elegant--yet still a bit tart--sugared confection.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT4H40M",
        "recipeYield": "3 cups",
        "recipeIngredient": [
            "6 lemon peels, cut into 1/4 inch strips",
            "4 orange peels, cut into 1/4 inch strips",
            "2 cups white sugar",
            "1 cup water",
            "⅓ cup white sugar for decoration"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place lemon and orange peel in large saucepan and cover with water.  Bring to a boil over high heat.  Boil for 20 minutes, drain and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In medium saucepan, combine 2 cups sugar and 1 cup water.  Bring to a boil and cook until mixture reaches thread stage, 230 degrees F (108 degrees C) on candy thermometer, or small amount dropped in cold water forms a soft thread.  Stir in peel, reduce heat and simmer 5 minutes, stirring frequently.  Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll peel pieces, a few at a time, in remaining sugar.  Let dry on wire rack several hours.  Store in airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegan",
            "Desserts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Brenda Ward"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.690721649484536,
            "ratingCount": 97,
            "itemReviewed": "Sweet Candied Orange and Lemon Peel",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "153.9 calories",
            "carbohydrateContent": "39.9 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": "0.5 g",
            "proteinContent": "0.1 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "0.8 mg",
            "sugarContent": "39 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-20T17:56:05.85Z",
                "reviewBody": "Ok, I have now made this recipe about 6 times, and after playing around I think I perfected it.  TIPS: use a veg peeler -- not the whole rind.  I learned that the hard way. When laying it out to dry on racks, DO NOT dredge in sugar!!!  It just gets all caked on and looks gross. Just lay it out as is. Dry for about 12 hours (overnight -- no less than 12hrs.) and when it it still a little tacky to the touch, put a handful in a zip top baggy, THEN add a tablespoon or so of sugar and shake gently. Add another handful and another T. of sugar... Repeat until all of the peel is in the bag and lightly covered in sugar. Done this way they come out very pretty dusted in sugar, and nice and tender to bite into. Perfect! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PinkPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1734501/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T23:27:09.623Z",
                "reviewBody": "Here is a bitter,sweet trick. Put the peels in the sugar/water and simmer to 230 degrees F.or soft thread,this makes it less bitter,then roll in sugar,let dry,dip half in melted choclate and then in a little flaked coconut. make great for x-mas.  YOUR FAMILY WILL LOVE IT.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BONES57",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/938584/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-16T16:27:19.893Z",
                "reviewBody": "I made this recipe for my mother. And then found out these (formerly) creepy things were no relation to the awful peel found in fruitcake, a pleasant surprise - they really have a fresh fruity flavor, no bitterness at all. I washed fruit before cutting up. Then boiled about 15 minutes, changed water and repeated twice. I used 3 oranges, 1 grapefruit, 2 lemons and (after listening to my brother) 2 limes. The limes were quite difficult to get the pulp out since they were tiny and firm, pieces were much smaller than others. I think I would look for softer fruit if I decided to use lime again. But they added nice color to the mix, even though they lost their bright green color, they still were pretty. Because I used more fruit, I increased syrup recipe by 50%, could've gone to twice the recipe as it barely covered the peels. My brother said Grandma used a plate to keep peel submerged, but I didn't trust a plate in boiling syrup, so just pressed occasionally with slotted spoon. I also threw in a good handful of dried cranberries, they turned out beautiful. Now I have a ton of candied fruit drying on my table, it made a cookie sheet full about 1/2 - 3/4\" deep (will separate later for better drying).  It was very labor intensive, but did part Saturday and finished Sunday. All in all, a very successful adventure. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine James",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1599685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-10T15:07:27.467Z",
                "reviewBody": "This recipe was really good.... I plan to give the finished product away as gifts.  I filled little zip lock baggies with the orange peels, and then I added a handful of chocolate chips to the bag.  That's because as good as this recipe was, it tastes even better with chocolate (and the chocolate chips make the presentation look prettier).  Also, I'm not sure if everyone else had this same problem, but it took FOREVER for the peels to dry out.  I thought it was only supposed to take 5 hours or so, instead, it was taking 2 days... so I finally preheated the oven to 350, then turned it off and put the peels in there (kinda like meringues).  Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANCINGQUEEN117",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-28T19:59:48.513Z",
                "reviewBody": "Wasn't sure if I needed to remove the pith for this recipe or not...so to be on the safe side I did. However next time I think I will just change the water out several times while boiling them in the first step so it shouldn't be necessary. I did half lemon & half orange (In separate batches because I want to store them separately)...both are so yummy I can't stay out of them. If they weren't so labor intensive I would be eating them by the handfuls. LOL Because I removed the pith I was able to save the water from the first boiling & make orange & lemon simple syrups.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T18:32:35.293Z",
                "reviewBody": "Here are tips to making excellent peels: Boil the peels 3-4 times each for 5 minutes: you don't want the texture to be mushy. Drain and rinse after each boil. Simmer the peels in the sugar syrup for approximately an hour till the peels are translucent. I would not recommend doing the lemon and orange together I would do that separately. once you strain the syrup from the peels, save the syrup adjust sweetness and add to iced tea. DO NOT roll the peels in sugar while they are hot, they will be clumpy and use up extra sugar that will fall off. let them cool for about an hour and roll in sugar. let dry ( takes a day or two) and you can keep them in an airtight container for weeks.( You can still use them for baking after a few hours of drying.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "foodiemonster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4053953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-30T23:22:45.28Z",
                "reviewBody": "This is a really good recipe! I didn't make the lemon just the orange slices. The most difficult part was the clean-up! Remember that whatever is left of the sugar mix will dry very hard very quickly so if you're throwing any leftover mix out don't pour it down the sink!! I did it carelessly and had to boil some more water to dissolve the hardened sugar on the sink! The slices taste great though. I dipped them is melted chocolate and they are divine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWMOANIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1269632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-28T19:07:26.53Z",
                "reviewBody": "I decided to make these after picking oranges from my sister's tree. After jucing them I looked at all the orange rinds and decided to make just the candied oranges. I boiled in fresh water three times. In the interest of saving time and against my better judgment I used a reviewer's suggestion of putting them in the oven to dry. DO NOT do this as the sugar coating liquified into a pool of sugar syrup hence adding more time to the already labor intensive process. I had to backstep and rehandle these little morsels all over again in recoating with sugar to dry the long way. You need a lot of sheet pans counter space or an empty table to let them dry. In the end it was worth it! Very sweet and fruity and borderline addicting! Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "whiteorchidbloom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1477352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-29T20:08:34.66Z",
                "reviewBody": "Very easy to make but takes a lot more prep time than stated! Using a grapefruit spoon to remove the pith made it easy. I boiled the rinds 10 min., changed the water, repeated 4 times. The candy was not bitter at all. I will use this again. Thanks for the post. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476783/"
                }
            }
        ]
    }
]