[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15596/side-dish/sauces-and-condiments/sauces/dessert-sauces/",
                    "name": "Dessert Sauce Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19039/dulce-de-leche/",
        "name": "Dulce de Leche",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F30080.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2000-04-25T01:02:47.000Z",
        "description": "This is a typical sweet from Argentina.  You can eat it alone, use it to fill cakes, or serve over bananas,  ice-cream or any other dessert!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "32 servings",
        "recipeIngredient": [
            "1 gallon milk",
            "1 vanilla bean",
            "4 ½ cups white sugar",
            "1 teaspoon baking soda"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan, bring milk to a boil over medium-high heat.  Remove from heat and strain through cheesecloth.  Return to pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut vanilla bean in half and pour the seeds in the milk.  Stir in the sugar and replace the pan on medium-high heat, stirring constantly until the sugar is dissolved.  Just as the milk mixture begins to boil, stir in the baking soda.  Reduce the heat to medium, stirring constantly until mixture thickens.  When a wooden spoon drawn through the mixture leaves the bottom of the pan visible, and the mixture is light brown in color, remove the pan from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the pan in an ice bath and stir constantly until dulce de leche is cold.  Store in airtight container in refrigerator. Pour into sterile jars, and store in the refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces",
            "Dessert Sauce Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JUALONSO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.383333333333334,
            "ratingCount": 60,
            "itemReviewed": "Dulce de Leche",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "171.2 calories",
            "carbohydrateContent": "34.2 g",
            "cholesterolContent": "9.7 mg",
            "fatContent": "2.4 g",
            "fiberContent": null,
            "proteinContent": "4 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "89 mg",
            "sugarContent": "34.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-31T23:58:43.217Z",
                "reviewBody": "Previous reviewers' frustration with this recipe is probably the fault of a certain vagueness in the directions.\r\n\r\nDulce de leche is essentially a jelly based on milk instead of fruit juice; the liquid needs to be reduced to about half its original volume. It will foam up considerably when first reaching an active simmer, and again when the baking soda is added. After that, it will be relatively well-behaved for a while and the heat can be turned up, though constant stirring will still be needed to keep the bottom from burning. When it's nearly ready, it will suddenly get very foamy again (if you have a jelly/deepfry thermometer, this will be at about 220 F). After that, you can keep testing small samples on a chilled plate to see how much it stiffens up; if you evaporate it too far down, you may end up with something more like soft fudge-- still perfectly edible, but perhaps not what you had in mind.\r\n\r\nI'm not sure why this recipe suggests chilling the dulce de leche *before* placing in jelly jars, which seems like an invitation for trouble of various kinds. For a start, it's much easier to scrape it out when it's still hot. One last cleanup note-- instead of tossing the sticky pot into the sink to soak off the caramel you couldn't scrape out, pour a bit of plain milk into it and gently reheat it on the stove while stirring. Hey presto: caramel-sweet",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "WOMBAT1138",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/686463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-12T22:10:35.813Z",
                "reviewBody": "My daughter-in-law is from Argentina and taught me how to make this. She uses skim milk and splenda for half the sugar in the recipe. Instead of standing over the pot and stirring, she places a saucer upside down in the bottom of the pot. As the milk heats up, the saucer starts rocking and stirs the milk. She lets it simmer away without stirring for a few hours and it's delicious! Use it for a dipping sauce on bananas or any fruit, cake, ice cream. Unfortunately, it disappears by the spoonful eaten right from the storage jar!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marilyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2806849/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-20T01:20:59.107Z",
                "reviewBody": "I loved this recipe.  I actually made less by using 4 cups milk, 1 cup white sugar, 1/4 teaspoon baking soda and 1/4 teaspoon vanilla extract. It was done in 35 minutes. I had it on medium-high the entire time and ended up transferring it to a larger pan in the middle of it since it kept wanting to overflow. I did beat \"vigorously\" the entire time, my husband helped for a few minutes and it was done! At 20 minutes, it started turning slightly light brown and was heavier in consistency, I chose to leave it longer because I like it thick but you can probably turn it off as soon as it starts to get thick and brown if you want it runnier. I am argentinian and grew up on this so I'm thrilled to have this recipe. I made swedish pancakes that are so easy and put the dulce de leche inside...yummmmmmy!\nFor the swedish-like pancake recipe put everything in blender together:\n3 eggs\n2 cups milk\n1 1/2 cup flour\n3 Tbs sugar\n2 Tbs oil\n1 tsp salt\nBlend completely in blender. Fry very thin in hot frying pan coated with oil. Turn once, they should be lightly brown on both sides.\nPut a coat of dulde de leche and then roll them up. I like to add powdered sugar on top for presentation. Everyone will be impressed, these are delicious! Enjoy! (the swedish pancakes make about 24 pancakes, I cut this recipe in half to match the amount of dulce de leche made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2341758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-17T18:32:23.07Z",
                "reviewBody": "Great recipe for authentic dulce de leche! Be sure to use a wide deep saucepan that will allow the milk to bubble and foam a bit. I kept the mixture at a steady simmer-almost-boil the whole time and it was ready in about 45 minutes. Also the recipe should note that the dulce de leche is ready when a spoon leaves a path in the bottom of the pan that disappears after a second or two. Any longer and the dulce de leche will be too stiff after it cools.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda Fetters",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2122347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:36:06.967Z",
                "reviewBody": "Sorry Juliana this was a total waste of time ingredients and money. My son and I looked high and low for a recipe for his 6th grade spanish class project. We worked on this for nearly four hours one night and it never turned into anything but hot vanilla milk. It never thickened even after we added tapioca (after three hours of total frustration). We wasted an entire gallon of milk (whole because nothing was specified) cheesecloth and a costly vanilla bean.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "SORRYONE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/636631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-31T06:02:57.187Z",
                "reviewBody": "Alright for all the non-believers out there...I promise this recipe really does work and with a little time and a lot of patience you WILL have beautiful thick caramel-y dulce de leche. I altered this recipe a tiny bit (I didn't use a whole gallon of milk and lessened the amounts of the rest of the ingredients accordingly. When I was about 30 minutes into the final stage (stirring stirring stirring) and still just had hot vanilla milk I too was quite discouraged. I tried playing around with the heat a little and finally found that keeping it on high heat (it will constantly attempt to boil and foam over--just keep stirring) did the trick. After about 2 hours total (roughly an hour and a half of the final stirring stage) I couldn't believe my eyes when it FINALLY turned the promised golden brown and thickened beautifully. All in all the \"milk jam\" takes about 2 hours more or less of your time--and is well worth the wait. Stick it out! You won't regret it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHESMILEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1272831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-17T03:31:54.743Z",
                "reviewBody": "I tried this basic recipe and it came out great. I think that it's almost foolproof as long as you keep stirring the milk and making sure it does not overcook. I also only made the dulce de leche with 1 liter of milk (4 cups) 1 cup of sugar and a bit of vanilla extract. It took about 45 minutes from start to finish. I also added some chamille floewers (you can find them in the spices section) to give it something extra. By the way I also made a fat-free sugar free version using non-fat milk and Splenda; although it's not as fullfilling as the original it still taste pretty darn good for those of use on a diet. Try it on some vanilla ice cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jalejandrof",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2482897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-31T23:58:37.28Z",
                "reviewBody": "This recipie results in a good tasting product however it takes an extrememly long time to make (for me it was 4 1/2 hours)but worth the effort to get the traditional flavour (as opposed to the sweetened condensed milk version). This recipie made about 3 cups of dulce de leche. Vanilla extract may be used in place of the vanilla bean.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SALVAREZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/672482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:36:06.937Z",
                "reviewBody": "This recipe is not easy to make. (I needed 32 servings. No mention of what a serving size is nor how long the overall preparation and cooking time is. I stirred the mixture for over 1/2 hour at the last stage and NO thickening occurred. It never did occur for the following 1/2 hour. It sounds delicious but I never got there.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DRAGONFLYWINGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/621492/"
                }
            }
        ]
    }
]