[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2420/desserts/frostings-and-icings/cream-cheese/",
                    "name": "Cream Cheese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19108/whipped-cream-cream-cheese-frosting/",
        "name": "Whipped Cream Cream Cheese Frosting",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F292137.jpg",
            "width": 1504,
            "height": 1000
        },
        "datePublished": "2000-04-08T14:50:41.000Z",
        "description": "A decadent whipped cream and cream cheese frosting that has everyone asking if they can lick the bowl. It pipes very well.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT0H15M",
        "recipeYield": "1 frosting for a 2 layer 9-inch cake",
        "recipeIngredient": [
            "1 (8 ounce) package cream cheese",
            "1 cup white sugar",
            "⅛ teaspoon salt",
            "1 teaspoon vanilla extract",
            "1 ½ cups heavy whipping cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl beat whipping cream until stiff peaks form; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl combine cream cheese, sugar, salt and vanilla. Beat until smooth, then fold in whipped cream.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings",
            "Cream Cheese"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.713804713804714,
            "ratingCount": 1782,
            "itemReviewed": "Whipped Cream Cream Cheese Frosting",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "233.3 calories",
            "carbohydrateContent": "18 g",
            "cholesterolContent": "61.3 mg",
            "fatContent": "17.5 g",
            "fiberContent": null,
            "proteinContent": "2 g",
            "saturatedFatContent": "11 g",
            "servingSize": null,
            "sodiumContent": "90.8 mg",
            "sugarContent": "16.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-07-29T16:31:25.45Z",
                "reviewBody": "YUMMY YUMMY YUMMY!  Thank you!  A few of you have mentioned lumps in the frosting.  What works for me, I warm my mixing bowl with hot water first.  It is just enough warmth to \"melt?\" the cream cheese. Then use a chilled bowl for the Whipped cream, whip till very stiff.  Maybe why some are having trouble with it being runny. Fold together and it is absolutely scrumptious!! Awesome flavor!  So much lighter than a Cream Cheese frosting.  It won't over power the flavor of your cake.  Had many requests.\r\nMAY I ADD A HINT TO ALL WHO HAVE HAD TROUBLE WITH THIS RECIPE BEING RUNNY!  IF USING THE SAME BOWL AND BEATERS YOU MUST WHIP THE CREAM FIRST.  IF THERE IS EVEN A HINT OF THE CREAM CHEESE (OILY SUBSTANCE) IN THE BOWL OR ON THE BEATERS YOU WILL NOT GET YOUR CREAM TO \"WHIP\" UP TO A STIFF CONSISTENCY, WHICH MEANS THE FROSTING WILL BE TOO RUNNY. YOU MUST TRY AGAIN.  VERY DELICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GORNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/829509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-03-10T07:39:07.497Z",
                "reviewBody": "Superb supreme excellent wonderful spectacular delicious",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cindy3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-27T20:59:28.687Z",
                "reviewBody": "This was a real, real disappointment.  There is NO WAY you can pipe this frosting...it is soooooooo soft and runny. I am an part time cake decorator so I am very familiar with piping frosting.  I placed my bowl and beaters in the freezer and chilled my whipped cream.  It was still too soft to really ice anything other than a flat sheet cake. After reading the reviews I noted that some people said use only 1 cup of whipped cream and not 1 ½ cups.  Possibly that may have made it a little thicker.  But my point is...the recipe as written does not work.   Another reviewer suggested that this frosting can only be used on a flat, sheet type cake and I totally agree.  I used this to frost a 10 inch angel food cake and it just started to drip/slide down the sides.  It did not hold up well.....and that was after refrigerating and trying to chill/thicken it up.  I would never make this again....stick will regular, buttercream creamcheese frosting.  If you enjoy carrot cake with traditional cream cheese frosting you will not enjoy this fluffy, runny, whipped cream version.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBACUB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-29T14:35:02.327Z",
                "reviewBody": "Very Good recipe.  If you are concerned about it not being stiff enough for decorating I would do the following.  Dissolve 1 Tablespoon unflavored gelatin in 2-3 T boiling water.  Strain out lumps if necessary.  While beating the finished frosting very fast with mixer pour in hot gelatin mixture.  I know this may seem odd-beating quickly and adding hot liquid but it works.  Keep beating for a minute or two until it is well mixed (if not there will be lumps of gelatin).  The frosting will stand up much better for decorating, I've used it many times for borders, writing and other (nothing too fancy though).  The frosting will hold its shape after it is decorated for a few days.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CELLOFISH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-04T04:16:39.187Z",
                "reviewBody": "I make large special occasion/wedding cakes.  This recipe is a definite winner in the taste category, but it's only good as a filling.  I was very disappointed in it as a frosting because it has way too many airholes, and it just doesn't firm up enough when chilled to be stable (and not slide off the cake).  It does truly taste wonderful, and would be great as a fruit tart filling.  I made a double batch decorate a large cake and ditched that plan shortly after I started frosting the cake.  I read that it piped well, but I could just tell that was not going to work (and NO, my cream was not over whipped!).  Note to the person who tried to substitute powdered sugar in this recipe:  Powdered sugar is less sweet than granulated sugar, so you need 1 3/4 c powdered sugar to equal 1 c white granulated sugar.  You can't always substitute powdered for granulated, but in this case you can.  Actually, now that I think about it, powdered sugar contains 3% cornstarch which might aid in firming this recipe up a bit - I'll give it a try using powdered sugar next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRINCIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/885183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-16T18:30:40.543Z",
                "reviewBody": "I was nervous to make this based on the same concerns and problems coming up in many reviews and I was using this for a round devil's food cake. I always chill beaters and copper bowl.Chilled heavy cream also. Cream cheese was room temp.  Debated the sugar issue:10x or granulated and chose to stick to the recipe.  I beat the cream until it was almost like butter and placed it back in freezer while doing the rest.  I whipped the sugar/cheese forever and there was no grainy text. When I put it together I could see that it seemed somewhat 'loose' so decided to put it back in the freezer for another 15 min. Garnished w/strawberries as seen in the pic and placed them between a papertowel to draw up the extra moisture and not leave pink 'footprints' on my frosting, or slide down the sides from wetness.  The cake frosted fine although it is a very whippy frosting even after all the extra precautions.  I wouldn't hesitate to just whip it up and throw it on a sheet cake but would take the extra time when doing a round cake.  The taste is incredible.  I love it because it is not sugary sweet but sweet enough and complimented by the cream cheese.  I agree that this would make an A-1 fruit dip!!! Slathered liberally on the cake and still had about 1/2 a cottage cheese container left over so it does make plenty! I absolutely love this and would be great with almond extract on a cherry cake.  This is definitely a keeper.  thank you so much for such a lovely whippy non-sickening frosting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T18:51:09.62Z",
                "reviewBody": "Since I wanted to pipe the frosting onto cupcakes, and given some reviews indicated this frosting wasn't firm enough for that, I adjusted the sugar and cream to suit my needs. I used powdered sugar rather than white, and reduced the whipping cream to 3/4 cup. Once I had the frosting made I chilled it just long enough to make it of piping consistency.  This was a light, fluffy cream cheese frosting which was the perfect choice for \"Red Velvet Cupcakes,\" also from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-30T17:31:17.45Z",
                "reviewBody": "ABSOLUTELY EXCELLENT ICING AND FILLING!!!  I used this on a yellow cake for my husband's birthday and HE even said the icing made the cake.  IT TASTES WONDERFUL!!  You HAVE to be patient while you're whipping the cream because it can take a while, but you will know the cream is ready when it looks like Cool Whip.  Also, make sure to stick the beaters and the bowl (I prefer a glass bowl) in the freezer for about 15 minutes before you whip the heavy cream.  Your cream cheese MUST be at room temperature or you will end up with lumps.  You'll find that if you do it right, this icing is light enough that it spreads PERFECTLY onto your cake, not like the tubs of icing you buy in the store.  THIS ICING IS GREAT!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GARCIAGM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/474510/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-03T20:13:07.22Z",
                "reviewBody": "Wow.  This is amazing.  I just frosted some pumpkin cupcakes with it and they are perfect.\n\nI had absolutely no problem with runniness, and can imagine piping this.  It isn't really stiff, but it could happen.\n\nI did as another reviewer suggested and whipped my cream in a separate bowl than the other stuff.  I happen to have a copper bowl, which I put in the fridge to chill for maybe 30-45 minutes first.  I also kept the cream cheese cold, and I think this is important.  Just by nature of beating something like this you warm it up, so I took this straight from the fridge and used it.  I also chilled that bowl.  I whipped it for a good long time - at least five minutes.  I took little samples of it because I thought I was done, but when I tasted it I crunched on grains of sugar.  After more beating and careful folding, I was done.\n\nThis is amazing stuff.  Just a little bite from the cream cheese, but otherwise light and fluffy with a wonderful vanilla flavor.  What I don't know is how they will hold up overnight or for any length of time, so I'll post when I know that.\n\nUpdate:  I made this on a Sunday night and took the cupcakes to work.  One woman who ate one on Tuesday said it was the most amazing thing she had ever tasted and it was just wrong to moan and groan so much over the frosting.  Thought that was a pretty good review, and convinced me that the frosting held up for a couple of days!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KSDIENER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/464219/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Whipped Cream Cream Cheese Frosting",
            "description": "Cream cheese and whipped cream make an addictive frosting.",
            "uploadDate": "2012-08-29T00:17:58.836Z",
            "duration": "PT2M5.542S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd3a76121-2fd9-4901-a2ee-edb164a031a6%2F3cde7cab-6ae1-4316-ba57-fa5a450c39af%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1811420662001"
        }
    }
]