[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19148/pretzel-dessert/",
        "name": "Pretzel Dessert",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1097222.jpg",
            "width": 3264,
            "height": 2387
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This is a festive, crunchy, and fruity dessert. The pretzels in this recipe provide a crust for the filling of gelatin and pineapple.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "10 to 12 servings",
        "recipeIngredient": [
            "½ (15 ounce) package pretzels, crushed",
            "1 cup margarine, melted",
            "¼ cup white sugar",
            "1 (8 ounce) package cream cheese",
            "1 (8 ounce) container frozen whipped topping, thawed",
            "1 cup white sugar",
            "2 cups boiling water",
            "2 (10 ounce) packages frozen strawberries, thawed",
            "1 (6 ounce) package strawberry flavored Jell-O®"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine crushed pretzels, melted margarine, and 1/4 cup sugar. Press mixture into a 9x13 inch baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes. Let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, beat cream cheese, frozen whipped topping, and 1 cup sugar.  Pour over pretzel crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan, combine boiling water and strawberry-flavored gelatin; bring to a boil. Stir in frozen strawberries. When it begins to thicken, pour over cream cheese filling. Serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "chris"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.329268292682927,
            "ratingCount": 82,
            "itemReviewed": "Pretzel Dessert",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "467.9 calories",
            "carbohydrateContent": "52.7 g",
            "cholesterolContent": "22.4 mg",
            "fatContent": "28.7 g",
            "fiberContent": "1 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "11.8 g",
            "servingSize": null,
            "sodiumContent": "331.2 mg",
            "sugarContent": "50.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-22T06:53:39.427Z",
                "reviewBody": "There IS a trick to this recipe!  When you spread the cream cheese/Cool Whip layer, you need to \"seal off\" the pretzel layer.  In other words, you need to spread it on carefully and make NO corners or edges are left out where the jello layer can seep in.  If your pretzels turned out soggy (mine did the first time i did this recipe), you didn't spread the cream cheese/Cool Whip on properly.  When it comes out right (with crunchy pretzels), this recipe is delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LMWELCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/850353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-02T18:59:13.297Z",
                "reviewBody": "YEAH! My family has been using this recipe for years. I lost my copy and was SO happy to find it. One tip -- if you buy the larger container of whipped topping you can spread that on top of the strawberries for and extra layer. AND if you're feeling even more adventerous slice fresh strawberries on top. NOTES: 1. cut the water back to 1 cup -- the frozen strawberries will add the extra water. Otherwise your gelitan will be too soft. 2. make sure you seal pretzel crust with the cream cheese / whipped topping layer. Otherwise the liquid will seep into the pretzel layer and make it soggy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "producergirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/600897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-22T04:13:33.92Z",
                "reviewBody": "I make this dessert all the time and everyone always loves it. I do the jello/frozen fruit layer differently however....I pour the package of jello into a bowl and add 1 cup of boiling water to it. Then I use the quick set method on the side of the jello box by adding 1 1/2 cups of ice water to the jello and refridgerate for about 20 minutes then I add the frozen strawberries/raspberries. I wait until the jello is half set before pouring it over the well-sealed cream cheese mixture. I hope this helps some of you - I've never had my pretzel layer get soggy this way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gabsmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2279762/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-05T19:36:18.92Z",
                "reviewBody": "Im only giving this recipe 4 stars since the recipe itself isnt all that accurate. Ive made a different version of this...The final product itself though (when done right) is awesome! I just think that there are some mistakes on the directions themselves. These are the changes I made: 1 cup melted butter rather than margarine 1 1/2 packages (16oz) frozen whole strawberries thawed 1 plus 1 partial (6oz) package strawberry gelatin I started the jello right away since I knew that it would need to PARTIALLY Set in the refridgerator while I prepared the rest of the ingredients. I did use the 2 cups of boiling water but I also added about 1/4 of the 2nd package of jello to ensure it sets correctly. Once I added the strawberries (which were mostly thawed I used a potato masher to crush them a bit). I transfered the entire saucepan of jello into the fridge and began the next steps. It is also very important to complete the baking process as well as sealing off the entire layer of pretzels to prevent the jello from seeping into the pretzel. HOWEVER the seeping wont be much of an issue if the jello is partially set (like jelly/jam texture almost) and the cream cheese layer is well chilled after you layer it. Pour jello over cream cheese layer and chill at least a few more hours to set properly. The directions make it seem like this is a fast quick step process. But each step takes time in between for setting chilling and setting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "squeeziebrb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3017288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T19:52:20.123Z",
                "reviewBody": "I have a friend that makes this (her own recipe) and this one turned out nothing like hers. She said to cut the water back to 1 cup boiling water. She said there was too much water. I stirred it on the stove(water strawberries&jello) for 20 min and it just wouldn't thicken. I poured it on top of the pretzels & cheese and it leaked underneath the dessert and made the pretzels soggy. None of the jello stayed on top. When my friend makes it it looks like a perfect casserole with the jello nice and neat on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTYLEE3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/431260/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-07T18:03:59.077Z",
                "reviewBody": "THIS IS SO GOOD i DO COOL EACH LAYER AND COMPLETLY COVER PETZELS WITH CREAM CHEESE LAYER TO SEAL AN PROTECT PRETZELS FROM GETTING SOGGY. ALSO I BOIL WATER FOR GELATIN (OR FRUIT JUICE) THEN REMOVE FROM HEAT STIR IN FROZEN FRUIT AND REFRIGERATE FOR 30-60 MINS TIL IT STARTS TO FORM OR SET THEN POUR OVER CREAM CHEESE LAYER.. NEVER HAS IT EVER FAILED. I ALSO HAVE USED CHOCOLATE WHIPPED CREAM OR COCOA TO WHIPPED CREAM TO MAKE IT MORE A CHOCOLATE COVERED STRAWBERRY FUN THING. aLWAYS TAKE A CLEAN PAN HOME... NEVER ANY LEFT OVERS. SSSOOOOOOO GGGGGGGGOOOOOOOOODDDDDD THANKS FOR RECIPE",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GAMMA KATSY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1889815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-18T12:52:00.023Z",
                "reviewBody": "My middle daughter requests this dessert instead of a cake on her birthday. The key to making this dessert turn out great is to be sure and seal the cream cheese/whipped topping layer around the edges so the cooled Jello won't seep into the pretzel layer below. The sweet/salty crust is a nice compliment to the other layers. This is a winner with my family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Matlyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1823552/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-08T21:15:12.6Z",
                "reviewBody": "This recipe is FANTASTIC!! I have been making this very recipe for 10 years only I make mine with Raspberries instead of Strawberries. I think it adds a nice tartness to the dish. I am definently going to try the strawberries next time and I recommend that you try it with the raspberries! YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3159680/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T17:43:09.71Z",
                "reviewBody": "I have to say that I do love this dessert but when making it for the first time my jello did not thicken like the directions said it would. I had to place the jello and strawberry mixure in the fridge for quite a while til it set up. I was very disappointed by this clinch in the directions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3804204/"
                }
            }
        ]
    }
]