[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17278/desserts/fruit-desserts/fig-desserts/",
                    "name": "Fig Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19185/fig-bars-i/",
        "name": "Fig Bars I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2063325.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2000-03-16T22:22:39.000Z",
        "description": "These are really good if you like fig bars. These are supposed to be like the real ones.  Judge for yourself!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "1 cup water",
            "3 cups dried figs",
            "1 cup white sugar",
            "½ cup butter, softened",
            "1 cup white sugar",
            "1 tablespoon milk",
            "1 ¾ cups all-purpose flour",
            "1 teaspoon baking powder",
            "½ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak figs in the water for 1 hour. In a small saucepan, combine the fig mixture with the sugar, and cook over medium heat until thick and stewy. Remove from heat and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar. Beat in the milk and vanilla until smooth. Combine the flour, baking powder and salt, stir into the creamed mixture. Cover and refrigerate for one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough into two pieces and knead each piece about 5 or 6 times. On a well floured surface, roll the dough out to 1/4 inch thickness. Line the prepared pan with one piece of the dough. Spread the fig mixture over it, then cover with the other piece of dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 to 30 minutes in the preheated oven, until golden brown. Cool and cut into squares.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Fig Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SAUNDRA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.71875,
            "ratingCount": 32,
            "itemReviewed": "Fig Bars I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "234.1 calories",
            "carbohydrateContent": "47.9 g",
            "cholesterolContent": "12.2 mg",
            "fatContent": "5.1 g",
            "fiberContent": "3.9 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "118.7 mg",
            "sugarContent": "35.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-29T17:36:05.533Z",
                "reviewBody": "This is going to be long but I have a lot to say..I read the reviews therefore very hesitant and with good reason, but all was not a loss. I knew going in i needed to make some changes. I have a fig tree so i have been looking for things to prepare with them. I used 3 cups fresh figs with 1 cup sugar and a pinch of cinnamon and allpice and 1/4 cup water and just simmered them for an hour 1/2. Meanwhile I put the dough together by directions and discovered that it was not dough at all more of a crumbly mixture so I added a TBS. of cream and 2 eggs, this produced and very sticky dough. I refrigerated it for an hour and then floured my board and kneeded it 5 or 6 times. when i rolled it out it was very soft and when i tried to pick it up it would fall apart so i floured my already greased disn and just spread it out, once the fig mixture was nice and thick and gooey i spooned it in and then i was ready for the top layer of dough, i finally was able to fold like a business letter and laid on top of figs got the first fold over nicely and then oh my goodness the other side fell apart so I patiently pieced it all together and pinched any cracks and into the oven. 1 hour and 15 minutes. let it cool and cut into bars..My son said they are better than the ones from the store. As a possible solution to the too soft dough, I am going to try only one egg next time and see what happens.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Scott",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1029639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-15T19:42:56.747Z",
                "reviewBody": "This is a great dessert, i had no problems with it. I used 1tsp vanilla. The only changes i made after reading the reviews was...\n#1-added no water to the 3cups fresh figs, cooked on med low until thick paste. Did not kneed dough,sqeezed into 2 ball, then flattened to roll out on a lightly floured surface. When placed in dish dough was alittle larger, so after adding the fig paste, i laid the dough back over the figs, then added the top.\nI will be making this one again!!! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Winona",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3206116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-14T16:18:30.53Z",
                "reviewBody": "I used 3 cups of fresh figs and only added about one-fourth cup of water to cook the filling. Mine turned out more like a cobbler than bars but it had an excellent flavor. My husband loved it and the kids thought I had used apple (I didn't tell them any different!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAYRAY500",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/445198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-18T17:03:21.24Z",
                "reviewBody": "I just tried this recipe and I could tell the list of ingredients was missing 1 Egg and 1/2 tsp vanilla. I added the egg and vanilla to the creamed butter and sugar. After chilling the stiff, crumbly dough, instead of using a lightly floured surface, I rolled the dough into a long rope about 1.5\" in diameter between 2 pieces of plastic wrap. I cut the rope into 12\" long pieces and worked with 1 piece at a time rolling it between the plastic wrap to 3\" wide by 1/4\" thickness. I then spread the fig mixture down the middle half of the dough. Using the plastic wrap for control, I folded the front part over the mixture to the center of the filling and repeated this step for the back portion overlapping the front slightly. Pick each piece up with the plastic wrap and position on prepared cookie sheet with the seam side down. I baked for only 20 minutes and cut into serving size pieces before the bars cooled. These were delicious, a little crispier than packaged fig bars but definitely much better tasting. If you use 3 cups of dried figs, you'll have enough filling for at least 2 more batches of bars. I used 2 lbs of dried figs (1 lb is about 2 cups), put a lot of filling in mine and have leftovers for several more batches which is great because I'm making them again. This recipe is a keeper. I did make one other change, I used half white and half brown sugar in the fig mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brigitte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3968905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-14T16:18:25.793Z",
                "reviewBody": "I am hoping this turns out okay. The recipe isn't clear. The amount of vanilla to be added is not listed. The amount of sugar to be added is not broken out for the filling and the dough. This recipe should have been edited properly before posting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "CAROLRENO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/465959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-22T20:41:54.947Z",
                "reviewBody": "Tried this recipe with much trepidation as did others but was encouraged that everyone said they tasted great. And they do! However there were errors made in the recipe. First other than omitting vanilla from the ingredient list which I didn't use the ingredient list is correct. However the mixing instructions should have been more like a pastry mix rather than a cake mix. I didn't cream the butter and sugar. I added the sugar to the other dry ingredients then cut in the butter just as I would for pie pastry. Then I added the milk. I did have to add a tablespoon extra milk but that kind of variant occurs with any pastry recipe according to the humidity of the flour so I didn't think anything of that. After mixing with a fork I continued mixing the dough with my hands until it came together exactly like pie pastry. Then I rolled half out spread with the fig filling covered with the other half of rolled out pastry and pinched the edges. Turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1742660/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-03T17:28:58.793Z",
                "reviewBody": "I wanted to give this recipe the benefit of the doubt so I made it as directed. It is true the dough needs a bit more milk-not really a big deal. When I took it from the fridge it was too crumbly so I added enough milk to make it workable. Transferring it to the pan was tricky-it does indeed fall apart on the way. I pieced it together for the bottom then for the top layer I simply folded itself over on itself a few times transferred it and unfolded it. Beautiful and flawless. The finished product-wonderful taste and texture. We loved these. Thanks for sharing a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "denveryogaamy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2143228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-29T06:25:29.9Z",
                "reviewBody": "I gave this recipe four stars out of five because there are a couple ingredients missing from the ingredient list and the dough was really difficult to work with. Having said that once I got past these couple things the fig bars really turned out great! They are delicious. I had fresh figs at home so I used three cups of that and only added 1/4 cup of water and a cup of sugar for the filling. For the dough I added an egg to the ingredients listed 1 1/2 tsp of vanilla and 3 tbsp of milk. Even with these additions the dough was really sticky and difficult to roll out. I think next time I will try adding an extra egg to the dough mixture and see if it is easier to work with. Overall really yummy recipe and great for those with fig trees at home and looking for ways to use them. My family loved these and I will definitely be making them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "megan_mena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6503824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-10T00:24:00.58Z",
                "reviewBody": "These are very yummy! I made them with fig preserves instead of fresh figs. I followed the recipe for the cookie dough but added another tablespoon of milk. I did not refrigerate it. It was a dry crumble so I spread half of it on a cookie sheet lined with parchment paper and then put a sheet on top and gentle rolled it out with a rolling pin. I then spread the fig preserves on top of the dough then sprinkled the rest of the dough on top and with the parchment paper gently rolled the dough out. As soon as it came out of the oven I used a pizza cutter to trim the edges and cut into squares. These are very good cookies and do not require eggs because that would make something totally different. I will make these again with raspberry jam or apple filling next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jmofaustin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1833043/"
                }
            }
        ]
    }
]