[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19306/sukhothai-pad-thai/",
        "name": "Sukhothai Pad Thai",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F459698.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-02-15T00:35:51.000Z",
        "description": "This dish can be made with shrimp, chicken or pork instead of tofu. Look for the more exotic items in the Asian foods section at your local grocery store. Adjust the pad Thai sauce ingredients to taste.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "½ cup white sugar",
            "½ cup distilled white vinegar",
            "¼ cup soy sauce",
            "2 tablespoons tamarind pulp",
            "1 (12 ounce) package dried rice noodles",
            "½ cup vegetable oil",
            "1 ½ teaspoons minced garlic",
            "4 eggs",
            "1 (12 ounce) package firm tofu, cut into 1/2 inch strips",
            "1 ½ tablespoons white sugar",
            "1 ½ teaspoons salt",
            "1 ½ cups ground peanuts",
            "1 ½ teaspoons ground, dried oriental radish",
            "½ cup chopped fresh chives",
            "1 tablespoon paprika",
            "2 cups fresh bean sprouts",
            "1 lime, cut into wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To prepare Pad Thai sauce: In a medium saucepan over medium heat, blend sugar, vinegar, soy sauce and tamarind pulp.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make Pad Thai: Soak rice noodles in cold water until soft; drain. In a large skillet or wok over medium heat, warm oil and add garlic and eggs; scramble the eggs.  Add tofu and stir until well mixed; add noodles and stir until cooked.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in Pad Thai sauce, 1 1/2 tablespoons sugar and 1 1/2 teaspoons salt.  Stir in peanuts and ground radish. Remove from heat and add chives and paprika.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Serve with lime and bean sprouts on the side.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Nan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.31678486997636,
            "ratingCount": 423,
            "itemReviewed": "Sukhothai Pad Thai",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "618.6 calories",
            "carbohydrateContent": "64.1 g",
            "cholesterolContent": "93 mg",
            "fatContent": "34 g",
            "fiberContent": "5.3 g",
            "proteinContent": "19.5 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "1010.4 mg",
            "sugarContent": "17.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-29T16:12:20.14Z",
                "reviewBody": "Great recipe. Did mine with chicken. If you really are into authenticity, do not leave out the tamarind and substitute fish sauce for soy sauce. Leave out the white vinegar (what's that all about?), instead put 2 TBS lime. Instead of Paprika use 1 TSP (TEASPOON) chili powder (make sure you read TEASPOON correctly or else it will become EXTRA spicy). Definitely substitute PEANUT OIL (or canola) for the vegetable oil. Make sure the peanuts are unsalted, dry roasted. Chop the peanuts instead of grinding. For the tamarind, use tamarind concentrate, about 2 TBS mixed with 1/4 cup water (making tamarind juice). Substitute FISH SAUCE (I use the THAI brand) for SOY SAUCE. Soy sauce should be used for the tofu while it's frying. And it should be used as coloring for the noodles while they are in the pan/wok. Use pickled oriental radish (about 1/2 cup) this adds a great taste to the noodles. These changes were all from researching over 10 pad thai recipes. Tried these changes and it was stunning. Also, if you have shrimp paste lying around somewhere, it would be nice to add a teaspoon of it to the mix. It's great but optional.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1574051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-01T03:46:54.357Z",
                "reviewBody": "The first time I tried it, I found this dish to be quite good, though not 100% authentic. On my second attempt I substituted rice vinegar for white vinegar, peanut oil for the vegetable oil, fish sauce for the soy sauce, and added a dash of sesame oil. I also omitted the paprika and added a quarter cup of coarse chopped cilantro along with the lime wedges and sprouts. The type of noodles used is also very important. I've found that the wide rice sticks give the best results (avoid the \"angel hair\" type noodles). In my opinion these changes improved the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KitchenDude",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/810861/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-26T23:53:59.983Z",
                "reviewBody": "I used this recipe only for the phad thai sauce based on BES review. Then I combined it with the peanut sauce from the \"vegetarian phad thai\" submitted by Sarah Kai. Anyway, from trials and errors, this is how I make the really good authentic phad thai. Phad thai sauce: 1/2C white sugar, 2 TBSP lemon/lime juice, 1/4C fish sauce, 2 TBSP tamarind pulp soaked in 1/4C water. (stir all and cook in the stove) Peanut sauce for phad thai: Mix together 2 Tbsp peanut oil/sesame oil, 1 1/2C peanut butter, 1/3C water, 1/3C soy sauce, 1C coconut milk, 1 1/4C brown sugar, 1/3C lemon/lime jice. Season with 2 Tbsp garlic powder, 1 Tbsp pprika powder, and cayenne pepper to taste. (when you make the phad thai, just put in as much as you need, which depends on how much noodles you make and store the rest on the fridge/freezer). How to: Stir fry chopped garlic and chopped shallots on  the wok/skillet until slightly browned, put in minced dried shrimp, chopped salted radish/turnip, and finely chopped thai chilli peppers. Then, just put in your choice of meat, combined all. Put in the noodles, and then the phad thai sauce until all mixed, then the peanut sauce. After this point, you just set it aside, and make room to fry the eggs. Put the noodles mixture on top of the eggs until it's slightly cooked, and combined. Throw in the chopped unsalted peanuts, garlic chives, bean sprouts and julienned carrots. Garnish with beansprouts and lime wedges.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The_Martins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688715/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-16T21:11:07.81Z",
                "reviewBody": "This recipe is awesome!!!Id give it more stars if I could.Ive been going to a Thai restaurant that is almost 1 hour away from my house just to get some pad thai but I dont think ill be going there again!!This recipe is very easy to make.I only have 2 suggestions on this dish.Here they are: 1-When you decide to buy the ingredients for this dish keep in mind that there are many varities of rice noodles because of the diversity of every country in Asia(meaning all noodles are not the same over there!).Asian markets sell pad thai noodles which are intended for use in pad thai you may ask for them as Mekong Rice Stick or by their Thai name- BANH PHO MEKONG. 2-I have realized that you dont have to use the tofu in strips like the recipe suggested I dont like tofu on a regular basis but my boyfriend does.I solved this issue by just cutting the tofu in cubes and by the time I blended it with the eggs you cant really tell which is egg or which is tofu.This is a good dilemma solution for children or adults because they wont be able to notice the difference and you wont have to give up on the tofu.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENEPEREZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1437945/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-07T23:56:34.343Z",
                "reviewBody": "i'm giving 4 stars because this was really good and i'll definetly make it again but i also followed a lot of suggestions made by others so i feel the original recipe is lacking. changes i made: 1/4 c rice vinegar instead of white lime instead of tamarind (but i will use tamarind as soon as i can find it!) 1/4 c seasame oil instead of 1/2 c vegetable didn't add the salt or sugar at the end added 2 tbsp crunchy peanut butter to the sauce used fish sauce instead of soy sauce (although i added a splash of soy sauce to both the sauce and tofu/egg mix) didn't use radish but did add some red pepper flakes didn't use paprika at all and added some cilantro at the end. phew. i agree it was just a bit too sweet in the end even without adding the sugar in the third step; i think rice wine vinegar would be ideal. i also used chinese noodles personal preference more than anything. next time i would use a bit less sugar and add some green onions also as suggested. thanks nan - it was still great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lockesmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1719054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-03T05:30:53.5Z",
                "reviewBody": "For those who want to cook proper and authentic Pad Thai, please read advice from Bes (reviewed on Apr. 29, 2006). The changes she mentioned are absolutely correct. I'm Thai and I've eaten Pad Thai a thousand times since I was little. The dish should be quite sweet, a bit tangy, and salty. For fully authentic way of serving this, sprinkle it with dried shrimp, chopped roasted peanuts, a bunch of fresh chive, a pile of fresh bean sprouts and a lime wedge on the side. If you google the images, you'll know what I mean.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alyssa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2275398/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-19T04:37:21.107Z",
                "reviewBody": "This is a very good recipe. Much better than some of the others listed here at least. I did make a couple changes to make my phad thai super tasty: first soy sauce is not right here- it's WAY too overbearing - Thai cooking is about delicate flavors and bright notes soy is just too earthy. Instead I used it to darken up the sauce - it adds a nice \"cooked\" color. I also prefer fish sauce in my Thai cooking so for the quantity listed for the soy I used fish. I'm still searching for my favorite brand the one I used this time was Caravelle - it had a subtle fish flavor and wasn't nearly as salty as other brands I have tried. I also disagree with the amount of sugar used - I used less than half the amount and it tasted great! The last missing ingredient was real HEAT! Not that radish stuff! I used dried chili flakes as well as chili paste. Have fun!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LE_COOKIE_MONSTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T21:01:09.547Z",
                "reviewBody": "This was the first Thai dish that I have ever made that came even close to tasting authentic. I used tamarind concentrate that I found at an asian market. I couldn't find any ground oriental radish (daikon) so I used 1 1/2 tsp of Thai seasoning (from the grocery store) instead. I used a pound of tofu and omitted the eggs and used turbinado sugar to vegan-ize this recipe. Even with all of the substitutions the dish turned out very well. It was even great the next day for lunch! NOTE: I've found that cooking the noodles according to package directions and then adding the cooked noodles to the pan works best. Next time I think I'll add some mushrooms broccoli and carrots just to give it a bit more flavor and texture (without eggs it lacks some variety). I highly recommend this easy and versatile recipe! Be sure to use a BIG wok or skillet!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber Waite",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/386879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T21:01:26.687Z",
                "reviewBody": "This is a delicious recipe. I made it last week for my boyfriend (first real thai food I've ever attempted) and it was fantastic! If you want to do a vegan version you can add a bit more tofu and some more peanut and radish and take out the egg. Also I had some trouble finding tamarind pulp even at the asian grocery store so if you can't find it try a tablespoon of crushed fresh lime or even lime juice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PROTOZOA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/578082/"
                }
            }
        ]
    }
]