[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
                    "name": "Custard and Cream Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12958/desserts/pies/custard-and-cream-pies/coconut-pie/",
                    "name": "Coconut Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19715/coconut-cream-pie/",
        "name": "Coconut Cream Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1488247.jpg",
            "width": 1936,
            "height": 1936
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "A rich and smooth pie. It takes a half hour to make, but is well worth the effort! Top with whipped cream and toasted coconut, if desired.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT4H55M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup white sugar",
            "½ cup all-purpose flour",
            "¼ teaspoon salt",
            "3 cups milk",
            "4 egg yolks",
            "3 tablespoons butter",
            "1 ½ teaspoons vanilla extract",
            "1 cup flaked coconut",
            "1 (9 inch) pie shell, baked"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, combine sugar, flour and salt over a medium heat; gradually stir in milk. Cook and stir over medium heat until the mixture is thick and bubbly. Reduce heat to low and cook 2 minutes more. Remove the pan from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a strainer over a clean mixing bowl; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the egg yolks slightly. Gradually pour 1 cup of the hot custard mixture into yolks, whisking constantly. Return the egg mixture to the saucepan and bring the entire mixture to a gentle boil. Cook and stir 2 minutes before removing the pan from heat. Immediately pour custard through the strainer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir butter, vanilla, and coconut into the hot mixture. Pour the hot filling into the baked pie crust. Cool and refrigerate until set, about 4 hours.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Custard and Cream Pies",
            "Coconut Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mary"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6976744186046515,
            "ratingCount": 430,
            "itemReviewed": "Coconut Cream Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "398.5 calories",
            "carbohydrateContent": "51.1 g",
            "cholesterolContent": "121.2 mg",
            "fatContent": "18.8 g",
            "fiberContent": "1.5 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "9.1 g",
            "servingSize": null,
            "sodiumContent": "293.4 mg",
            "sugarContent": "32.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-04-09T14:43:18.7Z",
                "reviewBody": "Coconut pie is my husbands favorite and I have used many different recipes over the years and have learned a few tips over the years that help cut down on the amount of time you spend standing over the stove.  When I make any custard style pie, I use a stainless steel mixing bowl that will serve as a double boiler, that will fit over a large saucepan, like an 8 quart pan.  Use just enough water so the the bottom of the mixing bowl is not touching the water. Bring water to a boil.  Using a microwave safe 1 qt measuring cup, heat milk until scaled (tiny bubbles around rim of cup). Be careful not to let milk boil.  Add sugar, flour and salt to the stainless steel mixing bowl stir to combine, set bowl over boiling water, add the hot milk and stir with a whisk until smooth.  It only takes a few minutes for the mixture to thicken and then you can follow the remainging part of the recipe.\r\nYou must be careful as the hot steam will escape for the sides of the bowl and you can get burnt if you are not careful. Use a pot holder or dish towel to hold on the mixing bowl while you stir it.  Since using this method, I've never burnt or scorched any filling that I was making and cooking time has been cut in half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LOYAMADA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/741133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-13T05:12:40.097Z",
                "reviewBody": "Coconut cream pie is by father's favorite pie and this is the second time I have used this recipe.  I selected this recipe because it makes a bigger pie and I like to use a deeper pie plate.  My family (& especially my dad!) just love it.  I used whole milk and the filling is so creamy - really delish!  I increased the coconut to one & a half cups and felt it had plenty of coconut taste.  I used the 4 egg whites to make a meringue topping, sprinkled coconut over the top and browned it in the oven.  It looked great and tasted better.  Thanks Mary!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/258041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-06T00:11:23.107Z",
                "reviewBody": "A fantastic coconut cream pie.  I made my crust with 1 1/2 cups graham cracker crumbs, 1/3 cup white sugar and 6 tbsp melted butter, mixed and pressed into a pie plate and baked @375 for 7 min. \r\nKeep stirring the mixture while it's on the stove or dark-brown blobs will end up in the pie and you'll have a very messy pot to clean.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NURSECHRIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1043360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-30T22:37:32.373Z",
                "reviewBody": "It was very good, but it did not really have a coconut taste... I made 1 change: instead of using 3 cups of milk, I only used 2 cups + 1 cup coconut milk. If you don't expect a strong coconut taste, it is a very good pie. Be sure to use a non stick pan. I used stainless steel and the sugar burnt at the bottom, giving the pie a slight burned taste. That wasn't the recipe's fault though. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "XVELVETX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1164899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-19T21:01:05.17Z",
                "reviewBody": "Coconut Cream pie has always been my favorite, and this recipe was FANTASTIC!  Of course, I am not the greatest cook, and I managed to bust the crust and cooked the wrong part of the egg (ha ha) before re-reading the recipe, but the filling ended up tasting incredible, despite the chef!  :O)  I also fixed some whipping cream with 4 tablespoons of white granulated sugar for topping.  I know that I am probably the ONLY person dumb enough to add the whipped topping right away (before the pie cools, in which case it melts into a cream), but just in case I'm not, a word to the wise:  WAIT UNTIL THE PIE COOLS before you add the whipped cream topping.  My pie wasn't really very attractive looking, but TALK ABOUT TASTY!!!!  I highly recommend this recipe to anyone who loves coconut cream pies.  Now I have to go make my \"common sense\" notes so that I don't rough up the crust or mess up the eggs again next time I try this recipe.  It usually takes me two tries on a new recipe anyway. I guess we'll have to eat the practice pie tonight and try again tomorrow! OH DARN!! HA HA",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thepeachpeddler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/620327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-29T22:11:40.247Z",
                "reviewBody": "I took previous posters advice and used 1/3 cup cornstarch in place of flour, used 1 1/2 cup milk and same of coconut milk, added 1 tsp of coconut extract and toasted the coconut. I also didn't have much time for the pie shell so I just crushed graham crackers and added some melted butter and sugar pressed into a pie pan. This coconut cream pie was raved about and didn't last past Thanksgiving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Charlie1001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1645449/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T05:05:17.403Z",
                "reviewBody": "I like a recipe that works the FIRST time. I made this pie exactly as the recipe stated and it turned out perfectly. It easily filled my pie crust to the brim, set up beautifuly and tasted great. I topped it off with my own recipe for cream: 1 cup of cold heavy cream, 3 Tbs of powdered sugar, 1 large marshmallow melted and mixed in. I garnished with toasted coconut. Even the first slice looked gorgeous when I served it. I would definitely recommend this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ASHBARJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/325983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T05:05:53.797Z",
                "reviewBody": "Oh my! I had never made a coconut cream pie before and this one was definitely a success. I made it with two cups skim milk and one cup cream and it was incredibly rich. You could only eat a small sliver. Next time I will use only milk and I think it will be plenty rich and creamy and lower fat. My recommendation is to make this the night before. Because the coconut is not cooked with the custard the custard does not have a coconut flavor right away. While it sits overnight the coconut has a chance to re-constitute plumping it up and infusing the pie with coconut flavor. I topped it with whipped cream and toasted coconut.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NICEGIRL512",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/651907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-26T18:41:22.02Z",
                "reviewBody": "Best coconut pie I have ever had. Which is saying alot sence I thought my mother in law always made the best I had tasted. It was creamie and rich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALL FOR MY BOYS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/285311/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-08T19:23:41.020Z",
                "reviewBody": "I made this for someone else who loves coconut cream pie and I was told it is a bit on the sweet side compared to others.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "schneib",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4665701/"
                }
            }
        ]
    }
]