[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17530/desserts/fruit-desserts/peach-desserts/",
                    "name": "Peach Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19897/old-fashioned-peach-cobbler/",
        "name": "Old Fashioned Peach Cobbler",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F08%2F02%2F9227157-old-fashioned-peach-cobbler-photo-danielle-k-sq-crop-2000.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2000-07-27T16:15:19.000Z",
        "description": "I was searching for a peach cobbler recipe that reminded me of the yummy dessert I ate as a young girl in Southeast Missouri. No shortcuts here. Fresh peaches and homemade crust...but worth every minute! Absolutely delicious served warm with vanilla ice cream! Never any leftovers with this dessert!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "18 servings",
        "recipeIngredient": [
            "2 ½ cups all-purpose flour",
            "3 tablespoons white sugar",
            "1 teaspoon salt",
            "1 cup shortening",
            "1 egg",
            "¼ cup cold water",
            "3 pounds fresh peaches - peeled, pitted, and sliced",
            "¼ cup lemon juice",
            "¾ cup orange juice",
            "½ cup butter",
            "2 cups white sugar",
            "½ teaspoon ground nutmeg",
            "1 teaspoon ground cinnamon",
            "1 tablespoon cornstarch",
            "1 tablespoon white sugar",
            "1 tablespoon butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, sift together the flour, 3 tablespoons sugar, and salt. Work in the shortening with a pastry blender until the mixture resembles coarse crumbs.  In a small bowl, whisk together the egg and cold water. Sprinkle over flour mixture, and work with hands to form dough into a ball. Chill 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Roll out half of dough to 1/8 inch thickness. Place in a 9x13 inch baking dish, covering bottom and halfway up sides. Bake for 20 minutes, or until golden brown.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan, mix the  peaches, lemon juice, and orange juice. Add 1/2 cup butter, and cook over medium-low heat until butter is melted. In a mixing bowl, stir together 2 cups sugar, nutmeg, cinnamon, and cornstarch; mix into peach mixture. Remove from heat, and pour into baked crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll remaining dough to a thickness of 1/4 inch. Cut into half-inch-wide strips. Weave strips into a lattice over peaches. Sprinkle with 1 tablespoon sugar, and drizzle with 1 tablespoon melted butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 35 to 40 minutes, or until top crust is golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Peach Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ELETA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.627142857142857,
            "ratingCount": 700,
            "itemReviewed": "Old Fashioned Peach Cobbler",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "337.8 calories",
            "carbohydrateContent": "43.7 g",
            "cholesterolContent": "25.6 mg",
            "fatContent": "17.6 g",
            "fiberContent": "0.6 g",
            "proteinContent": "2.3 g",
            "saturatedFatContent": "6.6 g",
            "servingSize": null,
            "sodiumContent": "176.9 mg",
            "sugarContent": "29.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-20T21:57:11.127Z",
                "reviewBody": "Okay, after reading about a hundred posts on this recipe, I've taken all the suggestions and put them together to make an excellent Peach Cobbler that was not runny at all. The filling was smooth and luscious! Here's  the list: 12-13 peaches  (about 4 lbs. I found that 3lbs wasn't enough), 1/2c brown sugar, 1/2c white sugar, 1/4c lemon juice, 1/4c orange juice, 3.5 T cornstarch, 2 tsp vanilla, 1/8 tsp nutmeg, 1 tsp cinnamon, 1 1/2 crust recipe (use only 1 egg and 1/4 c water), and butter instead of shortening. After baking I put it under the broiler for a minute to brown it up a bit. Although the crust/topping was delicious, I might try a more traditional crumb topping next time with flour, oats, butter and brown sugar. I think the ideal combination would be using one recipe of the crust for the bottom, then putting the crumb topping on the top. Both are delicious, it's a matter of what your taste is. Please see my photo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TWITCHERY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1386485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-09T01:31:55.7Z",
                "reviewBody": "I thought this recipe was EXCELLENT.  I did make a few changes after reading several of the reviews.  I did double the crust recipe-it was a bit much-I could have done just fine with a batch and a half.  I used a 1/2 cup of shortening and the remaining amount was butter.  I used approxiamtely 4lbs of peaches-as far as I'm concerned, you can never use enough fruit in pies.  I used 1/4c lemon juice and 1/4 c orange juice.  I used 4 tablespoons of cornstarch, one teaspoon of vanilla and a sprinkle of ginger.  I also used 1/2 cup of white sugar and 1/2 cup of brown sugar as I used fresh fruit that was sweet enough.  I also made the fancy lattice work on the top as suggested by French Blue-it came out gorgeous.  I topped mine with some whipped cream and a sprinkle of cinnamon on top.  The crust was flakey and delicious and the filling was to die for.....take a look at my picture...and try this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Daisy Mae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34929/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T22:10:25.757Z",
                "reviewBody": "This is absolutely great.  I've always been a double crust cobbler girl, but it's hard to find that.  I've never made a cobbler before although I consider myself an excellent cook and baker.  I was skeptical about the orange juice and fully intended to follow the crust recipe and combine it with another peach filling recipe.  I'm so glad I didn't.  This was absolutely great!!!  I kept raving about it.  My husband loved it too.  I will be making this again and again.  I did substitute the shortening for butter.  I don't stock shortening.  And I didn't use two sticks.  It was more like 1 1/2 sticks for the cobbler.  Baking the bottom crust first made this the perfect cobbler.  I'll be using this crust for all future cobblers.  I'm making blueberry next (after I make the peach again).  Thanks for a great cobbler.  I didn't do the lattice top either.  I just cut 1 1/2 inch long strips and placed over the top of the peaches.  I just couldn't see myself doing a lattice top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GodMadeMePretty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/879516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-19T01:21:00.217Z",
                "reviewBody": "Great dessert.  Instead of doing the lattice on top of the hot peaches, dust the bottom side of a cookie sheet and do it there.  Then you can just slide it on top of the fruit and finish it off.  This is a great trick with pies, too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "patty crocker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/295707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-22T06:56:16.72Z",
                "reviewBody": "Wow...scrumptious!  This is really more like a giant peach pie than a traditional cobbler -- and that is more than fine with me since I prefer pie crust to spongy cobbler crust.  The crust here...oh my goodness...to die for!  I made 1-1/2 times the crust recipe, and it was just the right amount to split evenly between bottom and top layers.  I took a cue from another reviewer's (FrenchBlue) photo.  She placed the strips atop the pie in three alternating diagonal layers.  Looks so beautiful that way!  I don't think I would've had enough dough to do that with a single recipe.  I measured the peaches in the scale at the grocery store and bought 3.75 lbs.  Ended up being just the right amount.  It took 9 med-large peaches to reach that weight.  I used the full 1/4 c. lemon juice but reduced the OJ to 1/4 c. as well.  Hubby and I both thought the full amount, while it probably would have been good, might've overpowered the delicious peach flavor we were going for.  I just made up the difference in water.  Also added 2-1/2 TBS cornstarch.  Filling was juicy without being runny.  Thank you so much for this fabulous recipe...we loved it! :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DISCOBUNNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/153632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T08:45:50.467Z",
                "reviewBody": "I have tried about eight different recipes in the last few months in an effort to find a great cobbler. My father-in-law never comments on my cooking, but said after trying this one \"You need to write this recipe down! This is really good.\"\r\nMost are too sweet, but this one is just right and the crust is wonderful. Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TALACHEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/347100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T18:16:52.653Z",
                "reviewBody": "This recipe is great for just the crust alone. I would suggest cutting the sugar in half as it is awfully sweet. Also I would add one tablespoon of corn starch to make it thicker and maybe a teaspoon of Mexican vanilla. It is wonderful and can even be \"better\" with a little tweaking. You need to make sure you roll the dough really thin as there is barely enough dough for the bottom of the pan as well as the lattice work. Enjoy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danny Odom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T18:18:17.67Z",
                "reviewBody": "I am not a baker and have never successfully made my own dough!  This recipe was excellent.  I served it to my husband and his eyes lit up!   He requested this, along with other recipes from this site, for father's day. I also used canned peaches (drained and washed) and also added some extra cinnamon, brown sugar and vanilla (to suit my family's tastes).  I also used a crumb topping (made with yellow cake mix and butter).  The first time I made it I did the lattice topping.  As with all the other reviews, I suggest making some extra dough.  Otherwise, this recipe was absolutely excellent.  Try it you won't regret it...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1MOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/653000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T08:09:11.96Z",
                "reviewBody": "My family really loved this cobbler even the picky ones. I really liked the crust too. Instead of doing a lattice top I used a small cookie cutter (about 1 1/2 inch) and placed the cut crust all over on the top randomly. After reading other reviews that said to reduce the amount of sugar added to the peaches let me say that it's not too sweet if you put whipped cream on top. If you eat it as is coming out of the oven and you don't like things very sweet you may want to cut down on the amount of sugar but for me and my family it's perfect just as is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIANE LANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/243252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T22:09:44.007Z",
                "reviewBody": "I picked this recipe because it had a five star rating. My husband is a big peach cobbler fan and I wanted to really wow him. I was not happy with the way this turned out. It was too runny/watery/liquid the crust reminds me more of a pie and it was too sweet for my taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LOSGARCIAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/894752/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Old Fashioned Peach Cobbler",
            "description": "Nutmeg and cinnamon flavor fresh peaches wrapped in flaky pastry.",
            "uploadDate": "2013-12-20T19:46:11.539Z",
            "duration": "PT3M58.363S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6e546fc1-4d8f-46bf-8ea5-eeabace352db%2F3dd2f0c7-0716-44b0-a0ec-3453b77a6db1%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2955880535001"
        }
    }
]