[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/718/world-cuisine/european/austrian/",
                    "name": "Austrian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20137/austrian-peach-cookies-ii/",
        "name": "Austrian Peach Cookies II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F42503.jpg",
            "width": 1916,
            "height": 1356
        },
        "datePublished": "2000-07-18T23:25:14.000Z",
        "description": "Cookies are shaped like miniature peaches and filled with jam and chocolate.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "¾ cup unsalted butter",
            "1 cup white sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "3 ¾ cups all-purpose flour",
            "1 teaspoon baking powder",
            "½ cup milk",
            "¼ cup semisweet chocolate chips",
            "⅔ cup apricot jam",
            "⅓ cup ground pecans",
            "2 teaspoons rum",
            "¼ cup water",
            "1 cup white sugar",
            "2 drops red food coloring",
            "4 drops yellow food coloring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and 1 cup sugar until smooth. Beat in the eggs, one at a time, then stir in the vanilla. Combine the flour and baking powder, stir into the creamed mixture alternately with the milk. Roll dough into 1 inch balls and place balls 1 inch apart onto an ungreased cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 20 minutes in the preheated oven, until cookies start to brown on the bottom. remove from baking sheets and cool on wire racks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When cookies are completely cool, carve a hole into the flat side of each cookie using a small knife. Save the crumbs. In a heatproof bowl, melt chocolate chips in a microwave or over a pan of simmering water. Stir frequently until smooth. In a medium bowl, stir together the melted chocolate, apricot jam, ground pecans, rum  and reserved crumbs until well blended. Fill the carved out centers of the cookies with the chocolate mixture and stick two cookies together with the filling sides in to form a peach shape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the remaining cup of sugar into two bowls. One bowl should contain 1/4 cup and 3/4 cup in the other. Color the small bowl with the red coloring by working it in with your fingers. Color the other bowl with the yellow coloring and add a pinch of the red sugar to it to make a peachy color. Brush each cookie with water and roll them first  in the yellow sugar, then dip a part of them into the red sugar to give them a blush. Insert plastic green stems into the top for a realistic effect.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Austrian"
        ],
        "recipeCuisine": [
            "European",
            "Austrian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Barbara"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.25,
            "ratingCount": 8,
            "itemReviewed": "Austrian Peach Cookies II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "937.3 calories",
            "carbohydrateContent": "155.6 g",
            "cholesterolContent": "124.6 mg",
            "fatContent": "31.3 g",
            "fiberContent": "3.1 g",
            "proteinContent": "12 g",
            "saturatedFatContent": "17 g",
            "servingSize": null,
            "sodiumContent": "111.4 mg",
            "sugarContent": "87.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-31T20:59:29Z",
                "reviewBody": "Ooooh, these are darling!  They look just like little peaches and impress everyone! However, I didn't get them right the first time.  All that ball rolling got the dough too warm and they flattened in the oven too much to work as peach halves. When you roll the dough, put it into the freezer for twenty minutes.  Then they only flatten to hemispheres, which is just what you want.  The other change I made was the stems. Using plastic seemed fakey on such a fancy little cookie, so I used a gumdrop cut into a triangle and then stuck it into the end of the \"peach\" with a whole clove.  They were adorable and fun to make with the children, who delighted in rolling them in colored sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NITROJEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/705795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-22T22:41:20.657Z",
                "reviewBody": "I've been making this recipe every year since 1972 when it was published in Sphere magazine as part of a collection of wonderful foreign cookies. They are a treat to the eye and the palate and make a wonderful gift for giving. Many readers might like adding 1/2 tsp of salt to the cookies to better suit an American taste. In addition and to add more flavor to the filling use a full Tablespoon of rum or substitute 1 1/2 to 2 tsp rum flavoring for an even stronger flavor. For a richer moister filling I use only 1 1/2 cups of the reserved crumbs in the filling making another half batch if you don't have enough. Using a spray bottle to lightly wet the cookies before coloring with the sugars is helpful as is a friend or two to help in a production line. I like coloring my sugars in zip bags; your children will like squishing the colors in for you. You'll get a prettier look by dipping in the red first and then roll in or sprinkle with the peach color sugar. I also make the stems and leaves in the following manner: Roll green gumdrops 1/8 inch thick on well-sugared board. Cut into leaf shapes. Make small hole in stem end of leaf. Insert small piece of cinnamon stick through hole in gumdrop and into seam of \"peach.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Connie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2991088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:50:44.013Z",
                "reviewBody": "This is a great little cookie.I've tried the Italian versian and it's exactly the same.Everyone thought that they were cute and resembled bums so they are now called the bum cookies at my parties. thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZULMIDA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/623145/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-28T20:51:12.597Z",
                "reviewBody": "I LOVED this recipe!!! The cookies were so cute they looked just like little peaches and were so tasty! I substituted strawberry jam and 1 tsp of rum extract because I didn't have what the recipe called for. I highly reccomend chilling the dough before baking. I also used a fresh chocolate mint leaf in place of the fake stem which was great because then the whole thing was edible!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ruthie24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2584570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-10T00:05:16.33Z",
                "reviewBody": "My Brother-in-law made the very odd request of Austrian Peach Cookies for his birthday dinner dessert. I am ALWAYS up for a cooking challenge and since I had never seen heard of or tasted these cookies before I turned to good ol' allrecipes who never fails me:) There are two recipes for these cookies on here. Both of the cookie doughs were similar so this was the exact dough recipe I used. My BIL also requestd that I make some with a strawberry jelly filling so I combined a 1/2 cup jelly with 2 or 3 tbsp of the cookie crumbs 1/4 tsp cinnamon and 1/4 tsp nutmeg which filled about 10 cookies. Of the three versions I made the filling in Ausrtian Peach Cookies II was our least favourite. The Austrian Peach Cookie filling recipe on here was our favourite and the strawberry jelly filling was second. I photo journalled my making of these cookies in hopes that I could help someone who was intrigued by the recipe but intimidated to try it. I highly recommend diving head first into a recipe that you have never attempted before. The best thing that can happen is an incredible epicural discovery that is received with high praise leaves you feeling proud of your accomplishment. The very worst thing that can happen is you now have an epic tale of cooking disaster to tell which will humour all who hear it for ages:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "A & R's Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2953283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-23T14:23:04.513Z",
                "reviewBody": "WOW. If you need a special dessert this is it. Time consuming but worth every minute. Omitted rum in filling (didn't have any) and used real mint leaves to decorate each cookie. The end result looked and tasted as if it came from a European pastry shop. Please make these beautiful things! You won't be sorry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "trufflebun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1731932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-16T00:04:33.577Z",
                "reviewBody": "These cookies were supposed to be in my cookie jars Im giving out for Christmas but they are not going to be. They are very dry. The filling definitely needs more rum or something else to give it more flavor. Also I baked them 20 minutes and they seemed to be raw inside when I carved tho holes into them even though the bottom was nice brown. I dont think I do these again even though the presentation with sugar looked great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Zuzana Halbgewachs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1578150/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-25T02:46:31.06Z",
                "reviewBody": "Great for Easter.... Left out the brandy so the kids could also enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9898089/"
                }
            }
        ]
    }
]