[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/346/bread/pastries/",
                    "name": "Pastries",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1306/bread/pastries/cinnamon-rolls/",
                    "name": "Cinnamon Roll Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20156/clone-of-a-cinnabon/",
        "name": "Clone of a Cinnabon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F04%2F08%2FClone-of-a-Cinnabon-by-abrooks-2000.jpg",
            "width": 2000,
            "height": 1333
        },
        "datePublished": "2000-06-09T00:10:09.000Z",
        "description": "You have got to try these. The first time I made them, I thought of how much money I could save by making my own!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "12 rolls",
        "recipeIngredient": [
            "1 cup warm milk (110 degrees F/45 degrees C)",
            "2 eggs, room temperature",
            "⅓ cup margarine, melted",
            "4 ½ cups bread flour",
            "1 teaspoon salt",
            "½ cup white sugar",
            "2 ½ teaspoons bread machine yeast",
            "1 cup brown sugar, packed",
            "2 ½ tablespoons ground cinnamon",
            "⅓ cup butter, softened",
            "1 (3 ounce) package cream cheese, softened",
            "¼ cup butter, softened",
            "1 ½ cups confectioners' sugar",
            "½ teaspoon vanilla extract",
            "⅛ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press Start.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After the dough has doubled in size turn it out onto a lightly floured surface, cover and let rest for 10 minutes. In a small bowl, combine brown sugar and cinnamon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough into a 16x21-inch rectangle. Spread dough with 1/3 cup butter and sprinkle evenly with sugar/cinnamon mixture. Roll up dough and cut into 12 rolls. Place rolls in a lightly greased 9x13 inch baking pan. Cover and let rise until nearly doubled, about 30 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake rolls in preheated oven until golden brown, about 15 minutes. While rolls are baking, beat together cream cheese, 1/4 cup butter, confectioners' sugar, vanilla extract and salt. Spread frosting on warm rolls before serving.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pastries",
            "Cinnamon Roll Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marsha Fernandez"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8150641432744825,
            "ratingCount": 7873,
            "itemReviewed": "Clone of a Cinnabon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "502.3 calories",
            "carbohydrateContent": "77.3 g",
            "cholesterolContent": "64.1 mg",
            "fatContent": "18.5 g",
            "fiberContent": "2 g",
            "proteinContent": "8.2 g",
            "saturatedFatContent": "8.7 g",
            "servingSize": null,
            "sodiumContent": "387.7 mg",
            "sugarContent": "42.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-03T08:51:34.163Z",
                "reviewBody": "Someone wanted to know how to make this without a bread machine, here is how. Dissolve the yeast in the warm milk in a large bowl. Mix in the sugar, margarine, salt, and eggs. Add flour and mix well. Knead the dough into a large ball, using your hands dusted lightly with flour. Put in a bowl, cover and let rise in a warm place about 1 hour, or until doubled in size. Then pick up with rolling out the dough. Hope this helped!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANDYTAMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/797083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T03:07:55.827Z",
                "reviewBody": "These are fantastic cinnamon rolls but I have yet to see people suggest the key part to these rolls!  As soon as you take them out of the oven you need to flip the pan over which allows all of the yummy cinnamon drippings to recoat the rolls.  I have heard a lot of you state that the filling has simply run out of the rolls.  This alleviates that and makes them to die for.  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER WOODARD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-05T05:35:03.24Z",
                "reviewBody": "These are fantastic! It's a fairly quick and easy recipe as far as cinnamon buns go, and you definitely DON'T NEED A BREAD MACHINE to make them.  Just use an 8 gram pack of dry active yeast instead of the bread machine yeast and knead the dough with your hands and a rolling pin. Then heat the oven to 200 degrees and then TURN IT OFF. COVER the dough with a moist paper towel over the bowl, and put in the oven for around 1 hour (the dough will almost double in size) then roll out and fill.  Use dental floss to cut buns into 12 pieces (1 and 3/4 inch thick). Also, some reviews mentioned that there was too much brown sugar and cinnamon, but i would recommend sticking with what the recipe calls for...double the amount of icing though!!\r\nAlso, you can use butter or margarine in the recipe, both are equally as good (i use both when i make them).  When you bake them, line your pan with wax paper that has been greased with butter or margarine, and remove them immediately after baking, or they will stick.  Bake at 350 for 20 minutes and they will turn out perfect.  This recipe rocks : )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mcatherwood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/446416/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T18:57:54.09Z",
                "reviewBody": "These are really good. I experimented with my batch and found that after shaping the rolls and placing them in the greased pan, they could rest, covered, in the fridge overnight.  In the morning, simply place them into the preheated oven to bake--a very fast breakfast.  The unbaked rolls also freeze well (I used 2 8-inch square disposable pans and put 6 rolls in each pan.)  The night before, simply put the pan into the fridge.  In the morning, they're ready for the oven.  Easy and great to have on a cold morning.  I was a little concerned that they didn't look doubled before I baked them this way, but they rose perfectly in the oven.  Sure beats having to get up 3 hours before breakfast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COCONUTPALM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/230949/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-29T21:25:14.153Z",
                "reviewBody": "I make these to the point where they are placed in the baking dish, then I cover them with plastic wrap and put them in the refrigerator for the night.  The next day, they go into a COLD oven (minus the plastic wrap!).  Turn up the heat to 350 and bake for 25-30 minutes.  There is no need to let them sit out.  I do this with other yeast rolls and breads.  Also, I made the frosting (used Neuchatel cheese - less fat), dropped it by spoonfuls (enough for 1-2 rolls) onto wax paper, froze them, then removed the frosting drops and wrapped them individually in plastic wrap.  These all went into a plastic bag and back to the freezer until needed.  This way you can use all of the 8 oz package of creamed cheese (2/3 c butter, 4 c powdered sugar, 1-1/2 tsp vanilla, 1/3 tsp salt).  The extra rolls, if you have any, are frozen and reheated in the microwave (these are really good reheated).  This is where the frozen frosting comes in handy.  It doesn't take much heat to thaw the frosting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DBDCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751421/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-01T01:33:17.167Z",
                "reviewBody": "Prevent leaky filling! From a former Cinnabon employee...Leave a 1/4\" margin at the far side of dough b4 buttering. This will allow a better seal (dough-to-dough) when done rolling. After spreading the filling over the soft butter, use rolling pin and roll over the sugar/ cinn mix a couple times before rolling up your rolls. Then make sure to roll up tightly, under-tucking after each completed rollover. Work from middle to edges as you roll.\n\nLining your pan w/ parchment allows you to scrape up the juices (we always had people who wanted extra goo instead of xtra frosting!)\n\nA tip on frosting...1/2 of the frosting went on hot rolls, as soon as they came out. They sat for a few minutes and then got the rest of it. That makes for the sticky/ moist roll w/ intact frosting that so many know and love.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHANNONTHESHE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T10:04:29.67Z",
                "reviewBody": "Not a cinnabon, but very good!  We have already made this recipe twice and I just downloaded it three days ago!  I have a few suggestions though...1 T. of cinnamon was plenty.  Also, we did one batch in a glass dish and the other in a metal cake pan and the glass dish batch turned out better.  Finally, we mixed the butter with the cinnamon and sugar and then spread it on in our first batch.  They turned out great and it was easier to do it this way.  The batch where we spread the butter on first and then sprinkled the sugar mixture over the top wasn't as good because the sauce ran out the bottom and crystalized on the bottom of the pan.  Still good, but not as good.  The icing was delicious!  I licked every spoon and beater clean!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/213392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-22T04:59:39.607Z",
                "reviewBody": "I loved this recipe! Since I don't have a bread machine, (mainly because I like to make a lot at once), I doubled this recipe. I dissolved the milk and sugar then added the yeast. I let that get foamy on the top, then added the salt, eggs, and oil. I used a regular mixer to mix that mixture in with the flour a little at a time. Then, switched to bread hooks to continue kneading. When it was mixed well enough, I finished kneading by hand. A good trick to keep it from sticking or becoming too dry is to use butter flavored cooking spray instead of flour. After it was ready, I let it rise and continued with the rest of the recipe as usual. They were so delicious and soft. Freeze cinnamon rolls. Then you can pop them out of the freezer, put them in the microwave, and they taste fresh from the oven!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEATHER_O",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/691809/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-22T23:11:23.843Z",
                "reviewBody": "My skinny father in law ate 6 batches of these in a little over a week.  They're really good and have made me a popular gal at potlucks and brunches.  I do like to cut down a little on the sugar in the dough.  Be careful when substituting all purpose flour for bread flour!  The all purpose has less protein and absorbs less fluid which means you'll need to add a little more to keep the dough from being too soft.  Also, don't over-rise your all purpose dough.  It's not as strong as dough made with bread flour and falls easier.  Also, I have experimented with butter vs margarine.  Since margarine has hydrogenated oil and butter doesn't, the margarine lightens the texture of the bread.  If you're out of margarine, try using some shortening.  It works better than butter.  They came out lightest when they were baked on a pizza stone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1592828/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-27T17:20:59.170Z",
                "reviewBody": "These were okay, but nothing special.  I have always used a different recipe for my cinnamon rolls and have always gotten rave reviews on them.  People ask me to make them all the time. When I saw that this recipe had over 1,000 positive comments, I figured they must be better...That wasn't the case though.  My recommendation for people is to check out  Cinnamon-Rolls-III instead. They are a lot better. I'll keep using that one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Micah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2163064/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Clone of a Cinnabon",
            "description": "See how to make this top-rated cinnamon roll.",
            "uploadDate": "2012-04-14T00:07:27.469Z",
            "duration": "PT4M33.607S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fcb75afae-be3e-48d7-93a7-7ca88b9d3fc7%2F9a7eacba-30a1-4e08-b8d6-2d4fb4f67724%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1561183862001"
        }
    }
]