[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/364/desserts/frozen-desserts/",
                    "name": "Frozen Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20465/butter-brickle-frozen-delight/",
        "name": "Butter Brickle Frozen Delight",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1018103.jpg",
            "width": 1634,
            "height": 1632
        },
        "datePublished": "2000-08-19T02:17:39.000Z",
        "description": "This dessert is a frozen winner! It is made in a 9\" springform and can be stored in the freezer and served immediately when unexpected company arrives.   It is a very rich dessert with layers of butter brickle, caramel sauce, and a rich layer of cool whip & cream cheese. Very rich!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H21M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "1 - 9 inch springform",
        "recipeIngredient": [
            "1 ¼ cups graham cracker crumbs",
            "⅓ cup butter, melted",
            "¼ cup white sugar",
            "1 cup all-purpose flour",
            "¾ cup quick cooking oats",
            "¼ cup brown sugar",
            "½ cup butter, melted",
            "¾ cup chopped pecans",
            "1 (8 ounce) package cream cheese",
            "1 (14 ounce) can sweetened condensed milk",
            "1 (12 ounce) container frozen whipped topping, thawed",
            "1 (12 ounce) jar caramel topping"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In medium bowl, combine graham cracker crumbs, 1/3 cup melted butter and white sugar until well mixed.  Press into bottom of a 9 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 6 minutes, until set.  Cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine flour, oats, brown sugar, 1/2 cup melted butter and pecans until well mixed.  Lightly pat onto a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 10 to 15 minutes, until light brown.  Crumble while still hot.  Cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large mixing bowl, beat cream cheese until smooth.  Beat in condensed milk until well blended.  Fold in whipped topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread half of the cheese mixture over the crust in the springform pan.  Sprinkle half of the oat crumbles over the cheese mixture, and spread half of the caramel sauce over that.  Repeat layers.  Freeze until firm, remove pan sides and serve cold.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frozen Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LORIELEECOOPER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.791855203619909,
            "ratingCount": 221,
            "itemReviewed": "Butter Brickle Frozen Delight",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "616.9 calories",
            "carbohydrateContent": "70.9 g",
            "cholesterolContent": "65.7 mg",
            "fatContent": "35.4 g",
            "fiberContent": "1.9 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "20.7 g",
            "servingSize": null,
            "sodiumContent": "346.6 mg",
            "sugarContent": "36 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2002-09-16T16:25:32.95Z",
                "reviewBody": "VERY RICH AND VERRRRRRRRYYY SWEET. It's almost TOO SWEET. Some members of my extended family couldn't finish their one piece and they are big time dessert eaters! Although it's still good before it completely sets up, it takes SEVERAL hours to harden (Like over night).  It's good any way you eat it though. Be careful to not press the graham cracker crust into the springform pan or it will be hard as stone in the bottom of your pan. I made a second batch with a double layer crust, since I like thick crusts, and I barely pressed it in. Much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "IMAGINAIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/681908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-10T17:52:11.903Z",
                "reviewBody": "WOW! I made this for my mother-in-laws B-day. We went to a restaurant for dinner and they allowed us to bring our own \"cake\" for dessert. It is a very impressive looking dessert. We shared the dessert with our waiter staff and hostess. The raves came from all. I heard \"Awesome\" \"the best I have ever eaten\" and the restaurant wants the recipe. I guess there isn't a better testimonial than that. Allow enough time for this to freeze. I did it over night and suggest that it be left in the freezer til you are serving it. It melts fast!! If you spray the pan \"lightly\" with pam there shouldn't be any trouble serving it. Young and Old agreed on this one. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GORNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/829509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-23T14:21:05.71Z",
                "reviewBody": "This is SO good! Tastes like a candybar!I also put it in a 9x13, instead of a springform pan. I will definitely be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie Cloninger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-23T00:45:18.153Z",
                "reviewBody": "Absolutely scrumptious! This is great to keep on hand in the freezer for unexpected company.  I've made this three times now and I have better luck with the flour/oat mixture if I bake it at 350* and keep a close eye on it. Ten minutes seems to work great. It starts to burn @ 400* for 10 minutes in my oven. I have tried it with both pre-chopped pecans and whole pecans broken into smaller pieces and I like the whole broken pecans the best because they toast better and they lend to the crunchiness in the layers. Using whole crushed graham crackers works better than the store-bought graham cracker crumbs also. My 14.4 oz. box came with three cellophane packs of graham crackers and one pack was the perfect amount. Do not press the crumbs firmly in the pan or you will have a hard crust. A light pat is all you need. The bake time of 6 minutes as stated in the recipe is perfect for the crust. I used a whole jar (17 oz.) of Mrs. Richardson's Caramel Topping, which is my favorite, just remember to save some to drizzle over each cut piece. It will take several hours to firm up so I suggest freezing overnight. My husband loves this recipe and gives this a five star! I also took it to work and one of the guys wouldn’t let me leave without sharing the recipe. Well loved by all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KGora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kgora/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T16:52:53.23Z",
                "reviewBody": "Super but as everyone says very sweet and rich. Next time I might eliminate the carmel and add another block of cream cheese. I made it in a 9x13 pan and it came out fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MyVintageMommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/963417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-11T18:17:18.787Z",
                "reviewBody": "If there were more stars for the rating I would have clicked on more! I have prepared this recipe twice for guests and they have loved it... I substituted the regular graham crackers with fat free one butter for 'I can't believe it's not butter-Lite' cream cheese for 1/3 less fat regular condensed milk with fat free whipped topping for Lite and the caramel topping with fat free.....and surprisingly it was delicious. Did I say 'Delicious'? My husband and I are into healthy eating but do enjoy a nice dessert and I was able to decrease the calories by more than 200 per serving. I can still taste it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lulu0523",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5739488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-28T18:43:48.623Z",
                "reviewBody": "TO DIE FOR! I made this for the butterscotch lovers in my family. They went crazy! My brother in law showed up at my house with the ingredients and begged me to make it for him again. Only changed the caramel to butterscotch, caust thats our prefrence. TOO GOOD! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BZBMOMOF3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/322837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-03T17:20:03.313Z",
                "reviewBody": "This is amazing! And judging by the ingredients anyone that does not have a sweet tooth should not even try it! It's very rich but I couldn't stay out of it! It was super easy to assemble. To make sure the caramel sauce doesn't stick to the sides pour it away from the sides of the pan. It will eventually spread all over. I didn't have any pecans around but it tasted great without that addition. I even didn't have any oats so I ended up using a package of instant oatmeal! This dessert is very versatile to suit your tastes! Maybe I'll try chocolate sauce next time!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "teddybear87",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1908295/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-10T21:17:54.407Z",
                "reviewBody": "OMG! Over-the-top delicious! Please DO use any and all non- or low-fat ingredients you can because you won't be able to tell much difference. I certainly hope that you like SWEET when you make this because it is decadently that! Just follow the directions and give it plenty of time to set (at least 8 hours). The caramel sauce just slowly oozes out just as if to dare you! YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            }
        ]
    }
]