[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21461/ooey-gooey-cinnamon-buns/",
        "name": "Ooey-Gooey Cinnamon Buns",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F09%2F29%2F353408-ooey-gooey-cinnamon-buns-photo-by-foodelicious-horiz-crop.jpg",
            "width": 960,
            "height": 640
        },
        "datePublished": "2000-07-27T20:13:00.000Z",
        "description": "These buns are sooo good hot from the oven when they're gooey and warm.",
        "prepTime": "P0DT2H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "15 servings",
        "recipeIngredient": [
            "1 teaspoon white sugar",
            "1 (.25 ounce) package active dry yeast",
            "½ cup warm water (110 degrees F/45 degrees C)",
            "½ cup milk",
            "¼ cup white sugar",
            "¼ cup butter",
            "1 teaspoon salt",
            "2 eggs, beaten",
            "4 cups all-purpose flour",
            "¾ cup butter",
            "¾ cup brown sugar",
            "1 cup chopped pecans, divided",
            "¾ cup brown sugar",
            "1 tablespoon ground cinnamon",
            "¼ cup melted butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, dissolve  1 teaspoon sugar and yeast in warm water. Let stand until creamy, about 10 minutes. Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in 1/4 cup sugar, 1/4 cup butter and salt; stir until melted. Let cool until lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the yeast mixture, milk mixture, eggs and 1 1/2 cup flour; stir well to combine. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While dough is rising, melt 3/4 cup butter in a small saucepan over medium heat. Stir in 3/4 cup brown sugar, whisking until smooth. Pour into greased 9x13 inch baking pan. Sprinkle bottom of pan with 1/2 cup pecans; set aside. Melt remaining butter; set aside. Combine remaining 3/4 cup brown sugar, 1/2 cup pecans, and cinnamon; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough out onto a lightly floured surface, roll  into an 18x14 inch rectangle. Brush with 2 tablespoons melted butter, leaving 1/2 inch border uncovered; sprinkle with brown sugar cinnamon mixture. Starting at long side, tightly roll up, pinching seam to seal. Brush with remaining 2 tablespoons butter. With serrated knife, cut into 15 pieces; place cut side down, in prepared pan. Cover and let rise for 1 hour or until doubled in volume. Meanwhile, preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 25 to 30 minutes, until golden brown. Let cool in pan for 3 minutes, then invert onto serving platter. Scrape remaining filling from the pan onto the rolls.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "dakota kelly"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.699001426533523,
            "ratingCount": 1402,
            "itemReviewed": "Ooey-Gooey Cinnamon Buns",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "392.4 calories",
            "carbohydrateContent": "45.3 g",
            "cholesterolContent": "66.1 mg",
            "fatContent": "21.7 g",
            "fiberContent": "1.9 g",
            "proteinContent": "5.6 g",
            "saturatedFatContent": "10.5 g",
            "servingSize": null,
            "sodiumContent": "281.9 mg",
            "sugarContent": "18.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-03-09T21:51:54.24Z",
                "reviewBody": "I used to make cinnamon rolls and stick buns professionally.  Here is how we rolled tight buns.  Make sure you roll your dough out to 1/4\".  Apply butter evenly, then sugar/cinnamon mixture.  Holding the rolling pin, gently roll over the sugar/cinnamon mixture.  At the beginning of the roll only 1/2\" of dough and pinch down.  Now you must begin rolling from each corner, middle, working your way back and forth.  Curve your corners toward the center to avoid too much overlap (exess)  IMPT:  after about 2-3 rolls, carefully lift up each portion and pull away from you, this will \"tuck\" in the dough, be careful not to tear the dough.\r\n\r\nA lot to remember, but after you get the hang of it, it's like second nature and you will have picture perfect cinnamon rolls and sticky buns",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DROB27",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1046309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-14T17:08:54.803Z",
                "reviewBody": "This is a good cinnamon roll recipe.  Here's a trick for cutting the rolls without mashing the dough:  take a piece of thread, slide it under the roll, cross the thread and pull quickly.  It works like magic, and you don't have a sticky knife to clean up afterwards!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Helen H. Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/739448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-17T15:50:24.483Z",
                "reviewBody": "These cinnamon buns are THE BEST EVER!!! I loved them so much, just a tip: the longer you let them rise, the fluffier and better they taste!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEWEL1190",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1036277/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-18T16:03:11.047Z",
                "reviewBody": "Mine weren't so ooey-gooey.  I made per the recipe---except I didn't add the pecans to the brown sugar/cinnamon mixture that went inside the rolls.  I would suggest not melting the butter that you spread on the inside before you roll it up.  If you just spread on a thin layer of softened butter you should end up with a more ooey-gooey feel because you'll have more butter on the inside to melt, which will make the caramel more gooey.  When you use the melted butter you don't get a lot of butter on the inside & I found this tended to give me a dryer--but still good--caramel roll.  I will try again, but next time I won't melt my butter.\nHave made a couple more times & it definitely works better not to melt the butter for the inside and then I double the caramel for the bottom.  Still a good recipe, hence the 4 stars, but does need some adjustments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MNDiana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1733966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T00:08:00.92Z",
                "reviewBody": "I am a lucky baker, meaning I have no idea what I'm doing most of the time, but it usually works out pretty well in the end. When I made these for a dinner party I was having - I was a little worried - but they turned out well. Too well. The buns were so unbelievably and incredibly delicious I kind of got scared. I felt like I had created something so devastating, so powerful, that it would wreak havoc on humanity. I knew what it was like to be Oppenheimer, surveying the results of his work. So PLEASE be careful when and where you make these - they are beyond humanity's control; this cinnamon bun WILL NOT BE DENIED AND WILL HAVE ITS WAY WITH YOU! Consider yourself warned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dougger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6093209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-08T06:59:39.953Z",
                "reviewBody": "The best!!  I come from a long line of bakers.. this is great!  I used half whole wheat flour...incredible.  To easily cut the dough, use dental floss.  Slide it under the end, cross the dental floss at the top and pull.  Perfect cuts every time!  If you want more ooey-gooey, just add a little cream or whole milk (3-4 tablespoons) to the butter, brown sugar mixture in the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marcia W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1363319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-04T21:06:08.75Z",
                "reviewBody": "I came to this recipe this morning and made these wonderful sticky buns. I changed only these two areas: I used a 9 X 9 baking pan and I made a little extra filling. In addition I made some simple white icing and I have to say this is one of the best sticky buns I have ever had; and I've had quite a lot over the years. I never thought I'd make a world class sticky bun but I was wrong. \n\nI would highly suggest taking extra time and being extra careful when reading the directions. In addition, I allowed my first rise to go for approx. 2 hours and it came out perfect. \n\nIf you want great sticky buns that will knock the socks off your friends and family, this is it! Happy Holidays from Maggie's kitchen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2656121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-11T23:55:07.577Z",
                "reviewBody": "Great Recipe! For those of you who are novice bakers like myself, I'll share a few things I learned after a lot of trial and error and more reading. First, this recipe should be read closely as there are a lot of steps and can be confusing. Kneading was the difficult part for me. You must knead at least the recommended time if doing it by hand (8min for this recipe). In the past I didn't knead enough and my bread didn't come out fluffy, I couldn't figure out what went wrong because the dough would rise nicely. Kneading is key!! Add a little flour if it gets too sticky to work with/ lightly dust. The dough should feel harder the more you knead and you'll know its ready when you pinch it between your fingers and it feels like your earlobe. If in doubt, knead some more. It is difficult to over knead by hand. Also, when making the caramel you may want to do extra. I made double but make sure the sugar has completely dissolved so that it turns into caramel. I think it should be cooked at medium-high heat but watch carefully so it doesn't burn. Lastly, I cooked at 375 for 25min (min time recommended) and I was disappointed that after all the work they were over cooked on the top. I don't know if the temp was too high or time was too long, just make a note and watch carefully. No one mentioned this in other reviews so maybe it was just my oven. Next time I will try 350 degrees...My first review on here so hope it was helpful :) Good Luck!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carolyn Curry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4118174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-04T22:44:16.43Z",
                "reviewBody": "This buns are yummy! They taste like the Cinna-Buns.  They are one of those treats you do only a couple of times a year because they are not the healthiest thing but flavor-wise they are awesome.  We did not add the pecans because my kids do not like the nuts but they were great.  Present Idea: Prepare batches and put them in disposable aluminium containers - you can give them away and put the baking instructions and a DO NOT BAKE UNTIL CHRISTMAS MORNING Sign.  They will love it and remember you on Christmas morning when the cinnamon smell comes out of the oven! Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DCANT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/500385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-21T14:49:36.100Z",
                "reviewBody": "This is the only time I've ever set my oven on fire. The sugar-butter mixture rises and overflows a shallow pan, and it's pretty combustible in the oven!!! They sure looked tasty, but I didn't eat them with their fire-extinguisher powder coating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kat1815",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8580029/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Ooey-Gooey Cinnamon Buns",
            "description": "These amazing sticky buns are topped with pecans and a luscious caramel sauce.",
            "uploadDate": "2012-09-10T18:11:24.276Z",
            "duration": "PT9M6.921S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb79c55ac-f657-4dff-85d1-98deab2ec4a7%2Fef2c9878-5f57-40c7-af23-6201ab64a981%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1832717537001"
        }
    }
]