[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/375/desserts/specialty-desserts/tiramisu/",
                    "name": "Tiramisu Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21412/tiramisu-ii/",
        "name": "Tiramisu II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2014%2F11%2F864554-Tiramisu-II-Photo-by-Connie-Ding-resized.jpg",
            "width": 650,
            "height": 465,
            "caption": "Tiramisu II | Photo by Connie Ding"
        },
        "datePublished": "2000-06-11T05:21:32.000Z",
        "description": "Mascarpone custard layered with whipped cream and rum and coffee soaked ladyfingers.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT5H0M",
        "recipeYield": "1 7x11-inch dish",
        "recipeIngredient": [
            "6 egg yolks",
            "¾ cup white sugar",
            "⅔ cup milk",
            "1 ¼ cups heavy cream",
            "½ teaspoon vanilla extract",
            "1 pound mascarpone cheese, at room temperature",
            "¼ cup strong brewed coffee, at room temperature",
            "2 tablespoons rum",
            "2 (3 ounce) packages ladyfinger cookies",
            "1 tablespoon unsweetened cocoa powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, whisk together egg yolks and sugar until well blended.  Whisk in milk and cook over medium heat, stirring constantly, until mixture boils.  Boil gently for 1 minute, remove from heat and allow to cool slightly.  Cover tightly and chill in refrigerator 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, beat cream with vanilla until stiff peaks form.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk mascarpone into yolk mixture until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine coffee and rum.  Split ladyfingers in half lengthwise and drizzle with coffee mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange half of soaked ladyfingers in bottom of a 7x11 inch dish.  Spread half of mascarpone mixture over ladyfingers, then half of whipped cream over that.  Repeat layers and sprinkle with cocoa.  Cover and refrigerate 4 to 6 hours, until set.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Christine"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.838817358130663,
            "ratingCount": 2097,
            "itemReviewed": "Tiramisu II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "387.2 calories",
            "carbohydrateContent": "22.7 g",
            "cholesterolContent": "215.7 mg",
            "fatContent": "30.5 g",
            "fiberContent": "0.3 g",
            "proteinContent": "6.6 g",
            "saturatedFatContent": "16.6 g",
            "servingSize": null,
            "sodiumContent": "60 mg",
            "sugarContent": "13.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-04T10:27:09.56Z",
                "reviewBody": "As a Tiramisu-Lover, I decided to try this recipe, based on the reviews.  The only thing I can say is WOW!!!!  The RICH & CREAMY flavor mixed with the Coffee-soaked lady fingers leaves you wanting more!  VERY IMPORTANT: Let it refrigerate AT LEAST 24 hours; the flavors really need to blend!! I tasted the mixture right after adding the Marscapone Cheese and it tasted very bland.  However, after refrigerating overnight, it was probably better than any Tiramisu I'd ever tasted.  ONE MORE IMPORTANT TIP: As others have mentioned, doubling the coffee / rum mixture is a MUST.  You get that espresso taste, blended with the creamy flavor - HEAVENLY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LisaC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1844169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-26T21:40:40.487Z",
                "reviewBody": "This is the recipe to try if you´ll make your Tiramisu.  I was unsure wich recipe to try, ´cause others had more reviews.  Lucky me, I try this one. My husband, a very picky eater, loved this and didn´t stop the MMMM! while he was eating.  The milk in the egg mixture makes the difference. Few tips: 1. make 2 days ahead, it´s the peak of flavors and consistency.  2. double the amount of coffe/liquor, it´s not enough.  3. use soft lady finger, the others are just like rocks. 4. don´t be tempted to lower the amount of sugar, I did based on a preview review, big mistake, went from a 3/4 cup wich is what the recipe call for, to 2/3 cup, the little extra sugar was missing, and I don´t have a sweet tooth.  5.  serve chilled, just my taste but it´s wonderful in this warm day to have a cold dessert.  6.  be carefull, one piece of this has tons of calories, your waist and hips are going to tell you sooner than later.  7. mix well the egg and sugar and when you cook the mixture NEVER stop beating, this makes a silky smoth texture.  8. with a electrical mixer add the mascarpone to the milk/egg, this way you avoid clumps and keeps the silky texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lulu Mash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1024307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-27T23:56:03.307Z",
                "reviewBody": "I don't normally bring a dish to a party until I've \"test drove\" it with my immediate family, but I decided to go ahead and trust the allrecipes community and brought this to our extended family Christmas party this past weekend.  It was a hit.  I'm picky about my tiramisu and was doubtful that I could produce one that I really liked.  This is it.  \nI took the advice of several others and doubled the coffee mixture, and had just enough.  I didn't have any rum on hand, so I substituted with Frangelica.  Yum!\nAlso, as noted by other posts, don't judge by the way it tastes when you are making it.  I thought it quite blah during preparation, but after 2 days in the fridge it was delicious.  \nFor presentation purposes, I made it in a trifle dish. I modified the layering a bit, but used the same amount of ingredients and it fit perfectly.  I covered the bottom of the dish with lady fingers and then also stood them up along the outside of the circumference of the dish (on the first layer only).  I then did a layer of filling, layer of cream, second layer of ladyfingers, layer of filling, layer of cream, third layer of ladyfingers, layer of filling, layer of cream.\nThanks for adding another great dessert recipe to my collection!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CALSMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1437785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-26T18:45:35.21Z",
                "reviewBody": "FanFreakin'tastic!!!! OMG....I am so glad that I chose this recipe over the many others on this site...I made this Christmas eve to serve for dessert on Christmas day for 10 of us. It was absolutely the best, and my family raved over it.....I made espresso using instant espresso granuals, used Kahlua instead of the rum, and did need to double this as the lady fingers are like little sponges. I did use the Savoiardi lady fingers that I easily found at Shop-Rite. They are the hard lady fingers, not the soft. I dipped each one half-way(long ways)and then placed the espresso/kahlua side up in a tin pan (11 3/4\" X 9 1/2\") and then spred my filling on top. By the way I loved that the egg yolks were cooked and that you didnt need to use a double boiler, after I made the egg yolk and marscapone filling, I made the whipped cream and then folded that into the cheese mixture (so I had one filling instead of 2)I layered the filling over the fingers and repeated. I made 3 layers with the marscapone cheese filling on the top. I dusted with the cocoa powder when I served the dessert. Everyone said it tasted like it was from a fine Italian restuarant. I was nervous that it would become soggy and runny....and that was not the case it was perfect. I recommend folding the whipped cream into the egg/cheese filling. I really think it saves a step and really makes the filling light and very flavorful. Thanks for this recipe. I highly rate this.....10 stars+!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLJ6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-28T17:02:45.717Z",
                "reviewBody": "I made this recipe for company last Friday and it was wonderful.  I learned to make Tiramisu in Italy from my husband's family and this was every bit as good.  Even better because this recipe cooks the eggs.  I have two hints to pass along.  I increased the coffee to one cup and the rum to 4 tablespoons.  Also, I did not split the ladyfingers.  I put the coffee/rum mixture in a shallow container and then quickly dunked both sides of the ladyfingers in the mixture.  I'm looking forward to making this recipe again, soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JBOND1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1043916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T05:43:14.39Z",
                "reviewBody": "I LOVE this recipe!  Originally, I was quite disappointed.  Shortly after making it, I had a piece and decided it wasn't worth the cost of the ingredients or the time it took to find them.  However, when I went back to it a day or two later...HEAVEN!  I've made it three times since (all in the last month) and I always make it two days before I need it or plan to eat it.  It's one of those recipes that needs to sit a while.  I use more vanilla, equal parts of coffee and brandy (and more than the recipe calls for), and I've even made it with pound cake when the local bakery/deli is out of ladyfingers...it's just as good and much cheaper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFETTE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-19T17:32:12.933Z",
                "reviewBody": "Positively the best Tiramisu recipe ever but with adjustments!!  I took a long time reading the reviews and agreed with\nmost of the suggestions.  This is what I did and it turned out brilliantly.\n1. I used a 9\" springform cake tin and lined the outside with dry sponge fingers sugar side out cut to level of the tin. Bit fiddly but the shape can be perfected once you start putting in the filling.\n2. Savoiardi biscuits are the best quality, but any supermarket sponge fingers will do. To use up leftovers I used a mixture of both. For three layers you need 2 or 3 packets especially if using a springform tin.\n3. Agree egg/sugar/milk mixture must be stirred constantly whilst cooking to a nice thick consistency.  Also stirred it twice while cooling. You should end up with thick yellow custard.\n4. As suggested, I added a little sugar (level dessertsp.)to whipped cream and vanilla mix. \n5. I folded the mascarpone mix and cream mix together.\n6. Agree you need to treble the amount of coffee and rum.  Rum is best of all in my opinion to get a good balance of flavours. \n7. I mix rum/coffee in shallow dish and then with a sponge finger in each hand I dip, flip and out. This takes a second or two and just colours the fingers on either side. Do not soak them or you will end up with a mush!! Do a couple at a time and put sugar side down in base of tin to form complete layer. Totally unnecessary to split fingers.\n8. I put a third of the mascarpone mix over the top of base fingers and sprinkled ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Libby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3396162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-02T05:50:40.583Z",
                "reviewBody": "I am not a Tiramisu fan but apparently this recipe was outstanding.  I did double up on the coffee and instead of rum I used Kahlua (which I doubled also).  I used a pastry brush and  brushed the coffee onto the lady fingers.  I also whipped the egg whites and added them to the cheese mixture.  Makes it very fluffy.  Definately let it sit for 24 hours.  The flavors really blend in.   Don't forget to sprinkle your cocoa on just before serving or it will get soggy.  I also added some strawberry chocolate shavings on top of the cocoa.  Looked really good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GOLDENKONA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1092457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-25T19:38:31.717Z",
                "reviewBody": "Wow! I made it yesterday for Thanksgiving and all our picky eaters loved it!It was the hit of our dessert table - Now I will be making for Xmas too! It really tasted like it was from my favorite Italian restaraunt!\r\n\r\nI read all the tips and suggestions for this recipes -following is what worked (and didn't work)for me:\r\n- made it 2 days ahead worked great\r\n- added more coffe and Rum ( 1 cup strong coffe and 4 table spoons rum) this worked perfect!\r\n- tried quickly dunking ladie fingers vs drizzling was a disaster! I tried quickly doing this with the liquid spread out, but it absorbed up almost all of the liquid after just a few ladie fingers, so I would reccomend the drizzle method which worked just fine.\r\n\r\nThanks for this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawgboy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1634646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-14T18:09:41.793Z",
                "reviewBody": "I don't know if its that I don't like tiramisu enough, or if I did something wrong with the recipe, but I was a bit disappointed with how this turned out. It was a lot of work and the flavor of it wasn't all that great, even after letting it sit in the fridge for 24 hours. It wasn't sweet enough for me, so if I do make this again, I'll definitely add more sugar. It did make for a beautiful presentation though! Thanks for posting the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "astacy12",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3034146/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Tiramisu II",
            "description": "Create a delicious, authentic tiramisu--rich and impressive.",
            "uploadDate": "2012-08-24T00:12:18.794Z",
            "duration": "PT6M7.325S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F47e3a714-17c6-4aae-8b67-6e15d1751ce3%2F47e8951c-3264-4c82-a6af-47fd65331c64%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1801395576001"
        }
    }
]