[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17640/desserts/pies/slab-pie/",
                    "name": "Slab Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22265/apple-sheet-cake/",
        "name": "Apple Sheet Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4114462.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2000-06-17T20:16:50.000Z",
        "description": "This sheet cake is a favorite on cold winter nights. It's moist and flavorful but definitely not low-calories!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 10x15 inch sheet pan",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "1 teaspoon salt",
            "½ cup shortening",
            "1 cup milk",
            "3 pounds apples - peeled, cored and sliced",
            "1 cup white sugar",
            "1 teaspoon ground cinnamon",
            "2 tablespoons all-purpose flour",
            "½ cup butter",
            "2 ½ cups confectioners' sugar",
            "3 tablespoons milk",
            "⅓ cup butter, softened",
            "½ teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). In a large bowl, combine 3 cups flour, baking powder and salt. Cut in shortening to the consistency of coarse crumbs. Stir in 1 cup cold milk slowly until completely blended. Separate dough into two balls. Roll out one ball of dough to fit a 15 x 10 inch pan with some dough extending over the edge of the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine sliced apples, sugar, cinnamon and 2 tablespoons flour. Place filling in an even layer over prepared crust. Thinly slice 1/2 cup butter and evenly distribute over the apples. Roll out the remaining dough and place over the apple filling. Seal edges and prick the top all over with a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 30 minutes. Cool 5 minutes before frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the frosting:  In a small bowl, combine confectioners' sugar, 3 tablespoons milk, 1/3 cup butter and vanilla extract. Beat until smooth and creamy.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Slab Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Barbara"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.647058823529412,
            "ratingCount": 68,
            "itemReviewed": "Apple Sheet Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "259.7 calories",
            "carbohydrateContent": "40.1 g",
            "cholesterolContent": "17.2 mg",
            "fatContent": "10.7 g",
            "fiberContent": "1.8 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "163.9 mg",
            "sugarContent": "26 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-26T04:15:38.057Z",
                "reviewBody": "I just pulled my \"apple sheet cake\" out of the oven about an hour ago and already had a piece.  It was delicious! The crust is not like your ordinary pie crust - it's more biscuit like (probably because there is baking powder in the crust). I think the crust might be a tad bit better if it had some sugar in it.  It's plenty sweet with the apple filling & icing but the edges by themselves are not sweet enough. I made 1 1/2 recipes of the pastry because I suck at rolling out pie dough and I thought that rolling it out to the size of a jelly roll pan would be difficult for me.  1 1/2 recipes turned out to be perfect for me! I had enough dough to really get a nice looking edge to my crust that I could crimp nicely. It prevented any leaks of the filling and did not brown too much.  The only small change I made in the recipe is to add one more tablespoon of flour in the filling because I was worried about it being too thin. I cut it when the pie/cake was still very warm and it did not ooze at all.  Sliced very nicely.  I prepared my filling before I started on my crust and so my filling had a chance to produce alot of juice at the bottom of the bowl which I left in the bowl as I scooped the apples into the crust. I've had so many pies with soggy bottom crusts that I tried hard to prevent it from happening again.  I used 3 different kinds of apples and didn't weigh them but used about 7 or 8 medium apples.  I sliced them very thinly because 30 minutes in the oven is not a long time ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1462254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-03T08:15:31.077Z",
                "reviewBody": "This reminds me of a apple slice pastry I used to buy by the slice from 7-11..when I was a kid, it would be delievered from some bakery in Chicago.. I have made this many of times now  everyone always loves it....sometimes i will add rasins(golden rasins) and walnuts....but its great as is too. I double dough recipe and used 12 x 18 sheet pan & had alittle left over dough,but I like having anuff to work with..its a easy dough to work with on a flour dusted table..I use flour to dust and roll the dough...I like it best with granny smith apples, I wash and core them,then just slice them up, with the peel on them..(big time saver)no one ever knows differance...if you use red apples you will have to peel them, otherwise you will have bits of red, not pretty...I also but alittle cinn and brown sugar in the dough...I use this recipe for pot luck dinners, its always a number 1 dessert, ice cream is good on top also. love it. Note if you dont want it watery...use granny smith apple , they hold their juices.....poeple always love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sohol",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1197634/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-16T19:34:15.89Z",
                "reviewBody": "I find this easier than apple pie and it is great for a crowd. I took it to a pot luck and got LOTS of requests for the recipe. I have made this using both butter and shortening for the dough, butter makes a more tender crust. It is a job rolling it out to fit into the pan but the dough is easier to handle than regular piecrust. Definitely a hard to categorize dessert, it's not a \"cake\", more of a pie in a sheet pan. My husband said \"It's like a cross between an apple pie and a danish... but better.\" I'll be making this one again. The icing's called for amounts frosts the dessert VERY generously, you could get away with half as much (if you wanted to!).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-20T14:49:12.547Z",
                "reviewBody": "As previously noted this was tough to roll out to the proper thickness and size but the crust was good. I did doctor up the filling a bit with extra cinnamon brown sugar and nutmeg. Came out good and it freezes and defrosts well. I'll make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-26T17:12:20.963Z",
                "reviewBody": "This was more like a sheet apple pie.  It was really very good!  I followed what another reviewer said and rolled out the dough between parchment paper.  Best idea ever!!!  I will now be doing this with any rolled pie or cookie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Sergot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/debserg/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-16T18:28:01.49Z",
                "reviewBody": "This is not a cake but a pie and oh what a pie! I didn't have the 10 X 15 pan so I used a 9 X 13 cake pan. I did not take time to do the icing either and doubled the amount of cinnamon. We all agreed it was wonderful for an early morning coffee. I will definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUES1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1051752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-08T16:09:14.677Z",
                "reviewBody": "i was very excited about this recipe. i had high hopes only to be sorely disappointed:( first of all the \"cake\" part was more like a pie crust. i don't do pie crust. i added sugar and cin to the crust as did some other reviewers. the filling was lovely but wasted between a really bad crust. i will ask on the exchange if anyone can figure out what went so wrong with this recipe and maybe give it another try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "debbie eckstein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2175240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-19T23:28:37.87Z",
                "reviewBody": "Incredible-favorite of everyone. My 5 year old has been requesting these for months now. I call these 'apple pie bars'. This is the only recipe I ever spend the time making home-made dough for & it is well worth it. It's a big pan but they get eaten fast! Let's be realistic it takes time peeling/slicing apples & rolling out the crust if you're not used to it (I bought a tupperware rolling sheet & that helps me a ton). I usually cut the frosting amount in half-it's just too much. These are just as good refrigerated as they are fresh. Forget apple pie & move on up to this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nice lady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3080072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-18T01:40:59.323Z",
                "reviewBody": "This is a kick butt recipe I love it(so does everyone else)! I made it in a 9X13 Baking pan instead baking time is the same makes it a little thicker. Added a 1/4 cup sugar and 1 tsp cinnamon to the pastry. I'm not sure why everyone else says there is not enough pastry though I can still make it fit a 10X15 cookie pan. I found that rolling the pastry out on parchment paper worked out well if you don't roll it out thin enough the pastry is to thick and didn't make the \"frosting\". This is definitely apple pie on a bigger scale you certainly get a lot more pieces this hasn't lasted long in my house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3503025/"
                }
            }
        ]
    }
]