[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17285/desserts/nut-desserts/almond-desserts/",
                    "name": "Almond Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22328/almond-chocolate-coconut-cups/",
        "name": "Almond Chocolate Coconut Cups",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F643868.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-10-01T23:52:06.000Z",
        "description": "I found the recipe for Almond Joy Cake at cakerecipe.com and wanted to find a way that I could add it to the goodies that I make at Christmas time.  This is what I came up with.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 dozen",
        "recipeIngredient": [
            "1 (18.25 ounce) package chocolate fudge cake mix",
            "1 egg",
            "½ cup margarine, melted",
            "¾ cup all-purpose flour",
            "½ cup white sugar",
            "½ cup evaporated milk",
            "14 large marshmallows",
            "7 ounces flaked coconut",
            "¼ cup evaporated milk",
            "¾ cup semisweet chocolate chips",
            "2 tablespoons margarine",
            "½ cup sliced almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Grease mini-muffin tins.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, combine cake mix, egg, 1/2 cup melted margarine and flour until well blended.  Roll into 1 inch balls and place in prepared mini-muffin pans.  Press into bottom and up sides of muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven 10 minutes, until set.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While cups are baking, combine 1/2 cup sugar and 1/2 cup evaporated milk in microwave-safe bowl.  Microwave on high 2 minutes, until mixture comes to a boil.  Stir in marshmallows until melted.  Stir in coconut until well combined.  Spoon into baked shells while mixture is still warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a microwave-safe bowl, combine 1/4 cup evaporated milk, chocolate chips and 2 tablespoons margarine.  Microwave on high 1 minute, remove from oven and stir until chocolate is melted and mixture is smooth.  Stir in almonds until well coated.  Spoon over coconut mixture and spread to cover.  Cool completely before removing from pans.  Store in refrigerator or freezer.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Almond Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ZIPITY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.185185185185185,
            "ratingCount": 27,
            "itemReviewed": "Almond Chocolate Coconut Cups",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "94 calories",
            "carbohydrateContent": "10.9 g",
            "cholesterolContent": "3.3 mg",
            "fatContent": "5.6 g",
            "fiberContent": "0.8 g",
            "proteinContent": "1.3 g",
            "saturatedFatContent": "2.6 g",
            "servingSize": null,
            "sodiumContent": "83.4 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-04-15T20:10:16.95Z",
                "reviewBody": "Had to give this 5 stars because I loved them but had to make a few changes.  First change was the crust...I mixed all the ingredients and it was not a consistency for rolling into balls so added another egg and some water.  I then baked the crusts for 10 minutes which seemed too long when I took them out of the oven...they got very crunchy but after having the filling in them softened up a little.  Next time I will check them after 5 minutes.  The coconut filling is awesome!  After reading the other review about the chocolate topping not setting up I decided to add less milk to the mixture, next time I will double the amount of chocolate topping because I had to make more.  With all that said these were awesome! Everyone loved them and their were many request for the recipe.  Thank You, Patty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ASHBERRY95",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/378590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-23T18:42:12.943Z",
                "reviewBody": "These were fabulous! Like the other reviewers suggested, I def recommend adding the extra egg to the fudge cake batter, cutting back on the milk in the chocolate topping, and pressing your thumb in the cups while taking them out of the oven.  Also, bc not everyone in my family likes coconut, I substituted graham crackers for coconut in half the marshmellow mix, keeping the rest of the recipe the same...they turned out like little s'more cups.  These were gobbled up so quick I had to make more for the true event!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Lyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2203906/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-20T20:10:39.673Z",
                "reviewBody": "Used them for my son's catering business. Everyone really enjoyed them. I did as was suggested and added another egg to the cake batter and only used 2 tablespoons of milk in the frosting. Also after baking cups for 7 minutes I thumbprinted the cups and baked another 2 minutes. They were perfect for the filling. I didn't spread the frosting all the way to the outside. They looked prettier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bernice Dray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/317442/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-11T20:05:01.603Z",
                "reviewBody": "These were very good. I followed the suggestions of others and baked for about 7 minutes added an extra egg to the cake batter and used 1/8 c. evap milk for frosting. Also pressed my thumb in shells when removing from oven. Will make these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelly C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2389920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-23T12:33:53.28Z",
                "reviewBody": "This recipe is SO good! It was worh the time it takes! One note... I pressed my thumb in the batter in each muffin as I was taking it out of the oven so I had plenty of space for the filling. The only prob. I had was the topping. It didn't harden well and remains tacky to you can't stack the sweets but who cares! They get eaten too fast! TKS for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PRESSEDFORTIME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-19T01:29:04.467Z",
                "reviewBody": "This tastes very much like the candy bar it is named after. I needed to make another half batch of the chocolate topping. Made 36 in mini-muffin tins and an 8 x 8-inch dish that I cut into bars. Next time I will put a whole almond on top of each piece. Very rich dessery.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Larry J",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/817979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-24T16:44:41.687Z",
                "reviewBody": "This recipe was very time consuming and only made half of the listed servings. When I took the lined mini muffin tins out of the oven the dough had risen so there was little room to put the coconut filling. Then after topping them I waited 4 hours for the chocolate almond mixture to harden up so I could store them and it never happened. I was very dissapointed and could not leave them not touching one another so I had to throw them out. (after spending over 1.5 hours in prep time.) Sigh!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVE2B23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1426379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-07T19:51:57.53Z",
                "reviewBody": "I had a few issues putting this recipe together. The end result gets 4 stars but the preparation gets a 2. First when the little cakes bake they pretty much fill the entire muffin opening. And if you don't push them back down immediately after they come out of the oven they get hardened like that very quickly. I followed the instructions of keeping the filling warm to fill the chocolate molds and if you don't it begins to separate and the coconut falls to the bottom. At this point in the recipe it should tell you to chill the cups before adding the chocolate topping. I added the chocolate on top of the warm filling and it just ran all over the pan making a huge mess. After doing 3 cups I stopped put the pan in the fridge and chilled for about 30 minutes. Then I came back to a slightly thickened chocolate glaze and added it onto the chilled coconut filling. This worked much better. In the end the chocolate cups were kind of hard and crumbly and the filling is extremely sweet. But after my changes they did turn out very pretty with some sliced almonds on top. Too many steps too much work and not a great finished product.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mominml",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mominml/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-07T02:53:32.023Z",
                "reviewBody": "I've made these twice and the second time I think I got it right. Why add a second egg? Just cut the flour down to 1/4 cup and it's the perfect consistency. I used paper liners but just rolled the balls and dropped them into the liners. Also Ladies to address the comments about only getting X amount of treats remember we're talking inches in female mentality. An inch is an inch and I got 52-60 treats. I baked them for 9 minutes but oven temps vary. Dido on pressing a thumbprint after they come out of the oven. I did let them cool for a few minutes before carefully taking them out of the muffin tin to let them firm up a bit. That way it frees up the tins for a second batch since I only have two tins. They're a bit time consuming but worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the3rdsister",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5091985/"
                }
            }
        ]
    }
]