[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22708/egg-white-sugar-mold/",
        "name": "Egg White Sugar Mold",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F200074.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-04-21T04:25:13.000Z",
        "description": "The egg whites in this recipe make for a stronger mixture that will hold together better.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "2 large or 10 small eggs",
        "recipeIngredient": [
            "2 tablespoons cornstarch",
            "5 pounds white sugar",
            "2 egg whites"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 200 degrees F (93 degrees C).  Dust egg molds with cornstarch.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place sugar in a large bowl, stir to get rid of lumps.  Make a well in the center and pour in egg whites.  Mix and knead with hands 5 minutes, until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Press firmly into mold with the heel of your hand.  Scrape off excess sugar with the straight edge of a knife.  Unmold at once and place on baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven 20 minutes, until hard.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cecile"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8333333333333335,
            "ratingCount": 6,
            "itemReviewed": "Egg White Sugar Mold",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "443.9 calories",
            "carbohydrateContent": "114.2 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": null,
            "proteinContent": "0.4 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "5.6 mg",
            "sugarContent": "113.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-31T20:50:04.89Z",
                "reviewBody": "i gave this a 4 star rating b/c i changed the recipe alot. but thought it might be helpful to those who have problems with the sugar holding together... i used one whipped egg white 3.5 C sugar.5 C powdered sugar and it held together beautifully! it seems too dry at first but just keep mixing and it comes together!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nellie Fiorenzi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2902260/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-01T19:23:27.117Z",
                "reviewBody": "This recipe is great!! I also tried using just water and a drop of food coloring. This made some beautiful sugar shapes when I found an old spoon with a shell shaped bowl. Demitasse spoons work well too for smaller shapes. The key is the consistency of the sugar. It should be like wet sand but kind of dryish. You only need a few drops of water to knead into the sugar. If it is too wet it will stick to the mold even if you use cornstarch. If using egg white I would just add a little at a time until I obtained the desired consistency. Experiment with the consistency so that is holds together after releasing from the mold. Be sure your mold is clean. You may have to clean it between the molding process. Just take the spoon with molded sugar tap it onto a cookie sheet to release the molded sugar and pop it in the oven. If the shapes are thicker like mine were you may need to leave it in the oven longer at 200 degrees. This works great. This is really very easy once you get the hang of it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Fortuna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2302271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-23T19:54:59.297Z",
                "reviewBody": "I give this recipe 0 stars! It is the worst I have tried in a long time. I couldn't wait to wash my hands of sugar to get up here to write. The sugar did not stay together to unmold so I kept adding egg whites to the tune of 5 and IT STILL WOULD NOT HOLD THE SHAPE! I WASTED 5lbs af sugar and 5 eggs to do this. I am an accomplished baker who does not shy away from any decorative task and I could not make this work. Eeesch. Terrible directions!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Schneider Huggins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1383015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-08T21:57:49.913Z",
                "reviewBody": "I gave this 4 stars because Nellie did and I used her recipe. I used the sugar for small candy size fleur de lis molds that I was using to decorate a cake. It worked very well with the small molds but when I tried to use it on the larger sucker sized molds I couldn't get them out of the molds w/out cracking or breaking even after dusting the mold w/ cornstarch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bettie Rocker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3971158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-06T05:33:01.37Z",
                "reviewBody": "This is a good primer for people who are beginners in sugar crafting. The thing is that depending on what you're making what time of year it is (temp and esp humidity in your kitchen will always make a difference!) and most importantly what works best for you specifically you will find that with time and practice you will understand what works best for you with regard to ingredients and the quantity of each. For instance I've been working with sugar molding for many years. I've made these eggs in different sizes and I've made countless decorations for cakes and so forth. What works for me depends on what I'm making; the size the texture I want in the finished molds color and how stable the pieces must be when they are finished. In the case of these eggs I do want the sugar granule texture to show so I use half regular sugar and half superfine. If I'm making letters numbers or flowers and other small cake decorations I use all superfine or half super and half powdered. In any case I never use egg whites. I prefer using meringue powder and water mixed to the consistency that is right for me. It makes for a stable \"glue\" with no variable consistency unlike egg whites. I suggest using food color pastes versus liquid color. It's definitely more true to color takes less amt and is buildable up to very intense vivid shades. Use the ratios of sugars to liquids above as a guide you can always add more of anything as you get a feel for the work. Build color slowly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LoriMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lorimd/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-03-11T05:33:16.953Z",
                "reviewBody": "This is not a complete recipe. You need to tell people to hollow it out and decorate the insides then glue it together and then decorate the outside. I've been teaching how to make panoramic eggs for 40 years. I find that using egg whites instead of water causes them to turn yellow after a while.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Gram",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13450440/"
                }
            }
        ]
    }
]