[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15974/world-cuisine/asian/pakistani/",
                    "name": "Pakistani",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22752/rice-pudding-kheer/",
        "name": "Rice Pudding (Kheer)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3591083.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "2000-08-31T00:08:02.000Z",
        "description": "This is a very famous Pakistani desert, which is cooked by mixing rice and milk. It is very nutritious and very rich tasting.  Serve warm or cold.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ cup uncooked white rice",
            "2 quarts milk",
            "1 ½ cups white sugar",
            "4 pods cardamom",
            "2 teaspoons rose water",
            "¼ cup finely chopped almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the rice in a small bowl and cover with water.  Soak for one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain the rice and place it in a large, heavy saucepan with the milk over low heat.  Cook, covered 50 minutes, stirring occasionally, until tender.  Stir in sugar and cardamom and cook 20 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from the heat and stir in the rose water.  Serve topped with almonds.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Pakistani"
        ],
        "recipeCuisine": [
            "Asian",
            "Pakistani"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SRECIPE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.186046511627907,
            "ratingCount": 43,
            "itemReviewed": "Rice Pudding (Kheer)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "439.3 calories",
            "carbohydrateContent": "79 g",
            "cholesterolContent": "26 mg",
            "fatContent": "8.5 g",
            "fiberContent": "0.7 g",
            "proteinContent": "12.8 g",
            "saturatedFatContent": "4.3 g",
            "servingSize": null,
            "sodiumContent": "133.9 mg",
            "sugarContent": "65.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-24T04:04:30.523Z",
                "reviewBody": "I've made this recipe twice in the last 3 days.  Here's my strong suggestions:  DO NOT soak the rice.  The milk needs the starch from the rice in order to properly thicken.  If there isn't enough starch, the pudding will be thin/runny.  \n\nUse GROUND RICE!  In your blender or food processor - grind about 3/4 cup rice as much as possible - there will remain some coarsely ground grains - this is perfect!    \n\nWhole milk works best.  However, if you're looking to  reduce fat - I discovered that using a combination of 2 c. whole milk and 6 c. 2% milk is good.  Just increase the rice a little bit to avoid a slightly thin pudding.  \n\nSubstitute a scant 1/2 tsp ground cardamom for the pods.  However, I strongly suggest increasing the rose water a bit because the ground cardamom will drown out the rose water. \n\nCUT WAY BACK ON THE SUGAR!  No more than 1 cup unless you want very sweet pudding.  I preferred the taste using only 3/4 cup sugar.  \nQuicker preparation:  Bring milk to a boil; reduce heat, add ground rice and simmer 25 minutes (stir occasionally).   Add cardamom & sugar; simmer 10 minutes.  Remove from heat & add rose water.  Almonds can be optional... top pudding with chopped pistachio nuts.\n\nWhen the pudding cools pour into a ceramic bowl, or individual ramekins; refrigerate until cold and set.  \n5 stars with alterations - otherwise a 3+/4-",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-08T20:17:19.06Z",
                "reviewBody": "I love this recipe! I had Kheer for the first time yesterday at an Indian restaurant. I liked it so much that I immediately came home and started looking for a recipe. I used this recipe and it was just as delicious as what I had at the restaurant. I made it almost exactly like the recipe except for just a couple of minor changes. For example I only had cardamom seeds in my pantry so I crushed these and added approximately 1/2 of a teaspoon in place of the cardamom pods. This worked out very well and gives it a delicious flavor. The rose water is a very nice and subtle addition but I'm sure the Kheer would still be delicious if you don't have any on hand. I noticed that a previous reviewer thought that it needed more rice but I think this is probably the correct amount. The one that I had at the restaurant didn't even have this much rice in it. It was almost soupy enough to drink which I presume is the way it is supposed to be. Since I was somewhat rushed I didn't take time to soak the rice but just rinsed it a few times in cold water. That seemed to be sufficient and I don't think it made much of a difference. I cooked mine uncovered as I was afraid that it would boil over and I couldn't watch it the whole time. I just kept it on a low simmer and stirred it now and then. This is a very sweet dessert and you can safely reduce the sugar just a tad if you prefer. I used sliced almonds which had been toasted lightly. This is good warm but is even better after",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAVVYSISTERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/816514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-15T05:01:31.763Z",
                "reviewBody": "this recipe is alright but its much better when you substitute half of the milk with coconut milk and you can get by with only 3 T. of sugar and half the amount of rose water 1/2 tsp. of cardamom.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRICK7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1050593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:24:15.497Z",
                "reviewBody": "This is the reply to the first review.You can substitute 1/4 teaspoon cardomom powder. This is the reply to the other review regarding milk quantity.Use the milk as advised because the milk needs to be boiled for longer which produces a rich taste and the quantity of milk is reduced with prolonged boiling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "madhu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/881310/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-18T22:17:05.92Z",
                "reviewBody": "This was pretty good. I used the rice/milk proportion that the recipe called for and cooked the kheer uncovered. I worried that the kheer was too thin so I raised the heat and boiled some of the milk off. However when the kheer cooled it was too thick. So I think the rice/milk proportion stated in the recipe is correct. Also the rose water has a very strong flavor; I was not very careful measuring it and so the rose water overwhelmed the cardamom flavor. And I mixed in raisins & slivered almonds in the end. Overall this is a very good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ATZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/823303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:24:14.043Z",
                "reviewBody": "I am wondering if the ratio of milk and rice is correct. 2 quarts of milk to 1/4 cup of rice seems to be off. I had to use less milk by about a quart and a quarter.. The flavor is wondeful though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "BRIGHTON BRIT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/430963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-04T13:26:54.623Z",
                "reviewBody": "Addictive flavor. Although it takes time this is a very easy recipe with simple healthful ingredients. The timing of soaking the rice is important. If you soak the rice for too long then it won't absorb enough of the milk and it will turn out too watery. I substituted 4 tsp ground cardamom for the 4 pods which might be a little much but I love cardamom. Be sure to stir the pudding while sprinkling the cardamom on so that it doesn't clump. I omitted the almonds and it tasted great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MBERRYBLUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1361280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:24:16.03Z",
                "reviewBody": "This recipe is exactly like the Kheer we get in our favorite Indian restraunt. I searched all over to try to find the right recipe. It's EXCELLENT! My husband can't get enough. Although he likes to just drink the milk and leave the rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ep",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-15T18:28:58.61Z",
                "reviewBody": "Wow this is so good and so authentic! Exactly like what is served at Indian restaurants...even better! I like the addition of the almonds. I used basmati rice and lightly toasted the almonds. I had my doubts about the rose water because it smells so \"perfumey\"...but it really accents the pudding beautifully. I also cut back on the sugar a little...I used 1 1/4 cups. The recipe as it is scaled makes a lot of pudding...it doesn't cook down much since there is no boiling involved. Next time I will scale down by half since I am the only one in my family who likes pudding (I just don't get it)! Shazia I make your Pasanday often and now this will be a regular treat too! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURA B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/149230/"
                }
            }
        ]
    }
]