[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14734/soups-stews-and-chili/soup/vegetable-soup/squash-soup/",
                    "name": "Squash Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 7,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16370/soups-stews-and-chili/soup/vegetable-soup/squash-soup/butternut-squash-soup/",
                    "name": "Butternut Squash Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22956/roasted-and-curried-butternut-squash-soup/",
        "name": "Roasted and Curried Butternut Squash Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F22994.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2000-10-11T16:51:35.000Z",
        "description": "This is my original recipe and can be either vegetarian or meat based.  It also freezes well - just thaw, heat and add cream or yoghurt before serving.  It's delicious and well worth the extra steps of roasting and pureeing.  Enjoy!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 butternut squash, halved and seeded",
            "2 large onions, peeled and quartered",
            "1 medium head garlic",
            "6 cups vegetable broth",
            "1 bay leaf",
            "1 teaspoon brown sugar",
            "1 teaspoon mild curry powder",
            "½ teaspoon dried oregano",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon ground nutmeg",
            "salt and pepper to taste",
            "1 cup plain yogurt",
            "¼ cup chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper or aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place squash halves and onion onto the prepared baking sheet. Wrap garlic in foil and set with other vegetables.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast in the center of the oven for 45 to 60 minutes, until the squash is tender. Remove from oven and set aside until cool enough to handle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Squeeze garlic cloves out of their skin like paste into a food processor. Scrape the flesh from the squash and place into the food processor along with the roasted onion. Puree until smooth. Add vegetable broth if necessary. Transfer the pureed mixture to a stockpot and stir in  vegetable broth. Season with the bay leaf, brown sugar, curry powder, oregano, cinnamon, nutmeg and salt and pepper to taste. Bring to a boil and simmer gently for 10 minutes. Remove from heat and stir in yogurt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove bay leaf and serve hot. Garnish with fresh parsley if desired.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Squash Soup Recipes",
            "Butternut Squash Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "lcpgh"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.220183486238532,
            "ratingCount": 218,
            "itemReviewed": "Roasted and Curried Butternut Squash Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "142.4 calories",
            "carbohydrateContent": "31.1 g",
            "cholesterolContent": "1.8 mg",
            "fatContent": "1.2 g",
            "fiberContent": "4.9 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "376.8 mg",
            "sugarContent": "10.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-20T06:04:44.677Z",
                "reviewBody": "I am a chef in a Manhattan Resturant, and we have recently received several requests for pumpkin or squash soup.  I searched the internet, and I liked this recipe because of the roasted squash- this makes a huge difference in flavor.  Let me tell you what I did for the resturant, and how I modified it at home for my family.  First, for the resturant:\n\n2.5 lbs (40 oz) of butternut squash, peeled and seeded\n2 large yellow onions, quartered\n6 cloves of peeled garlic\n1 2\" piece of fresh ginger, peeled and cut into 4 chunks\n2 cups of chicken stock\n2 cups of heavy cream\n2 tsps of salt\n1 tsp of white pepper\n1 tsp of medium curry powder\n2 tbs. of chopped fresh cilantro\n1 tsp. of cinnamon\nSour cram and cilantro for garnish\n\n1. Roast squash, onions, garlic and ginger until brown and soft- over an hour, depending on your oven\n\n2. Puree in your blender or food processor with chicken stock until completely smooth.  Should be done in batches.\n\n3. Heat on medium heat- add salt, pepper, curry, 1 tbs. of cilantro, and cinnamon (cinnamon can be a spice that enhances sweet or savory dishes- don't be afraid of it!).  While the mixture is hot, but before it bubbles, slowly add the heavy cream.  Add until it is the desired color and thickness for your taste, and allow mixture to bubble.  Lower the heat, and continue to cook on low flame for another 10 minutes.  Remove from heat, and let rest for 10 minutes.  Before serving, add a dollup of sour cream and sprinkle the rest of the fresh cilanto on t",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2623522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-14T00:38:14.263Z",
                "reviewBody": "This is a grown up treat. I hate squash but I cater parties and was asked by the client to make a squash soup. I searched and found this recipe followed the instructions exactly and wound up with a soup I tried and actually liked(!!!) and received rave reviews from my paying clients over. Have used it several times since and am working on coming up with some short cuts which may allow it to obtain better ratings on the quickness & easiness ratings. As for the kid-friendly rating who cares? Not everything is for children who are notoriously fussy eaters and should not be catered to as they have no sense of taste and should be ignored in terms of culinary aspiration. AllRecipe should add another rating scale - entertainment potential in which this recipe would score off the charts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THELASTBARON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/259468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-05T15:59:46.403Z",
                "reviewBody": "This soup is okay. It's quite similar to an excellent recipe that was passed on to me from a friend and which I later found in Vegetarian Classics by Jeanne Lemlin. I prefer the latter recipe which I've modified a little and which includes coconut milk and fresh ginger. I recommend substituting the yogurt with coconut milk; nixing the oregano cinnamon and nutmeg and bayleaf and instead using extra garlic 1 inch of fresh ginger root (finely minced) and 1 -2 T. of sweet curry powder and a dash of cayenne pepper for bite. This soup will knock your socks off. It's gotten rave reviews everywhere I go.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "EXTERRA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/705277/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-07T20:01:11.1Z",
                "reviewBody": "Okay I must confess I've made this twice and it's a keeper! 1st time I made it I started off by accident NOT reading the recipe and cut the veggies sticking it in a pot with vegetable stock and while it was boiling away proceeded to read the recipe... Well after all of that it turned out terrific! My husband proclaimed it his favorite yet! Then 2 weeks later I roasted the veggies and must admit it was even better than the first time! So if you don't want to \"mess\" with roasting as some have suggested- don't- boil it and run it through the blender/food processor and you'll have a definite keeper recipe! But if you are patient and roast everything you will be rewarded handsomely for your effort! My husband and I thank you for this terrific low cal meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1834492/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T06:13:21.287Z",
                "reviewBody": "I made this and substituted 2 cups of coconut milk for the yogurt, added more curry and ginger, more brown sugar, and a bit more salt.  It was easy to make and my family loved it.  A definite keeper.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Totten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1227176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-16T01:09:53.383Z",
                "reviewBody": "The roasted veggies made this soup delicous. I also used the coconut milk instead of yougart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paige",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1941358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-17T08:06:57.17Z",
                "reviewBody": "AWESOME!!! I just love squash soup this one is a healthy keeper!!! I used 'World's Greatest Vegetable Broth' found on allrecipes.com for my vegetable stock it is HEAVENLY and compliments this recipe well! (I try to avoid store-bought stock because of all the salt.) I doubled the curry (and I used Sharwood's extra-hot curry and it really wasn't overpowering just gave it a nice mellow flavour if you can beleive it) and I alse added some baked apples and carrots to the puree. Tastes great even without the yogurt. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GoodKitty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/658792/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-13T18:15:42.553Z",
                "reviewBody": "UPDATE 10/13/11 No matter how much I make this I never tire of it. I decided to add some diced macoon apple but did not puree nor did I peel them. gave bits of color and that bite of sweet apple lends to the savoriness of the soup. No oregano..i always sub a bit of fresh cilantro. Excellent! Perfect for a cool fall day. Recipe followed exactly except omitted the oregano upped the curry to 1 1/2 tsp. and didn't add yogurt directly to soup; just used a dollop to garnish the individual bowl. Used cilantro instead of parsley out of personal preference. Used Lawry's salt instead of regular. I used 2-15 oz. cans of broth. Important to remember that each squash has a different water content so adjust accordingly. The buttercup used didn't have a high water content so added broth after everything else was pureed and added to the stockpot. Since the squash was exceptionally sweet I didn't need to add brown sugar. The dollop of yogurt added a nice creamy touch. Thank you for this wonderful fall recipe that I'll make seasons to come!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-26T01:44:58.387Z",
                "reviewBody": "Wonderful! I used two medium squash since recipe didnt specify size of the one also I upped the curry powder and used coconut milk at the advice of another review in place of yogurt because I didnt have any. But these were my own person variations... This is just a great recipe with a perfect blend of spices. Other reviewers mentioned it being annoying to roast the veggies or that it dirtied all of their dishes but to the contrary I dirtied very few dishes and how hard is it to cut a few veggies and stick 'em on a cookie sheet? Only problem I had was being to imatient to let them cool before I scooped them into processor! Ouch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELM82",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1255885/"
                }
            }
        ]
    }
]