[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/375/desserts/specialty-desserts/tiramisu/",
                    "name": "Tiramisu Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23143/easy-tiramisu/",
        "name": "Easy Tiramisu",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F476708.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-10-25T09:02:52.000Z",
        "description": "Yummiest dessert ever! And very easy to make. This is my family's favorite. One serving is not enough! Believe me! Don't substitute the mascarpone with double cream. There is no tiramisu without mascarpone. And use the best quality coffee.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT1H15M",
        "recipeYield": "1 - 8x8 inch dish",
        "recipeIngredient": [
            "3 egg yolks",
            "¼ cup white sugar",
            "2 teaspoons vanilla extract",
            "1 ⅛ cups mascarpone cheese",
            "24 ladyfingers",
            "1 ½ cups brewed coffee",
            "1 tablespoon unsweetened cocoa powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, beat yolks with sugar and vanilla until smooth and light yellow.  Fold mascarpone into yolk mixture.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip ladyfingers briefly in coffee and arrange 12 of them in the bottom of an 8x8 inch dish.  Spread half the mascarpone mixture over the ladyfingers.  Repeat with remaining cookies and mascarpone.  Cover and chill 1 hour.  Sprinkle with cocoa just before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KALLISTA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.163636363636364,
            "ratingCount": 110,
            "itemReviewed": "Easy Tiramisu",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "406 calories",
            "carbohydrateContent": "35.6 g",
            "cholesterolContent": "252.2 mg",
            "fatContent": "25.8 g",
            "fiberContent": "0.7 g",
            "proteinContent": "9.2 g",
            "saturatedFatContent": "12.9 g",
            "servingSize": null,
            "sodiumContent": "92.7 mg",
            "sugarContent": "8.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-01T02:25:40.463Z",
                "reviewBody": "first i changed the servings to yeild 11 servings. this made enough cream for my 8x11 baking dish. I used enough lady fingers to fill the dish. (appx 30?). i followed the recipe exactly with all the ingredients, but i also added a secret ingredient to the mascarpone mixture. i used a pint of heavy whipping cream, beat it seperately to make my own whipped cream and folded it into the mascarpone mix together with allt he other ingredients. this will make the consistency of the cream JUST RIGHT (so its never runny) without changing the taste. \nthen, to solve your problems of the lady fingers breaking.... use VERY COLD coffee. i buy a large cup of black coffee\n WITH 2 SUGARS IN IT and refrigerate it for a few hours. then i dunk the lady fingers very quick on both sides but give them no time to soak.  \ni serve the next day. IN-FREAKING-CREDIBLE!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elenara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1653652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-24T02:40:15.857Z",
                "reviewBody": "Very horrible recipe I thought with all the good reviews it would be good. The ladyfingers were soaked with coffee making the dessert very juicy. I would suggest just brushing the ladyfingers with a coffee-soaked pastry brush.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLY601",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-19T23:03:50.823Z",
                "reviewBody": "This recipe is great! Like other reviewers I made changes based on the unavailablity of lady fingers in my area and with the filling amount and process. I used one store bought angel food cake in place of the lady fingers. I also used a 9X13 pan. Here are the amounts of other ingredients I used: 5 egg yolks 1/3 cup white sugar 3 Tbsp vanilla extract 16 oz Marscarpone cheese 1 angel food cake 1 cup strongly brewed instant coffee 1.5 Tbsp cocoa powder I placed slices of angel food cake in the pan then spooned 2 teaspoons of coffee per piece over the bottom layer rather than dipping. Then I put a layer of filling and then a layer of cake this time with 3 teaspoons per piece. It worked out wonderfully and was not soggy at all. As a former health inspector I was concerned about using raw eggs but there's enough sugar in the mix to not allow bacterial growth. I also made sure to promptly refrigerate any remaining cake. I especially love this recipe because I wanted tiramisu without the alcohol. I will definetly make this again. I may substitute the marscarpone with neufchatel cheese as I wouldn't mind it tasting a bit like cheesecake and it would make it less expensive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JulieCC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/juliecc/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T05:47:46.03Z",
                "reviewBody": "This is one of the most delicious no bake easy recipes there are. The only reason I had to give it 4 stars is because I had to make a few changes to make it even better-1st change is double the filling amount. 2nd change is to dip the ladyfingers (make sure they are not soft but hard cookie ones) in a mixture that is 2 parts coffee 1 part frangelico hazelnut liquor. Then i added some whipped cream on top. This is excellent and everyone that tries it loves it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NOELLETHEDIVA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/696700/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T05:47:52.45Z",
                "reviewBody": "I had a few issues with this recipe. First of all I did follow others suggestions and made twice the cheese filling. The filling was very thin even after adding an additional 1/4 cup of cheese. After sitting in the fridge for 24 hours it did finally firm up enough to where you could cut into it and have a formed piece instead of the filling running everywhere. Second if you are going to use an 8x8 pan as the recipe calls for you should not need all 24 lady fingers or to double the filling. My 8x8 pan would hold 12 lady fingers and the orginal quantity of filling. Thinking in advance I did a dry run with the cookies by placing them in the 8x8 pan before I even started the rest of the recipe. I ended up using an 11x7 pan and I thought it was the perfect size. Because the filling was so thin the cheese mixture didn't do a very goo job of actualy forming a seperate layer. Overall the taste was fine but if I make another tiramisu I will try another recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DOGLOVER22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/574085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-24T00:08:11.03Z",
                "reviewBody": "For never making Tiramisu before this recipe helped me look like a pro. A co-worker born in Italy (and a Tiramisu fanatic) raved on and on about it what more can I say but thanks:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "makeupgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2866168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-29T22:29:58.267Z",
                "reviewBody": "This is a FABULOUS recipe and so easy! It turned out perfect for me but I took the advice of others so it wouldn't turn out runny. Only dip the lady fingers in the coffee for 1 second per side. That is plenty any longer and it will turn to complete mush. I know some people suggested using a pastry brush but that doesn't add enough coffee. I also let it sit overnight as so many said it tasted better the next day. It was a complete hit and everyone is asking for the recipe. Very Yummy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kimejorg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3980787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-30T07:55:15.157Z",
                "reviewBody": "I made this recipe before and it turned out excellent. However when I did it this time it turned out to be very soggy to the point that I have liquid sipping out in the pan soaking the leftovers. It happened twice this past 2 weeks and I could not understand what happened. Also the recipe did not mentioned anything about the eggwhite but I went ahead and beat eggwhites to stiff peak with 1 teaspoon of sugar and then fold into the cheese mixture. That should not have affected the result.....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "vlui",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/831901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-25T05:55:27.42Z",
                "reviewBody": "This was a great recipe! I couldn't find any lady fingers so I substituted sugar free pepridge farm milano cookies (since my stepdad is diabetic). I also replaced the white sugar with a sugar substitute. And then I couldn't find mascarpone cheese so I used the recipe using cream cheese (it's called 'mascarpone substitute' here I believe). anyways although mine was a little cheesecake like it was still delicious even as a diabetic recipe... except I did use regular whipped cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADACHIC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/944073/"
                }
            }
        ]
    }
]