[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/749/desserts/candy/chocolate-candy/",
                    "name": "Chocolate Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23189/angel-food-candy/",
        "name": "Angel Food Candy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F304787.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2000-10-26T13:08:34.000Z",
        "description": "Sugar and dark corn syrup are cooked with vinegar and tempered with baking soda to make a crunchy candy that gets covered in a chocolate coating.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "1.5 pounds",
        "recipeIngredient": [
            "1 cup white sugar",
            "1 cup dark corn syrup",
            "1 tablespoon vinegar",
            "1 tablespoon baking soda",
            "1 pound chocolate confectioners' coating "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Butter a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium heat, combine sugar, corn syrup and vinegar. Cook, stirring, until sugar dissolves. Heat, without stirring, to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat and stir in baking soda. Pour into prepared pan; do not spread. (Mixture will not fill pan.) Allow to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the microwave or over a double boiler, melt coating chocolate, stirring frequently until smooth. Break cooled candy into bite-sized pieces and dip into melted candy coating. Let set on waxed paper. Store tightly covered.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Chocolate Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Debbie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.540983606557377,
            "ratingCount": 122,
            "itemReviewed": "Angel Food Candy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "129.4 calories",
            "carbohydrateContent": "22.2 g",
            "cholesterolContent": null,
            "fatContent": "6 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "134.9 mg",
            "sugarContent": "9.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-27T04:53:11.687Z",
                "reviewBody": "This recipe was exactly what I was looking for.  My brother and I used to fight over the angel food candy every Christmas. It was a favorite of both of ours. After I made this, I couldn't wait for him to try some.  Well, as I thought, he couldn't keep his hands off of it.  When I told him that I made it, he wouldn't believe me.  I actually had to show him the recipe in order to convince him that it wasn't store bought. Here are a few things that you might like to know about this recipe. First of all be sure to use all of the baking powder, stir it in quickly and then pour it into the buttered pan. Make sure you just pour it into your pan, do not spread it around. This recipe is great, but if you want the candy even lighter, be sure to butter the pan all the way up the sides and then put the candy into the oven at 200 to 250 degrees right after you pour it into the pan for ten minutes and then decrease the temperature to 170 degrees for another ten minutes. The candy will puff up and fill the entire pan. It is a good idea to use a metal pan or one of those flexible pans. This makes it easier to get the candy out when it cools. Thanks Debbie, for sharing this recipe with us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1960106/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-14T12:43:10.25Z",
                "reviewBody": "Perfect!  It is also called fairy food, seafoam, sponge candy, honeycomb, hot air candy, etc.  After 8-10 failed batches, I finally found the way to success:  If you don’t have a high quality DIGITAL candy thermometer, don’t even try this.  The brand I use is CDN.  Previously I had tried a cheap analog thermometer and/or testing in cold water, but the candy cooks so quickly that by the time the thermometer registered the right temp (or a sample formed a brittle thread), the candy had already cooked to a much higher temp.  It burned EVERY time I tried these methods.    Before starting to cook the candy, prepare:  Line your pan with non-stick foil.  Measure and sift baking soda.  Make sure your pan is large enough, as the mixture will foam a great deal after you add the baking soda.  Use a heat-proof silicone spatula for stirring the candy mixture.  Cook only at medium heat or lower; higher will cause the candy to cook too fast and it will burn.   Be ready; the SECOND the candy thermometer registers 295° (300° risks burning), slide your pan off the burner and add the baking soda.  Stir quickly, but be sure to incorporate every bit of the soda.  (It’s nasty to get even a teeny bite of pure soda!)  Pour into the nonstick foil-lined pan as evenly as you can, but resist the urge to spread it.  It will fill in the empty spots as it cools and settles.  Score cooled candy w/ a serrated knife, then place into a Ziploc bag and break.  Pieces will be irregular in shape.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The (Almost) Amazing Mammarino",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2289696/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-30T05:54:00.17Z",
                "reviewBody": "Yes - finally SUCCESS!!  I've  been making this candy using this recipe  for 4 or 5 yr now. Best candy ever but frustrating to make.  We make for Christmas, but it takes 4 - 5 tries to get 2 - 3 good batches.  Well, this year I went back and read all the reviews and made some changes and ended up with 2 perfect batches for 2 tries!!  Per Lisa K, we sifted the baking soda, used 1/2 cup brown sugar and 1/2 cup white sugar (in place of 1 cup white), used parchment paper to line the pan, put in 225 degree oven for 10 min after we poured into pan, then lowered to 170 for 10 min more (amazed it continues used to puff up), and lastly scored with a knife and then broke by hand into (mostly) perfect pieces (did try the pizza cutter but got very crumbly results.  Thought I would put all these tips in one place.  I'm so excited I don't have to go through numerous ruined batches to get the couple of good ones I need for the holidays.  This truly is a family favorite and want to thank everyone for the great tips!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cara Huhman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14787602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T21:53:22.107Z",
                "reviewBody": "This is great! I have tried a lot of different reipes and this one is a good one. For the person who said it smells like campfire marshmallows burning; you are probably cooking it on too high heat. I used to burn mine all the time because I was in a hurry to get it up to the required temperature on the candy thermometer. I have learned to cook it slower and it turns out every time. I also use light corn syrup and it tastes good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "geri_s",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1426408/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:44:36.16Z",
                "reviewBody": "Wonderful recipe, brought me back to my favorite childhood treat.  BUT much better with real dipping chocolate than the coating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYSB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/566446/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-11T21:40:25.483Z",
                "reviewBody": "Very quick and easy to make. Tastes just like the old fashioned Angel Food Candy my husband grew up eating at Christmas time, he said.  I used real chocolate (3 cups of semi-sweet chocolate chips) and 1/4 cup of vegetable shortening to make my own chocolate coating (heated it in microwave).  Then set the candy in the refrigerator to set up faster.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/774632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:44:36.803Z",
                "reviewBody": "This is a really easy recipe. For one who had never made candy or used a candy thermometer until this recipe I found it very easy. I would also like to stress not to spread the candy once you have placed it in the pan. Makes more than it seems like it is going to.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara Doege",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/230964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-07T19:47:54.767Z",
                "reviewBody": "The only issue I had with this recipe wasn't really with the recipe. You should note REMOVE IMMEDIATELY from heat when the desired temp is reached...otherwise it tastes a little burned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2555334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-21T18:24:31.493Z",
                "reviewBody": "OK, you're all probably going to hate me. I had NO trouble making this recipe at all. And I've never made it before. So, you CAN do it. Don't be afraid to try! But, I did read the reviews thoroughly. I used half brown sugar and half white sugar, and sifted my baking soda. I greased my GLASS (Bc it's what I have) baking pan well, over every crevice, and had everything all ready to go and in it's place when I started cooking the candy. You want to cook it LOW & SLOW. I'm talking med low heat, it will take a LONG time. Find something else to do while it's cooking., and leave it alone! I used only a cheap candy thermometer because it's what I had, and I found that my candy was ready before it reached 350 degrees. I used the cold water test. That's a better indicator of when it's ready then strictly going by the temp (again,in my opinion. I mean, what did our moms and grandmother's do without candy thermometers?). Also, I too used melted semi-sweet chocolate with just a touch of shortening in it in place of the choc conf coating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amydoll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:44:36.007Z",
                "reviewBody": "I don't know how it was supposed to turn out, exactly, but it wasn't what I had envisioned.  It was too big for my dish and ended up touching the sides, which made it extremely hard to remove from it.  I didn't even bother adding the chocolate coating.  Perhaps some of these things are my fault (I've never been an excellent candymaker) but I didn't like the recipe anyhow.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SISSI808",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/307522/"
                }
            }
        ]
    }
]