[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
                    "name": "Custards and Puddings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1559/desserts/custards-and-puddings/chocolate-pudding/",
                    "name": "Chocolate Pudding Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23192/chocolate-cream-pudding/",
        "name": "Chocolate Cream Pudding",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F998564.jpg",
            "width": 990,
            "height": 998
        },
        "datePublished": "2000-10-26T00:50:58.000Z",
        "description": "Sugar, cornstarch, milk and unsweetened chocolate are cooked, thickened with egg yolks, cooked some more and then flavored with butter and vanilla before chilling.",
        "prepTime": null,
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup white sugar",
            "2 tablespoons cornstarch",
            "¼ teaspoon salt",
            "2 cups milk",
            "2 (1 ounce) squares unsweetened chocolate, chopped",
            "2 egg yolks",
            "2 tablespoons butter",
            "2 teaspoons vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium heat, combine sugar, cornstarch and salt.  Stir in milk and chocolate.  Cook, stirring constantly, until chocolate melts and mixture thickens.  Remove from heat and stir in egg yolks.  Return to heat and cook 2 minutes more.  Remove from heat and stir in butter and vanilla.  Chill before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Custards and Puddings",
            "Chocolate Pudding Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mimi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.438818565400844,
            "ratingCount": 237,
            "itemReviewed": "Chocolate Cream Pudding",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "282.2 calories",
            "carbohydrateContent": "42.7 g",
            "cholesterolContent": "85 mg",
            "fatContent": "11.8 g",
            "fiberContent": "1.6 g",
            "proteinContent": "4.8 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "162.8 mg",
            "sugarContent": "37.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-02-03T21:05:31.787Z",
                "reviewBody": "I don't want to be rude, but if this recipe turns out as anything other than a perfect basic chocolate pudding, it is entirely your fault. If you have egg bits: you put the egg in too much at a time and the temperature difference between the eggs and mixture was too high. Temper the eggs first or they will cook instantly when you put them in. Corn starch bits: you added the corn starch too late and the mixture was too hot. Mix the corn starch in thoroughly with the first cup of milk until it's dissolved. Liquid consistency after chilling: you didn't stir it enough while it was cooking. Stir it more until it becomes thick in the pan. Chocolate didn't melt: you cooked it too hot and the chocolate was too thick. Break it into smaller pieces, shave it, or cook the pudding on a lower heat for a longer period of time. Gritty or otherwise imperfect texture: you didn't use a whisk. Use a whisk. Remember that the pudding is only as good as the ingredients you put in it, so if you want it to turn out awesomely, splurge a bit and get some GOOD chocolate. Furthermore, it's a recipe that will take some tweaking before you get it exactly to your tastes. Don't make it once, trash it, and blame it on the recipe; make it twice, three, four times and change it each time until you get it. This is a pudding worth mastering.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarasvati",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2874615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-20T23:06:11.403Z",
                "reviewBody": "Great stuff.  I served this cold at a dinner for 20 and got loads of compliments.  Adding 15% more chocolate made the flavor intense.  I would add a few steps to the instructions.  1)Destroy every lump in the powder mix or risk lumpy pudding. 2)Grate the chocolate.  It melted at the same moment the mixture boiled. 3) Stir a few spoonfuls of heated cream/chocolate mixture into the egg yolks to warm them up BEFORE putting the egg yolks into the pot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SHERRYMILLER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/672143/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:30:39.217Z",
                "reviewBody": "Very creamy and tasty. Unsweetened cocoa powder (with a little vegetable oil) can be substituted for the unsweetened chocolate with good results. As an aside, for those having trouble adding in the egg: beat the yolks in a bowl and add a tiny bit of the hot pudding in, mix it up and add a little more. Then you can add the yolks into the pudding and they won't 'scramble'. Seperate the yolks carefully as well or you'll get bits of cooked egg white in your pudding. Overall a good, old-fashioned pudding recipe with wonderful texture and flavour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SMACKJACKAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/350261/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-18T21:13:18.123Z",
                "reviewBody": "Basically this is a wonderful, old-fashioned pudding recipe that's been around for decades.  In this recipe an extra teaspoon of vanilla is used. However, the cooking method here is asking for trouble - like cooked bits of eggs to be specific!  (If that happens you might still be able to salvage it by sieving it) Do NOT stir the egg yolks into the hot mixture!   Rather,  stir about a half cup of the hot mixture into the yolks to temper them, then return the egg mixture to the saucepan to finish cooking.  Finally, whether you leave this in one serving bowl or pour into individual serving dishes, cover with plastic wrap directly on the surface to prevent a skin from forming.  Note: For a vanilla variation eliminate the chocolate and reduce the sugar to 3/4 cup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-20T02:09:11.64Z",
                "reviewBody": "This pudding is delicious! My kids and I had this as a snack with some vanilla wafers and loved it! I made a couple of minor changes to the recipe though- I cut the vanilla extract down to 1 teaspoon and added 1 teaspoon of almond extract as well. I also omitted the butter at the end (simply because I got busy with my kids and forgot until it was already in the fridge) and even without it this was the richest creamiest pudding I've ever made and I saved on some calories and fat! I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffinmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2457961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-06T07:22:42.22Z",
                "reviewBody": "I thought this recipe was great simply because it is so easy to make! I will use it again with a couple of slight variations. I thought it was a bit too sweet and the sweetness overpowered the more complex deep chocolate flavor that I was really hoping for. Next time I will use 3/4 cup sugar. Also I used Ghiradelli unsweetened chocolate and I found that I was left with little dark flecks of chocolate throughout the pudding that hadn't melted completely despite the fact that I cooked at a lower heat for a longer period of time to try to avoid this. I don't think this had any impact on the flavor because the pieces were so tiny but next time I will melt the chocolate before adding it in. The little chocolatey spots definitely show that the pudding is homemade though so if they don't bother you just follow the recipe as is and go for it! Although the recipe doesn't mention it make sure you temper your egg yolks before adding them in. (Add a little of the chocolate mixture to the yolks first and whisk to bring up the temperature then pour in to the main mixture and whisk.) Failing to do this will leave you with little chocolatey scrambled eggs! Also I would suggest using a whisk for the entire cooking process to ensure a lump-free pudding. All in all very tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2419264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T23:47:47.497Z",
                "reviewBody": "I upped the chocolate to 2.5 ounces and told my dad that it was really rich...\"Well who doesn't want rich pudding?\" This was really good though. Very creamy rich and chocolately. I only used maybe a teaspoon of butter and it still had great flavor. The best chocolate pudding recipe so far.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FRAMBUESA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-18T01:55:05.5Z",
                "reviewBody": "This was exactly what I was looking for. I did grate the chocolate which worked out very well. Definitely temper the egg yolks by stirring some hot mixture into them then adding them to the pan. If you skip this step you'll wind up with little chunks of scrambled egg yolk in your pudding.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:30:26.14Z",
                "reviewBody": "There's a trick to get all of the chocolate to melt. Use a whisk!! This recipe turns out great! My kids just loved it. Also add the egg yolks in a little at a time not all at once. This will definitely go into my family's \"favorites\"! Becky D.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BECKY D.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/122686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T02:35:24.793Z",
                "reviewBody": "way too bitter for my tastebuds and im a dark chocolate fan. needed more sugar to sweeten things up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "NYPD K9 COP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nypdk9cop/"
                }
            }
        ]
    }
]