[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/350/bread/quick-bread/muffins/",
                    "name": "Muffin Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2003/bread/quick-bread/muffins/blueberry-muffins/",
                    "name": "Blueberry Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23294/blueberry-cream-muffins/",
        "name": "Blueberry Cream Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5341114.jpg",
            "width": 3648,
            "height": 2498
        },
        "datePublished": "2000-10-26T02:48:18.000Z",
        "description": "Rich and delicious blueberry muffins. The secret is the sour cream.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "4 eggs",
            "2 cups white sugar",
            "1 cup vegetable oil",
            "1 teaspoon vanilla extract",
            "4 cups all-purpose flour",
            "1 teaspoon salt",
            "1 teaspoon baking soda",
            "2 cups sour cream",
            "2 cups blueberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Grease 24 muffin cups or line with paper muffin liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large bowl beat eggs, gradually add sugar while beating. Continue beating while slowly pouring in oil. Stir in  vanilla. In a separate bowl, stir together flour, salt and baking soda.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir dry ingredients into egg mixture alternately with sour cream. Gently fold in blueberries. Scoop batter into prepared muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Muffin Recipes",
            "Blueberry Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KK3"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.600339174674958,
            "ratingCount": 1769,
            "itemReviewed": "Blueberry Cream Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "281 calories",
            "carbohydrateContent": "35.2 g",
            "cholesterolContent": "39.4 mg",
            "fatContent": "14.2 g",
            "fiberContent": "0.9 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "171.7 mg",
            "sugarContent": "18 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-29T06:27:51.017Z",
                "reviewBody": "Excellent.  Moist and tender.  I've made this recipe many times and I always add 3 cups blueberries instead of 2.  If using frozen, just throw them right in, no need to thaw.  I also add about about an extra 1/2 cup of sugar & 1 1/2 teaspoon cinnamon to the flour mixture for an extra kick, or else the original recipe can be a bit bland.  Forget the complicated mixing instructions.  Just mix the sour cream right in with the egg mixture until smooth, then slowly add it to the flour.  As an alternative, using 50/50 of white sugar and light brown sugar gives it more flavor.  And to top it off, I add a brown sugar streusel on top for extra crunch and sweetness b4 baking.  (Use the streusal topping recipe from To Die For Blueberry Muffins off this site).  I do like this recipe the best, even better than the recipe just mentioned.  It's lighter and more moist.  Oh, and DON'T OVERMIX.  Just like pancake batter, mix just until flour has been absorbed.  Batter will be very thick and slightly lumpy.  I use regular (medium) sized muffin tins and fill the paper cups right to the top for bakery size muffins. Will be my master recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-14T20:15:24.95Z",
                "reviewBody": "These are bakery quality; no question. I took the advice of another reviewer and increased the sugar by an additional 1/2 cup, and, I used 50% brown sugar and 50% white (so 1 and 1/4 cup white sugar, 1 and 1/4 cup brown sugar). Just gives more flavor that way. I also added a pinch of nutmeg and about two teaspoons of cinnamon. I mixed the eggs together then tossed in the sugars, vanilla & sour cream all at once. Used three cups of blueberries and fat free Breakstone's Sour Cream. I used a modified crumb topping recipe from a Barefoot Contessa sour cream coffee cake recipe to top muffins: 1/2 cup brown sugar, 1 cup all purpose flour, 6 tablespoons cold butter cut into pieces, two tsps cinnamon. Pinch mixture together with your fingers for couple minutes until it forms more of a crumble). First time I made this topping I worried it was too loose, but it holds well. just spoon a good heaping TBSP on top of each muffin before cooking. They come out SO moist and flavorful. Wouldn't dream of making them without a crumb topping. Another  Barefoot hint: use a regular ice cream scoop (the old fashioned half ball shaped kind with the release lever in the scoop) and scoop evened off scoops of batter into the cups -- they make the perfect size muffin every time. My tip: used a KitchenAid silicone muffin pan & it worked like a charm. This recipe made two dozen large muffins. These will have people thinking you're a pro in the kitchen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T17:41:43.39Z",
                "reviewBody": "I tried a healthier version (6% fat vs. 45% fat) of this recipe and it turned out great.  I substituted apple sauce for the oil and low-fat vanilla yogurt for the sour cream.  I used 2 cups of whole-wheat flour and 2 cups of white flour and added an extra cup of blueberries.  I also saved 1/2 a cup of sugar (and only mixed 1 1/2 cups into the eggs) and used it to top the muffins prior to baking but I found this was too much sugar, 1/4 cup would have worked much better.  I would increase the cooking time to 23 minutes.... a few of the middle muffins looked a little under-cooked.\r\n\r\nNutritional value per muffin: 227 calories, 1.4g of fat, 49.3g of carbs, 4.3g of protein.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAILUAGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/892048/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-25T22:15:14.747Z",
                "reviewBody": "If ever there was a perfect blueberry muffin, this is it. Other than adding more blueberries, I followed the ingredients and method exactly, including taking the extra step of alternating the sour cream with the flour mixture, which is the classic technique for this type batter that's all about texture--it's well worth it. There is no need to tweak or tinker with this recipe at all--as the saying goes, if it ain't broke, don't fix it. This is a perfect, plump and pretty muffin, moist, pleasantly sweet and cakey, just bursting with blueberry flavor. Sprinkling them with demerara sugar just before baking took them over the top, with just a hint of extra sweetness and crunch. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-29T14:09:52.043Z",
                "reviewBody": "Good recipe!!! I am a professional baker and I made this recipe exactly as it said and it turned out great. I think the other reviewers who did not rate this recipe   well did not follow the recipe and mix the ingredients properly.  It's a good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "beth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-27T05:09:28.49Z",
                "reviewBody": "All in all, a very good recepie! Muffins came out absolutely delicious...  I did a bit of tinkering with it, heeding the advice of previous reviewers. Changes I made were as follows: 1 cup of white sugar and 1 cup of light brown sugar, 1 TBSP of Vanilla instead of 1 tsp, added 2 tsps of cinnamon and 1 tsp nutmeg, used 1 1/2 cup of sour cream and 1/2 cup plain yogurt. (That last one because it turned out that I didn't have enough sour cream.) And wound up adding 2 lbs of frozen blueberries instead of two cups. (16 oz weight isn't the same as 16 oz liquid, I know this, yet I forget...)\r\n\r\nThis recepie is really very forgiving. I keep reading that some people complain about them being flat and heavy, and my only guess is that they are possibly overmixing the batter. Much like pancake batter, it's important to mix only until ingredients are just incorporated. Don't be afraid to stir it, but don't go at it like it's a cake batter, either.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Framboise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-20T15:56:56.48Z",
                "reviewBody": "My search for the perfect blueberry muffin is over!  These are just like something out of a bakery.  Not only are they moist and flavorful, but actually come out of the oven looking pretty.  I cut the recipe in half for a dozen and used only 1/4 c. of oil and used a full tsp. of vanilla.  Other than that, I wouldn't change a thing!  These were done in exactly 20 mintues.  I sprinkled a little sugar on top for a little crunch - delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-13T02:30:58.98Z",
                "reviewBody": "I've used a different Blueberry muffin recipe for at over 20 years.  They always were dry by the second day.  These were wonderfully moist and dense.  I used light sour cream, maybe 50% more berries, and a little cinnamon/sugar sprinkled on top before baking.  I also halved the recipe.  Now I wished I hadn't as I will have to make more!  Everyone loved them-thanks!\nUPDATE 2012:  I use melted butter rather than oil - the flavor is much better.  A streusel type topping is very good on these, but you don't need it.  People still tell me how good these are, and they ARE good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOYMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/573019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T22:29:31.577Z",
                "reviewBody": "These muffins are the best! Mind you I altered it quite a bit but that was only because I am trying to incorporate healthier choices into my diet. First I used 2 cups of whole wheat flour and 2 cups of unbleached flour. Second I added 1 cup of ground flax seed and reduced the amount of oil (I used grapeseed oil) to 2/3 cup. I also added 1/4 cup of unsweetened apple juice as well as substituted 1 cup of sucanat (organic evaporated cane juice) and combined these with my frozen blueberries as suggested by a previous review and 1 cup of organic sugar. Last but not least I used homemade non-fat plain yogurt instead of the sour cream. Although it seems that I did not use this recipe at all it was a base for me and I just used the ingredients that I want myself and my family to consume. These were incredibly light moist and very flavorful! I will make these again and again and again. Thanks for the super duper recipe: )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNDMN28",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/182112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-02T18:26:11.63Z",
                "reviewBody": "This was a good muffin but it just seemed to be lacking something. I think 2 cups is too much sour cream because the taste came out less like a blue berry muffin than I imagined. I did add a vanilla sugar topping which looked very nice and added a nice sweet touch but I would recommend using all white sugar rather than the brown sugar substitution some of the reviewers suggested. Of course that is your preference! I will not be making this my blueberry muffin recipie but I did like that all of the ingredients were measured in 1 cup increments. Less dishes to wash.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "theJezzaBella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thejezzabella/"
                }
            }
        ]
    }
]