[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23349/lebkuchen-iv/",
        "name": "Lebkuchen IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Lebkuchen IV"
        },
        "datePublished": "2000-10-27T18:02:30.000Z",
        "description": "This is a recipe I got from my husband's mother several years ago.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT8H40M",
        "recipeYield": "6 dozen cookies",
        "recipeIngredient": [
            "½ cup honey",
            "½ cup molasses",
            "¾ cup packed brown sugar",
            "1 egg",
            "1 tablespoon lemon juice",
            "1 teaspoon lemon zest",
            "2 ¾ cups all-purpose flour",
            "½ teaspoon baking soda",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground cloves",
            "1 teaspoon ground nutmeg",
            "1 teaspoon ground allspice",
            "½ cup chopped walnuts",
            "½ cup chopped candied citron",
            "1 cup white sugar",
            "½ cup water",
            "¼ cup confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small saucepan over medium heat, stir together honey and molasses. Bring to a boil and remove from heat. Stir in the brown sugar, egg, lemon juice and lemon zest until well blended. Set aside. In a large bowl, mix together the flour, baking soda, cinnamon, cloves, nutmeg and allspice. Stir the ingredients from the pan into the bowl and blend well. Mix in the walnuts and  candied citron. Cover the dough and chill for several hours or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using a small amount of dough at a time, roll out to 1/4 inch thickness on a floured surface. Cut into small rectangles. Place the rectangles 1 inch apart onto the prepared baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 to 12 minutes in the preheated oven, until firm. Brush with glaze while hot from the oven. To make the glaze: Combine the 1 cup of sugar with water in a small saucepan over medium heat. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Remove from heat and stir in confectioners' sugar until smooth. Brush over hot cookies.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Nancy Haugen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.933333333333333,
            "ratingCount": 15,
            "itemReviewed": "Lebkuchen IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "64.3 calories",
            "carbohydrateContent": "14.3 g",
            "cholesterolContent": "2.6 mg",
            "fatContent": "0.7 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "16.3 mg",
            "sugarContent": "8.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-17T00:58:53.367Z",
                "reviewBody": "This is the old Betty Crocker cookbook version that I grew up with--a favorite Christmas cookie for sure!!! But I seem to remember an amount of time to boil the glaze like maybe 5 minutes? If you're finding the dough too sticky it's probably because you're using a mixer. That makes a softer dough for some reason. I boil the honey/molasses mixture in a medium sized saucepan then add the other ingredients and stir by hand--finishing up WITH my hands since it's too stiff for me to finish up stirring. I refrigerate in 4 disks wrapped in plastic wrap. After that I dust the dough with flour on each side roll a bit dust again and repeat if needed. No sticky problems! I found that 9 minutes was just right in my oven. For best flavor and texture you'll need to put the cookies in a sealed container with a slice of apple or orange for a month or so changing the fruit every few days. They'll become soft and chewy with a marvelously complex spicy fruity flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deborah Jacques",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/563179/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-21T21:25:36.45Z",
                "reviewBody": "Having moved away from home (and away from German cookie bakers) I decided to try making these for the first time and I'm happy to report that this recipe was great! The only thing that I changed was that I used a bit more citron and nuts than was called for and I used chopped pecans. Before baking I pressed a pecan half into the center of each cookie. Also I used a lemon glaze - something that I think is necessary. To make juice one lemon and add enough powdered sugar to make somewhat thick. Spread on when cookies are still hot from oven. In terms of stickiness this dough is quite sticky but it is definitely manageable. Make sure you chill it overnight and do not add a lot of flour into the dough as you roll. Before placing the cookies on the sheets I blew off any and all flour I could. The cookies turned out great; I have the last sheet in the oven now...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MelanieW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-27T20:59:17.67Z",
                "reviewBody": "I found this exact recipe in Betty Crocker's \"Cookie Book\". I have no idea how the cookies are supposed to turn out I think they're okay but I'm online searching for a better recipe. Even though I refrigerated for longer than 8 hours it was a very sticky dough and I had to use a lot of flour when rolling it out. I found that the cookies burned when they were in at 400; when the oven was between 350 and 375 degrees they baked in 10 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAH2005",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1301998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-03T00:47:01.23Z",
                "reviewBody": "I was disappointed with these. I spent my childhood in Germany and Lebkuchen was always a favorite. These taste good and for taste I would give this probably 4-4.5 stars but the consistency is all wrong - MUCH too crisp and hard unlike what Lebkuchen is supposed to be which is almost cakey. The directions to roll these to 1/4\" is not right - if you roll to 1/2-3/4\" they turn out a lot better. I would also bake these a little less than called for these turned out much too hard. Better for cutting out gingerbread men or building a gingerbread house out of. The glaze also wasn't right - much too gloopy and sticky I ended up only doing the first batch and then throwing out the rest of the glaze - they are good plain or I might add some melted chocolate. I used the Back-Oblaten someone mentioned - the edible paper wafers as a base. I didn't have the problem with stickiness everyone else had if anything it came out of the fridge much too hard and I had to gently warm it to make it pliable and workable again although to be fair I added 1/4-1/2 cup more flour. I'm also in the UK and I think the flour may be a different consistency than US flours which might help. To sum up I think these need to be thicker baked less and possibly need more of a levening agent to get them cakier/softer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "guinevere",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5953455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-15T16:37:06.177Z",
                "reviewBody": "My mother made Lebkuchen every Christmas and gave it as gifts. I am doing the same...this recipe tastes just like hers. Thank you. Sue",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3374688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-10T16:58:54.017Z",
                "reviewBody": "Loved making this recipe i thought it tasted just like real german lebkuchen which i love! Only downside is that the sugar topping didn't work out from me. However this didn't detract from the finished product which was still great. When rolling out the dough i would recommend not putting too much flour on your surface but just rubbing in a little bit to the top and bottom (after every couple of rolls out) this kept the dough nice and not too floury but also helped it roll out very easily!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3273255/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-09T02:39:19.59Z",
                "reviewBody": "I thought this recipe was very nice. Thanks for submitting it. My grandmother also made these cookies every year and although hers were a little different I thought these were very comparable. I added a little more flour and they were easy to roll out. Just going to glaze them now with a lemon glaze and then paint them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Northernmaiden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3355541/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-24T15:29:29.377Z",
                "reviewBody": "This recipe is one that has been in my husband's family for a very long time. We don't add the nuts and we cut down on the citron but they turn out very good. I think this is my son't favorite cookie. They are very spicy and chewy. I do the glaze twice sometimes just for extra sweetness. You can tell that from my picture. Not very pretty but oh so good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "terry haussler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4599631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-15T21:06:52.95Z",
                "reviewBody": "otice no significant liquids no shortening. I ended up with a bowl of sweet spicy flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "hugho",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5377907/"
                }
            }
        ]
    }
]