[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1316/breakfast-and-brunch/waffles/",
                    "name": "Waffle Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23390/emmas-belgian-waffles/",
        "name": "Emma's Belgian Waffles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1752326.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2000-10-23T16:41:21.000Z",
        "description": "These waffles taste wonderful, but are simple to make and include self-rising flour instead of yeast.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 egg yolks",
            "5 tablespoons white sugar",
            "1 ½ teaspoons vanilla extract",
            "½ cup butter, melted",
            "1 teaspoon salt",
            "2 ¾ cups self-rising flour",
            "2 cups warm milk",
            "2 egg whites"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat together egg yolks and sugar. Beat in vanilla extract, butter and salt. Alternately mix in flour and milk until blended well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl, beat egg whites until they have formed soft peaks. Fold egg whites into batter and let stand for 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown and fluffy.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Waffle Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef Emma"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4186046511627906,
            "ratingCount": 301,
            "itemReviewed": "Emma's Belgian Waffles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "445.4 calories",
            "carbohydrateContent": "57.2 g",
            "cholesterolContent": "115.5 mg",
            "fatContent": "19 g",
            "fiberContent": "1.5 g",
            "proteinContent": "10.6 g",
            "saturatedFatContent": "11.4 g",
            "servingSize": null,
            "sodiumContent": "1278.7 mg",
            "sugarContent": "14.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-01-04T23:13:18.43Z",
                "reviewBody": "I bought my boyfriend the Waring Pro Belgian Waffle Maker for Christmas, but he didn't have a good waffle recipe.  I was in search of the \"perfect\" waffle recipe to replicate the flavor and crispness of hotel-style waffles because he would like to be able to wake up in the morning and pour pre-made batter onto the waffle iron and have a wonderful breakfast in a matter of minutes.  I was beginning to get discouraged after trying some other \"highly rated\" recipes and coming up short--they were either not crispy enough, too crispy, lacking substance, too doughy inside, too oily tasting, or too much like french toast.  Although the general ingredients in this recipe aren't too different from others, there's something about it that is spot on!  I made a couple of minor changes based upon what I've learned through other trial & error: I added 1/4 cup corn starch for crispness, used 1 3/4 cups milk and 1/2 cup buttermilk to add a little flavor.  I beat 2 Tbsp of the sugar in with the egg yolks (actually used Egg Beaters substitute) and 3 Tbsp of the sugar in with the egg whites, which stabilizes and softens the whites, improving the batter's longevity and making it much easier to fold into the batter.  I used 2 tsp vanilla and mixed 1 tsp with the yolks and 1 tsp with the whites after they were whipped.  I found I got the most uniform brown color when I used very little cooking spray.  These were fantastic!  They even smelled wonderful!  I may try adding malted milk powder next time",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HottKoko81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3778502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T03:29:16.917Z",
                "reviewBody": "This is an okay recipe - I have found though waffles have a lot to do with a waffle iron and since I bought my Waring Pro belgian waffle iron it has made a world of difference - takes long as you can only make one at a time, but my the difference.  Also, I substitute in some corn starch into the flour mixture and this adds a nice crunch to the waffle.  Another thing I have learned is if you want to keep waffles warm to place them on the oven rack directly, don't ever stack them or put them on a plate, else they can get soggy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheri Laine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2040653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T16:13:28.06Z",
                "reviewBody": "This recipe made very good Belgian waffles! I used 2.75 tsps. baking powder and regular flour. I only waited about 10 minutes, while heating the iron. The only thing that could have been better was the spillage - it is hard to tell how full to make the waffle iron since they rise quite a bit. Don't overfill! Irons are not easy to clean if the batter overflows. I used a new Krups iron that makes 4 square Belgian waffles and the batter made about 9 of these. Add an eighth tsp cinnamon and serve with sweetened vanilla whipped cream...enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBICA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/707673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-06T03:17:38.78Z",
                "reviewBody": "these waffles have quickly become the familys' favorite. They smell so wonderful when cooking. They truly are delicious. I didn't have any self rising flour so I added 23/4 t of baking powder to the flour. The kids are fighting to get to the fridge in the morning to get the leftovers. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEAH CUSTARD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677084/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-06T03:17:20.357Z",
                "reviewBody": "Fantastic waffles.  I must confess though, I couldn't wait the 40 minutes, but did let the batter rest about 5 before I started.  They still turned out perfect!  Thanks Emma!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/205990/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-09-19T14:18:01.857Z",
                "reviewBody": "I got a new Krups Belgian waffle iron for Christmas and this is the 3rd recipie I've tried. This one is by far the easiest and the best. I've never seen my 3 year old eat waffles so fast. Not having to deal with yeast makes this one a keeper for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAMAKERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/563840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-08T18:49:30.06Z",
                "reviewBody": "Quite frankly I'm baffled! I made these last night to use as a summer dessert. The waffles were somewhat tough. I followed the recipe exactly even down to the self-rising flour (brand was Gold Medal). There was batter left over so I made them for breakfast - same thing - they were tough kind of rubbery. I have been making homemade waffles for years and this is the first time this happened. I'm still trying to figure out what went wrong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "anchrista",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/781635/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:09:42.663Z",
                "reviewBody": "made them for a breakfast at work fixed the batter before leaving for work and by the time we started making them (with my handy waffle iron) the 40 minutes you're supposed to wait was up. it worked out great tasted great everyone was very pleased. i added cinnamon and a dash of nutmeg for flavor. great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANTABIROSTRIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/211021/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-03T19:01:11.84Z",
                "reviewBody": "First of all, this recipe, in my opinion, is not as simple as the description makes it sound.  That may have something to do with the fact that my handmixer is not working and I had to do it all by hand, but there were lots of steps just to make waffles.  \n\nNone the less, this recipe is fantastic!  The outside of the waffle is crispy and the inside is soft and delicious.  I followed the recipe almost exactly, with a couple changes.  First, I added a few tablespoons of malted milk at my husband's request.  Also, I only used half the salt that was called for.  Next time I will either skip the salt altogether or use unsalted butter, as it was still a little bit salty for my taste.\n\nMy husband raved about these waffles, I will most definitely be making them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wingingit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2055855/"
                }
            }
        ]
    }
]