[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23644/ricardos-pizza-crust/",
        "name": "Ricardo's Pizza Crust",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F780757.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2020-06-19T03:05:01.000Z",
        "description": "This is a magnificent Italian flavored crust for the bread machine.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "1 - 16 inch crust",
        "recipeIngredient": [
            "1 cup warm water (110 degrees F/45 degrees C)",
            "3 tablespoons olive oil",
            "3 tablespoons white sugar",
            "1 teaspoon salt",
            "2 ½ cups bread flour",
            "2 teaspoons minced garlic",
            "2 ¼ teaspoons active dry yeast",
            "½ teaspoon dried oregano",
            "½ teaspoon dried basil leaves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine water, olive oil, sugar, salt in pan of bread machine  Add flour, then sprinkle garlic on flour.  Lastly add yeast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn machine on dough cycle.  As the dough mixes, sprinkle on oregano and basil until it suits you for color and taste.  Let mix for about 15 to 30 minutes. Let the dough rest from 5 to 30 minutes. The longer it rests, the thicker and more tasty the crust. Meanwhile, preheat oven to 475 degrees F (245 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out dough on a lightly floured surface. Spray a large pizza pan with nonstick cooking spray.  Place dough on pan and add your choice of pizza toppings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until golden brown, about 12 to 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Richard Maloy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.707865168539326,
            "ratingCount": 267,
            "itemReviewed": "Ricardo's Pizza Crust",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "177.8 calories",
            "carbohydrateContent": "29.2 g",
            "cholesterolContent": null,
            "fatContent": "4.7 g",
            "fiberContent": "1.1 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "234.6 mg",
            "sugarContent": "3.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-18T02:14:52.547Z",
                "reviewBody": "THIS CAN BE MADE WITHOUT USING A BREAD MACHINE.  I love trying different dough recipes and this is my favorite!  If making without a bread machine, add yeast, sugar, and water (105-115 degrees) and let bud for 10 minutes.  Add EVOO, and 1 cup flour and stir.  Add second cup of flour w/the salt(salt directly added to yeast can kill it)  It was more like a batter with the second cup but I didn't use bread flour, using A-Purp. unbleached flour instead(read a review for a chewier crust use unbleached and it works well)  I took the 1/2 cup and poured the dough onto a board and kneaded it in but needed more flour so probably added another 3/4 cup.  I guess I got so nervous w/the consistency of the dough at first that I forgot to add the herbs/garlic.  I wasn't worried since it did have sugar/salt/EVOO in the crust.  I let it rise in warm place for 1 hour. It rose nicely! Punched down and let it rest for 5 minutes.  Rolled it out into pan and didn't prebake or anything..just proceeded from there.  The crust is how I like it personally; chewy and just a nice brown. It had the best flavor even without the herbs.  I can't imagine how good it is w/adding the herbs!  Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-21T04:03:35.12Z",
                "reviewBody": "This could be a good recipe, but what ruins it is the fact that the amount of flour is woefully inadequate. I was in a hurry and ended up having to take the time to add flour to the 'finished' dough, which was a gooey, sticky mess. Messy and time-consuming to try to fix it so it could be usable.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MIHAELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/97390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-29T20:17:24.387Z",
                "reviewBody": "We have been on a homemade pizza craze here. I have tried 3 pizza crusts from this site so far. This one was good---but it was a little too sweet I thought! Might cut down on the sugar next time? It did make a beautiful crust very 'deep dish' like. Also I baked at 400 and it was fine. Came out very nice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanaquil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1982546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-25T22:06:33.423Z",
                "reviewBody": "This pizza crust is soooo good!!   I like to make homemade pizza because it is healthier for the kids.  Store-bought dough and sauce has high fructose corn syrup in it.  I have tried different recipes, but it is hard to find a crust that tastes great when just baking from your own oven with a metal pizza pan!  I had settled for an OK recipe when I came across this one, I will never go back!  My bread machine has an hour and thirty minutes dough setting.  I just sprinkled in the spices when it started to mix and left it on through the whole cycle. I also used 1/2 cup of whole wheat flour and ran out of bread flour so used 1 cup of all purpose flour.  I baked it at 425 degrees and baked for about 4 min. before adding the toppings.  I sprayed the pizza pan with olive oil cooking spray and made a simple sauce with tomato sauce and a little paste with a little italian seasonings, pinch of sugar, pepper, grated parm. and garlic salt.  There was so much flavor in the crust, I didn't want to  overpower with the sauce. All the flavors blended perfectly.  Thank you so much for sharing Ricardo!  This is the crust I will use from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "3monkeys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2389332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T01:15:23.03Z",
                "reviewBody": "Very good crust. I must say that my favorite crust uses a sponge-starter...takes a total of 3 days to make and is well worth the effort! However this is a quick alternative that I use in a pinch. I have a tip for \"MIHAELA\" who said his crust won't slide easily off his peel...use parchment paper! Take a piece large enough to fit your stone (and pizza) spray it with a little cooking spray and then make your pizza right on the parchment. Pull the parchment rather quickly to get it on your peel and then slide the whole thing on your stone...you may need to use your hand to pull at the back corner of the parchment to get it on the stone. When the pizza is finished slide your peel under the pizza (minus the parchment)...you may need to put on an oven mit to help push the pizza on the peel. Then just take the parchment out of the oven and throw it away! Easy and problem-free!!! I hope this helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLYMAMMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/440618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-11T01:33:53.17Z",
                "reviewBody": "This is the perfect amount of dough for a large pizza pan making a thin crust in the middle and nice medium thick edges. I decreased the sugar to 1 TB and it was the best I have ever made and I have made lots! Baked it 6 minutes on the lowest rack possible before adding other ingredients. Kept it on low rack to help ensure crispy crust. This is a must try. For those having yeast problems: Bury your yeast in the middle of your flour without letting it touch the liquid. It will work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEATHERLING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/278894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T01:15:23.56Z",
                "reviewBody": "This is the best recipe for a bread machine I've ever tried! I've also made bread sticks and cheese sticks using this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SIRYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/640609/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-03T00:29:57.59Z",
                "reviewBody": "Very tasty recipe. I added a little parmesan to the dough and it was great. Maybe a quarter cup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Juan Lahera",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/341773/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-09T17:57:17.267Z",
                "reviewBody": "This is the first pizza base recipe I have tried to make from scratch in my bread machine and it was so easy to do won't try another. Cut the sugar down to 1.5 tablespoons as recommended and didn't find it too sweet but made the crusts tasty. Also used 6g yeast as that is the size packets you get here in the UK rose well. Topped with the sauce from the \"Pizza Sauce and Dough\" recipe mozzarella chili peppers and mixed veggies which worked really well. Came out slightly soggy in the centre of the base using a baking (cookie?) tray so have invested in a pizza stone and will blind bake for 5-8 mins prior to topping. Brushed the edges with olive oil before baking and came out lovely golden and crisp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ButtercupBento",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/860336/"
                }
            }
        ]
    }
]