[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/927/side-dish/vegetables/sweet-potatoes/",
                    "name": "Sweet Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23719/sweet-potato-oranges/",
        "name": "Sweet Potato Oranges",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2303.jpg",
            "width": 2536,
            "height": 1660
        },
        "datePublished": "2020-06-19T03:05:05.000Z",
        "description": "Sweet potatoes cooked in orange skins with a yummy topping!  Very festive!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 oranges",
            "3 cups cooked, mashed sweet potatoes",
            "1 cup white sugar",
            "¼ cup orange juice",
            "2 eggs, lightly beaten",
            "1 teaspoon vanilla extract",
            "1 cup butter, softened, divided",
            "1 tablespoon grated orange peel",
            "1 cup brown sugar",
            "½ teaspoon all-purpose flour",
            "1 cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare oranges by cutting tops off, 1/4 to 1/2 inch down.  Spoon out the flesh, leaving a shell.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl combine sweet potatoes, sugar, orange juice, eggs, vanilla extract, 1/2 cup butter and grated orange peel.  Spoon mixture into orange shells.  Place in a deep casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small saucepan over medium heat, combine remaining 1/2 cup butter, brown sugar, flour and pecans.  Cook until sugar dissolves in melted butter.  Spoon over oranges.  Fill casserole dish with water to reach 1/2 inch in depth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables",
            "Sweet Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "louise b."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.654822335025381,
            "ratingCount": 197,
            "itemReviewed": "Sweet Potato Oranges",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "853.6 calories",
            "carbohydrateContent": "110.1 g",
            "cholesterolContent": "143.3 mg",
            "fatContent": "45.9 g",
            "fiberContent": "10 g",
            "proteinContent": "8 g",
            "saturatedFatContent": "21.2 g",
            "servingSize": null,
            "sodiumContent": "292.5 mg",
            "sugarContent": "83.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-25T20:31:25.737Z",
                "reviewBody": "We made these yesterday for Christmas Eve dinner and everyone kept telling me how delicious they were. I was very happy with the flavor...the orange compliments sweet potatoes very well. They were a bit of work..having to scoop out the inside of an orange isn't so easy. I ended up cutting them in half squeezing the juice out and then peeled the rind away from what was left...much easier than trying to scoop it out with a spoon. I also did this part a day ahead and stored the prepared skins in a ziplock bag in the refrigerator. This saved me a lot of time when cooking them the next day. I used 1/2 of the sugar in the sweet potato mix and I'm glad I did because the topping is also very sweet..and I have a huge sweet tooth. Very very good and worth the effort in my opion. We will definitly be making these again! Thank you for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONKAREE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/869543/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-25T01:00:58.153Z",
                "reviewBody": "EXCELLENT! A few years ago I watched Emeril make Bourbon Street Sweet Potatoes so I decided to try them. I never like sweet potatoes before that recipe. I must say that I think this one beats Emerils. A TIP I had no orange juice so I cut my orange in half instead of just cutting the top off and then squeezed the juice to use and scooped the rest out for my shell. I see alot of people have complained about the time involved in the scooping but I think if you do it the way I did it would be much easier and quicker as you have more room to scoop. I also was able to get two servings with one orange that way. Of course the portions would be smaller so if you really like it go for two servings! I will definately make this again and again and certainly use it the next time I entertain! Thank you for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CUMBER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/823178/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-25T10:48:44.183Z",
                "reviewBody": "These were FABULOUS and IMPRESSIVE!...my recipe \"keeper\" of the season. Th presentation was beautiful and the oranges infused a bit (not too much) of orange flavoring throughout. My kids are fighing over the leftovers now! Just a hint when making: Preparing the oranges can be tedious. I started out scooping with a spoon to get the flesh out and finally resorted to using my (clean) hands to pull out all of the mushy stuff and skin inside - it went much faster. Try these - you'll love them!!! Oh one other hint - try to cut your oranges so they are as stable as possible otherwise the will roll over into the water (which is a shame with that yummy topping) I made these a day ahead of time (sans the topping) and refrigererated; baked and added topping when ready to cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Blon-Dish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/753557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-03T16:23:04.157Z",
                "reviewBody": "I actually made these last year but forgot to review. They were amazing and I'll be making them again this year. Much better presentation and flavor than traditional sweet potato casserole. A few tips that made things easier for me: The big tip I wanted to impart is that their is def. a science to scooping out the oranges. I know it isn't easy to explain but everything goes about 3x as quickly if you get in between the orange rind and the white skin covering the fruit using your finger. Then you can basically peel the orange out gently with your hand leaving a nice smooth orange rind bowl. A spoon or knife tends to puncture the white skin and makes it harder to get everything out and in the end you are stuck scraping with a spoon and there are still bits of orange clinging to the inside and a lot more mess. The only problem with the quick method is that you have to be careful when you come to the bottom as you might accidentally remove the very bottom plug and your orange bowl will have a hole. The solution is to pinch that piece off when you are scooping/peeling. If you still accidentally tear out the little bottom part (which I did on one or two) it is all right just wrap the oranges loosely in some aluminum foil. The second tip. I had some problems balancing my oranges in the pan and the water. I ended up putting aluminum foil around them (loosely) and then when I put them in the pan the foil allowed them to prop up against one another). They still cooked fine but I",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katrina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1912471/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T16:42:06.577Z",
                "reviewBody": "This recipe had such a beautiful presentation!!! It really wasn't that hard or time consuming to prepare! I read all the reviews before hand and took the following suggestions - I cut the oranges in half and used a grapefruit knife to cut out the orange making sure to keep the peel in-tack. I wrapped the sweet potatoes in foil and baked them for about 1 hour to keep them from absorbing too much water and to enhance their flavor. Once cooled I just squeezed out the flesh - no peeling necessary. I reduced the sugar to 1/2 a cup and used brown sugar instead of white sugar. I totally left out the butter - it did not need it and boy did that save a lot of fat and calories! next time I will probably leave out the eggs as I thought they would hold the sweet potatoes more firmly together - but it did not make a difference - the texture was mushy so the eggs didn't add much. I added about 1/2 tsp. cinnamon to the sweet potato mixture. As for the topping i wanted to make the topping as stated but I did not have whole pecans I made it with chopped nuts instead next time I will make it with the whole pecans. I used cut pieces of tin foil and wrapped it around the oranges as they baked so that the orange peel won't burn. If I don't use the eggs next time - i will just skip this step and not even bake the orange cups - as the filling was delicious before baked and no eggs will lead me not to have to do this step. This got rave reviews from all of my guests! I will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef4Six",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2646978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-17T16:31:02.14Z",
                "reviewBody": "EXCELLENT!!!!! Very well received at my Easter dinner last night! Everyone requested i make it for every holiday gathering! I made a few changes as is my style instead of the glaze i made a streusel type topping with melted butter oatmeal brown sugar and chopped pecans. I sprinkled that over the top and it made a great topping! Also a side tip i used my juicer after cutting the oranges in half i juiced them and used the orange juice in the potatoes and on the ham! It made the shelling a LOT easier as the juicer did all the work for me! Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SolitaryFairy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1805418/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-28T23:22:13.763Z",
                "reviewBody": "Marvelous! I cut the oranges in half to make it easier to scoop out the flesh then the bottoms in foil while baking. This way the orange skin cooks in its own juice and you can eat the shell with the sweet potato filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnInHK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/422932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-26T14:02:35.3Z",
                "reviewBody": "I was pleasantly surprised at how easy it was to shell an orange. These made a very impressive display and even the sweet potato haters loved these. They did turn out a little too sweet for my taste (and I drink coffee with extra sugar!) so next time I will cut the sugar almost in half. Definately try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FOOZALG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/835823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-28T18:31:40.14Z",
                "reviewBody": "Wonderful!! I served this Thanksgiving and had 3 recipe requests. My 5 children and a cousin that never ate didn't like sweet potatoes loved them and asked for more. Scooping out the oranges is a bit time consuming. A grapefruit spoon and kitchen shears help.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GSTIBS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/518062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-22T20:04:49.19Z",
                "reviewBody": "Looks great but taste too sweet",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "momasita14",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2064832/"
                }
            }
        ]
    }
]