[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/859/desserts/cookies/sugar-cookies/",
                    "name": "Sugar Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23750/marys-sugar-cookies/",
        "name": "Mary's Sugar Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4790880.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:05:06.000Z",
        "description": "A very good sugar cookie with a hint of almond flavor.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "5 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "1 ½ cups sifted confectioners' sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "½ teaspoon almond extract",
            "2 ½ cups all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon cream of tartar",
            "¼ cup granulated sugar for decoration"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and confectioners' sugar until smooth. Beat in the egg and stir in the vanilla and almond extract. Combine the flour, baking soda and cream of tartar; blend into the creamed mixture. Cover and chill for at least two hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Divide the dough into two parts. On a lightly floured surface, roll each piece of the dough out to 3/16 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto greased cookie sheets. Sprinkle cookies with plain or colored granulated sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 minutes in the preheated oven, until lightly browned. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sugar Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Pat"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.390134529147982,
            "ratingCount": 223,
            "itemReviewed": "Mary's Sugar Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "126.3 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "22.5 mg",
            "fatContent": "6.4 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "88.2 mg",
            "sugarContent": "7.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-02T14:00:44.217Z",
                "reviewBody": "This is exactly the sugar cookie recipe I was looking for.  Light, flaky, slightly crisp, but not crunchy.  Perfect flavor with the vanilla and almond extracts.  This is definitely a keeper for those who like a traditional sugar cookie.  For those who like thick, soft cookies, you'll want to try something else.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HETTIE15",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/418486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-24T00:42:32.937Z",
                "reviewBody": "Good recipe- just have to adjust the baking time and temp.  Mine were browning around the edges after 5 minutes, making them too crunchy and hard.  Sugar cookies should be tender and soft, in my opinion.  After turning down the heat to 350 and baking for only 6 minutes, these were perfect.  I prefer sugar cookies using powdered sugar instead of granulated- I think it makes them more soft and tender.  Frosted with luscious buttercream frosting from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:05:27.28Z",
                "reviewBody": "This is the best sugar cookie recipe ever!  Until I found this recipe my cookies came out dry and flavorless.  I didn't have almond extract so I only used vanilla extract which I added a little extra.  I also Rolled the dough between wax paper to avoid excess flour to dry them out.  These cookies are fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTINEESMYTH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/730096/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-26T19:21:24.92Z",
                "reviewBody": "I tried these at Christmas time this year. They weren't terribly difficult to make and the dough was easy to work with (with a well-floured board and rolling pin) but this recipe only made half the amount I thought it should. The taste was okay--a little bland but better with frosting. They also spread too much during baking and did not hold their shape very well at all! I don't think I'll make these again; they're just too bland and crumbly. I've tried several sugar cookie recipes from this website and one of the reviewers said she'd stick to the recipe in BHG for sugar cookie cutouts. Then I tried that recipe as well. I agree with her 100%--BHG's were exactly right just what I was looking for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JenSmith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1166969/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-15T04:52:48.717Z",
                "reviewBody": "I have been making this recipe for over 40 yrs it is the favorite of all who taste them...they are so crisp yet tender and I think the powered sugar makes all the difference....I make about 4 batches every holiday season and they are the first to go",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BREEZYBELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/499715/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-17T21:53:44.17Z",
                "reviewBody": "Perfect recipe! These made the perfect cookies--soft without being chewy with a lovely melt-in-your-mouth texture. I topped with buttercream icing and they were terrific I love the almond flavor. I'm not sure why some have had problems with this recipe but I would say to make sure the powdered sugar you measure is already sifted rather than taking a cup and a half of packed powdered sugar and THEN sifting it or you could end up with too much. And to keep them soft make sure you don't roll them out too thin these do need to be rolled out a bit thicker than most sugar cookies. The only problem I had was that this didn't make anywhere NEAR as many cookies as the recipe said it would but the ones I did have were fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1520985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-14T01:48:41.81Z",
                "reviewBody": "My mother has made these cookies for years. They are my favorite sugar cookies. I love the hint of almond flavoring. You can also shape this dough in to a log wrap chill and use as a slice and bake cookie. Dip the tops in color tinted sugar--and you have an easy treat for the kids! I also don't think you can really get 5 dozen out of this recipe--unless you roll them out super thin. I usually get about 3 dozen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DKHALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T12:12:36.467Z",
                "reviewBody": "This is the best cookie recipe. I use this for my personal cooking and for my 8th grade Home Economics classes. The powdered sugar in the recipe makes the dough easy to work with and the students can roll the dough many times without it becoming stiff. I always chill the cookie dough over-night for my classes but it can be placed in the freezer for 15 minutes and will roll out o.k. If it is too stiff to roll when you remove it on day two pop it in the microwave for 15 seconds so it is workable. (You may have to do this a couple of times.) I work with a small amount of dough at a time and leave the rest in the refrigerator. After it has been rolled once push the left-overs back together and roll again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "grandmadanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/483977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T06:33:38.06Z",
                "reviewBody": "This recipe was given to me by a friend three years ago who has long since moved out of State. I wrote it down on an envelope and lost it this past year and have been trying to find it again since it has been a family favorite! I have used this recipe for numerous projects at school for Valentines Day as a room mom soccer parties at home for any given holiday and bake sales etc. I have found that it is better to use the dough directly after mixing due to ease of use. It is a firm cookie when baked but flaky. It is a GREAT cookie for kids to decorate since they are not \"soggy\" in texture and hold up very well to little hands. They have wonderful flavor! I also bake my cookies for 12 min. instead of 8 or until the edges are a golden brown. We like the golden edges better and have noticed that they have almost a \"spritz\" like flavor. This is one recipe that I am happy to have back! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRINITYFARM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/958895/"
                }
            }
        ]
    }
]