[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
                    "name": "Apple Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23766/danish-pastry-apple-bars/",
        "name": "Danish Pastry Apple Bars",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F275626.jpg",
            "width": 1846,
            "height": 1848
        },
        "datePublished": "2020-06-19T03:05:07.000Z",
        "description": "This recipe is excellent! I also use the crust recipe for round fruit pies.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 9x13-inch pan",
        "recipeIngredient": [
            "2 ½ cups all-purpose flour",
            "1 teaspoon salt",
            "1 cup shortening",
            "1 egg yolk",
            "½ cup milk",
            "10 apples - peeled, cored and thinly sliced",
            "½ cup light brown sugar",
            "¼ cup white sugar",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon ground nutmeg",
            "1 egg white"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine flour and salt. Cut in shortening until mixture resembles coarse crumbs. Beat egg yolk in measuring cup and add enough milk to make 2/3 cup total liquid. Stir into flour mixture until all flour is damp. Divide the dough in half. On floured surface, roll half the dough into a rectangle and fit into a 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large bowl, combine apples, brown sugar, white sugar, cinnamon and nutmeg. Put apple mixture in pan. Roll out remaining dough and place over apples. Seal edges and cut slits in top dough. Beat egg white till frothy and brush on crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 50 minutes, or until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Apple Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Nancy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.632,
            "ratingCount": 125,
            "itemReviewed": "Danish Pastry Apple Bars",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "356.1 calories",
            "carbohydrateContent": "46.5 g",
            "cholesterolContent": "17.9 mg",
            "fatContent": "18.1 g",
            "fiberContent": "3.5 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "4.6 g",
            "servingSize": null,
            "sodiumContent": "206.6 mg",
            "sugarContent": "22.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-26T13:40:39.793Z",
                "reviewBody": "This is a great recipe.  I've been making it for well over 25 years but haven't added the nutmeg, will do that now.  \nThe only things I do different is use margarine/butter in place of the shortening and take corn flakes, put them into a one cup measuring cup, crush them down with my hand until I have a cup, then sprinkle on the bottom crust before putting the apples (I use macintosh or cortland) on the crust.  It catches and absorbs the apple juices and no one would ever guess the bars contain cornflakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBBIEWI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/854511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-08T17:18:07.467Z",
                "reviewBody": "This recipe is also called \"Apple Slices\". That is what my Danish grandmother called them. It's the egg yolk in the dough that makes it different from pie dough. We like this dough much better than pie crust. My mother brought it to every family gathering. When cool, drizzle with glaze made from confectioner's sugar and lemon juice. No water or milk! That also is authentic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINNEA LAHLUM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/400371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-23T18:05:02.827Z",
                "reviewBody": "This recipe was very good. My only suggestions are to increase the sugar if you are using Granny Smith apples. I always use those in baking b/c they don't get mushy but this recipe turned out quite tart. Also, moisten some waxed paper to stick to your counter then lightly flour it and roll out the dough. This way you can just lift the wax paper, turn it over and peel it off your crust instead of trying to get the crust off of your counter in one piece. I do recommend the lemon juice/powdered sugar glaze as another suggested, be sure to taste for sweetness before drizzling. I found this recipe is easily halved for a smaller pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "queendiva1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/792183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T17:20:01.73Z",
                "reviewBody": "FANTASTIC Apple Pie recipe! No brown sugar? Use white sugar and drizzle a little honey inbetween apple layers. White sugar or honey doesn't hinder the taste and the honey adds a special flavor. Don't be scared to add a couple extra teaspoons of cinnamon it only makes it better. The thickness of your apple slices determines the texture of the filling: extra-thin (1 cm) slices for soft filling (almost apple-saucey) and thin (3 cm) slices for chunky apple pie. The fact this pie was in a 9x13 and not in a round pan was PERFECT for my situation - Im in Europe right now and wanted to share a traditional American recipe but didnt have a round pan for it! This recipe was the solution and was a fantastic treat at that. I've made it three times already! And the crust recipe is absolutely wonderful I've used it for quiches as well. Because this recipe has top and bottom crust you'll have to alter it a little: Just cut the amount of the ingredients for the dough in half and there you have a bottom crust for a perfect homemade quiche. (Just say no to ready-made pie forms!) Recommended: 'Belle and Chron's Spinach and Mushroom Quiche ' Note for dough: Keep dough cold!! Easier to work with and best on a cold marble counter top. Put the second half in the fridge when youre working with the first half. Use your fingers to cut in the shortening it works the best. And don't stop before its finished it needs about 3-5 minutes until its really thoroughly cut in well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julia K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1575585/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-08T17:16:03.983Z",
                "reviewBody": "This recipe was a big hit with my family!  The crust was to die for, it was so easy and quick to make.  I used an apple peeler corer all in one to slice up the apples, this saved a lot of time.  When the bars were still warm I poured a glaze on them that was powder sugar, butter, milk and a little vanilla extract.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "skram",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/177808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-09T22:07:15.6Z",
                "reviewBody": "My family and I love this recipe and so did everyone who has had it.  Other than the logistics of manuevering the dough into a 9x13 I found the dough itself to be easy to work with. What dough isn't a pain to get into any pan perfectly?  I made sure that both layers of dough were over-lapping the pan and then I just pinched and tucked it under itself.  Any excess I cut away, rolled out and used a leaf or apple shaped cookie cutter and laid them on top for decoration. The 9x13 size makes it easy for family functions because you only have on pie to carry versus 2-3 individual pies. We love and I make it frequently.  I think I'll make it now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Micspicer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2395152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-22T14:21:07.287Z",
                "reviewBody": "I've always have great success with this recipe. The crust is especially something special (if you use butter instead of shortening). It makes a perfect amount for a traditional double pie crust with embellishments. To make prep a snap I put the flour and salt in my 11-cup food processor. I cut the butter into tablespoons then toss all of it into the processor bowl and turn it on until it resembles wet beach sand. Then I put it in a bowl and add the milk/yolk mixture and kneed it together with my hands. After chilling it rolls like a dream. I've used it for all my pies for years. Thanks Nancy for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elaine Kilby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-08T17:16:13.31Z",
                "reviewBody": "Excellent recipe easy to make and dough is easy to handle. I added one tablespoon corn starch to sugar mixture as a thickener. It was wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LITTLESTEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/433168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-07T06:42:08.843Z",
                "reviewBody": "I was always afraid of making an Apple Pie. No longer! This recipe was easy and everyone in my family raved. The crust alone is to die for as it will go with any pie you like. This recipe is a keeper. Thanks Nancy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teri   Yaki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/669076/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-07T19:57:48.98Z",
                "reviewBody": "I have never rated a recipe with 1 star before but I don't think this one deserves more than that. First the dough was a gloppy mess after adding the egg/milk mixture so I had to add more and more flour to even get it to roll-out consistency. Second this calls for 10 apples - WAY too many for a 9x13 pan and the little amount of sugar it calls for. I would say it only needs half the amount of apples (I used Braeburn). Which brings me to the sugar - too little for all the fruit. AND this definitely needs some cornstarch or something in the filling to thicken it up. I was horrified that after baking time I pulled it out of the oven to see that there was boiling apple juice around the sides as that makes a soggy bottom crust. So I had to hold the pan over the sink and tilt it to run all the liquid out and at least a cup of it came out. THEN I was trying to cut and remove the bars (I made them as part of an order from my home baking business for a graduation party today) and it was a nightmare - the crust was slipping off the apples all the apples were falling out of the center and not staying together etc. If I had time to make something else and chuck this entire batch I would. It's basically like an apple pie except the crust is tasteless and the filling not very desireable either. Sorry will not make again or recommend to others.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Hurt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marleesmom/"
                }
            }
        ]
    }
]