[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23816/blue-ribbon-white-bread/",
        "name": "Blue Ribbon White Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9099564.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:05:09.000Z",
        "description": "This is a county fair 'blue ribbon' winning loaf that is very tender and creamy.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "2 - 9x5 inch loaves",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "1 teaspoon sugar",
            "½ cup warm water (110 degrees F/45 degrees C)",
            "1 (12 fluid ounce) can evaporated milk",
            "¼ cup warm water",
            "¼ cup shortening, melted",
            "¼ cup honey",
            "2 teaspoons salt",
            "6 cups bread flour",
            "2 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, dissolve yeast and sugar in 1/2 cup warm water. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the yeast mixture with the evaporated milk, 1/4 cup water, shortening, honey, salt and 2 cups flour. Stir well to combine. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch dough down and divide in half.  Roll out each half and roll into loaf shapes, sealing seams by pinching.  Place in buttered 9x5 inch bread pans.  Butter the tops of each loaf with melted butter; cover loosely with plastic wrap.  Let rise in warm area until doubled, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a small pan of hot water on the bottom shelf of the oven. Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Uncover loaves and bake until tops are golden brown, about 25 to 35 minutes. Brush butter onto crusts while warm.  Slice when cool.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kristin Eichers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.675862068965517,
            "ratingCount": 145,
            "itemReviewed": "Blue Ribbon White Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "60.7 calories",
            "carbohydrateContent": "4.8 g",
            "cholesterolContent": "7.1 mg",
            "fatContent": "4.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "217.6 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-08-22T14:24:13.513Z",
                "reviewBody": "I, too, double the yeast and use melted butter instead of shortening. I have found that using butter not only improves the flavor, but it also eliminates the need to butter the crusts altogether. I also don't bother with the pan of water. No need! It is wonderful without the fuss!! The milk, butter, and honey give the bread the depth of flavor that we were looking for. The texture is perfect, and I love that it makes two 9x5 inch loaves. To make wheat bread, I just substitute whole wheat flour for the first 2 cups of bread flour. I can't believe that this recipe isn't more highly rated!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-13T06:49:32.78Z",
                "reviewBody": "Ever since I decided to make my own bread by hand instead of buying the mediocre loaves at the grocery store, I've been in search of the perfect white bread recipe. Well, I found it a month or two ago in this. This bread has everything I want in a loaf -- the flavor is there, it really is tender and creamy enough you can eat it plain, and yet it holds together well enough for sandwiches and for scooping up gravies and sauces. You really do get the best of all worlds with this recipe. However, I recommend using a bread flour instead of all-purpose flour. I have found that all homemade loaves really benefit in texture immensley. The only other thing I eventually changed was using melted butter instead of shortening -- one time I had run out of shortening and didn't notice until it was too late, so I had to substitute. The butter tastes very, very good in this loaf! The texture isn't exactly the same, but the difference is very minor and I actually like it better. This is a keeper! Thanks, Kristin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPEEDBMP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/384564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-24T02:29:28.653Z",
                "reviewBody": "Love it, love it, love it!!!!!\r\n\r\nI am a novice (with a capital N) baker, but I have made this several times and it always turns out great.  As Kristin has said, it's creamy and rich.  Actually, it's a little too good, because we're consuming a lot more bread than we usually do!!!  :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRAVELR773",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/702877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-23T20:17:16.42Z",
                "reviewBody": "YOUR SEARCH FOR THE PERFECT BREAD RECIPE CAN END RIGHT HERE! I followed this recipe EXACTLY. I've eaten some wonderful homemade bread in my life especially since we don't live that far from Ohio's Amish Country. This bread blows every other out of the water! It is so unbelievably good. Not doughy but nice and soft inside with a nice crust. It makes great rolls too! I'm going to add a little more sugar and use it for cinnamon rolls. I'll probably never buy bread from the store again! Thank you for sharing this wonderful recipe!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1627020/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-15T00:13:30.23Z",
                "reviewBody": "I think I am only the second person who did not like this recipe. It was very heavy and had an unpleasing taste. I will not make this bread again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "LILENGLISHCHIC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/586369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-21T00:57:12.49Z",
                "reviewBody": "Wonderful soft sandwich bread. I made half of the recipe in my bread machine. I put it through the dough cycle and shaped it into a long loaf and it turned out great. Thank You Kristin for responding to my request for the \"Subway sandwich\" type of bread. It was just what I was looking for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "queen of cakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/287095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-16T22:09:24.623Z",
                "reviewBody": "Made this yesterday except I reduced the salt by 1/2 tsp and doubled the yeast (both recommended tips here thank you). Don't like shortening used melted butter. 1/2 dough as is; the other I spread cinnamon and butter (forgot the sugar part yikes) before rolling up tight and into the pan. Family loved both and had them straight from the oven with butter and camembert. Made cheese toasts (plain loaf thickly sliced) served with corned beef hash for breakfast... mmm. Quite dense if not for the increased yeast but that's ok too if you like dense bread. Good basic bread with lots of possibilities. Thanks Kristin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sereneblue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/972019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-01T18:41:25.18Z",
                "reviewBody": "I make this every week- it's beautiful sandwich bread for the week's lunches.  I used melted butter instead of shortening and don't add any additonal butter after cooking, nor do I put a pan of water in the oven.  I heat my oven to about 200 degrees and then turn it off while I put the ingredients together- then I do the initial rising in my oven- nice warm, draft free spot for rising!  I have non-stick pans, so I don't use any more butter or shortening for this step either.  This is a beautiful, easy, no fail recipe!  Thank you for sharing this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COURTNEYGRIFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1466984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-21T00:59:46.397Z",
                "reviewBody": "This is the best bread I have ever made. I have a bread maker that has been sitting in the closet for years because I could never get good bread out of it. This is the first recipe I tried from this site and it turned out perfect. The more I make it the better it gets and the neighbors won't stop asking for loaves. It was because of this bread recipe that I finally got my wife to get me a Kitchenaid mixer for my birthday!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RSPRINGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/507770/"
                }
            }
        ]
    }
]