[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24142/cinnamon-raisin-swirl-bread/",
        "name": "Cinnamon Raisin Swirl Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F888720.jpg",
            "width": 1997,
            "height": 1332
        },
        "datePublished": "2020-06-19T03:05:21.000Z",
        "description": "Delicioso! Made using bread machine and normal oven, also usable without bread machine. Like a giant Cinnamon bun.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "2 - 9x5 inch loaves",
        "recipeIngredient": [
            "1 ½ cups warm water",
            "2 tablespoons milk",
            "2 tablespoons shortening",
            "1 teaspoon salt",
            "4 cups bread flour",
            "3 tablespoons white sugar",
            "2 teaspoons active dry yeast",
            "1 cup raisins",
            "2 tablespoons butter, softened",
            "2 tablespoons brown sugar",
            "1 teaspoon ground cinnamon",
            "1 tablespoon butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place water, milk, shortening, salt, flour, sugar and yeast in the pan of the bread machine in the order recommended by the manufacturer. Select cycle; press Start.\n"
            },
            {
                "@type": "HowToStep",
                "text": "If your machine has a Fruit setting, add the raisins at the signal, or about 5 minutes before the kneading cycle has finished.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Take dough out after first kneading cycle has finished. Turn dough out onto a lightly floured surface and roll out into a rectangle. Spread dough with butter, brown sugar, and cinnamon. Roll dough, and divide into two parts. Place loaves in two lightly greased 9x5 inch bread pans. Cover and let rise in a warm place until doubled in size, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush tops of risen loaves with melted butter and bake in preheated oven for 30 to 40 minutes, until crust is brown and loaves sound hollow when tapped.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Joey Byrtus"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.682634730538922,
            "ratingCount": 167,
            "itemReviewed": "Cinnamon Raisin Swirl Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "59.3 calories",
            "carbohydrateContent": "8.3 g",
            "cholesterolContent": "4.7 mg",
            "fatContent": "3.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.4 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "130.4 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-04T20:32:13.58Z",
                "reviewBody": "I made this using my Kitchen Aid mixer from start to finish. I did double the filling. I might triple it next time, for a deeper swirl. The dough came together beautifully (I've been having such issues with that lately) and rose like a champ. It's baking now, but I'll update after we've cut into it at tomorrow's breakfast. EDITED: Excellent bread. I liked that it wasn't overly sweet. The raisins add a nice touch. I couldn't wait for it to cool fully, I ate a piece warm with butter. Heavenly.\nCut well even warm, didn't fall apart like most cinnamon breads do. Perfection.\nTIP: You might want to oil the pan down and make sure both sides of the loaf are oiled. It's a stickier bread, which means when it rises, you'll have a heck of a time getting it off the saran wrap if you don't. EDITED AGAIN: The vanilla glaze from this site is wonderful drizzled over warm slices of this bread. Just like a cinnamon roll!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-13T02:17:07.467Z",
                "reviewBody": "I made this once to give it a try. LOVED it!  Only changes I made when making it again was to put a dash of cinnamon in the dough, added powdered milk and skipped adding the milk (to keep the dough more elastic instead of sticky) and soaked the raisins in water for about an hour before starting the recipe for the bread machine.\r\nMy whole family loved this recipe so much I made 15 loaves for a bake sale and sold out in less than an hour because I offered samples.\r\nThank you Joey for this awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Can_It_Rachael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/can_it_rachael/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-19T15:27:19.25Z",
                "reviewBody": "HERE'S MY RECIPE NOT USING A BREAD MACHINE:\r\nSoak 3/4 raisins in hot water for 1/2 hr. or till plump.  Drain and pat dry on paper towel. Set aside.\r\nDissolve 2 tsp. yeast and 1/2 tsp. sugar in 1/2 c. warm water - 95-105 degrees.  Proof for 10 minutes or until foamy. \r\nMelt shortening in 3/4 c. water and 1/4 milk. Cool.\r\nPut salt, rest of sugar, 1 tsp. cinnamon in large bowl.  Add cooled milk mixture and proofed yeast. Stir together. Stir in flour until batter leaves side of bowl.  Turn out onto lightly floured surface.  Knead in remaining flour adding 1/2 - 1 cup extra flour if necessary. Knead about 6-7 mins. adding in the raisins during the last couple of minutes of kneading.  Place in lightly oiled bowl. Turn dough over once in bowl to oil top side of dough. Cover with thin dishtowel and place in warm place to rise 1 1/4 to 1 1/2 hrs. Punch down.  Separate dough into two halves.  Roll out each half of dough into rectangle (roughly 8 x 10\").  Spread with softened butter and sprinkle with cinnamon brown sugar mixture (I doubled the filling).  Roll each rectangle up tightly and seal ends and fold under.  Place each rolled up dough in prepared pans, place towel over pans, let rise for another hour.  Bake as directed in recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine Lynde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8844931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-15T02:50:11.327Z",
                "reviewBody": "Maybe it's because I'm pregnant, but this bread was sooo good!  I had to add some more flour, about 1/4 cup, as it was too wet and sticky in the bread machine.  I also added a teaspoon of cinnamon to the dough and plumped up the raisins in boiling water before adding to the bread machine.  After rolling out, I doubled the brown sugar and cinnamon for the filling.  Baked exactly 30 minutes...perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMISON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-07T18:30:46.22Z",
                "reviewBody": "I make this bread all the time, it is that good.  I've been experimenting a little with it.  The last time, I added about 3/4 cup of raisins and 1/4 cup chopped granny smith apples.  Next time I think I'll add more apples!  It came out great.  I also use 2.5 cups bread flour and 1.5 cups wheat flour and that seems to give it the perfect balance between a wheat bread and a white bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3060010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-06T16:01:05.693Z",
                "reviewBody": "So, I kept the basic bread part the same, but I added orange extract (1 TBLS) and some chopped apricots (about 1 CUP) to the dough as mixing.  You never need to add more flour than a recipe calls for, when it stops sticking and starts slapping the side of the bowl, it is ready to rise btw.  For the swirl, I used 1 egg(egg holds your sugars without splitting your bread) and 1 tea. orange extract and brushed that over the bread.  Then, I sprinked my brown sugar (1/2 cup), cinnamon (1.5 TBLS), clove (1/4 tea), and nutmeg(1/4 tea) over the bread and let it rise again.  Baked it for about 35 mins (but the best way to tell is with a thermometer reading at least 190 degrees).  This way the best bread I've made (and I make some pretty decent bread), and I probably ate most of 1 loaf all by myself!  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1563429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-16T16:17:37.487Z",
                "reviewBody": "OMG -- this was SO GOOD! I made a few changes per other reviewers. First I soaked the raisins in hot water to make them softer. I also added 1 tsp cinnamon to the dough ingredients and I doubled the filling ingredients. Lastly I topped both loaves with a thick sugar glaze. The loaves were soft & moist with a chewy texture. My husband ate an entire loaf in one evening and said \"You can't buy bread this good anywhere.\" Amazing!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ACPHIFER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/894235/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-15T12:50:11.653Z",
                "reviewBody": "This recipe makes a very good cinnamon raisin bread. I had to add a little more flour, as the dough was very sticky. The loaves didn't rise as high as I had expected; may consider using a single 11\"x5\" loaf pan in the future. An additional 1/2 cup of raisins was added to the brown sugar and cinnamon prior to rolling. Some extra brown sugar was also added. Will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gilda George",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ebony3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-18T22:32:16.467Z",
                "reviewBody": "this recipe doesn't say how much nuts to use. I put in 1/2 cup. My 2lb. bread machine took about 30minutes before the beep to add the nuts and raisins. The rest was really easy also. Everyone really liked it just out of the oven. I'm sure it will be good toasted. Thanks Michele",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHK35",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/152322/"
                }
            }
        ]
    }
]