[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24145/easy-cream-cheese-danish/",
        "name": "Easy Cream Cheese Danish",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1459905.jpg",
            "width": 1980,
            "height": 2040
        },
        "datePublished": "2020-06-19T03:05:21.000Z",
        "description": "This recipe makes the best cream cheese Danish I have ever tasted.  It is very simple to make.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "2 (10 ounce) cans refrigerated crescent roll dough",
            "2 (8 ounce) packages cream cheese, diced",
            "¾ cup white sugar",
            "1 ½ teaspoons lemon juice",
            "1 teaspoon vanilla extract",
            "2 teaspoons sour cream",
            "1 cup confectioners' sugar",
            "1 tablespoon milk",
            "1 tablespoon butter, softened"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line bottom of baking pan with 1 can of crescent rolls. Pinch all seams together to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together cream cheese, white sugar, lemon juice, vanilla extract and sour cream. Spread filling on top of rolls. Place second can of rolls on top of filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 20 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together confectioners' sugar, milk and butter. After Danish has cooled, drizzle with icing.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Natalie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.590759075907591,
            "ratingCount": 606,
            "itemReviewed": "Easy Cream Cheese Danish",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "497.6 calories",
            "carbohydrateContent": "50.9 g",
            "cholesterolContent": "52.9 mg",
            "fatContent": "29 g",
            "fiberContent": null,
            "proteinContent": "7.5 g",
            "saturatedFatContent": "13.7 g",
            "servingSize": null,
            "sodiumContent": "582.1 mg",
            "sugarContent": "31.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-05-16T19:30:08.337Z",
                "reviewBody": "This is wonderful, I've been making it for several years using the flaky Pillsbury crescent rolls. The recipe as published here makes too much filling for a single batch. I use one package of cream cheese, 1/2 cup sugar, 1 tsp lemon juice, 1 tsp vanilla and 1 TBSP sour cream and it turns out perfect every time. In the frosting, I use half & half instead of milk and add 1/4 tsp almond flavoring. You'd never know this danish wasn't made in a fine bakery. I am asked for the recipe every time I make it. NEW EDIT: The new Pillsbury crescent sheets without the perforations are great for this!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaye Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kayelynn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T17:18:48.013Z",
                "reviewBody": "My mom passed this recipe on to me and it's FABULOUS!  \r\nMy mom changed the directions slightly - she leaves the cresent dough rolled up and slices it into about 1/4\" thick slices...then she flattens the middle a bit, fills it with the filling and bakes them.  This makes tiny round danishes like the ones we buy frozen from Costco.  They're awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CSANGEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/849979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-20T23:13:09.483Z",
                "reviewBody": "I woke up this morning craving danish. I had all of the ingredients on hand except lemon juice. I thought the suggestion of several previous reviewers to slice the crescent dough into rounds instead of making a top and bottom layer in a pan sounded interesting, so I sliced the crescent rolls into about 1/4 inch thick slices (dental floss makes this very easy!). I mixed up the filling and substituted 1/2 teaspoon lemon extract for the lemon juice  (turns out that made it taste exactly like the danish filling I'm used to getting at the bakery!). I flattened down the center of each dough circle and filled the depression with a spoonful of filling and baked for 15 minutes. They came out great! Cute little mini danish. Half a recipe of filling is plenty for two tubes of crescent rolls. Don't overbake, they should just barely be golden or the danish will be dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T17:09:15.653Z",
                "reviewBody": "Loved the filling, but I don't like canned dough. What I did use was puffed pastry and once philo. I rolled out puffed pastry then cut in 4 inch squares, put a tablespoon of filling in centre and pinched opposit corners baked 15 minutes in a 400F oven delious. Philo is just as easy. Unroll thawed pastry cut in 5 inch squares put into muffin pans then a spoon of filling. Taste is much better and realy not much more work with frozen puff and pholo pastry. Finish both with a sprinkle of powered sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol Doyle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/148366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-04T02:23:59.733Z",
                "reviewBody": "Excellent and, indeed, easy.  I used the suggestion of a previous reviewer and sliced the crescent roll dough (like purchased cookie dough) rather than roll it out.  I managed 20 slices per tube of dough.  After flattening the middles, I could put almost a tablespoonful of cream cheese filling in the center of each.  I reduced the filling amount by half and still had more than I needed.  (I just refrigerated the extra; I KNOW I will be making these again soon.)  I drizzled each individual danish with the glaze.  This was a wonderful addition to the buffet set out for a breakfast meeting.  Not a single crumb left.  My next experiment will be to add a spoon of blueberry pie filling along side the spoon of cream cheese mixture.  My local bakery makes awesome blueberry cream cheese danishes.  I don't see why I can't too.  lol",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sbsbea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/774112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-04T03:57:09.5Z",
                "reviewBody": "Thanks Natalie!\nBeing a professional in the food business, I can tell you this really is a great recipe. \n\nAfter reading the comments...i made a few very minor changes.\n1) baked bottom crust for about 5 minutes to prevent it from being soggy\n2) Whipped a whole egg and brushed it on the top layer before baking (gave it a nice color\n3) used the icing BUT...added about 3/4 tablespoon of Almond Extract in the icing (i did not end up using all the icing.. I just put on how much I personally liked...drizzled it on\n\nTo the comments about shaping it round...I actually like the fact that you get cheese in every bite by keeping the recipe as is!\nTo the comments about it being TOO much cheese mixture...I totally disagree. To me its the perfect amount. If you like Cheese Danish...use the full amount!\nTo the comment about it taste better when its cooled off....you are right on the money...it was even better cold!\nFinally...it did taste like danish dough. I will be making this again real soon!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wayne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8535488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-22T14:24:25.123Z",
                "reviewBody": "Not bad! I took the harder approach and sliced the canned crescent rolls into 40 slices (20/roll). Made the whole filling amount w/exact ingredients listed and added 1/2 T. of sifted flour to stabilize it, had about 1/4 c. left over. The crescent rolls lack the true flavor of danish pastry (buttery/sugary), so next time I'll beat 1 egg w/1 T. water, brush the rounds and sprinkle w/a little sugar before filling them. When you make them this way (rounds vs. sheet-style), they take about 15 min. Watch them closely, and let them get golden brown for more of a bakery effect. I put about 1/2 T. of filling (before baking!)after indenting middle of the crescent rounds - was more than enough, and they will settle (shrink) a little when cool. I used parchment paper on the baking sheets - worth the investment, cleanup's a breeze! Also - the glaze was very stiff, but you want it that way to firm up like a frosting. An easier way to drizzle them is: 1) Make the glaze in a micro-safe dish, nuke for 5-10 seconds (watch closely, don't boil it - just want to make the glaze \"pourable\"), use a funnel to put it in a squeeze bottle, and drizzle away on COOLED pastries (so it doesn't run, makes it more authentic). I may try next time with puff pastry rounds in a muffin pan. Your friends will be impressed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jw81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/433659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-26T16:20:42.483Z",
                "reviewBody": "This came out perfect with (like others mentioned) half the filling mixture.  Next time I may even use a little less than half of the sugar (like 1/3 cup).  I laid the crescent unrolled and flat into the baking dish, topped with cream cheese mixture, then made three \"stripes\" with strawberry pie filling.  I topped it with the second unrolled crescent roll and left some of the filling show, then made three \"stripes\" of pie filling on the top.  Baked for 25 minutes and it was pretty and tasty!!  Also, I used 3/4 cup of powdered sugar and 2 tablespoons of milk for the topping so it would drizzle.  Next time I'll try the slicing method.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Sell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-05T18:52:39.95Z",
                "reviewBody": "UN.BE.lieeeeeeavable!\r\ni halved the recipe, and added a splash of almond extract to the frosting.  i also spread the filling, then rolled the dough up, loaf-style, and it came out looking & smelling like something from a bakery! i think next time i may also add some almond paste to the cream cheese filling and sprinkle slivered almonds on the frosting, just to experiment.  so easy and so good!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Phoebe Winterbottom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/953280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-01T16:46:09.027Z",
                "reviewBody": "I followed the recipe without alterations. There is waaaay too much cream cheese. The bottom layer was soggy. The top layer was almost burnt. I read and re-read the instructions. Not sure why this is so highly rated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kari",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kari/"
                }
            }
        ]
    }
]