[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/116/appetizers-and-snacks/spicy/",
                    "name": "Spicy",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24228/sushi-roll/",
        "name": "Sushi Roll",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5360403.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2020-06-19T03:05:24.000Z",
        "description": "Sushi can be filled with any ingredients you choose. Try smoked salmon instead of imitation crabmeat. Serve with teriyaki sauce and wasabi.",
        "prepTime": "P0DT0H45M",
        "cookTime": null,
        "totalTime": "P0DT0H45M",
        "recipeYield": "8 appetizer servings",
        "recipeIngredient": [
            "⅔ cup uncooked short-grain white rice",
            "3 tablespoons rice vinegar",
            "3 tablespoons white sugar",
            "1 ½ teaspoons salt",
            "4 sheets nori seaweed sheets",
            "½ cucumber, peeled, cut into small strips",
            "2 tablespoons pickled ginger",
            "1 avocado",
            "½ pound imitation crabmeat, flaked"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, bring 1 1/3 cups water to a boil. Add rice, and stir. Reduce heat, cover, and simmer for 20 minutes. In a small bowl, mix the rice vinegar, sugar ,and salt. Blend the mixture into the rice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). On a medium baking sheet, heat nori in the preheated oven 1 to 2 minutes, until warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Center one sheet nori on a bamboo sushi mat. Wet your hands. Using your hands, spread a thin layer of rice on the sheet of nori, and press into a thin layer. Arrange 1/4 of the cucumber, ginger, avocado, and imitation crabmeat in a line down the center of the rice. Lift the end of the mat, and gently roll it over the ingredients, pressing gently. Roll it forward to make a complete roll.  Repeat with remaining ingredients.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut each roll into 4 to 6 slices using a wet, sharp knife.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Spicy"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "1ORANGE1"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.417085427135678,
            "ratingCount": 199,
            "itemReviewed": "Sushi Roll",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "152.2 calories",
            "carbohydrateContent": "25.8 g",
            "cholesterolContent": "5.7 mg",
            "fatContent": "3.9 g",
            "fiberContent": "2.4 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "702.5 mg",
            "sugarContent": "7.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-01T22:53:11.34Z",
                "reviewBody": "this recipe is a must for sushi fans!  I cant begin to tell you the money I've been spending a week on sushi! *lol*  \r\n\r\nI make the rolls with the rice in the nori or on the outside.  I've watched at the sushi station and figured out after pressing the rice onto the nori, sprinkle sesame seeds and flip it over onto the bamboo mat (wrapped in syran wrap) so the rice is on the bottom and nori ontop.  Fill with whatever you want and roll.  \r\n\r\nI've been making the small snack ones with cucumber and carrot in them (nori outside, rice inside), crab salad instead of the crabstick with avacado, shrimp with cucumber and this spicy sauce they make at the sushi station (consisting of rice vinegar, mayo and chilli sauce (the oriental one), the other shrimp one Ive made is shrimp, spicy sauce, avacado and these little crispy rice balls (not sure what they are called but it adds a little crunch) wow are they good!\r\n\r\nI make these now atleast once a week.  If you go to kitchen ect or some place like that, you can pick up a sushi set which has all you need, (bamboo mat, bamboo spoon, rice, wasabi, vinegar, soy sauce, little cook book ect) and its only 30 bucks!  well worth it seeing that 9 rolls cost you 5-7 each time.  \r\n\r\nAlso, the guy at the sushi station said the trick to perfect sushi is a tight roll!  Use the mat and press tight each turn you make with the mat, this will make the rolls tight and things wont fall out or come apart.  Good Luck and Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NYPD K9 COP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nypdk9cop/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-01T21:44:28.56Z",
                "reviewBody": "the hardest part of any sushi recipe is finding a bamboo mat... for a long time mine would come out bulky and uneven and generally not pretty. It's hard to roll sushi with just your hands - the nori rips if you press too hard and the roll coomes apart if not hard enough. The easiest thing to do if you cant find a bamboo mat is use a clean dish towel. To get the meat and other stuff right in the center of the roll, position it 3/4 down on the rice, rather than the center. Just some sushi tricks I've learned these past few years ^^",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSEYCAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/434406/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-10T17:54:30.62Z",
                "reviewBody": "It's nice to see sushi recipes posted. Thanks for this one. I too do not use sugar in my sushi rice. It seems the seasoned rice vinegar has enough sweetness on its own. Also, my japanese neighbor, (originally from Tokyo) always used Heavy Duty Foil instead of a bamboo mat to roll her sushi. She just smiled at me when she saw my bamboo mat and said \"No one really uses these at home in Japan.\" The foil is easy enough, and no cleaning! Just throw it/recycle it. She taught me that in her neighborhood, a california roll had 3 color components, White/red (the crab), green,( cucumber or avocado) and yellow/orange, (roe, carrot, or she used scrambled egg strips). I always make mine with crab, cucumber, & egg.) My husband lived in Japan for 6 yrs and he likes his sushi with crab, lettuce, and mayo. WHEN SHE CUT THE SUSHI ROLL> She used a serrated knife, and a water soaked paper-towel. She folded up the wet paper-towel and dabbed each side of the knife blade to make it wet..before cutting each individual slice. So the nori would have a clean cut edge (not torn/jagged). I hope any of this info. is helpful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BaillysMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3237905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:20:55.81Z",
                "reviewBody": "My sister had to present a project for her japanese class so she chose to make these sushi rolls for them. Boy were they a hit she made everyone one and made extras just in case. They were all gone and people were asking for more. Tastes just as good as any restaurants. I had a problem trying to find \"short-grain\" rice and then I figured out it was \"calrose\" rice. That's the rice they use. Don't be fooled by the brands that say \"japenese rice\" that sell for 3x as much as calrose rice. They're both the same. Anyway thanks will be making again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Flaquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:20:53.793Z",
                "reviewBody": "I've made these for years and I love them. You can make them with only one item rolled in or combine items in the rolls. I don't like to flake the crabmeat (it's better when you buy the long thin strips - it's more like at the restaurants easier and less messy). Go to a Japanese grocery store where you can buy frozen salmon tuna roe etc. for some more variety. Also I spread a VERY thin line of wasabi on the rice before I put on the avocado etc. It adds a little kick. And make sure when you're spreading the rice on the nori that you leave about a half inch at the end without rice so that when you're tightly rolling and almost at the end you can wet that bare edge slightly with a little water on your fingertip. That way the roll will hold together. I don't heat the nori. I store it in the fridge take it out and roll it just like that. I usually cut them into 8 pieces otherwise they're too big. And when making the rice I add salt to the water instead of adding it after the rice is cooked and I don't put any sugar in it when I add the rice vinegar. Serve with soy sauce with a little wasabi mixed in. Sooooooo delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER72_00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:20:53.64Z",
                "reviewBody": "Sometimes its hard to keep those bambo mats clean. So what i do is put mine in a zip lock bag or wrap it in seran wrap. It works great and you can just throw away the bag or the saran when done. This recipe is very good and so easy to do.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADAM_O",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/622771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-17T17:44:58.64Z",
                "reviewBody": "These were great! Tip: For the section of the recipe that calls for adding/blending the rice vinegar, sugar and salt mixture into the rice pan - do the opposite.  Remove the rice from the pan and mix it into a large bowl of the rice vinegar, sugar ,and salt blend. By doing this you won't scorch your rice when the sugary mixture meets the hot bottom of the pan.  This may have been what happened to the one reviewer who said her rice scorches each time she's made it.  This also helps the rice to cool faster.  :o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KatFlyGrl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1292464/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:20:53.293Z",
                "reviewBody": "This is a good recipie for sushi however I usually add a slice of cream cheese (put in freezer for 10 min to harden) and I leave the pickled ginger on the side with the wasabi. If you like spicy rolls mix the krab with japanese mayo and sriracha chili sauce (avail at asian stores.) Its awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SNOWRIDER88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-02T04:10:37.14Z",
                "reviewBody": "My husband and I LOVE sushi but this rice was WAY too sweet. I suggest cutting back on the sugar big time. I will stick to my original recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Mommyof2CutiePies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1853479/"
                }
            }
        ]
    }
]