[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14730/soups-stews-and-chili/stews/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24226/baked-beef-stew/",
        "name": "Baked Beef Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2700.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2020-06-19T03:05:24.000Z",
        "description": "A wonderful and easy beef stew recipe!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds <a href=\"https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/\" aria-label=\"beef stew\">beef stew</a> meat, cut into 1 inch cubes",
            "1 (14.5 ounce) can diced tomatoes with juice",
            "1 cup water",
            "3 tablespoons instant tapioca",
            "1 tablespoon beef bouillon granules",
            "2 teaspoons white sugar",
            "1 ½ teaspoons salt",
            "¼ teaspoon ground black pepper",
            "4 carrots, cut into 1 inch pieces",
            "2 strips celery, cut into 3/4 inch pieces",
            "3 potato, peeled and cubed",
            "1 onion, roughly chopped",
            "1 slice bread, cubed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, brown the stew meat; drain and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a mixing bowl, combine the tomatoes, water, tapioca, beef bouillon granules, sugar, salt and pepper. Stir in the beef, carrots, celery, potatoes, onion, and bread cubes.  Pour into the prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and bake for 2 hours, or until meat and vegetables are tender.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Diane Blanchard Angell"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.619926199261992,
            "ratingCount": 271,
            "itemReviewed": "Baked Beef Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "425.4 calories",
            "carbohydrateContent": "23.2 g",
            "cholesterolContent": "98.8 mg",
            "fatContent": "21.4 g",
            "fiberContent": "2.4 g",
            "proteinContent": "33.1 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "794.3 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-25T14:41:27.937Z",
                "reviewBody": "Good base recipe you can definitely make your own modifications. I add about half a cup of dry red wine. I also boil my water first and then add about four beef bullion cubes (instead of granules) get a broth going and then stir in a few tablespoons of cold water whisked with a few tablespoons of cornstarch (instead of tapioca). This mixture gives me a nice gravy base to start off with. In the meantime I brown my beef (tossed with flour garlic and onion powders salt and pepper) in a large saucepan (pot). Once it has browned I pour a little more red wine in the pot to loosen up the brown bits on the bottom (that's where the good flavor comes from) and then toss in my 'gravy' mixture and the canned tomatoes. I actually drain about half the liquid out because I add more water later. I then add all my vegetables...potatoes celery carrots onions peas...and then I add some addtional salt garlic and onion powder and some a few teaspoons of minced garlic (I looooove garlic) and just a pinch of sugar. I then add just enough water to cover the food stir it up bring to a slow boil and then reduce heat to a nice simmer. I leave it on the stove for about an hour and then transfer to the oven for about another hour or until the meat is tender. It's important to have enough liquid to cover your entire dish or it will come out dry and your meat will not be very tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Bakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-05T22:11:00.127Z",
                "reviewBody": "This is a great recipe! However I did use some of the suggestions of the other reviewers. Definitely use a few tablespoons of cornstarch with a few tablespoons of cold water instead of the tapioca. I've used tapioca in the past (because that was what my mom used) but the stew gravy always seemed to have little geletin like dots in it--corn starch leaves it nice and creamy. I dredged my meat in flour garlic and onion powders pepper and salt by combining all ingredients in a plastic bag with the meat and shaking it. Then I browned the meat in a cast iron pot took out and set aside. Added about 4 cups of water with 4 bullion cubes and brought to a boil. Added can of diced tomatoes garlic powder 2 cloves of fresh minced garlic a little salt sugar corn starch and cold water mixture and made my gravy being sure to dredge up the bits and pieces left over from the meat in the bottom of the pan. Then I returned the meat to the pot and added the vegetables (which I chopped up while the meat was browning). After adding everything I noticed that I needed more liquid to cover everything up. I used about 1/2 box of beef broth (the kind that you can store in your fridge and use as needed instead of being stuck with 1/2 a can) but you should use just enough to cover up all your meat and veggies. Then I put into the oven for 3 hours at 325 degrees and it was just perfect yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFTASTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1408139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-14T20:02:34.67Z",
                "reviewBody": "Wow! This stew had a wonderful flavor. It was a big hit with my family. I did make a couple of substitutions: flour instead of tapioca and onion soup mix instead of chopped onion. It was delicious. I will definitely make this again. From now on however I will leave out the cubed bread. I didn't care for the texture of it when cooked. Otherwise it was excellent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MKALAGAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/693328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-21T18:23:11.207Z",
                "reviewBody": "This was the best beef stew I ever made. I did tweak it a little bit. Since most stews are fairly bland I started by first dredging the beef in flour mixed with salt pepper Italian seasoning onion and garlic powders. I browned it in a cast iron dutch oven. I then took out the beef and added some beef bullion (mixed 1 1/2c. hot water w/3 beef bullion cubes) to loosen the baked on bits. I then added back the meat 1 can beef broth 1 can tomatoes the remaining bullion 3 T. of corn starch with cold water and all the veggies omitted the celery (none on hand)and bread (forgot). I cooked in the oven stirring occasionally for 3 hours. My youngest son who hates onions ate 2 huge bowls. This is definetly a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1688522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-09T18:51:08.773Z",
                "reviewBody": "A direct quote from my husband - \"BEST STEW I HAVE EVER HAD!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\" No kidding. I loved it too because the taste was fantastic and it was SO easy to make! I did substitute 1/4C water mixed with 3T cornstarch because I didn't have any tapioca and it certainly did the trick. This recipe will definitely be a staple meal with our winter comfort foods!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsay Ritchie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2120350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-12T23:14:52.337Z",
                "reviewBody": "THis was an excellent stew! I usually make my stew in the crock pot so something from the oven was a nice change. I lightly tossed the meat with garlic salt onion powder and flour then browned it. I substituted 3T of cornstartch in 1/4 cup of water for the tapioca and I used a can of beef broth in place of the water and bullion because these were the things I had on hand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1518131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-15T01:51:34.09Z",
                "reviewBody": "This was the first time I ever \"baked\" stew and it was fantastic!!! I altered the recipe a little and this is what I did... I used 2 cans of diced tomatoes with juice and then filled the can with water and added that too. I added 2 beef bouillon cubes (crushed) and 1 envelope of onion soup mix. Lastly I added 1/2 cup of Ketchup. I left out the celery and the bread and used \"Wondra\" in place of the tapioca. Doing this left plenty of thick delicious gravy!!! YUM! Make with plenty of biscuits for dipping!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JenniferT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1855339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-06T18:52:50.713Z",
                "reviewBody": "All I can say is DELISH!!! I read all the reviews and used alot of the modifications. I used beef broth instead of water onion soup mix and reduced the salt. I floured the beef and then browned it which thickened the sauce therefore not needing the tapioca. The entire family loved the stew and it was sooooo tender. I will definately use this recipe for years to come.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BONGO1578",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677157/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-29T16:08:14.367Z",
                "reviewBody": "This is a very good beef stew recipe. I am now going to use this as my go to beef stew recipe from now on. Everyone loved this from husband to teenager to toddler. After reading other reviews I made a few modifications. First I used 1 can of stewed tomatoes 2 cloves of minced garlic and instead of the water I used approx. 2 cups of beef broth. I was surprised at how delicious this was seemed pretty simple to taste so good! We had an unusually cold day here and this yummy beef stew was just the comfort food we needed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pngwnchick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2914113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-19T19:53:08.883Z",
                "reviewBody": "Followed the recipe exactly & turned out to be a weirdly sweet tasting stew :(  I don't think instant tapioca is a good blend for stew and the bread chunks ended up very soggy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Hot stuff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2715158/"
                }
            }
        ]
    }
]