[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
                    "name": "Wraps and Rolls",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24239/vietnamese-fresh-spring-rolls/",
        "name": "Vietnamese Fresh Spring Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F07%2F08%2F24239_VietnameseFreshSpringRolls_AR.jpg",
            "width": 2000,
            "height": 1599
        },
        "datePublished": "2000-10-16T01:26:48.000Z",
        "description": "These spring rolls are a refreshing change from the usual fried variety, and have become a family favorite.  They are great as a cool summertime appetizer, and are delicious dipped in one or both of the sauces.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "8 spring rolls",
        "recipeIngredient": [
            "2 ounces rice vermicelli",
            "8 rice wrappers (8.5 inch diameter)",
            "8 large cooked shrimp - peeled, deveined and cut in half",
            "1 ⅓ tablespoons chopped fresh Thai basil",
            "3 tablespoons chopped fresh mint leaves",
            "3 tablespoons chopped fresh cilantro",
            "2 leaves lettuce, chopped",
            "4 teaspoons fish sauce",
            "¼ cup water",
            "2 tablespoons fresh lime juice",
            "1 clove garlic, minced",
            "2 tablespoons white sugar",
            "½ teaspoon garlic chili sauce",
            "3 tablespoons hoisin sauce",
            "1 teaspoon finely chopped peanuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a medium saucepan of water to boil. Boil rice vermicelli 3 to 5 minutes, or until al dente, and drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a large bowl with warm water. Dip one wrapper into the hot water for 1 second to soften. Lay wrapper flat. In a row across the center, place 2 shrimp halves, a handful of vermicelli, basil, mint, cilantro and lettuce, leaving about 2 inches uncovered on each side. Fold uncovered sides inward, then tightly roll the wrapper, beginning at the end with the lettuce. Repeat with remaining ingredients.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix the fish sauce, water, lime juice, garlic, sugar and chili sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another small bowl, mix the hoisin sauce and peanuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Serve rolled spring rolls with the fish sauce and hoisin sauce mixtures.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Wraps and Rolls"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.639107611548557,
            "ratingCount": 762,
            "itemReviewed": "Vietnamese Fresh Spring Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "82.4 calories",
            "carbohydrateContent": "15.8 g",
            "cholesterolContent": "10.8 mg",
            "fatContent": "0.7 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "305.4 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-06T19:17:52.717Z",
                "reviewBody": "I'm Vietnamese so I was impressed when I saw such a great version of one of my favorite dishes.  For those of you who are willing to add a bit more effort to make the rolls even that much more \"authentic\" here are some suggestions:  along with the shrimp, add some boiled pork that's thinly sliced. As well as some sprouts, shredded carrot and a long thinly sliced piece of cucumber.  \r\n\r\nAnd for an easy and excellent peanut dipping sauce, mix 1 part crunchy peanut butter to 2 parts hoisin sauce.  Whisk over medium heat until blended, adding a few splashes of water to make the sauce less thick.  This sauce truly MAKES the dish!  Hope this was helpful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kats11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1013930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:20:15.327Z",
                "reviewBody": "This was so similar to a cooking class recipe that I lost that I just had to try it.  I simplified the recipe by mixing the softened rice noodles with fish sauce (for flavor), and omitting the basil and mint.  I added grated fresh carrots to the rolls for extra color and flavor.  One of the tips I learned in the cooking class was to layer the ingredients for color and a good presentation.  On the bottom end of the softened wrapper, place a leaf of lettuce, cut into two pieces, so that it lies flat.  Top with shredded carrots, then rice noodles, then cilantro leaves.  Just above this stack of ingredients, lay the split shrimp in a line.  By doing this, the shrimp will be visible through the transparent wrapper, when the rolls are served.  Diagonally slice off the uneven ends of the roll, and make a diagonal cut through the roll, dividing it into two pieces.  By doing this, the beautiful green, orange, and white fillings are displayed.  \r\n\r\nI served my rolls with a peanut dipping sauce.  It was very, very good!  The next day, I mixed the leftover rice noodles with fish sauce, shredded carrots, cooked shrimp, cilantro, peanut sauce, and chopped lettuce for a tasty and easy cold main dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDT2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/297942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T04:49:34.357Z",
                "reviewBody": "These fresh spring rolls are delicious!  Don't be intimidated by the rice paper wrappers.  Soak them one at a time in warm water until they are JUST soft then remove it to a paper towel and fill.  The wrap will continue to soften.  By the time you are finished adding the ingredients, it will be ready to roll. If you don't have ALL the ingredients called for in this recipe, please don't let that stop you from using what you do have and enjoying every bite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAKEBAKER61",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/173546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-06T04:33:43.79Z",
                "reviewBody": "Spring rolls are my absolute favorite Vietnamese food.  Apparently, people have different versions of the dipping sauce.  In our family (and yes, we're Vietnamese), we make a peanut-hoisin dipping sauce.  We NEVER use a fish sauce for spring rolls.  In a sauce pan, heat up one can of coconut soda (don't worry if you can't find this, I've subbed a can of 7-up or Sprite with the same result albeit with a slightly different taste), about 3 tablespoons of creamy peanut butter, and about 6 tablespoons of hoisin sauce.  Whisk until all the peanut butter melts.  Simmer.  (Taste it & add more hoisin or peanut butter to suite your tastebuds.)  Put a tablespoon of cornstarch into a mug, add water, & mix.  Slowly add this to the simmering pot to thicken the sauce to your desired consistency - the sauce should have a consistency like gravy.  This will make lots of sauce.  Cool before serving.  Top with crushed peanuts.  In our family, 8 spring rolls does NOT equal 8 servings.  Seriously, we each eat 3-4 of these as a meal.   So that's enough sauce for everyone (well, sometimes, because some of us like the sauce so much, we practically drink the sauce!) UPDATED NOTE:  I made 40 of these today for our party.  When we make lots of these, it helps to take all the greens and chop it all up together; then I can grab 1 handful and get all the veggies at once.  Also, we use slivered cucumbers - adds an extra crunch. Cucumber slices + peanut-hoisin sauce = heaven!  Trust me on that one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4069785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:20:14.453Z",
                "reviewBody": "Brought this to a neighborhood gathering and simplified it since I only had a few minutes to get it ready.  I bought the rice vermicelli and rice wrappers at the local asian store.  I also found rib eye very thinly sliced which is usually used for Korean bulgogi.  I marinated the beef in the soy and ginger rib eye marinade I also found on this website (I added more soy sauce and red pepper to the original recipe to add a bit of kick to it.)  Instead of getting all the different herbs, I grabbed a fancy salad mix with baby spinach, arugula and radicchio.  I stirfried the beef, boiled the water for the vermicelli and then saved that same hot water to put the rice wrappers in one by one to soften.  These rolls disppeared first off the picnic table - perfect for a warm summer evening.  So many people asked me for the recipe and they couldn't believe that I did this all within half an hour!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALELI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/474335/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-28T19:13:39.95Z",
                "reviewBody": "So delicious!\n\nIf unable to find Thai basil, just add more cilantro and mint.\n\nMethod for softening Rice Paper:  alternate between sheets of wet paper towels.  Within 3 minutes they will be soft enough to handle but not so soft that they disintegrate.\n\nMethod for rolling:When rolling, don't start by covering the contents then pulling in.  Rather, cover half the contents, then pull in and roll.  This makes them firmer, and a lot easier to eat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scott Simmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1287563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:20:13.39Z",
                "reviewBody": "These rolls were great the same day I made them.  They still tasted good the next day, but they started to get a little sticky.  If you are serving them to company, make them fresh.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JODISOLOMON100",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-15T10:53:26.54Z",
                "reviewBody": "An explosion of flavour!\nMy suggestions:\nSoak the rice 'Angel Hair' noodles in hot water until soft and white, if you boil them, they turn out soggy. Rinse the noodles in cold water, drain and they are done. Don't chop the herbs up, use whole leaves. Too easy to use too much if it's all chopped up. People have teeth! They can chew!\nThe wrappers need to be simply dipped into warm water, one at a time, and taken out. Place on a clean, plastic cutting board. They will still be hard. Do not fret! By the time you have put the ingredients on, they will have softened up!\nThink of the centre of the rice paper wrapper as the 'top' of the finished roll. Place six shrimp halves (or sliced chicken, pork or tofu pieces) pink side down in a horizontal line. Around this place 6-10 cilantro leaves flat on the wrapper so they show through. On top of the shrimp/meat/tofu place the mint leaves and the basil leaves. Then an oblong nest of noodles. Then some shredded carrot and mung bean sprouts. (Forget the lettuce.) Finally some paper-thin slices of unpeeled English (hothouse) cucumber. You will have a manageable shape that is easier to roll. Roll up as you would do a burrito. Beautiful!\nI use a dipping sauce that is 2 parts smooth peanut butter, 1 part Hoisin sauce, whizzed with 4-6 cloves fresh garlic, a splodge of chili-garlic sauce, a lot of fresh lime juice and a bit of cold water to thin out.\nNote! These ''Rouleaux de Printemps'' are NEVER deep-fat fried!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MsBelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1632045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-24T23:47:21.157Z",
                "reviewBody": "I believe you are missing a few things, but it's ok overall. Carrot or jicama or even daikon for crunch is much needed in your recipe. I would double the shrimp in your rolls, so every bite has some shrimp in it. Also, your hoisin based sauce is the more appropriate one, but you should add some peanut butter and water to it, to give it better depth of flavor. The hoisin by itself can be a bit overpowering.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Azn_Jeff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7328488/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Vietnamese Fresh Spring Rolls",
            "description": "See how to make healthy spring rolls with shrimp.",
            "uploadDate": "2012-10-17T02:22:48.634Z",
            "duration": "PT4M54.669S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F45c3f506-d802-455f-a81a-97f8c8012bfc%2F96e44d2d-a1c8-44fc-977d-c9c64f308653%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1905183936001"
        }
    }
]