[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24351/cinnamon-rolls-ii/",
        "name": "Cinnamon Rolls II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3317510.jpg",
            "width": 1936,
            "height": 1937
        },
        "datePublished": "2000-12-19T16:27:40.000Z",
        "description": "I make these the night before and bake them in the morning. My family and friends can't stay out of them. They are very moist and decadently rich.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT2H25M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "1 cup milk",
            "½ cup butter",
            "1 cup water",
            "1 tablespoon active dry yeast",
            "1 cup white sugar",
            "1 teaspoon salt",
            "2  large eggs eggs",
            "6 cups all-purpose flour",
            "2 teaspoons ground cinnamon",
            "2 cups dark brown sugar",
            "½ cup butter, softened",
            "2 cups confectioners' sugar",
            "1 (3 ounce) package cream cheese, softened",
            "1 tablespoon butter, softened",
            "½ teaspoon vanilla extract",
            "3 tablespoons milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in the butter; stir until melted. Add water and let cool until lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the milk mixture, yeast, white sugar, salt, eggs and 2 cups flour; stir well to combine. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough into two pieces. Roll each piece into a 12x9 inch rectangle. In a bowl, stir together the cinnamon and brown sugar. Spread each piece with half of the butter, half of the brown sugar and cinnamon mixture. Roll up dough, using a little water to seal the seam.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut each roll into 12 slices using a very sharp knife or dental floss. Place rolls onto two 9x13 inch greased baking pans.  Cover and let rise until almost doubled, about 1 hour. Meanwhile, preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 20 to 25 minutes until golden brown.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make frosting; combine confectioner's sugar, cream cheese, butter and vanilla. Add milk gradually until frosting reaches a spreading consistency. Spread over warm (but not hot) cinnamon rolls.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PAT MYERS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.54421768707483,
            "ratingCount": 735,
            "itemReviewed": "Cinnamon Rolls II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "331.2 calories",
            "carbohydrateContent": "55.5 g",
            "cholesterolContent": "42 mg",
            "fatContent": "10.4 g",
            "fiberContent": "1.1 g",
            "proteinContent": "4.7 g",
            "saturatedFatContent": "6.3 g",
            "servingSize": null,
            "sodiumContent": "180.7 mg",
            "sugarContent": "31 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-31T00:02:50.27Z",
                "reviewBody": "Great recipe - even easier to pull off the second time around.  A few lessons I discovered:\n1) As others mention, use 8oz of cream cheese in frosting, not 3 oz as listed in recipe.  Turns out perfect with 8 oz.  Must be a typo.\n2) I let mine rise for about 3 hours, they got much larger and fluffier that way - 1 hour wasn't enough. May be a result of the yeast I used?\n3) The dental floss trick mentioned in other reviews worked great.\n4) I have no idea how one is can roll out a rectangle!  I just did a big circle and pulled out the corners by hand.\n5) Leave the far side (the one you are rolling the \"worm\" of dough toward) clear of any butter or sugar mixture.  It is easier to seal the seam if you have about 1/2\" of clean dough to work with along that seam edge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GCRIM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/934246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-05T03:16:50.407Z",
                "reviewBody": "This recipe is the best one I've ever tried for cinnamon rolls, and I'm really picky.  I did, however, do a couple things differently:  1) let the stand mixer knead it, which transformed it from sticky to smooth dough in 10 min, eliminating the need for extra flour 2) let the dough rise after kneading for 2 HRS - this makes it pliable, silky, and very easy to roll out into rectangles (plus, much lighter), 3) after rolling and refrigerating overnight, let them rise for 2 more hours in the morning (I know, it's a lot of time, but it's soooo worth it!).  The end results were rolls that were tender, fluffy, and soft even after they cooled off.  The frosting was amazing too.  Thanks for this recipe!  It will definitely be a regular in my reportoire!\n\np.s. - for those who don't have a stand mixer, try letting the mixture rest for 10 minutes before kneading it (a French method known as autolyse).  Flour needs time to absorb water, which will help with the sticky dough problem.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mrsduenes06",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2185108/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-12T09:21:22.537Z",
                "reviewBody": "This recipe is easily halved :) \nAs for refrigerating the night before baking, I let the dough rise for an hour before I shape it into rolls. Then after shaped into rolls, I put in pan in fridge covered with plastic wrap. Then I turn the oven on in the morning and let them rise at room temperature/on top of oven for about 30 min-to an hour, until about doubled. Works wonderfully. And the frosting is sooooooo good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Josie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1960993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T23:53:33.81Z",
                "reviewBody": "very good recipe.  One tip i would suggest is that after letting the milk mixture cool down some add the sugar and yeast first.  also you want the liquid to be around 105 - 115 degrees F.  if you add the salt at the same time as yeast it will cause the yeast not to activate and due to this you will have problems getting it to rise.  the yeast feeds off of the sugar which causes it to activate and rise more quickly.  adding salt before the yeast activates kills off some of the yeast.  So once you add the sugar and yeast wait about 10 minutes or until some foam forms on the surface of the liquid before adding the rest of the ingredients.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cory",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3303962/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-26T02:29:00.71Z",
                "reviewBody": "Good recipe but as a professional baker I would suggest to put all dry ingredients in bowl ( I also added 2tbls of glueton to flour (found in grocery store with the flour) this gives it a lighter, fluffy texture and helps preserve longer. Sugar activates the yeast not the salt as a review mentioned. I also melted butter and spread on dough then the brown sugar and sprocket cinnamon with raisins. Put in refrigerator if u want to bake in A.M.  One viewer said it took a long time to rise. If u have a bread proofing cycle on your range use it. Otherwise if you press 140-200 no hotter on your oven then shut off put rolls in this cut rising time in half without killing the yeast. If u don't want the work u can use a loaf of frozen bread dough put in microwave on defrost for 4-5 minutes should be soften to roll if not put back in for 1 more minute only then roll spread melted butter, cinnamon mix with white or brown sugar or half brown & half white sugar and raisins roll up and cut 9-11 slices. Put in greased Pan not touching allowing for doubling in size then repeat oven instructions for proofing  when doubled bake 350 for 15 minutes",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Judi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2127496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-08T21:56:46.937Z",
                "reviewBody": "I made this recipe for my boyfriend and his co-workers, (they're firemen). They absolutely loved them. Now they all want the recipe so that they can have their wives/girlfriends make them at home. They especially loved the icing. I did need a little extra flour. Also I made up an extra batch of the cinnamon/brown sugar. I put it in a bowl with melted butter (just enought to make a slightly runny paste). Then I spread it over the tops of the cinnamon rolls right befor they go in the oven. It gives them just that much more yumminess. They especially loved the icing. These are now a favorite among my family, co-workers, and several local firehouses.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Breanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2223410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-30T21:35:01.693Z",
                "reviewBody": "If you're a novice (like me) or looking for a compilation of most useful reviews, I'm listing the tips I found most helpful for these HEAVENLY rolls. I'd never used active yeast or made 'real' bread before, so I spent some time researching to figure out what to do and when. Here are my tips! 1)Once milk mixture cooled, added yeast & sugar then let sit 10 min to ensure yeast activated, then added salt, eggs, flour. 2)Added extra 1/2 C. flour to manage stickiness of the dough. After all flour was mixed, I let dough sit ~10 min (autolyse method). 3)After kneading, placed dough in greased bowl & placed wet towel over top to let rise ~2 hrs. 4)Divided dough, then used 9x12 sheet pan to gently press dough into rectangle 5)doubled cinnamon (4 tsp) for \"filling\" 6)Rolled dough from long edge, wrapped in plastic & put in fridge to cool (easier for slicing). I later sliced, put in pans (two 9x13 and one pie plate) and put back in fridge overnight. 7)Spacing - I did 9 rolls in each 9x13 pan, spaced about 1.5\" apart. They rose enough during baking that they ended up covering entire pan, edges touching 8)In the AM, preheated oven and let pans sit on warm stove for 1 hr to let rise a bit more. Added leftover butter and sugar/cinnamon to tops & baked ~22 mins. 9) doubled cream cheese for frosting (6oz) which hydrated frosting enough that I didn't add milk, but definintely got a thicker frosting.  If you want \"drizzling\" consistency, add a little milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peytonje",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4887869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-26T21:17:00.44Z",
                "reviewBody": "These were well worth the effort.  As for making ahead of time, I wasn't sure at what point to stop, so I made the rolls and put them in the pan - then placed in fridge.  Got up early to let them warm, then rise, and then baked.  Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/434775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-07T13:24:51.49Z",
                "reviewBody": "I am not really sure how to review this recipe since I did not follow it exactly. I have some experience with sweet breads and I was puzzled by a couple of things with this recipe.  First of all, there is no step for yeast proofing, it does not instruct you to add the eggs called for in the ingrediants list nor does it call for a first rising of the dough before forming the rolls.  So, here is what I did.  I used the one cup of water called for (110-115 degrees) with 2 T. of sugar out of the 1 cup called for as the proofing.  When the yeast was foamy after 10 minutes I added the milk, butter, sugar, salt, eggs (which should be at room temp).  I also added about a teaspoon of vanilla and then I added first 2 cups of flour.  After all the flour was added I used the dough hook on my stand mixer to beat the dough for about 5 minutes.  The dough was sticky and shiny, not soft and smooth but sticky and shiny is what you should have with a sweet bread.  Anyway, I scraped it into a buttered bowl and let it raise about 1 1/2 hours. Poured it out on a floured board and divided it in two pieces. Rolled into rectangle and added filling along with some extra cinnamon.  Placed rolls in buttered dish and let them raise again for about 1 1/2 hours.  Baked for 25 minutes.  I used the frosting recipe but added a little more butter and powdered sugar so that I had enough to really slather the rolls.  These were so good my husband almost swooned.  I am giving the recipe as it is 3 stars but with",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PrincessoftheLake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3450502/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cinnamon Rolls II",
            "description": "Watch how to make these top-rated cinnamon rolls.",
            "uploadDate": "2012-11-12T23:08:24.139Z",
            "duration": "PT7M10.847S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F53371c12-d8f4-41ee-b715-849cb13e5491%2Fb058714b-5c29-49dd-b75e-7e60fab7d6d8%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1964300505001"
        }
    }
]