[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/859/desserts/cookies/sugar-cookies/",
                    "name": "Sugar Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24462/thick-cut-outs/",
        "name": "Thick Cut-Outs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F150361.jpg",
            "width": 1280,
            "height": 1001
        },
        "datePublished": "2020-06-19T03:05:33.000Z",
        "description": "A big batch of big thick sugar cookies. These are THE big soft sugar cookies you have been looking for. Frost them while warm and sprinkle with colored sugar.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "75 cookies",
        "recipeIngredient": [
            "2 ⅛ cups white sugar",
            "2 cups butter, softened",
            "4 eggs",
            "6 egg yolks",
            "1 ½ teaspoons vanilla extract",
            "7 cups all-purpose flour",
            "1 tablespoon baking powder",
            "½ teaspoon salt",
            "4 cups confectioners' sugar",
            "¼ cup vegetable oil",
            "½ teaspoon vanilla extract",
            "1 tablespoon hot water or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the sugar and butter until smooth. Beat in the eggs and egg yolks, one at a time, mixing well after each. Mix in vanilla extract. Combine flour, baking powder, and salt; stir into the sugar mixture. Cover dough and chill for at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. On a floured surface, roll the dough out to 1/2 inch thickness and cut into desired shapes using cookie cutters. Place 2 inches apart on the prepared baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make frosting, mix together the confectioners' sugar, oil and 1 teaspoon vanilla until smooth. gradually add enough hot water to achieve a spreadable consistency. Spread over warm cookies.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sugar Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Margo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.56140350877193,
            "ratingCount": 285,
            "itemReviewed": "Thick Cut-Outs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "147.5 calories",
            "carbohydrateContent": "21.1 g",
            "cholesterolContent": "39.3 mg",
            "fatContent": "6.4 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1.8 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "68.5 mg",
            "sugarContent": "12 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-18T23:00:44.15Z",
                "reviewBody": "Sugar cookies are my favorite cookies to make and these are the only ones I will EVER make again! I always add extra almond extract and they are So big and delicious! I've made them so many times that people just expect them for every holiday! I don't use this icing recipe, instead I make it with corn syrup and different flavored extracts.... I let the iced cookies set overnight and the are so stackable and ship Very well. For Valentines day, I made pink icing with strawberry extract and red icing with raspberry extract. I always put them in cute printed cellophane treat bags and give them to everyone in my family and everyone at work. (and I always save a few for myself)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2128864/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-30T21:43:11.333Z",
                "reviewBody": "The recipe I've been looking for forever!  They remind me of the ones you can get at \"Dutch\" restaurant bakeries.  Yes, the recipe neglects to tell you to add the vanilla extract, but come on folks!  Add it with/after the eggs.  I did double the vanilla, added around 3/4 teaspoon of almond extract, and added 1/4 cup of sugar as suggested by others because I like a sweeter cookie.  Perfect flavor!  Matched great with the \"Sugar Cookie Icing\" recipe on this site (not the icing recipe given).  You don't need to add flour; stick in the fridge for an hour, put flour on your rolling surface, a bit on your rolling pin, and a sprinkle on the dough you're going to roll out - no sticking!  I baked them for a total of 10 minutes, turning the sheet around in the oven at 5 minutes because my oven doesn't heat evenly on both sides unless I do so.  In my case, I had to watch the bottoms carefully - a teeny bit of golden color and they were DONE.  People are always so impressed with these!  I hate reading the extremely low star reviews for this recipe...people, learn the basics of cookie making (cream your butter/sugar thoroughly, don't over-mix the flour, use fresh baking powder/soda, learn the signs of doneness, etc.) before you complain about a recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ARDEO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-15T17:50:43.623Z",
                "reviewBody": "These cookies were very good!  To tell the truth, I really debated whether or not to make them since a few people really did not like them at all.  I thought what the heck -- I like to bake and it would really not be that big of a deal if we didn't like them.  I cut the recipe in half and ended up with 28 thick, soft cookies.  I added a little almond to the dough, as others had done, just to give it a little flavor.  I'm not sure what those who didn't like them are looking for.  They were very easy to make, and the dough was easy to handle.  The final cookie is a little shortbread-like.  We really liked them and will make them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JANIEJANIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1326411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-05T15:31:53.09Z",
                "reviewBody": "These really are soft and perfect. I have been looking for a good sugar cookie cut out recipe and this is the one. Upon reading other reviews I doubled the vanilla and added about 3/4 teaspoon almond extract. I also increased the sugar by 1/4 cup. I refrigerated the dough for about two hours and it was so easy to work with. When I baked them I put them on a silpat liner and the bottoms didn't even brown. I made hearts for Valentine's Day and I put them unfrosted in the freezer. I will take them out and thaw them when I am ready to frost them. Yummy cookies! They remind me of a homemade version of Cheryl & Co.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1271132/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T19:46:15.343Z",
                "reviewBody": "The only reason i didnt rate the a 5 was because i thought it lacked a touch of more flavor. THIS IS A GREAT COOKIE but next time i am going add some Almond Extract and see if it fixes it. The dough is Very Easy to work with! I think one should watch the clock carefully on these and not go to or over 10mins! PS.(THE # OF EGGS IS CORRECT)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ANDIKOF3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/226255/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-18T01:13:39.7Z",
                "reviewBody": "These cookies were delicious and soooooo easy to work with!!!  I used 1 tsp. of vanilla and 1/2 tsp. of almond extract.  I also substituted whipping creme for the 6 egg yolks (about 1 tbsp. for each yolk).  If you have a hard time making sugar cookies, this would be a good recipe for you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GAILSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-24T00:13:43.01Z",
                "reviewBody": "Awesome recipe! I was looking for the perfect cookies for my sister-in-law' babyshower, and I'm so glad I used these. I  baked these in the shape of baby carriages and bottles, and then used the icing recipe  called \"Sugar Cookie Icing\" from this site. I copied the colors and piping from the Cookies by Design website and they came out PERFECT!!! Now everyone in the family calls me Martha Stewart :).  If baking for a more adult crowd and using icing, only use this recipe's amount of sugar otherwise I think they would be too sweet. If you don't plan on decorating, definitly add a little bit more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Ecklund",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2503812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-18T16:50:45.81Z",
                "reviewBody": "Excellent! With a little almond extract they are exactly like the ones from Cookies by Design(cookie bouquets). Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CUPYSMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/254468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T20:04:01.617Z",
                "reviewBody": "My cookies must have been mondo because I only got 30 from this recipe. I rolled them 1/2 inch thick and used a 3 1/2 inch heart cookie cutter. I used 2 tsp. mexican vanilla and 2 tsp. almond extract. I needed to cook them about 11 minutes or they were still doughy inside. They also spread a bit more than I thought they would so leave room between them when baking. They tasted GREAT! Not too sweet and with icing they were perfect. No sugar coma here. The dough was wonderful to work with. I used a floured pastry cloth to roll it out on and a rolling pin cover. I didn't have any problem with it sticking. I usually don't make roll out cookies because I haven't found a good dough that doesn't stick. This was the exception. I'll make these again. Hubby and kids loved them!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1645250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T02:00:26.873Z",
                "reviewBody": "I tried three different sugar cookie recipes off this site. This one was the worst. Don't get me wrong the finished product tasted good but the large amounts of ingredients wasn't worth it. The dough was hard to work with too. A good tasting cookie just not worth the hassle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Wilson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kik_it2/"
                }
            }
        ]
    }
]