[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24556/cinnamon-rolls-iii/",
        "name": "Cinnamon Rolls III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4459950.jpg",
            "width": 1278,
            "height": 1278
        },
        "datePublished": "2020-06-19T03:05:36.000Z",
        "description": "Here's an easy alternative to buying those famous cinnamon rolls in the mall. They taste exactly the same, and the dough is made in the bread machine.",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "16 rolls",
        "recipeIngredient": [
            "¼ cup water at room temperature",
            "¼ cup butter, melted",
            "½ (3.4 ounce) package instant vanilla pudding mix",
            "1 cup warm milk",
            "1 egg, room temperature",
            "1 tablespoon white sugar",
            "½ teaspoon salt",
            "4 cups bread flour",
            "1 (.25 ounce) package active dry yeast",
            "½ cup butter, softened",
            "1 cup brown sugar",
            "4 teaspoons ground cinnamon",
            "¾ cup chopped pecans",
            "1 (4 ounce) package cream cheese, softened",
            "¼ cup butter, softened",
            "1 cup confectioners' sugar",
            "½ teaspoon vanilla extract",
            "1 ½ teaspoons milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In the pan of your bread machine, combine water, 1/4 cup melted butter, vanilla pudding, 1 cup warm milk, egg, 1 tablespoon sugar, salt, bread flour, and yeast. Set machine to Dough cycle; press Start.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When Dough cycle has finished, turn dough out onto a lightly floured surface and roll into a 17x10 inch rectangle. Spread with 1/2 cup softened butter. In a small bowl, stir together brown sugar, cinnamon, and pecans. Sprinkle brown sugar mixture over dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Butter a 9x13-inch baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll up dough, beginning with long side. Slice into 16 one-inch slices; place in prepared pan. Let rolls rise in a warm place until doubled, about 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake rolls in preheated oven until browned, 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir together cream cheese, 1/4 cup softened butter, confectioners' sugar, vanilla extract, and 1 1/2 teaspoons milk. Remove rolls from oven and let cool until warm; spread frosting over warm rolls.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MISS ALIX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.766328828828829,
            "ratingCount": 1776,
            "itemReviewed": "Cinnamon Rolls III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "371.8 calories",
            "carbohydrateContent": "45.2 g",
            "cholesterolContent": "51.4 mg",
            "fatContent": "18.9 g",
            "fiberContent": "1.7 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "198 mg",
            "sugarContent": "18.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-25T20:07:15.793Z",
                "reviewBody": "Absolutely wonderful!!!  I used the traditional method, without the bread maker.  I dissolved the tbs. sugar (I used brown) in the water, along with the butter.  If you use cold butter, just boil the water, and pour it over the butter while stirring.  By that time the temp is quickly brought to the ideal temp for adding the yeast.  Cover with plastic wrap, and fix the pudding while the yeast foams.  I add the egg, pudding mix and milk together and stir.  Then, I measure out the flour, adding 4 tsp of vital wheat gluten to all purpose flour, (I had no bread flour).  By that time, the yeast is ready for mixing.\nI add the pudding mixture, mixing well, followed by the flour.  I knead the dough until it forms a ball-all done in same bowl.  After I remove the ball, I pour a bit of oil in, and replace the dough and roll it in the oil.  The rest is pretty self-explanitory.  After rising for about 1 hr. I roll out, spread filling, cut, and rise again.  I cook for my boyfriend and the mechanics at his shop and they wont stop raving about them!  My boyfriend says that it's the only time the ENTIRE SHOP just sits in silence, awing over how good they are!!  A++++ recipe! Thanks Miss Alix!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~Marianne~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1381537/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-11T07:44:41.64Z",
                "reviewBody": "I made Christmas Eve a.m. using bread machine, cut (15 rolls fit great), put in pan, covered with plastic wrap sprayed with Pam and refrigerated.  Christmas a.m. I removed from fridge and let rise about 40-45 minutes.  Baked 325 (Convection oven setting) for 20 minutes and they came out great.  I used the whole box of pudding and increased the butter (for filling)to 1/2 C., increased the cinnamon to 2 T. and ommited the nuts.  I also used the \"Clone\" icing recipe from this site.  They were absolutely WONDERFUL! My Mother in law asked for the recipe and said that she would never cook GRANDS again!  I made again and froze; place on parchment papered cookie sheet and freeze. Once frozen place in freezer bag.  Remove rolls the night before and put in a buttered pan and refrigerate overnight as described above.  Next morning let rise, bake and ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1505883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-16T11:12:08.873Z",
                "reviewBody": "I followed this recipe exactly. I made 2 batches of rolls (48 all together).  Instead of raising and baking again, I put the cut rolls on a greased tin foil covered cookie sheet and froze.  After the rolls were frozen, I placed them in a freezer bag so I could take out however many I wanted.  I took the rolls out of the freezer the night before serving.  I made caramel topping for one pan, the other pan I greased and placed the rolls in to be frosted after baking and placed the pans in the refrigerator.  The next morning, I took them out of the fridge, let them raise for about 30-40 minutes, then baked at 375 for about 20 minutes.  I turned both pans over and frosted one pan.  The rolls were excellent and I still have 1 dozen of frozen rolls left to use.  You can have fresh baked cinnamon rolls any time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Bednarz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10421/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-13T17:30:30.653Z",
                "reviewBody": "I didn't use my bread machine, and  they still turned out great!  Just let\r\nthe dough rise for about an hour. Then make the rolls and let the rolls \r\nrise for another 45 minutes or so.  These are really good.  I will definately \r\nmake these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IGIVEUP2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248161/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-07T17:52:14.08Z",
                "reviewBody": "I'm a very experienced baker and love a great, gooey cinnamon roll.. but these were not my favorites.  I think it was the addition of the vanilla pudding mix as it gave them an \"off\" flavor.  Not sure why it was an ingredient, but I always make a recipe exactly as written here first before reviewing.. nothing worse than making a ton of changes and then commenting that the recipe wasn't good.  Not sure how it might be without the pudding mix or with all purpose flour, but I felt the bread flour made them far too dense and heavy.  I didn't even bother putting the icing on them.. they just weren't that good, sorry.  Also, I'm a traditional baker and I can convert any bread recipe that uses a bread machine, but as a traditionalist.. I wish these recipes gave stand mixer variations.. Bread machines just don't cut the mustard for this baker.  I like to control the look and feel of my dough and can tell by touch and site whether a dough will work or not.. in a bread machine, you're baking blind.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LemonLush",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bellesaz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T23:20:02.2Z",
                "reviewBody": "These cinnamon rolls were really, really good. I used regular granulated sugar instead of brown sugar for the filling. Plus to make them extra rich and gooey, I made a delicious caramel sauce for the bottom by melting 1/3 cup butter. Then I stirred in 1/2 cup of light brown sugar and 1/2 cup of vanilla ice cream and cooked the mixture, stirring frequently, just until thickened and bubbly. Then I poured it into the bottom of my pan. Like several others, I didn't use my bread machine. I dissolved the yeast in the warm water, added the rest of the ingredients and needed the dough just until smooth and elastic. Then, I placed the dough in a lightly oiled bowl, turning once to coat both surfaces, covered it with plastic wrap, and sat it on top of my warm stove to rise for about an hour. After that, I formed the rolls and put them in the pan on top of the caramel mixture, covered them once more and let them rise for 45 minutes until they doubled. Then, I baked them for 15 minutes, as directed in the recipe. EXCELLENT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MsTish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/964313/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T19:43:04.623Z",
                "reviewBody": "Excellent! I've made these three times in the past week because they're so good! I add in the full box of vanilla pudding, as others have suggested, and that makes them even more wonderful. I also made them and baked them immediately, after the 45 minute rise, and I made them and put them into two 8x8 foil pans and covered with foil and popped in the fridge to bake later. They turned out just as good and didn't need to rise before putting into the oven. \r\n\r\nI ALSO made a reduced-sugar version for the diabetics in my family. I tried it with sugar-free vanilla pudding and it turned out horrible, but then used half a box of regular instant vanilla pudding and the dough was wonderful. I substituted Splenda for the brown sugar and used Splenda instead of confectioner's sugar in the frosting and my diabetic guests were thrilled with the result.\r\n\r\nFor the regular sugar-filled rolls I made I did a combo of this frosting recipe and the clone of a cinnabon frosting recipe. I used 8 oz of cream cheese, two cups of confectioner's sugar, 1 tsp of vanilla, 2 tsp of milk and one stick of softened butter. Yummy and perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/228767/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T19:31:33.543Z",
                "reviewBody": "I have made this recipe twice. I use raisins instead of nuts. I make them the night before put them in the fridge and then set them out to rise and bake in the morning. Wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAM M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/681760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T08:35:35.74Z",
                "reviewBody": "I had never made cinnamon rolls from scratch before this weekend when I tried this recipe. These are great and easy even for a beginner like me! I don't have a bread machine so I used another reviewers suggestion and kneeded the dough and let it rise an hour before rolling it out. Worked great. The icing is quite rich so I may omit the cream cheese next time. My husband loved these! Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Louise Maxine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/704442/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cinnamon Rolls III",
            "description": "Make your own mall-style cinnamon rolls!",
            "uploadDate": "2012-08-10T18:44:56.550Z",
            "duration": "PT4M46.828S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F22c5287e-1925-41ef-b7f7-702067083a7a%2F77dc38db-3080-4406-afa7-443ed89650b5%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1780289387001"
        }
    }
]