[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24574/overnight-caramel-pecan-rolls/",
        "name": "Overnight Caramel Pecan Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F560419.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:05:37.000Z",
        "description": "These are easy and very good! They can be made and then cooked in the morning and make great hot rolls for special mornings (like Christmas or Easter). I have had a lot of compliments on these. Everyone will think that you got up very early to make these rolls because they are hot in the morning! I use my bread machine for the dough part, makes it very easy!",
        "prepTime": "P0DT1H30M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT16H40M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "2 cups milk",
            "2 (.25 ounce) packages active dry yeast",
            "½ cup warm water",
            "⅓ cup white sugar",
            "⅓ cup vegetable oil",
            "1 tablespoon baking powder",
            "2 teaspoons salt",
            "1 egg",
            "7 cups all-purpose flour",
            "1 cup packed brown sugar",
            "½ cup butter",
            "2 tablespoons light corn syrup",
            "1 cup pecan halves",
            "¼ cup butter, softened",
            "½ cup white sugar",
            "1 ½ tablespoons ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Warm the milk in a small saucepan until it bubbles, then remove from heat.  Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine yeast mixture, milk, sugar, oil, baking powder, salt, egg and 3 cups flour. Beat until smooth. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat brown sugar and 1/2 cup butter until melted. Remove from heat; stir in corn syrup. Divide mixture between two 9x13 inch baking pans. Sprinkle 1/2 cup pecans in each pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When dough has doubled in size, punch down and turn out onto a lightly floured surface. Roll out into a large rectangle and spread with butter. Sprinkle with sugar and cinnamon. Starting with the long side, roll up the rectangle into a log, and slice into 1 inch wide rolls. Place the rolls slightly apart in pans. Wrap pans with aluminum foil and refrigerate at least 12 hours but no longer than 48.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove rolls from refrigerator and let stand in a warm place until doubled in size, about 30 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake uncovered in preheated oven until golden 30 to 35 minutes. Immediately invert pan on heatproof serving plate. Wait for 1 or 2 minutes before removing pan, so that caramel drizzles over rolls.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ERIBERRY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.692883895131086,
            "ratingCount": 267,
            "itemReviewed": "Overnight Caramel Pecan Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "327.3 calories",
            "carbohydrateContent": "47.4 g",
            "cholesterolContent": "24.6 mg",
            "fatContent": "13.3 g",
            "fiberContent": "1.8 g",
            "proteinContent": "5.5 g",
            "saturatedFatContent": "4.8 g",
            "servingSize": null,
            "sodiumContent": "292.7 mg",
            "sugarContent": "17.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-09-12T09:47:22.023Z",
                "reviewBody": "I used to make this recipe for every special occasion and somehow lost it.  Was I ecstatic to see it posted in \"allrecipes\"!  These rolls are the best.\r\n\r\nWhen slicing the logs into individual rolls, use dental floss instead of a knife.  The rolls don't get squashed and the cut is cleaner and easier.  Use about 18\".  Put the floss under the roll.  Holding each end of the floss, bring them up criss-cross over the log and pull in opposite directions.  Kinda like a tonsillectomy, I'm told!  Hope others find this way helpful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BOOKWORM15212",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1182009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-22T18:54:02.933Z",
                "reviewBody": "This recipe is fabulous!  I must admit, I usually take the lazy route, and use frozen bread dough.  I use this recipe only for the caramel.  I've used many other caramel recipes, and ended up with really sticky/chewy caramel.  This recipe produces perfect caramel.  Make certain you do not boil the caramel, or else the caramel mixture will harden!  Do as the recipe says, and stir in the corn syrup after the mixture has been taken off the heat source.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1497206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-11T16:23:49.92Z",
                "reviewBody": "I was really surprised at how easy this recipe was to make. I read the reviews and noticed a couple said it needed less butter, so I skipped putting the butter on the rolled out dough. Next time I'll make it exactly as directed. Also, I made my rolls in 3 round pans, and did only one with pecan halves because so many in our family say they don't like nuts, next time I'm going to make them all with the nuts, everyone grabbed for those first and it seemed to protect the rolls from browning too much. I also used parchment paper in the bottem of my pans because someone suggested it was hard to clean, but I think if you just pop the pans right into water for a few minutes after removing the rolls, you won't have any problems with cleanup. Great recipe, thanks Andrea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHERI63MI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/740638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-25T21:50:01.383Z",
                "reviewBody": "OH. MY. GOD! These just came out of the oven and we are all going CRAZY for them!!! I halved the amount of dough, but kept the full amount of filling and bottom stuff. I also added 1/2 a cup of toasted chopped pecans into the filling. I learned a great technique to make a warm area for the dough to rise: I put the dough and a coffee mug of freshly boiled water into the microwave (don't turn it on). The hot water makes the inside of the microwave the perfect tempertature and humidity for the dough to rise perfectly! I didn't wait overnight, I just let them rise a second time for 30 minutes in the micro again and then baked right away. Mine only took 25 minutes in the oven. EXCELLENT!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kle_sam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4424314/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-10T15:43:22.17Z",
                "reviewBody": "I grew up with a recipe that is similar to this one, except it had Rhodes Rolls and butterscotch pudding for the topping. BUT, I wanted to go from scratch and when I saw this I knew that it just might work! Here is how I changed it to be like the one I grew up with...\n\nI made the dough as specified but instead of rolling it out I stopped. I lightly greased two bundt pans, put finely chopped pecans and a handful of coconut in the bottom. Then I made the caramel sauce and put that on top of that. Then I took the dough and divided it as specified and made little balls and put that on top of the sauce. Then I followed the directions after that... covering, putting in fridge and baking in the morning, instantly flipping it out to let the sauce cover that rolls. \nIt is beautiful and tasty! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsCHV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2982111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:32:48.497Z",
                "reviewBody": "This is the best dough recipe for a cinnamon roll that I've tried.  I used my bread machine and the dough turned out perfect.  The topping was very good but I added a cream cheese frosting that really made the roll.  The \"Easiness Rating\" really drops the overall rating.  Rolled baked goods are never easy, and this one is no exception.  It is just good messy fun.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/289362/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:32:46.7Z",
                "reviewBody": "I tried these months ago...changed a few things, instead of the carmel glaze I spread it on the rolled dough, add cinnamon - roll in log & cut.\r\nIt made my pans impossible to clean almost before.\r\nHOLIDAYS????  I make AT LEAST 2 double batches a week!!!!!\r\nOur small school teachers buy them to start out their Mondays, they are a great \"Welcome New Neighbor\" suprise, and as my revolving door with my 2 teenagers & friends....\r\nWell, there is not one in there for ME today w/ coffee!\r\nI do a powdered sugar glaze / milk / maple flavoring - just drizzle across....\r\nNo one has ever turned one down - or left crumbs!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GYPSYWINDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/720877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-01T15:14:13.953Z",
                "reviewBody": "I have been looking for a great roll recipe for the longest time.  I was a bit \nhesitant to try something from on line, but I gave it a shot and it turned \nout beautiful! I was a little crunched on time so the fridge time was not exactly\nthe recomended, but they still worked, just like in the bakery, and I do mean \nthese girls were huge!  Try it for you family and I promise they will be asking \nfor seconds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PSPIPHI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/592822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-14T17:54:20.443Z",
                "reviewBody": "I tried this recipe for the first time yesterday, made for a gathering for the \"girls\" Christmas party.  Seventeen accomplished cooks and bakers raved over these and requested the recipe!  I made a double batch (four dozen), and made a couple changes. One inadvertent one was that I used cornstarch instead of baking powder by accident (the red Rumford cans look the same!). It didn't seem to hurt the finished product one bit, though.  I also doubled the amount of the caramel for each recipe at the suggestion of others here, and was glad I did. It was just the right amount and wouldn't have been enough if I hadn't doubled it.  Also, I generously slathered the dough with a \"cinnamon butter\" made with the cinnamon, butter and BROWN sugar instead of the white. The cinnamon I used was 2 percent oil, too, so had a nice strong cinnamon presence. Combing the three ingredients was easier.  As to the pan cleaning? Use disposable medium-weight foil pans sprayed with Pam. The rolls slip right out when inverted (leave the pan on for a few minutes to allow all the caramel to run over rolls) and the pan gets crumpled up and tossed away!  I'm going to make them again for Christmas morning. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deedeedinah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4311031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T18:55:03Z",
                "reviewBody": "These were ok. I followed the recipe exactly. I baked the rolls about 25 minutes and that was too long. They were overcooked and dry so that is the first thing to watch for. I also didn't think there was enough caramel topping and that it wasn't thick enough. If I make these again I'd probably double the topping and make it thicker with more brown sugar/butter ratio.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SometimeCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/674315/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Caramel Pecan Rolls",
            "description": "See how to make amazing 5-star sweet rolls.",
            "uploadDate": "2012-08-30T17:11:51.757Z",
            "duration": "PT4M9.289S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F10bf9e5d-bb84-440b-8bea-5d9edb316ca2%2Fc86b233c-aa1a-4ddc-bf61-a3155dc087ae%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1814879213001"
        }
    }
]