[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24697/licorice-caramels/",
        "name": "Licorice Caramels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7553743.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:05:39.000Z",
        "description": "This is a mouthwatering candy recipe that is as close to the Callard and Bowser licorice flavored caramels as you can get.  I got this recipe from my sister, and once you have a piece, you can't stop eating them!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "64 pieces",
        "recipeIngredient": [
            "1 cup butter",
            "2 cups white sugar",
            "1 (14 ounce) can sweetened condensed milk",
            "1 cup corn syrup",
            "⅛ teaspoon salt",
            "1 teaspoon anise extract",
            "black paste food coloring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a 9x9 inch dish with buttered foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium heat, melt butter.  Stir in sugar, milk, corn syrup and salt.  Bring to a boil, stirring frequently.  Continue to heat, without stirring, to 242 to 248 degrees F (116 to 120 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball.  Remove from heat and stir in anise and food coloring.  Pour into prepared pan.  Let cool completely, several hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To cut, turn out of pan and peel away foil.  Cut with a buttered knife.  Wrap pieces in waxed paper or candy wrappers.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Paula"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.56140350877193,
            "ratingCount": 57,
            "itemReviewed": "Licorice Caramels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "83.9 calories",
            "carbohydrateContent": "13.5 g",
            "cholesterolContent": "9.7 mg",
            "fatContent": "3.4 g",
            "fiberContent": null,
            "proteinContent": "0.5 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "35.9 mg",
            "sugarContent": "11 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-13T14:01:55.92Z",
                "reviewBody": "If you are trying to duplicate Callard & Bowser - this is it exactly!  However, after scorching the pan the first time, I had to stir continuously and it took an hour over medium heat to reach the right temp, so be careful with that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "smh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1674272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:58:54.78Z",
                "reviewBody": "This is my husbands all time favorite candy ever!!! The licorice flavoring is\r\nvery subtle - even those who dislike licorice will love this candy.  You can also\r\nsubsitite the anise flavoring with vanilla if desired.\r\n\r\nIt is so easy - mix all together, bring to temperature, and then pour in pan to cool - \r\nby morning they are ready to be cut into perfect squares and wrapped in wax\r\npaper.  They keep their shape at room temperature.\r\n\r\nI cannot say enough good about this recipe!!!!  One suggestion I  have for a\r\ntwist is this:  after pouring the caramel into a pan to cool, place Lorna Doone \r\nshortbread cookies all over the to - covering all the caramel.  next day, cut\r\nthe caramel into perfect squares around each cookie.  Then, dip the candy into\r\nmelted chocolate - let firm and then you have a homemade twix bar - but better!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ESJILL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/532752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-16T20:02:29.81Z",
                "reviewBody": "Without a doubt this is the very best recipe for licorice. It is soft chewy and if you use very good anise it is beyond descripton. I use Watkins Anise for best results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DDDAVISSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/752322/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-12T05:15:12.933Z",
                "reviewBody": "I have noticed that the people that have given this recipe lower stars have had some difficulty with the recipe.  The main problem that you are having is your heat.  After melting your butter and adding the next ingredients, you have to crank the heat up.  Sugar has to cook on high heat or it will burn before it melts.  Sugar doesn't melt until it hits 225 F (sea-level) so it's going to burn on a low temp before it ever melts.  The other thing is once it starts to boil, as tempting as it is, don't stir. (Just like the recipe says)  Sugar is hard to work with, so don't give up if you fail a couple of times!  I am a culinary student currently in an advanced baking class.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mdyer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7175964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T00:08:12.043Z",
                "reviewBody": "these are scrumptious! so buttery good and rich and creamy but with a hint of licorice taste. Didn't have the paste for coloring so tinted w/red food coloring for the holidays. I heated to 250degrees and they were perfect; not too soft but nice and chewy without being tacky and sticking to the teeth. I didn't have a high quality extract(used McCormick's) and had it in the cupboard for a couple of years so I had to use about 2 1/2 tsp of extract so adjust accordingly. Lined the pan w/parchment paper. The only thing I would do differently next time is use a 9x13 pan as I had to do more cutting of them to get them the desired size. I didn't refrigerate; just let them sit at room temp for a few hours. They are much easier to cut than when they are hard from the fridge. thanks for this wonderful recipe that is a great addition to my holiday trays.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-28T07:56:27.41Z",
                "reviewBody": "I have never made candy or caramels so I was nervous to make these but they turned out so well!!! I can't believe how much they charge for each one of these in the stores when you can make a whole pan this easy!! I don't even like black licorice normally but my mom made these first and made me try them. I was in love! The 1 tsp extract is mild enough that even if you don't prefer black licorice you will probably like these. If you want the flavor stronger add more extract. The last time that I made them I made it with 1 Tbs and I thought it was perfect! One of my co-workers husbands loves black licorice so I made him some and my co-worker said he liked them so much he all but wanted to propose to me!!! LOL- he is old enough to be my dad. I have never met someone who has tried these that does not like these. Just watch the thermometer closely- it is critical you take it off the heat exactly when it says to. THANK YOU FOR A GREAT RECIPE!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chelsea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1771993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-29T19:46:25.977Z",
                "reviewBody": "As noted in the recipe I didn't stir the ingredients and they burned (at a low temp). This was and expensive lesson. The second time I stirred the entire time and the result was wonderful caramels; though I would recommend using more anise extract than 1 tsp. as the flavor is very mild.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandi Ingram Harris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4134064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-31T00:39:42.94Z",
                "reviewBody": "Pretty good licorice - says the woman who doesn't like licorice. So it must be good. Made my batch exactly as the recipe states however I would not recommend pouring into baking dish lined with buttered foil. Not unless you enjoy picking bits of foil out of your candy. Otherwise this was great... I mean really good. DH loves it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1471040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-25T21:17:54.64Z",
                "reviewBody": "I tried this for the first time after reading quite a few reviews. Here is what I did and some suggestions. I did not use foil, I sprayed the pan with \"Pam\" butter spray. When it was cool I just flipped it over onto a cutting board and it came out in one piece. I used a pizza cutter with \"Pam\" butter version on it in order to cut it. I first tried the teaspoon and thought it did not have enough licorice taste so I used a Tablespoon on the next batch. That was much better, but even though I used Watkins brand anise extract, I am going to do another batch using Anise oil, hoping that will have the \"staying power\" I am looking for. What I find with the extract is that the first few moments in your mouth it is exactly as I remember \"Callard and Bowser\", but then loses some of the flavor and tastes like a caramel. I highly recommend this recipe to anyone who was a fan of the old licorice from C&B. It is very easy. I never use a thermometer, I get it to a boiling stage then set a timer for 6 minutes, and I stir constantly. After 6 minutes of boiling I take it off the heat and add the anise and coloring. Hope this helps!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1603046/"
                }
            }
        ]
    }
]