[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/758/desserts/candy/nut-candy/",
                    "name": "Nut Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24955/aunt-bills-brown-candy/",
        "name": "Aunt Bill's Brown Candy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F27062.jpg",
            "width": 2848,
            "height": 2136
        },
        "datePublished": "2020-06-19T03:05:48.000Z",
        "description": "Very rich candy, but it's a great keeper.  Can be a family candy-making event!  You many need a helper to take turns with beating.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "5 pounds",
        "recipeIngredient": [
            "6 cups white sugar, divided",
            "2 cups heavy cream",
            "½ teaspoon baking soda",
            "½ cup butter",
            "1 teaspoon vanilla extract",
            "2 pounds pecan halves or pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Butter a 9x13 inch dish and a medium, heavy saucepan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the buttered saucepan, combine 4 cups sugar and the cream.  Have ready.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large heavy skillet over medium heat, pour the remaining 2 cups sugar.  Cook, stirring constantly, until sugar begins to melt.  Place the saucepan over low heat, stirring occasionally.  Continue to cook and stir the sugar in the skillet until it is completely melted and light brown.  Pour the melted sugar very slowly, in a thin stream, into the lightly simmering cream, stirring constantly (This step may take five minutes, and works best if someone strong pours the melted sugar v-e-r-y s-l-o-w-l-y.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat now, without stirring, to 242 to 248 degrees F (116 to 120 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball.  Remove from heat and stir in baking soda (mixture will foam).  Drop the butter into the foaming mixture and let rest without stirring 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the vanilla with a wooden spoon and continue to stir vigorously until mixture loses its gloss, 10 to 15 minutes.  Then fold in pecans and quickly turn candy into the prepared 9x13 inch dish.  Let cool until just warm and cut in 1 inch pieces.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Nut Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen Rodgers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.764705882352941,
            "ratingCount": 34,
            "itemReviewed": "Aunt Bill's Brown Candy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "114.4 calories",
            "carbohydrateContent": "11.4 g",
            "cholesterolContent": "7.7 mg",
            "fatContent": "7.9 g",
            "fiberContent": "0.7 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "12.5 mg",
            "sugarContent": "10.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-05-31T02:35:21.653Z",
                "reviewBody": "This candy recipe was first published in December 1936 in The Daily Oklahoman in Aunt Susan's food column. My grandmother made it for my father when he was a boy and it is still his favorite candy to this day. It is a favorite candy of most members of my family in-laws included! No it's not caramel. The best way I can describe it is to call it caramel fudge but then there is bound to be somebody who thinks it should be chocolaty too if I say 'fudge'. I make very good fudge and the year I included this with my fudge NOBODY ate the regular fudge and my my brother in law BEGGED me to make him some more Aunt Bill's just for him! Does anybody know an easier way to beat the sheen out of it? It kills my elbow and I don't have a heavy duty mixer. Is there a mixer heavy duty enough to do this?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "erin mitchell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2257940/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T21:00:33.06Z",
                "reviewBody": "My mom gave me this recipe last Christmas. I made two batches of the stuff. It's well worth the effort. I honestly thought Aunt Bill was a relative somewhere down the road. I assumed that was how my mom got the recipe. She said this was a favorite candy of hers many years ago. I highly recommend this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHEILAMP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/239952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T18:12:42.517Z",
                "reviewBody": "One of my all-time favorite Christmas candies. Granny would include these in her gift boxes (read: former bluebonnet fruitcake tins) to all of the grandkids. The Aunt Bill's were always the first to go. So good. Karen thank you for sharing this. I make it every year now and the reviews are always fantastic. To those that say \"it's caramel\": caramel wishes it was this good. I use two cast iron pans one a skillet and the other a dutch oven (no legs) to prepare this wonderful candy. Jack",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chef_jack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2427186/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T18:12:42.61Z",
                "reviewBody": "As other people have stated I always thought that \"Aunt Bill\" was a relative that my Grandmother got this recipe from!! My family has discovered the trick to beating the mixture for the 15 minutes to get the sheen out... use an Electric Power Drill!! Yes your husband's drill. Insert your wooden spoon into the end of the drill and have it do the work for you! Trust me I've even heard this same trick from a friends grandmother and she does the same thing and has been for almost 2 decades. Favorite Candy of All Time!! P.S. It freezes REALLY well and lasts for months that way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Clinton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4194377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T06:11:52.86Z",
                "reviewBody": "This is an old family favorite. It is rich but less rich than fudge. It makes a nice complement to all the fudge that gets handed during the holidays. I am curious to hear who was Aunt Bill?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCOTTROTTEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-04T04:06:25.127Z",
                "reviewBody": "I have had this same recipe for years and everyone loves it. To the person who prefers \"caramel \" it does taste similar but it does not have the consistency of caramel and is much richer and tastier if made correctly. It is a \"two-person\" candy with the \"pourer\" being the stronger of the two. It is well worth the effort. You should try it at least once! You'll love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LovesToCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2191219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T23:37:23.413Z",
                "reviewBody": "We have been making this candy for years and I have yet to meet a single person that didn't simply love it. I am asked every year to make it from Thanksgiving through New Years and beyond. BEST HOMEMADE CANDY EVER!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4233777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-21T20:39:57.683Z",
                "reviewBody": "I've made this batch in double with success. The trick is to not get in a hurry and have help in the kitchen. I use stainless cookware and utensils I tend to break wooden spoons too easily. Use a large sauce pan when you add the soda the volume of the candy will easily double. I also put a cookie sheet on top of the stove to move the sauce pan to. This way if Mt. Vesuvius becomes a reenactment on my stove the clean up is simple. Use unsalted butter. Tag team stirring.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PARROTT_HEAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/226205/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T00:09:07.223Z",
                "reviewBody": "Now that I have wiped the tears away from laughing I can type. You see I thought this was an old \"secret\" family recipe. One that my mother gave to me before she died. I nearly died when I saw that my family's \"secret recipe\" is all over the world!!! This candy is beyond compare. I love it so much. I found a company in Austin Texas called \" Lammes Candies \" that makes this candy (or close). It too is divine and will suffice as a substitute if you can't make your own. When I get to heaven I am going to have to remember to tell my mama about this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6791329/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-20T09:57:02.427Z",
                "reviewBody": "Waste of time. The recipe came out as inteneded no problems there but what your essential making is caramels. And the caramel isn't very good. I've made much better and easier ones from this site by using recipes that say \"caramels\". The flavor of these is very amatuer. No one liked them. I though I was making some other type of candy. If I wanted caramels I would use the recipe on this site \"Caramels\" submitted by Barbara.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DawnsDone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1513790/"
                }
            }
        ]
    }
]