[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24956/caramels-i/",
        "name": "Caramels I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1004580.jpg",
            "width": 2409,
            "height": 2432
        },
        "datePublished": "2020-06-19T03:05:48.000Z",
        "description": "I got this from a co-worker about 12 years ago.  These are the best melt in your mouth caramels I have ever had, and I always have to make them for Christmas.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 9x13 inch dish",
        "recipeIngredient": [
            "2 cups white sugar",
            "1 ½ cups corn syrup",
            "2 cups heavy cream",
            "1 cup butter",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Butter a 9x13 inch dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a heavy saucepan, combine sugar, corn syrup, 1 cup cream and butter.  Bring to a boil, stirring often, then stir in remaining 1 cup cream.  Heat, without stirring, to 242 degrees F (116 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball.  Remove from heat, stir in vanilla, and pour into prepared dish.  Refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When cool, return candies to room temperature then cut into 1 inch squares and wrap in waxed paper.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JUDI K."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.609195402298851,
            "ratingCount": 174,
            "itemReviewed": "Caramels I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "53.2 calories",
            "carbohydrateContent": "6.8 g",
            "cholesterolContent": "9.7 mg",
            "fatContent": "3.1 g",
            "fiberContent": null,
            "proteinContent": "0.1 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "15.3 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-10T17:34:27.717Z",
                "reviewBody": "I have made this recipe several times and it always comes out perfect.  I too cut the butter in half and I also changed the sugar to 1 c sugar and 1 c brown sugar.  I've made it with 2 c brown sugar too.  My family loves the richer taste that the brown sugar gives the caramels.  This is a very easy and fail proof recipe as long as you keep the heat on medium to low",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1506155/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-02T04:35:37.163Z",
                "reviewBody": "I've made caramels from a few different recipes, and this one is my favorite. I do, however, tweak it quite a bit. First, I only use 1 cup corn syrup. I boil the sugar and corn syrup to 350 degrees, then remove from heat and add butter (only about 1 stick, usually less) and 1 tsp. salt. Then I add the cream to the mixture, but I heat it first. Add the hot cream in a slow stream while stirring constantly, then return to the heat and boil to 250 degrees. Comes out perfect every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "campagnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-19T23:23:07.087Z",
                "reviewBody": "I really enoyed this recipe \"as is\". I read several reviews were people had problems with the consistancy of the caramel.  245 t0 250 degrees is the standard for firm ball stage at sea level. If you are above sea level then you should use your thermometer to see at what temperature water boils at your altitude. You then subtract that temperature from the standard of 212 degrees that water boils at sea level. Using that differential, subtract it from the standard 245-250 firm ball stage and that will give you a more accurate temperature of what the firm ball stage is at your altitude. EXAMPLE: I live at 4700 ft. water boils here at 203 degrees. For firm ball at my altitude I shoot for 236 to 241 degrees. Also, you should shut the heat off a few degrees early as the temperature will continue to rise even after you remove it from the heat. I hope that this helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Brett Janicek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2077019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-22T19:58:58.833Z",
                "reviewBody": "My husband my coworkers and I really dig this recipe. The caramels are fresh buttery smooth and addictive. I changed one thing about the recipe however and added another step - first I cook it just a little longer to 245 degrees as opposed to 245. Also I found that if I \"polish\" the cut caramels with corn starch that they aren't so greasy. I do this by coating each one in corn starch and letting them sit for 10-15 minutes and then wiping off the cornstarch with a cloth or paper towel. The starch absorbs the excess grease without changing the flavor or consistency. This also makes them less apt to stick to the wrapper or plate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIRIAM_THERESE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/384192/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-15T18:00:14.99Z",
                "reviewBody": "This recipe is very easy and results in creamy chewy caramels that won't pull your fillings out. If you don't get them firm enough or cooked to the right temp the first time don't be afraid to re-melt it down again and heat it up to the correct temp. These are also great with chopped pecans stirred in and look cute wrapped in wax paper wrappers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "S. Billings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2206519/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T01:03:53.75Z",
                "reviewBody": "Yummmm!!! I've made a couple batches so far and they keep dissapearing! I found that as long as it's heated to between 238 & 242 they come out so soft and chewy! For a carmel sauce stop it at about 220-225. I found that I wanted to add an extra dash of vanilla. I add marshmallows to one batch and made Carmarsh and oh was that wonderful... same with the Pecans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MILKEKAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/956281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-11-01T14:54:26.99Z",
                "reviewBody": "I've made this recipes soooo many times now it's hard to count and everyone loves them!!! Instead of a 9 x 13 inch pan I use an 11 x 13 cookie sheet and the size is perfect (plus you get a lot more)!!! A couple of things - I cook mine to 240 degrees and I make sure that I line my pan with foil first before pouring the caramel into the pan. Easy to remove and easy cleanup! Great recipe!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/412793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T21:41:19.27Z",
                "reviewBody": "I have now made these 3 times in a week. The first time I had to change pans 3 times - make sure you have a BIG pan or it will boil over!! Needless to say they came out a little on the soft side. I used that caramel as filling for my turtles - worked perfectly! The next 2 times I used a 5 quart kettle. The only problem I had was it seemed to take forever to get to 242. I just couldn't wait. Yummy - 5 Stars from me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BROSNANFAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-23T23:12:01.077Z",
                "reviewBody": "Well worth the time and effort my family LOVED these caramels. The first time they came out way too hard so I let them cool melted them down and brought them back to the right temperature. I added pecans and heating the mixture again didn't hurt the nuts. Remember to calibrate your thermometer in a pot of boiling water I live at a really high altitude and my thermometer was off by 12 entire degrees!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joesgirljeri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1219756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-19T15:03:03.157Z",
                "reviewBody": "It would be good to find out approximately how long this needs to boil until it reaches the proper temperature as mine took an incredibly long time. I also wish I'd read the one further review that said to cook in an extra large pan - I had to ladle out some of the mixture half way through the cooking time because it was boiling over. Also what temp are you supposed to boil at (without stirring) as my mixture burned on the bottom?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1074084/"
                }
            }
        ]
    }
]