[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25037/best-big-fat-chewy-chocolate-chip-cookie/",
        "name": "Best Big, Fat, Chewy Chocolate Chip Cookie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9088452.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:05:55.000Z",
        "description": "These cookies are the pinnacle of perfection! If you want a big, fat, chewy cookie like the kind you see at bakeries and specialty shops, then these are the cookies for you!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "1 1/2 dozen",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "½ teaspoon baking soda",
            "½ teaspoon salt",
            "¾ cup unsalted butter, melted",
            "1 cup packed brown sugar",
            "½ cup white sugar",
            "1 tablespoon vanilla extract",
            "1 egg",
            "1 egg yolk",
            "2 cups semisweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together the flour, baking soda and salt; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ELIZABETHBH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6295659295659295,
            "ratingCount": 12210,
            "itemReviewed": "Best Big, Fat, Chewy Chocolate Chip Cookie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "284.7 calories",
            "carbohydrateContent": "40.1 g",
            "cholesterolContent": "42 mg",
            "fatContent": "13.9 g",
            "fiberContent": "1.5 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "110.7 mg",
            "sugarContent": "27.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-10-17T13:22:40.577Z",
                "reviewBody": "We thought these were great. It's not the only chocolate chip cookie recipe I'll use, but when you want a \"big, fat, chewy cookie,\" this is awesome. For the cookies to stay chewy, they need to be left on the cookie sheet until cool. (Except, of course, for the few you just can't resist eating right out of the oven.) Also, the butter MUST be melted, and the flour should be all-purpose UNsifted. 10/17/04: I notice that some people have mentioned that this is a cakey cookie. I did not find that at all, and I HATE cakey cookies. My suggestions to avoid cakiness are: use real butter, be sure to melt the butter, don't overbeat your eggs, and do NOT skip the extra egg yolk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Evelyn in KC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/461834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-15T19:31:28.963Z",
                "reviewBody": "HELPFUL TIPS NOT MENTIONED: This is very forgiving! Just keep baking until it becomes golden brown around the edges. If they cool COMPLETELY & they're not done..put back in for another 5 min.  Can't go wrong! I promise they'll be super chewy although they must sit (set) for awhile as they won't appear it.  I've had to bake for 20 min. several times! Everything is dependent on if you put in fridge & for how long (i've left overnight or for DAYS). But if you don't refrigerate long enough or at all, they'll be flat! It has nothing to do with using margarine or butter. I've done it both ways ..same exact results! 1st: Sift the dry ingredients.  Melt the butter in microwave then mix in sugars. DO use the room temp. yoke of one egg & 1 other egg.  Dump rest of ingredients on top.  Mix by hand until blended.  Make sure butter isn't hot or it'll melt chocolate chips! Refrigerate batter for 1hr then preheat oven.  Drop 1/4C scoop (should make 16-18) & bake! If I use a med. scoop, I just bake 2 min less.  UPDATE: My husband thinks these are sweet so I only use 3/4C b.s. and a TAD under 1/2C of white sugar. 1C chocolate chips is PLENTY! Never grease pan! Melt in your mouth results if you use a combination of milk chocolate& semi-sweet like bakeries AND a touch of andes mint baking chips! Update2: Just tried \"Blonde Brownies I\" and it's IDENTICAL, but a yummy brownie! Try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T03:41:18.937Z",
                "reviewBody": "I have tried quite a few chocolate chip cookie recipes, and this is by far the BEST!  Don't be alarmed by the reviewers who say theirs turned out flat.  Because the butter is melted, you MUST refrigerate these before baking (long enough so they get hard, an hour or two, or speed up by putting in freezer).  Also, you will want to wait a bit to eat as they are a bit gooey at first. Take the cookies out of the oven when the edges are just turning brown, leave on cookie sheet for a few min, and then let rest a bit longer to ensure best results.  If you want these cookies to stay moist, put in sealed container after baking.  If you want them crunchy, leave them exposed to air.  Whatever you do - don't pass these up.  My friends wonder what amazing bakery I buy these at whenever I make them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GWENEC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/236811/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-16T20:46:59.373Z",
                "reviewBody": "Update: Learn from my mistake...Use MARGARINE rather than butter in this recipe if you want a thick cookie.\r\nWow! This cookie is absolutely heavenly! I've tried many of the other high rated chocolate chip cookies from this site, and this is by FAR the best one yet!  I won't look any where else for a chocolate chip cookie recipe.  The cookie comes out soft and think with literally layers of chocolate chips inside!  Like many other reviewers, I did not grease my pan and the cookies came off just fine once they were cool. Also, make sure your eggs are close to room temp rather than straight from the fridge. Fifteen minutes was the perfect time to bake these.  The edges are lightly browned, and the middle of the cookie may look slightly undone, but trust me, they are done perfectly at this time!  Lastly, definitely chill the dough for a while.  Forty-five minutes did the trick for my batch!  Thank you Elizabeth! Wonderful cookies!:-) Ally",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allyson Hester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T23:33:39.653Z",
                "reviewBody": "\r\nBest Big, Fat, Chewy Chocolate Chip Cookie\r\n\r\nMakes 36 - \"3 1/2 inch cookies\" \r\n\r\nIf you want a big, fat, chewy cookie like the kind you see at bakeries and specialty shops, then these are the cookies for you! \"A Winner At Our House, according to my 86 year old Cookie Monster Husband.\r\n\r\nI probably do everything wrong as I have Arthritis Hands, so had a problem stirring, so I use my hands. I also shape   the dough into Balls, with my hands, guessing at the size. The cookies baked down to 36 - 3 ½ inch, not too thick and absolutely not too thin wonderful cookies. Baked them on my “REMA” Air Insulated un-greased Cookie Sheets\r\n\r\nGranddaughter Sandie, and two Great Grandchildren coming to visit for two weeks. Will be busy so I wanted to get some goodies ready ahead of time. After they cooled I placed them into a box separated each layer with a sheet of parchment paper. Wrapped the whole box in Aluminum Foil, and placed into the freezer. Took one out the next day let it thaw our on a parchment paper. They were perfect, and I now will have 30 beautiful and delicious cookies ready for Sandie\"s family. Dewey gobbled up three before they hardly cooled, saved three for the next day, I pinched off a piece to taste test for quality as I do not eat sweets, these couldn't be better. Enjoy, Dewey & Me",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IAMJEWEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/887207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-09T11:11:17.31Z",
                "reviewBody": "W-O-W!!!! I'm speechless. Just when I was beginning to give up my faith in this website. I mean, come on...half the time the reviews are great and you make the dish and you're SOOOO disappointed. \r\n\r\nNOT WITH THIS RECIPE! These cookies are the hot-diggidy-dog of all chocolate chip cookies. They're better than bakery or coffee shop cookies (and better than refrigerated cookie dough too). We definitely need to double the recipe next time! \r\n\r\nI think what makes it stand out from other recipes is the extra egg yolk (without the white) and more brown sugar than white sigar. I think those two ingredients help with the cookies chewiness texture and make it not so cakey. \r\n\r\nFYI: Take them out of the oven after 13 minutes....otherwise they'll be too done, even though they may not look it. AND I recommend following another reviewers suggestion and DO NOT grease the cookie sheet, it makes them wierd around the edges. THANKS ELIZABETH!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookingForDummies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/40858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-11T01:01:36.98Z",
                "reviewBody": "This was the worst cookie recipe ever...They were so damn good i ate waaaayyy too many and got sick for 2 days...no joke. :) Great job. Anytime I make chocolate chip cookies again it will be these. They are a bit tricky in baking. A hint is to take them out before they \"feel or look\" done. Because once they cool they will be perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAUGHTERSOFDECEMBER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/739919/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-04T12:18:12.35Z",
                "reviewBody": "After sitting hours upon hours in front of a computer searching for that one chocolate chip cookie recipe that would be 'the one', I finally found it. This cookie is pefect in my opinion. They are huge, a little crunchy when you first bite into them but soooo wonderfully chewy in the middle. Breaking the cookie into, you see the many layers of chocolate chips. This makes a thick cookie, not a flat cookie, which, is one of the reasons I loved this recipe. Thank you for submitting your recipe. I don't have to look any further now!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISMULKEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T20:19:53.827Z",
                "reviewBody": "These cookies are wonderful!  They look just like they came from one of the cookie shops at the mall.  I am impressed.  I added a cup of chopped walnuts because I like nutty cookies.  If you let the eggs warm to room temperature, I think it helps to keep the cookies from flattening out too much.  Also, with these, the consistency is the best if you remove them from the oven when only the edges look baked and the top is still a bit soft.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLEMENTINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/556851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-30T07:39:52.983Z",
                "reviewBody": "these cookies were dry when cooked all the way through and too big.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "SILKYLIYNX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/682700/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Best Big, Fat, Chewy Chocolate Chip Cookie",
            "description": "See how to make chewy, bakery-style cookies.",
            "uploadDate": "2012-04-04T01:22:30.810Z",
            "duration": "PT3M37.968S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F4b1190e1-ec8a-4b35-a0a6-b7090d9623f8%2F7199221f-9db3-4c5d-8ca9-21bc88378426%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1545850871001"
        }
    }
]