[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/859/desserts/cookies/sugar-cookies/",
                    "name": "Sugar Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25065/delilahs-frosted-cut-out-sugar-cookies/",
        "name": "Delilah's Frosted Cut-Out Sugar Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4115144.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-06-19T03:05:57.000Z",
        "description": "My Family just loves this sugar cookie recipe. The hardened frosting adds a special touch!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H8M",
        "totalTime": "P0DT0H18M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "¾ cup butter flavored shortening",
            "1 cup white sugar",
            "2 eggs",
            "1 tablespoon milk",
            "1 teaspoon vanilla extract",
            "2 ½ cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 teaspoon salt",
            "1 tablespoon butter",
            "1 teaspoon vanilla extract",
            "2 ½ cups confectioners' sugar",
            "3 tablespoons milk",
            "2 drops any color food coloring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the shortening and white sugar until smooth. Beat in the eggs one at a time, then stir in the milk and 1 teaspoon vanilla. Combine the flour, baking powder, and salt; stir into the creamed mixture. Cover dough, and chill for at least one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Lightly grease cookie sheets, or line with parchment paper. On a lightly floured surface, roll out the dough to 1/4 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 6 to 8 minutes in the preheated oven. Remove cookies from baking sheets to cool on wire racks. Cool completely before frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, beat the butter, 1 teaspoon vanilla and confectioners' sugar until smooth. Mix in the milk one tablespoon at a time until a good spreading consistency is reached. Stir in food coloring to desired shade. Decorate cooled cookies, and set on waxed paper to harden.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sugar Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Delilah Lopez"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.499047619047619,
            "ratingCount": 525,
            "itemReviewed": "Delilah's Frosted Cut-Out Sugar Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "133.4 calories",
            "carbohydrateContent": "20.6 g",
            "cholesterolContent": "11.3 mg",
            "fatContent": "5.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "1.3 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "81.7 mg",
            "sugarContent": "13.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-23T14:15:45.327Z",
                "reviewBody": "Yum!  These cookies a fabulous.  Not only is the dough wonderful to work with, the frosting really does dry hard so you can plate them in layers and they do NOT stick together because of the frosting!  I am very pleased with these.  I just made footballs with brown frosting and white laces for Superbowl Sunday!  When you bite into these, the outside is crisp and they are extremely soft and almost cakelike on the inside.  Really, really great recipe!  I did add a little imitation butter flavor and a bit more milk to the frosting to get it to the consistency I wanted.  Glad I found this one!  It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debra Hunter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/502297/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T22:21:36.02Z",
                "reviewBody": "FANTASTIC recipe! Yes, the dough is somewhat delicate to work with but I had no problems, and I only refrigerated the dough for an hour. Use plenty of flour on your board, and you can softly brush off the excess with a basting brush. Just flatten the dough with your hands a little, and gently roll over it a few times. (Make sure you don't roll too thin) Something I feel makes these cookies so good is the butter flavored SHORTENING. Those who use real butter are not going to get the same results in texture, and it's not really fair to judge a recipe poorly if you change a main ingredient. Butter and shortening don't bake the same. These cookies baked wonderfully, tasted terrific and were easy to make. The texture is perfect, not too soft yet not crunchy. The frosting is delicious as well. Another tip- Use parchment paper and your cookies won't burn on the bottom (or brown much at all for that matter). I never make cookies with it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Texas Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484791/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-23T03:01:45.673Z",
                "reviewBody": "I really liked this recipe.  The only thing though, is I put mine in the freezer for 3 hours and it STILL wasn't firm enough to work with.  Once it was, I pulled off a small hunk and rolled out 1 dozen, while keeping the rest in the freezer. Make sure your surface is well floured, as well as the butterknife or whatever you use to scrape it up to put it on the cookie sheet.  The cookies held their shape well and taste good, nice and soft.  Oh also don't chill your dough in the mixing bowl, scoop it out onto a sheet of plastic wrap and press into a disc shape, so it chills evenly and is easy to roll.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SILVERISNOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-14T18:10:55.327Z",
                "reviewBody": "These are without a doubt the best sugar cookies I have ever had. The same recipe my Grandma made and the ones that I have made for 20 years now. Crispy on outside cakey inside. I leave out the milk and use 1/2 butter instead of all shortening. I also use a butter frosting (powdered sugar milk vanilla and butter). Outstanding!!! People always want the recipe. Also I would suggest chilling AT LEAST 2 hours - much easier to work with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PYTNPLACE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/484714/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T16:18:43.543Z",
                "reviewBody": "I thought the dough was too sticky; I had to keep adding flour.  That made the cookies taste a bit floury, but it wasn't horrible.  I found a better recipe that I could do with kids (less sticky and great texture): Soft Christmas Cookies by Georgie Bowers.  I also liked the Sugar Cookie Icing by Janice Brubaker.  I probably won't make this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Audrey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/940198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-01T19:06:51.39Z",
                "reviewBody": "The cookies were OK but I will keep looking for my favorite sugar cookie recipe. There is too much baking powder in the recipe - the cookies rise \"too much\" and detail in the cookie is lost when baked. Also too much baking powder taste. I also found the dough very soft from the refrigerator (although chilled overnight) so difficult to remove from pastry cloth without using a lot of flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DONNAJBF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/814504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-01T15:15:07.45Z",
                "reviewBody": "This was a great sugar cookie! The dough was very easy to work with. I only refrigerated it for about 15 minutes and it worked just fine. I added a little lemon flavor to the icing and a touch more milk so I could dip the cookies rather than spread the icing on and it was perfect. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MYLESARA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-20T06:57:47.03Z",
                "reviewBody": "I didn't get a chance to frost these cookies they were eaten so quickly. I quickly scanned the recipe and used regular crisco instead of butter flavored and they were still excellent. I'm making them again today and will be using the butter flavored this time. I also didn't roll them I chilled them in the freezer for about 20 minutes dropped them onto a cookie sheet and flattened them with my hand a little. I seriously don't think anyone could make a bad cookie with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMI CHRONOWSKI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-12T11:16:19.997Z",
                "reviewBody": "This is so awesome!!! I have 4 children from the ages of 5yrs. to 11 yrs and they loved every minute making these. I've searched for the perfect sugar cookie to decorate and I finally found it along with the most perfect icing. The cookies were soft in the middle and very delicious. Thank you so much Delilah for sharing your recipe. I will past this down to my children for their children some day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANDREALYNNTANNER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/616054/"
                }
            }
        ]
    }
]