[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
                    "name": "Lemon Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25091/lemon-square-bars/",
        "name": "Lemon Square Bars",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4520753.jpg",
            "width": 1500,
            "height": 998
        },
        "datePublished": "2000-08-14T22:14:05.000Z",
        "description": "Check out this recipe! It may be the one you are looking for.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "2 cups sifted all-purpose flour",
            "1 cup confectioners' sugar",
            "1 cup butter, melted",
            "4  large eggs eggs",
            "2 cups white sugar",
            "1 teaspoon baking powder",
            "¼ cup all-purpose flour",
            "⅝ cup lemon juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together 2 cups flour and confectioners' sugar. Blend in the melted butter. Press into the bottom of the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 15 minutes, or until golden.  In a large bowl, beat eggs until light. Combine the sugar, baking powder and 1/4 cup of flour so there will be no flour lumps. Stir the sugar mixture into the eggs. Finally, stir in the lemon juice. Pour over the prepared crust and return to the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for an additional 30 minutes or until bars are set. Allow to cool completely before cutting into bars.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Lemon Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "RCOMP"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.425155004428698,
            "ratingCount": 1129,
            "itemReviewed": "Lemon Square Bars",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "208 calories",
            "carbohydrateContent": "31.2 g",
            "cholesterolContent": "51.3 mg",
            "fatContent": "8.6 g",
            "fiberContent": "0.3 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "81.5 mg",
            "sugarContent": "21.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-16T00:12:18.03Z",
                "reviewBody": "Have made this recipe many times -- the following changes make these bars a \"5\":\nAdd 1 teaspoon grated lemon zest to crust.  \nReduce butter by 2 tablespoons.  \nBake until filling is set - may need to add 2-3 minutes depending on your oven and baking pan (I also bake crust an extra 2 minutes).  \nDust with sugar to disguise browning.  \nLoosen edges of bars with a sharp knife while still warm.  \nChill or partially freeze bars to facilitate cutting.  \n-------------------------------------------------------------------------------------------------------\nFor the reviewer wondering how to measure the juice: 1/2 cup + 2 tablespoons = 5/8 cup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeannette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1455306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-16T05:06:05.657Z",
                "reviewBody": "After reading all the reviews and modifications, I was so confused as to what to do! I gave up and made it as is.... it was wonderful. Sweet and tangy, the crust was golden and crispy, they were excellent. So, do yourself a favor and DON'T read all the reviews and make a bunch of changes. This is a great, easy recipe I'll be making over and over again, because they're addictively yummy! One tip: when spreading the crust, put it in the pan in a lump and use a sheet of plastic wrap and your hands to smooth it out. It's really fast, doesn't stick and there's no mess.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1515597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-17T03:38:52.717Z",
                "reviewBody": "After reading the reviews, I made this recipe as follows: Crust is 3/4 cup powdered sugar, 3/4 cup softened butter, 1/4 tsp. salt, 2 cups flour.  Mix that stuff and press into pan.  I was worried that pressing the mixture into the pan would make them difficult to get out, but they came out just fine.  Anyway, bake at 315F (yes, 315) for 15-18 minutes.  They will be maybe the slightest bit golden in color.  You do NOT want the crust to be browned all over or it will be much too crunchy.  Now the filling: 4 eggs, 1 1/4 cups white sugar, 1 tsp. baking powder, 1/4 cup flour, 2 Tbsps. lemon zest (basically all the zest from the lemons you use), and 3/4 to 1 cup of fresh lemon juice.  1 cup of juice took me 5 lemons.  This mixture will be pretty runny.  Pour over baked crust and put this in the oven at 350F.  Be sure to increase your oven temperature now.  Bake for 20 min.  Let these cool completely.  This is crucial.  Then sprinkle powdered sugar on top and store covered on the kitchen counter.  I'm so glad I read everyone's reviews and was able to utilize their suggestions.  That's what allrecipes is about.  Sharing recipes and improving them.  I will totally make these again.  By the way, I used other people's changes because so many people complained that the crust was too oily.  Trust me, with my revisions the crust was like a wonderful sugar cookie or shortbread and was plenty sweet and buttery with the 3/4 cup powdered sugar in the crust batter.  A really great recipe! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paige",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1913173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-11T18:33:41.62Z",
                "reviewBody": "There are some flaws with this recipes. This first is that the butter should NOT be melted in the crust- hence all the complaint about hard crusts. You want the butter cold and work it into the dry ingredients w/a pastry blender until the mixture resembles cornmeal. In the end, the crust should resemble shortbread. I like to add lemon zest to my crust for extra flavor. The second is, the filling needs to be doubled for a 9x13 or you will have more crust than lemon layer. Also, make sure you line the pan with parchment paper or foil if nothing else. It will allow you to lift the whole thing out and cut it.I have to admit I'm a lemon bar snob and have gone toe to toe with friend in lemon bar cook-offs. This is a good basic recipe. Don't be afraid to play around with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawn Aiono",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1329873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-12T15:09:10.827Z",
                "reviewBody": "OH MY GODD!!!   I made these this weekend and took some (not all) to my friends home.  They are amazing.  Very lemony without the extract and the zest.  I will be making these on a regular basis.  That is if my hips can stand it.\r\n\r\nVERY easy to make.  One suggestion... Line the pan with enough parchment to surround the bars.  Once cooled you can lift the bars out with no breakage.  You can pull the parchment away easily.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DRSCRIVENTHOMAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-09T17:46:59.857Z",
                "reviewBody": "These were good but a little different than lemon bars that I am used to.  I followed the recipe exactly!  Why do people give a recipe 5 stars when they add and and subtract different ingredients?  Almost every reviewer added more lemon juice, thus giving it 5 stars.  I don't know... that just bothers me, I guess.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MARMARL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1110187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-09T19:15:38.327Z",
                "reviewBody": "I wanted to use these for a bridal shower so after an intitial trial batch I made some minor changes. I increased the entire recipe by 25% to make a thicker bar. Decreased the butter in the crust by 2T. Lined my pan with Reynolds Release foil and then sprayed with Pam. I very firmly pressed the crust into the pan and baked at 315 degrees for 15 minutes-PERFECT! For the filling I added 1T flour to thicken up the sticky filling a bit (I was serving this as a finger food!). I used Minute Maid real frozen lemon juice and decreased the amount just slightly to counteract a slightly bitter aftertaste in the first batch. Then baked at 300 degrees for about 30-35 minutes until set-PERFECT. Everything was perfectly done not too brown. Bars cut up very easily didn't stick to anything with the foil. Dusted with powdered sugar and put the squares on a nice serving platter. A real hit! Great easy recipe with basic ingredients! Thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CBM6396873280",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cbm432875436896422455544334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-18T15:57:52.493Z",
                "reviewBody": "Man, oh man, oh man are these GOOD!  I was nervous to use melted butter in the crust, something I don't ever recall doing.  But it worked - ohhh, did it work!  This is no soggy, wimpy crust!  As I always do when I make any lemon bar recipe, I made 1-1/2 times the filling, keeping the crust measurements the same. I used a combination of lemon and lime juice (1 cup for a 1-1/2 filling recipe) and 1 T. of mixed lemon and lime zests.  The crust was firm but tender, the filling tart, sweet and substantial.  They don't cut as neatly because of the extra filling... but who cares?  These are lemon heaven!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-17T16:37:06.157Z",
                "reviewBody": "These were really good...exactly like the ones at the coffee shop near my house. They charge 2.50 a square...wonder where they got the recipe??? Update: I tried baking the crust at 315 as someone else suggested. I did not work out for me at all....The crust was mushy and greasy from the butter. Also I substituted lime juice for lemon juice just to see what the filling would taste like. The difference was negligible and the lime juice made the filling sorta brown and still tasted more like lemons than limes. I'm going to stick with baking the crust @ 350 for 17 mins and using fresh lemon juice. Oh and I also line the pan with parchment paper....very important step as they come out of the pan way more easily. UPDATE # 2. FINALLY figured out how to get great crust. I used my Cuisinart to blend the ingredients and added the butter partially frozen. Pulsed it until it was lightly crumbled. Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pinkypink",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2214218/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Lemon Square Bars",
            "description": "These traditional lemon bars have a lovely buttery crust and sweet-tart filling",
            "uploadDate": "2012-11-06T21:28:34.999Z",
            "duration": "PT4M5.078S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc8b077d2-dc69-4aa8-aeab-6f60cf6866d8%2Fc798cfc6-edb1-45f5-93d8-5f7c110a9bff%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1951385944001"
        }
    }
]