[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14691/desserts/cookies/thumbprint-cookies/",
                    "name": "Thumbprint Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25100/jam-filled-butter-cookies/",
        "name": "Jam Filled Butter Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F403167.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2020-06-19T03:06:00.000Z",
        "description": "This cookie recipe has been in my mother's family for more years than I've been alive. It's my favorite cookie; my comfort food!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "¾ cup butter, softened",
            "½ cup white sugar",
            "2 egg yolks",
            "1 ¾ cups all-purpose flour",
            "½ cup fruit preserves, any flavor"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the butter, white sugar and egg yolks. Mix in flour a little bit at a time until a soft dough forms. Roll dough into 1 inch balls. If dough is too soft, refrigerate for 15 to 20 minutes. Place balls 2 inches apart onto ungreased cookie sheets. Use your finger or an instrument of similar size to make a well in the center of each cookie. Fill the hole with 1/2 teaspoon of preserves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven, until golden brown on the bottom. Remove from cookie sheets to cool on wire racks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Thumbprint Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MKHG"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.62402496099844,
            "ratingCount": 1282,
            "itemReviewed": "Jam Filled Butter Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "82 calories",
            "carbohydrateContent": "10.5 g",
            "cholesterolContent": "21.5 mg",
            "fatContent": "4.1 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "29.2 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-14T22:29:54.087Z",
                "reviewBody": "I'd like to give this recipe 4 1/2 stars, since the only thing that keeps it from the 5 stars is that the actual cookie (excluding the jam) has a very bland taste, so I added 1/4 teaspoon of salt and 2 teaspoons of vanilla extract, made the cookies really great! I baked a batch yesterday, and it didn't last a day, so I baked another today. Also I used 1 whole egg instead of two yolks and used strawberry jam. Delicious, thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Maria Isa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2529906/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-24T22:00:35.217Z",
                "reviewBody": "Incredible!! here is a trick for getting the jam in the hole quickly and easily. Take sandwich bag and spoon the jam into the bottom of the bag. Massage slightly to get lumps out. Make a small snip in the bottom of the bag so you can squeeze out the jam into the holes in the dough. I used seedless blackberry jam..great choice!! I topped baked cookies with a coat of sifted powdered sugar. I'm going to always double this recipe. They are gone before they're cooled!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANINE PERKINS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/671975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-11T18:12:18.857Z",
                "reviewBody": "This is an excellent recipe. After my cookies were done, (while still warm) I dipped them in powdered sugar for a different look and taste. They are VERY yummy this way! I uploaded a photo of them for those who would like to see what they look like this way. The powdered sugar melts into the jam, so it looks like there is powdered sugar only on the cookie part. Otherwise, I followed it by the recipe. Make sure not to overfill them with jam (this is what I did the first time,... and they overflowed onto the cookie sheet).Make the hole deep enough to actually hold some jam. GREAT RECIPE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Stoicescu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1662296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-15T03:02:51.353Z",
                "reviewBody": "I absolutely love this recipe and I think it's a shame that it gets so many low ratings. It looks like a lot of bakers are making simple mistakes that ruin what should be a wonderful cookie. \n\nBLAND COOKIES - You may have used the wrong butter. I know the recipe just says \"butter\", but unless a recipe specifies unsalted, assume it means salted. Beyond that, you need to understand that this is a butter cookie. It's not meant to be very overly sweet. For the best tasting cookie, use high quality butter and jam. The quality of your butter can make a big difference. \n\nFLAT COOKIES - Your dough is too warm. Chill for half an hour to an hour before baking. The other possibility here is that you've used margarine. Margarine is not butter. \n\nDRY CRUMBLY COOKIE - You've probably overworked the dough. This can happen if your butter is too cold when you begin. \n\nBROKEN COOKIES, LEAKING JAM - You're making the wells too deep or overfilling them. Try using the back of a half teaspoon to make the indentations and fill with a bit less jam.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "McKenzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/980231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T20:58:24.59Z",
                "reviewBody": "I am so glad to be the first to rate this recipe; I almost didn't try it because it wasn't rated yet and I needed a quick fool-proof recipe. It was both and I hope your ratings and reviews reflect it soon. This was super easy and fun for me and my seven year old to make together; of course she loved the thumbprints and filling them! The cookies do not taste like quick and easy ones though...they are soft and yummy. I hope to pass this down as a traditional cookie in my family. It did take the full 10 minutes to bake; 8 wasn't long enough and they do not look done even then because they are a very light color...only the bottoms brown well. We used peach preserves...you could use any kind! Thank you for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARKNCHARLENE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/438999/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-18T15:56:01.06Z",
                "reviewBody": "These are such cute cookies!  They are very easy to make, and taste yummy.  I made a little indent in the cookies using the handle of a wooden spoon, and I just pressed it gently without making  a deep hole, and the jam sat in the hole perfectly.  I did notice that the jelly I used became really liquidy and runny, because they are made with juice instead of fruit, so next time I will use actual fruit jam.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKERYBUFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/643070/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-09T22:44:29.94Z",
                "reviewBody": "AWESOME! I had enough mix to make about 26 cookies. I found that 1/2 tsp of jam was a bit too much as it overflowed over the cookie once baked. Also keep a close eye on the cookies while in the oven they cook quickly and while the tops still look uncooked the bottoms may be black:) They harden once they sit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ASHLEYBEGOOD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1239205/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-23T12:02:04.7Z",
                "reviewBody": "These were wonderful and very tastey!  They were so pretty with a dusting of powdered sugar.  I only got 20 cookies out of my batch though, maybe they were a tad bit big but they looked just right.  I also only ended up using 1/4 cup of jam since that's all that was needed.  I plan to make some more today!  \r\n\r\nTo add the jam into the centers you chould put it into a zip lock baggie and cut the tip off of the corner of the bag.  This makes the jam dispersion nice and neat.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michigan Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/818228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-10T03:28:52.377Z",
                "reviewBody": "I can't believe how easy this recipe was. I followed it to a T and didn't change a thing. Some others explained that you'll need less flour. I did not. Nor was it crumbly when I rolled it into balls. It was a perfect texture. If I were to make a guess I'd say they didn't let their butter sit out before they used it. I let mine out for about an hour before I made the cookie dough. Then I mixed it very well with the sugar. They will be a must on my list for Christmas cookies from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Francine L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183182/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-23T12:45:16.903Z",
                "reviewBody": "These were passable. Nothing fancy. The cookie was too soft when cooked. The dough lacked flavour. Vanilla extract or something similar wouldn't go astray.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "AUSSIEMUM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1414774/"
                }
            }
        ]
    }
]