[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25110/the-perfect-chocolate-chip-cookie/",
        "name": "The Perfect Chocolate Chip Cookie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6711176.jpg",
            "width": 1200,
            "height": 1800
        },
        "datePublished": "2020-06-19T03:06:01.000Z",
        "description": "These are the prefect chocolate chip cookies! Made with vegetable oil instead of butter and they contain both almond and vanilla extracts!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "2 ½ cups all-purpose flour",
            "1 teaspoon baking soda",
            "½ teaspoon salt",
            "1 cup vegetable oil",
            "1 cup packed brown sugar",
            "½ cup white sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "1 teaspoon almond extract",
            "1 cup semisweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Stir together the flour, baking soda and salt; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In  a large bowl, cream together the vegetable oil, brown sugar and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla and almond extracts. Blend in the dry ingredients, then fold in the chocolate chips. Drop by rounded spoonfuls onto ungreased cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Emily"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.232283464566929,
            "ratingCount": 254,
            "itemReviewed": "The Perfect Chocolate Chip Cookie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "219.2 calories",
            "carbohydrateContent": "27.6 g",
            "cholesterolContent": "15.5 mg",
            "fatContent": "11.7 g",
            "fiberContent": "0.8 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "110.3 mg",
            "sugarContent": "17 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-22T18:07:09.23Z",
                "reviewBody": "Normally I try to make a recipe three times before rating it. I've baked five batches of these excellent cookies. Because they're made with oil rather than shortening, butter or margarine the texture is different but every bit as good. Cookies made with shortening, margaine or butter tend to have crispy or crumbly edges, but when baked properly, these crisp up nicely on the edges also. For those with cholesterol, saturated fat or trnas-fats issues, this recipe is a great find. You are giving up nothing with these cookies. The flavor is excellent, and the texture very satisfying, and the batter freezes well.\r\nI would suggest making a batch but baking just one tray to see how they turn out in YOUR oven, because as we all know, the recipe numbers for temperature and length of baking time vary with our own particular oven. Mine was spot-on, but cookies baked on the lower rack burned a little while upper rack cookies were perfection. I add walnuts, but I assume you can add anything you want, craisins, raisins, coconut, any kind of nut. You can even leave out the chocolate. But who'd be crazy enough to do that?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PUPMAN2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1284053/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-22T19:20:10.077Z",
                "reviewBody": "Many thoughts about this recipe, which is pretty good.  Almost certainly the people who disliked these cookies used old, rancid oil to make it.  You must use reasonably fresh oil.  To improve the flavor, if you have it, you can use a few tablespoons of sesame, almond, walnut, coconut or other nut oils.  If you only shop at the grocery store, your best choices are probably corn or peanut oil, although any will work.  You could also add one or two Tbsps of melted butter to add a bit of butter flavor without all the saturated fat.  Moreover, the fat in this recipe can be reduced a bit without affecting the texture much.  Since this is basically a Toll House Cookie recipe that uses oil instead of butter, and butter is 20% water and milk solids by volume, you can reduce the amount of fat by 20%, replacing it with milk or water, and still get a good result.  So use 3/4 cup (12-13 Tbsps) of oil, and about 3-4 Tbsps liquid.  If you use the fat + water, make the recipe with bread flour, and mix the dough awhile after the flour is added (say a minute), you will have a chewy textured cookie.  Whole-wheat flour and some added spices (about 2 tsp mixed) makes a good spice cookie.  Adding 2 tsp corn syrup to the recipe (you can use pancake syrup) will help the cookies stay moist and soft.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chuck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2667183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-13T20:23:08.023Z",
                "reviewBody": "These cookies came out a lot better than some of the other recipes that I have tried. I like that it is made with oil instead of shortening (which many other recipes call for) because oil is something that is commonly used in my house. I wouldn't know what else to use the shortening for. The flavor for these cookies usually come out very well. I have occasionally had trouble with the chips falling out of the dough, but that happens very rarely. Either way, I've used this recipe at least 15 times now, and I am usually very satisfied with these. They're soft and chewy, and not dry at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMCONGEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1288831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T06:19:05.617Z",
                "reviewBody": "These were okay. They come out looking very nice but I too found the taste to be quite bland. They were very convenient however because of the oil instead of the butter. I probably won't be making these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/573765/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-04T18:08:39.81Z",
                "reviewBody": "These were great when they were warm from the oven but once they cooled my family and I were not as happy with them. There was something missing. Not a bad recipe but I will probably not make them again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGEL207",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17911/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-24T00:19:29.82Z",
                "reviewBody": "For a chocolate chip cookie made with vegetable oil this is pretty good. I made the recipe the first couple of times with just veggie oil (soybean). Then one time I did not have enough veggie oil so I supplemented with corn oil (about half and half). The cookies turned out even better with this mixture. The corn oil seemed to add an additional level of richness that the cookie didn't have previously. I highly recommend trying a combo of these two oils. I've thought about using all corn oil but I'm happy with how they are turning out now and don't want to risk it. I also bake on convection bake at 325 and for about 11 minutes. I'm sure the temp and cooking time will just vary from oven to oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BFLOCCO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1360922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-07T21:19:07.487Z",
                "reviewBody": "These cookies actually came out really good. I admit they probably aren't as good as cookies made with butter but I only had canola oil so I decided to make these. They came out crisp on the outside and soft on the inside. I also didn't have almond extract so just used vanilla. I will probably make them again using more vanilla extract and chocolate chips.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TeenageFoodie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2393682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-08T20:21:40.213Z",
                "reviewBody": "the best cookies in the whole world.  I made this cookie because I didn't have butter in the house.   It is now our standard cookie.   I keep these in the freezer for in 8 minutes cookies.  I spread the dough out on a wax paper coveredcookie sheet and then cut the dough into squares with a knife.  then I place the sheet in the freezer. In about 2 hours I pull the sheet out of the freezer wrap the dough in freezer paper or large zip lock. when you want a cookie, beak off a line of dough squares and prepare.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rochelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/167910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-19T07:03:39.233Z",
                "reviewBody": "I love this recipe. The batter is a little oily but i find it easer to put in the pan. Instead of making small cookies i use my glass casserole dish and spread the cookie dough evenly. They bake perfectly and end up being like a brownie cookie. Very delicious! I use a tad more brown sugar because I like my cookies with that extra hint of brown sugar and I use smart oil which is a mixture of vegetable oil and olive oil. I also cut out the almond extract. This is perhaps the easiest cookie I have ever made and delicious wither fresh from the oven or chilled in the fridge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Bullock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2532342/"
                }
            }
        ]
    }
]