[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17527/desserts/fruit-desserts/banana-desserts/",
                    "name": "Banana Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25587/gramma-berthas-banana-cake/",
        "name": "Gramma Bertha's Banana Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F941100.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:06:18.000Z",
        "description": "This is my grandmother's recipe. It is very moist and tastes great plain or with cream cheese frosting.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "1 - 10 inch Bundt pan",
        "recipeIngredient": [
            "½ cup butter",
            "1 ½ cups white sugar",
            "4 eggs",
            "3 bananas, sliced",
            "1 cup sour cream",
            "1 teaspoon baking soda",
            "2 cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Spray a 10 inch Bundt pan with non-stick cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time. Beat in the sliced bananas, sour cream and baking soda. Beat in the flour. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Banana Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LISAPAV"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.68018018018018,
            "ratingCount": 222,
            "itemReviewed": "Gramma Bertha's Banana Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "248.6 calories",
            "carbohydrateContent": "36.4 g",
            "cholesterolContent": "68.1 mg",
            "fatContent": "10.2 g",
            "fiberContent": "1 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "145.2 mg",
            "sugarContent": "21.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-10T20:58:54.92Z",
                "reviewBody": "My mother in law has a banana cake receipe that she is guarding like the family gold but my husband craves the stuff like a pregnant woman.  So I came here looking for something that might tide him over till our next family outting and he actually said it was better than his mothers.  Score one for the wives.  Anyway.  I love this receipe.  I love that we throw sliced banans in.  I really think that makes a difference.  We eat it plain and frosted.  I always make it in a pampered chef stoneware bar pan and it comes out so nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "andee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1647172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-01T19:10:01.1Z",
                "reviewBody": "As I was saying to a friend, any recipe made by someone named Bertha HAS to be  made by me. It's GOT to be good. I did throw in a tsp. of baking powder and a half tsp. of salt. I didn't have quite enough chopped bananas, so I took what was left of a pound of organic strawberries, chopped them up and threw them in, too. This took about an hour to bake, give or take, and it came out moist and fluffy. I didn't have any with the family, but judging by their faces and lack of conversation at the table, they enjoyed this. I DID NOT make a glaze for this. This one's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-11T22:25:26.73Z",
                "reviewBody": "I'm a soft touch for recipes that have \"Grandma's\" in the title. Grandmas had the best recipes and they knew what the best was supposed to be because they all seemed to know what they were doing.  Sure enough, Gramma Bertha's cake did not disappoint me, although I took a little liberty with her recipe by adding 1 tsp. of vanilla and 1/2 tsp. salt.  When I cut into the cake I got concerned when I saw what looked like uncooked batter.  But not to worry!  I had never added sliced bananas to a batter rather than mashing them and what I was seeing (whew!) was the sliced bananas!  I have no criticism of this recipe whatsoever (although I'm glad for my small additions).  First, I love the texture of it - it's not as dense, as \"wet\" if you will, as banana breads (cakes) can sometimes be.  It does have a well-developed crumb, so in my view this really is a banana CAKE, not banana bread masquerading as one.  It's moist and just sweet enough – remember,  the closer to mushy black your bananas are, the sweeter they'll be and so will the cake.  Mine were brown-speckled.  Because I baked it in a specialty Bundt pan with a lot of detail I didn't frost or glaze it, just sprinkled it with powdered sugar and I'm kind of glad for it - the cake stands on its own with no other frosting or glaze necessary, although a chocolate butter cream or cream cheese frosting would be nice, as would a vanilla or caramel glaze.  Gramma Bertha's cake, I'm sure, has pleased a lot of family and friends.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-25T23:41:28.293Z",
                "reviewBody": "Note: With my changes I rate this recipe a 5 stars. With 10 bananas \"past their prime\" I was desperate to find a way to use them. This recipe fit the bill! This is definitely a cross between a cake and a bread but who cares? It is delicious! I used 5 small bananas and omitted the sour cream; this was still plenty moist! I also added 1 tsp of ground cinnamon and 1 tsp of vanilla. I mashed my bananas which wasn't hard to do considering their condition! Thanks for the post!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-05T18:57:13.723Z",
                "reviewBody": "Wow Gramma Bertha - this is one heck of a banana cake!  This definitely IS a cake which is fabulous because sometimes banana cakes tend to taste more banana bread.  This recipe is so easy to put together and doesn't require a lot of ingredients - nothing fancy, just plain good!  I used 1 cup of white sugar and 1/2 cup of brown sugar and like most others I smashed my bananas vs. slicing.  I also added 1 tsp. of vanilla and 1/2 tsp. of cinnamon along with a 1/2 tsp. of salt.  And to take an already delicious cake over the top I added a whole bag of mini-chocolate chips!  It was done in exactly one hour and turned out moist, tender and delicious!  No icing needed, just a dusting of confectioners' sugar over top once it cooled.  Thanks for sharing your Gramma's recipe LISAPAV!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-22T01:14:02.543Z",
                "reviewBody": "I really like this recipe and urge you guys to try it but I cut down the sugar by a little since I don't like my cakes to be too sweet. Stick to the recipe closely and it will turn out fine. I tried to make it a second time and used 4 bananas instead of 3 and a little too much sour cream. It turned out really soft and wet and it was just a pity!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wayne W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/40440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-15T14:40:36.857Z",
                "reviewBody": "This is a very good recipe for banana cake, my personal favorite...a handful of walnuts and chocolate chips will surely put you over the edge!  If you add the chips, remember to coat them in a little flour before you toss them in the batter!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAG04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1399695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-31T18:20:54.233Z",
                "reviewBody": "made this cake souly on the remarks. it's was the best cake. very easy to make and not too many ingrediants. i added a tspn vanilla and 1/2 c. finely chopped walnuts and was extra good. used powdered sugar instead of cream cheese frosting very moist so it didn't really need frosting. any other recipes from gramma bertha? i would make them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JNTLOU816",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/687582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-16T15:46:51.87Z",
                "reviewBody": "Good stuff. Real good. I'm always faced with bananas that are not eaten because they turn brown too quickly (nice & sweet just not as pretty on the outside) so when I see a recipe that calls for more than one banana I check it out... This one was a winner! Eleven people had some of mine (baked in a rectangular pan) and each person really liked it. I was the only one who thought it was a bit too sweet (I'll reduce the sugar by a 1/4 cup next time anyway). I live at an elavation of 6800 ft so I used less leavening (baking powder instead of baking soda). Turned out great! Getting 11 people to all like the same thing is not an easy task so I'm quite impressed. This recipe is a keeper thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "duskymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1477660/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-21T19:07:01.167Z",
                "reviewBody": "I found this recipe to use up bananas. It is a rich cake. I like it with a cup of coffee. Next time I make it I make it i will add a few chocolate chips or nuts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "helnwhls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6262176/"
                }
            }
        ]
    }
]