[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16416/desserts/cookies/sandwich-cookies/",
                    "name": "Sandwich Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25782/milk-chocolate-florentine-cookies/",
        "name": "Milk Chocolate Florentine Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6720421.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:06:28.000Z",
        "description": "Thin crispy cookies with milk chocolate in between.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "3 1/2 dozen",
        "recipeIngredient": [
            "⅔ cup butter, melted",
            "2 cups quick-cooking oats",
            "⅔ cup all-purpose flour",
            "¼ teaspoon salt",
            "1 cup white sugar",
            "¼ cup corn syrup",
            "¼ cup milk",
            "1 teaspoon vanilla extract",
            "2 cups milk chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Line 2 cookie sheets with aluminum foil and grease the foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, melt the butter. Stir together the oats, flour, salt and sugar; mix into the melted butter until well blended. Stir in the corn syrup, milk and vanilla. Drop batter by teaspoonfuls 3 inches apart onto the prepared cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 5 to 7 minutes in the preheated oven, until medium brown. Cool completely before removing from the cookie sheets.  In the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, stirring frequently until smooth. Remove from heat. Spread chocolate onto the bottoms of cookies and sandwich them together.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sandwich Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "A Miller"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.370967741935484,
            "ratingCount": 62,
            "itemReviewed": "Milk Chocolate Florentine Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "115.3 calories",
            "carbohydrateContent": "15.3 g",
            "cholesterolContent": "10.5 mg",
            "fatContent": "5.9 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.3 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "50 mg",
            "sugarContent": "9.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-18T21:58:49.31Z",
                "reviewBody": "I love these cookies. They are always the ones people request. However, I find that they are better crispier (and easier to peel off the foil). Leave them in the oven 10 minutes instead of five to seven. :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Genuardi Wilson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/505222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-08T01:05:17.543Z",
                "reviewBody": "I LOVE this recipe! I was so excited with how these turned out. They are a really elegant looking cookie and quite unique. I m definitely going to make these for gifts and such since they make a pretty presentation and it s something that will stand out from the usual butter/sugar/spritz/chocolate chip cookies. They look like something you d have to get at a specialty bakery and are very yummy. Because I like chocolate I made one change to the recipe and that is I added two Tablespoons of unsweetened cocoa powder. I took a chance and added the cocoa the first time I made them since there was a comment that this recipe was too sweet. I figured the cocoa would be a good counter to the sweetness and I like dark chocolate anyway. On my opinion it was a very tasty move. I always enjoy reading helpful hints from other s reviews so I hope someone else will find this suggestion useful. Next time I make these I think I will use special candy making chocolate (the kind that hardens back) so that the cookies are less messy. (Although melted chocolate on your hands isn t all that bad a thing!) I prefer dark chocolate so that's what I used. I also used parchment paper but I imagine release foil would work just as well. I agree with other s suggestions about the cooking time. I made a few trays crispy and a few chewy both were great. Just pay attention to the level teaspoon of batter and the space on the cookie sheet or else you get a giant blob of stuck together cookies. Ha",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "akroman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1742152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-17T20:05:40.803Z",
                "reviewBody": "Excellent cookies, I have been making these for years and they are very popular. I definitely recommend using parchment as the foil seems to stick. \n\nAlso, I find if you roll the batter into small balls and then spread them onto to parchment paper using a spatula that has been sprayed with cooking spray - I get a much better looking and consistent shaped cookie. \n\nMake sure you give your self a few hours to make these, they are a bit of work and can be time consuming, but well worth the effort.\n\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Strandberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3260229/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-02T15:33:45.243Z",
                "reviewBody": "This has become one of my favorite cookie recipes. A variation I've used (and really like) is dark chocolate in place of the milk chocolate. Keep a close eye on the color while baking - they brown up at once and should not be overcooked. I typically use convection baking at 350 for 7 minutes then watch them constantly until light golden across the cookie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kaz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2197004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-05T05:26:00.507Z",
                "reviewBody": "I loooove these cookies! One of my favorites from the Italian bakery:) Couple of suggestions to make them perfect: Use parchment paper. These are pretty sticky. I was using my fancy pants thicker aluminum cookie sheets and they weren't cooking/spreading fast enough. Switched to my flimsy cheap nonstick cookie sheet (still with parchment) and viola! Perfect browning on the edge and reduced cook time. Use a little more than the recommended teaspoon. In the bakeries these aren't so \"holey\" and are a satisfyingly sweet and sticky cookie. Lastly give them a little smoosh before baking since they don't spread enough on their own to make a flat thin cookie. Don't flatten them completely but don't leave them as round balls either. Thanks for the recipe! This NY'er has Italian cookie fever in MN:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lilbambella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4459898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-01T21:02:32.8Z",
                "reviewBody": "I was so very excited to find this recipe - my daughter and I bought a florentine cookie the other night to share (it had a 6\" diameter!). I was telling her that I used to make them and that I would look up the recipe - This is it - the exact recipe I used to make - Yea! I am going to make this next week for work - and my daughter and I are going to make these for us (= edit Made these yesterday - just as good as I remember... They are more time consuming than I usually take on (time is a precious comodity!). I had to do one pan at a time only ten cookies per pan (I did double it - that's on me (= ) I used parchment paper which worked well. Eight minutes worked perfectly in my oven... One of my doctors told me this is the best thing I've ever brought in =D Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gammaray (=",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4175968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-22T19:53:06.233Z",
                "reviewBody": "These were really good. I added about 1/2 cup of slivered almonds and baked for 8 minutes. I also used semi-sweet chocolate instead of milk. I recommend flattening the cookie a bit before baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amom2boys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2421818/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-28T22:40:42.27Z",
                "reviewBody": "This is very good and sugary! Using parchment paper is the best way to line the pans. I spread chocolate on top of each individual cookie instead of sandwiching the cookie. I agree though they are best when crispy and should be cooked for 10 mins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cocoalover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2184237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-08T23:00:02.04Z",
                "reviewBody": "Not exactly the recipe I was looking for but delicious just the same. Make sure to follow the recipe exactly especially when it comes to the size of the cookies. Mine came out a little on the large size.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "weatherman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1727779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T19:49:56.03Z",
                "reviewBody": "I did not care for these at all I am sad to say. Even with heavily greased foil (and in a second attempt a heavily greased nonstick cookie sheet) these cookies were quite difficult to get off the foil / pan (I tried removing them immediately after coming out of the over). To be fair several of the cookies did come off the pan / foil with only partially broken edges but to me any breakage is unacceptable. I bake constantly and have never had this much trouble removing cookies from a pan. I think another reviewer mentioned \"chiseling\" them off... sounds about right to me. I tried cooking them for 5-7 minutes then 10 minutes as per other reviews. Neither time really yielded a good cookie. I was looking for something thin crispy buttery and delicate. These ended up being chewy candy-like brittle and fragile. I really had high expectations for these cookies and I am by no means a novice when it comes to baking. Sorry these were not at all what I wanted and I will not be making these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JellyFish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2653067/"
                }
            }
        ]
    }
]