[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25811/lebkuchen-vi/",
        "name": "Lebkuchen VI",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1945832.jpg",
            "width": 1800,
            "height": 1200
        },
        "datePublished": "2020-06-19T03:06:30.000Z",
        "description": "I brought this recipe over from Germany almost 20 years ago. It has molasses, cinnamon, nutmeg, cloves, honey and brown sugar in it. This is one of my favorite memories of Germany at Christmastime.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT10H0M",
        "recipeYield": "6 dozen",
        "recipeIngredient": [
            "½ cup honey",
            "½ cup molasses",
            "¾ cup packed brown sugar",
            "1 egg",
            "1 tablespoon lemon juice",
            "1 teaspoon lemon zest",
            "2 ¾ cups all-purpose flour",
            "½ teaspoon baking soda",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground cloves",
            "1 teaspoon ground allspice",
            "1 teaspoon ground nutmeg",
            "⅓ cup diced candied citron",
            "⅓ cup chopped hazelnuts",
            "1 cup white sugar",
            "½ cup water",
            "¼ cup confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, stir together the honey and molasses. Bring the mixture to a boil, remove from heat and stir in the brown sugar, egg, lemon juice and lemon zest. In a large bowl, stir together the flour, baking soda, cinnamon, cloves, allspice and nutmeg. Add the molasses mixture to the dry ingredients and mix well. Stir in the  citron and hazelnuts. Cover dough and chill overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Using a small amount of dough at a time, roll out on a lightly floured surface to 1/4 inch thickness. Cut into small rectangles and place them 1 inch apart onto the prepared cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 to 12 minutes in the preheated oven, until no imprint remains when touched lightly. Brush the icing over the cookies while they are still hot and quickly remove them to wire cooling racks. Store in airtight container with a cup of orange or apple for a few days to mellow.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the icing: Combine the sugar and water in a small saucepan. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Remove from heat and stir in the confectioners' sugar. If icing becomes sugary while brushing cookies, re-heat slightly- adding a little water until crystals dissolve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Debi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.346938775510204,
            "ratingCount": 49,
            "itemReviewed": "Lebkuchen VI",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "60.6 calories",
            "carbohydrateContent": "13.8 g",
            "cholesterolContent": "2.6 mg",
            "fatContent": "0.5 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "14.7 mg",
            "sugarContent": "8.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-10T16:45:15.823Z",
                "reviewBody": "All my German friends want this recipe--that's how authentic it tastes. The only changes I made were: 1) instead of boiling the honey and molasses, I just warmed them up in the microwave (which made the dough stiffer and less sticky); and 2) I used a simpler glaze by just whisking together a little powdered sugar with some milk (no cooking necessary). Also, be sure to seal the baked and glazed cookies in a container with a wedge of orange or apple for several hours, then take the fruit out. It softens them up to exactly the right texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dynette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2667979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-26T04:11:42.653Z",
                "reviewBody": "You need to use a lot of flour when rolling them out. Don't work the flour into the dough just coat the outside of the dough & rolling pin with flour. And work with small amounts at a time. They are worth the extra trouble. Make sure they are rolled out to 1/4 inch any less and they will be too crisp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAPASCHE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/207034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-21T01:36:42.437Z",
                "reviewBody": "I made these cookies on the request of my husband who is a German national living in the US since 1996. He told me they taste exactly like he remembers his mothers' cookies. The dough was not sticky at all but as the previous reviewers complained about the stickiness I did add about 1/4-1/2 more flour and used plenty when rolling them out. I think the key was making sure they stayed in the fridge overnight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JANALORI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1294734/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-12T18:26:50.713Z",
                "reviewBody": "A few years ago I had tried a different lebkuchen recipe and although it was good it paled in comparison to this one. According to my husband this was better than the lebkuchen that I usually order from Germany. I would agree that this recipe requires chilling overnight in the refrigerator. To get over the stickiness I found the following technique useful. Definitely get the back oblaten (communion wafers). I got the 70mm size. Set those on a cookie sheet. Use a cookie scoop and prior to scooping out some dough dip it in flour. Coat your hands with flour and take the scooped out dough and roll it into a ball. Smash it down on one of the back oblaten. Use your fingers to push the dough out to the edges of the wafers. The portion size should be about perfect for the 1/4 inch suggested. If you find your fingers or cookie scoop getting sticky just coat them with more flour. You don't have to worry about pulling dough of a roller and you're not mixing in a lot of extra flour. Although the glaze is really good I took some of my lebkuchen and coated the tops with melted chocolate. I had some difficulty finding citron and hazelnuts but found a really good website that I was able to order both from.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kkdman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3200440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T18:29:46.983Z",
                "reviewBody": "This recipe is a bit darker and spicier than the ones my German mom used to make. I did find a good way to deal with the sticky dough: line a 10x15 jellyroll pan w/ parchment. Take a \"wad\" of dough with your floured hands and give it the first flattening. You can probably roll it a little now on your floured surface to even out the thickness. Fit it into the pan and work another piece. You can press the seams together so it looks like one big uniform pan full. When it bakes it all blends together. I scored it with a pizza cutter before it completely cooled making later cutting easier. I cut them into diamond shapes and placed a sliced almond on each after glazing. They look great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "christa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2213871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-23T10:51:56.937Z",
                "reviewBody": "Lots of German cookie recipes can be a pain because they're so sticky. Spreading the dough in a pan like for brownies gets rid of the problem - or you can drop it off in spoonfuls and flatten the drops although this isn't as pretty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sinopa2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1150193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T02:45:46.92Z",
                "reviewBody": "This recipe didn't work for me at all!!! After taking the dough out of the fridge to roll it out I realized it needed much more flour than the recipe called for. It was super sticky I added about another cup and a half of flour but it was still hard to work with. Finally I got so frustrated that I just threw it all away! Don't understand why it was so sticky. Even tried rolling it out between floured waxed paper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "METTKAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-02T23:22:04.023Z",
                "reviewBody": "This is a great recipe. Yes the dough is VERY sticky-but a lot of German cookie recipes are very sticky. They remind me a lot of the lebkucken and gingerbread cookies we buy from the german deli every winter-which are the best in my opinion. One way to prevent them from sticking on the bottom is to place them on rice paper or wafers called Back-oblaten. I didn't have to bake them as long as recommended. It took 7-8 min. I then melted some semisweet chocolate and drizzled the tops of them when they were cool. They do taste better after a 2-3 days in a sealed container but are still great right out of the oven. Definately will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PumpkinPoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/518177/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-07T16:34:42.72Z",
                "reviewBody": "These are better than what my mother use to make. And they are LESS sticky. You just have to make sure you use a lot of flour when rolling them out. I used a round cookie cutter to cut them out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marguerite",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2195761/"
                }
            }
        ]
    }
]