[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25828/oil-cookies/",
        "name": "Oil Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F453413.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:06:32.000Z",
        "description": "This is a family heirloom recipe from my grandmother. We had to stand by her to come up with measurements because she used a hand of this or a container of that. She called them oil cookies because most of the recipes had lard in them and this one used oil instead. This is a recipe that is called for on every cookie tray at holidays or gatherings. Brush cookies with a basic powder sugar and water icing and while wet, sprinkle colored jimmies to match the occasion. Let dry completely before storing. These cookies freeze great UNFROSTED.",
        "prepTime": null,
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "6 dozen",
        "recipeIngredient": [
            "6 eggs",
            "¾ cup evaporated milk",
            "1 cup vegetable oil",
            "2 tablespoons vanilla extract",
            "1 ¼ cups white sugar",
            "2 tablespoons baking powder",
            "6 cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat the eggs, evaporated milk, oil and vanilla until well blended. Mix in the sugar and baking powder. Stir in the flour 1 cup at a time until the dough becomes too stiff to stir. Turn out onto a clean surface and knead in as much of the remaining flour as possible. Dough should be smooth and not sticky. Keep the dough covered with a towel while pinching off tablespoon sized pieces of dough and rolling them into small ropes 6 inches long and 1/4 inch in diameter. Tie ropes into loose knots and place them 2 inches apart onto the prepared cookie sheets. The cookies will almost triple in size while baking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 to 12 minutes in the preheated oven, until light brown on the bottom. Remove from cookie sheets to cool on wire racks. When cool, glaze with a mixture of confectioners' sugar and water, if desired.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MYRAMANI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.4545454545454546,
            "ratingCount": 11,
            "itemReviewed": "Oil Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "88.8 calories",
            "carbohydrateContent": "11.8 g",
            "cholesterolContent": "16.3 mg",
            "fatContent": "3.7 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1.8 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "36.8 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-04-15T20:45:32.867Z",
                "reviewBody": "A basic bland cookie good for putting sprinkles or icing on. I chose this recipe because it uses oil instead of butter or trans-fat laden baking margarine. I found it took an extra cup of flour to even get it remotely stiff enough to shape and that it didn't really rise very much(maybe because of the extra flour). With no butter to cream it was a very quick dough to make and my 4 yr old was able to roll them in to \"snakes\" and after they were cooked I brushed on the glaze and she dipped them in sprinkles. We glaced and covered them with sprinkles and the kids loved them so I would definitely make them again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LVANDOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1075010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-28T01:36:59.013Z",
                "reviewBody": "We love these. They make great wedding favors. We make them into knots glaze them and sprinkle them with crystal sanding sugar. Then we package them 2 in a box tie it with a white ribbon and label it with a tag that says \"We tied the knot!\" Great recipe Cindy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUGARPLUMSCOOKIES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1463149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-30T05:33:04.91Z",
                "reviewBody": "These cookies are really cute! I had run out of butter but wanted to bake something sweet -- and these fit the bill perfectly! I had to add a bit more flour to get the dough workable but other than that the cookies came out great. Beware... they are addictive since they're so light!:) Note: I live at an elevation of 7000 feet and did not need to make any changes to the recipe. Thank you for posting this unique cookie recipe; I enjoyed the story about your grandmother as well!:)))",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lindseyluna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1346798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-09T15:21:01.1Z",
                "reviewBody": "SO good! They turn out with a taste and consistency close to that of scones. They are so fun to make shapes out of! Great group activity for baking with friends or kids because you can make whatever shapes you want out of the dough (and there is a LOT of dough so the help would be nice!). I only gave it 4 of 5 stars because I made a few adjustments and I think as-is it would only be a 4. What I did that made them GREAT was: 1) I added about 1/2 a tablespoon of almond extract along with the vanilla. 2) I ended up having to add in about 1.5 extra cups of flour... it was still a little sticky but with floured hands it was workable/rollable for shapes. 3) GLAZE! You definately need to take the advice in the recipe and glaze. The cookies are a bit bland by themselves but made complete with a little sugary goodness on top:) I used a vanilla glaze and it was the perfect pair but I bet they would be great with any other glaze or even jam! Thanks so much for this recipe I'll definately make it again:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RentheFabulousBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4680235/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-30T00:24:50.623Z",
                "reviewBody": "These were NOT a hit. I tried them plain and as thumbprint cookies. My kids (and honey) licked the jam out of the thumbprints and didn't eat the cookie.To quote my DH \"Oil Cookies? What did you use 40 weight?\" We'll stick to butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MomZilla (Evin)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2701003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-20T05:12:29.437Z",
                "reviewBody": "I was a little disappointed in the way my attempt turned out. Maybe I flubbed up somewhere with ingredients or preparation. Anyway my batch was sticky and hard to roll and when finished tasted bland and dry. I was glad that they used oil vs. margarine shortening or butter but I doubt if I'll make them again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-24T12:52:14.807Z",
                "reviewBody": "It is what it says which I like. Shapes hold well and it was a blast to make these with kids. I had enough dough to freeze and save for another day of play. I like the simplicity of this recipe and the comment that they are like scones is right on! They are a softer texture but for little teeth this is good. I just dusted them with icing sugar and while the kids made wild shapes I stuck with spirals and pretzels that looked charming when done. The taste might be bland but a solid base for whatever your imagination can create - admittedly I near tripled the vanilla since I love that flavour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Evora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5094274/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-11T19:31:51.637Z",
                "reviewBody": "Excellent cookie! Light on sugar and great with morning coffee. I added orange and vanilla flavors for a bit more flavor.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "siXstar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2574215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-09T18:53:59.073Z",
                "reviewBody": "I've been meaning to try this recipe for quite some time because it intrigued me. Finally when I decided to make it I didn't have evaporated milk. So I very gently boiled down some 2% milk until it was reduced to half. I made only half the recipe. I put the dough in the freezer for about a half hour. Next time I will refrigerate it overnight. I put a piece of saran wrap down to roll the dough on. I dipped my fingers in flour each time I took a tablespoon of dough. Since I had some cinnamon sugar left from another cookie I made I used that rather than glaze. I ended up making knots and they looked really cute. I got about 3 dozen cookies. I baked them longer than the recipe stated because I wanted them to have more color. I'll definitely make these again. Thank you for taking the time to get measurements from your grandmother. This recipe could have been lost forever.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rosalie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13600263/"
                }
            }
        ]
    }
]