[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25958/basic-cheesecake/",
        "name": "Basic Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5276663.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:06:35.000Z",
        "description": "A basic thick cheesecake. Serve with your favorite fruit topping.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "1 - 9 inch springform pan",
        "recipeIngredient": [
            "1 cup graham cracker crumbs",
            "¼ cup finely chopped walnuts",
            "3 tablespoons brown sugar",
            "1 tablespoon ground cinnamon",
            "½ teaspoon ground nutmeg",
            "5 tablespoons butter, melted",
            "3 (8 ounce) packages cream cheese",
            "1 cup white sugar",
            "1 cup sour cream",
            "1 cup heavy cream",
            "3 tablespoons all-purpose flour",
            "1 tablespoon vanilla extract",
            "3 eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine graham cracker crumbs, chopped walnuts, brown sugar, cinnamon, nutmeg and melted butter. Mix well and press into the bottom of a 9 inch springform pan. Bake in preheated oven for 10 minutes. Remove from oven and allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat cream cheese and sugar together until smooth. Beat in sour cream and heavy cream. Blend in the flour and vanilla. With mixer on low speed, add eggs one at a time. Pour batter over crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 60 to 70 minutes, or until center is almost set (filling will be soft). Refrigerate at least 6 hours or overnight before removing from pan.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "RONALD UY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.658610271903323,
            "ratingCount": 331,
            "itemReviewed": "Basic Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "375.3 calories",
            "carbohydrateContent": "23.1 g",
            "cholesterolContent": "117.3 mg",
            "fatContent": "29.5 g",
            "fiberContent": "0.6 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "17.3 g",
            "servingSize": null,
            "sodiumContent": "208.9 mg",
            "sugarContent": "17 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-22T15:08:01.763Z",
                "reviewBody": "This recipe is very much like the one I have used for over 20 years.  To stop the cake from cracking while cooking, leave cake in oven after turning off the heat, leave oven door ajar. Ten minutes later, run a thin bladed knife around the edge to release the cake from the pan, put back in oven and let cool until oven is cold. Take out of oven and let cake cool completely to room temperature before placing in cooler or fridge.\r\nI have used this method for many years professionally and found that it works every time. The main trick is not to overcook the cake, cook only until the centre is \"jiggely\" not firm. It will firm up as it cools.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMSCAKES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/777865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-14T15:47:37.973Z",
                "reviewBody": "I made this for a dinner party, and it turned out perfectly. No cracks-- the secret? Don't put the oven on 350. It's best to bake it at a lower temp. I put it on about 330 or so (and 55 minutes). Also, make sure that you cool it in the oven before you put it in the refridgerator: too soon and it will crack.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwyilm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/744784/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-06T21:45:18.123Z",
                "reviewBody": "Okay this is for sure a 5 star recipie! A couple things though. If you do not add your own flavoring it can be pretty boring. I added lemon extract, lemon juice and lemon zest. I served it with ras puree. I also left out all the spices for the crust. Another time I made it I used sugar cookies for the crust. That was wonderful! As far as cracks go..LEAVE int he over for a couple hours after you turn the oven off. I never get cracks and I always follow that rule. Also, I had the oven on 340 and only cooked it with the oven on for 30 min. Left it in the oven for another 2 hours. It will continue to cook in the heat just don't open the door! Great recipie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEIDIANNP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1178994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-26T20:40:39.693Z",
                "reviewBody": "This was a good cheesecake.  BUT the top browned too much for my liking.  I read reviews about it cracking, so I let the cheesecake cool in the oven. Literally, once it was done, we went to a Christmas celebration and I didn't take it out until we got home(2 hours later)- no cracks!! I also didn't over mix the filling.  I used our mixer on the lowest setting the entire time. The crust is okay.  I agree with another review that stated it's kinda a distraction from tasting the flavor of the cheesecake. Next time I'll use a basic graham cracker crust.  I also looked into it browning on the top.  I found an article about the baking temp. Apparently cheesecakes should be baked at 250-300 degrees.  Next time I will bake it at 300 degrees for about 80-90 minutes.\n\nEdit:  I just made this for Christmas yesterday.  I baked it at 300 degrees for about 80 minutes, and I had NO brown top!!  I left if in the oven to cool for 30 minutes, then cracked the door and left it in for another 30 minutes.  It was perfect.  NO cracks, and I didn't go through the trouble of using a water bath.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke Salazar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3156254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-31T16:19:40.687Z",
                "reviewBody": "Great cheesecake! I am on the Atkins diet so I have modified this recipe slightly. I use 1 1/2 cups almonds finely ground in the food processor for the crust and replace the sugar with 3 packets of Splenda. I use Atkins bake mix in place of the flour in the filling and use 24 packets of Splenda in place of the sugar. It is great and made that way has very few carbs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAINAA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/662107/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-13T06:16:14.107Z",
                "reviewBody": "I usually make my own recipe cheesecake but decided to try this one b/c this sounded really good and is a 'high' cheesecake. Have yet to taste (still in oven) but smells heavenly. I normally dont use a waterbath but what I do to avoid cracks is place the springform pan on a very sturdy baking sheet when cooking and never open the oven door. You can easily watch it from using the light switch of course. When done turn off oven and leave it in there for an hour or leave door open ajar. Always refrigerate cheesecake for at least a day or more for optimum flavor before serving. Never use 'whipped' cream cheese always buy the 'block' cream cheese that should always be softened.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Natalie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1481195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-28T19:24:27.95Z",
                "reviewBody": "Being a cheesecake fanatic I found this recipe made a good cheesecake although not the best I have ever had. The cheesecake filling was rich and extremely heavy (still waiting for it to digest). This recipe was very easy to follow although it made far too much cheesecake filling so I just made a second cheesecake to use up the extras. To avoid cracking make sure you do not overbeat your cheesecake mixture use a water bath whilst baking and bake at a lower temperature. After baking cool cheesecake in oven with door open once the oven has cooled down take cheesecake out to finish off cooling. Once cooled refrigerate overnight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MUIJIU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/738661/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T13:15:04.043Z",
                "reviewBody": "I have a bakery and am always looking for good recipes. I made 3 of the cheesecakes from this page and had people taste test them, they voted this one 2nd in taste.  However, this cheesecake cracked very badly, and since appearance is important, I won't make this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "lsneed62",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/524895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-04T04:00:43.893Z",
                "reviewBody": "I served this cheesecake for an occasion where it was very important to me that it turned out right. I studied quite a few recipes before deciding on this one which I chose because of the additions significant ones at that of both heavy cream and sour cream. I m not a big fan of heavy dense dry cheesecakes and the smooth and creamy texture I anticipated was exactly what this delivered. Because a basic cheesecake with a fresh raspberry sauce was what I planned I used a standard chocolate wafer crust rather than the spiced up version directed in the recipe. This cheesecake couldn t have done me more proud. I baked it in a water bath and even tho it appears condensation caused some water seepage I don t know how a cheesecake could have turned out any better. I admit I was a little nervous about the rather large amounts of sour cream and heavy cream but after making serving and eating this cheesecake myself I m convinced it IS the large amounts of sour cream and heavy cream that made this cheesecake such a hit so extraordinarily delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            }
        ]
    }
]