[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/395/desserts/cakes/pound-cake/",
                    "name": "Pound Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25999/chocolate-pound-cake-iii/",
        "name": "Chocolate Pound Cake III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F38315.jpg",
            "width": 1536,
            "height": 1024
        },
        "datePublished": "2020-06-19T03:06:38.000Z",
        "description": "A dense chocolate cake made in a Bundt pan. Dust with confectioners' sugar for a nice presentation.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 10 inch Bundt pan",
        "recipeIngredient": [
            "1 ½ cups butter, softened",
            "3 cups white sugar",
            "5 eggs",
            "2 teaspoons vanilla extract",
            "2 teaspoons instant coffee granules dissolved in 1/4 cup hot water",
            "1 cup buttermilk",
            "2 cups all-purpose flour",
            "¾ cup unsweetened cocoa powder",
            "½ teaspoon baking powder",
            "1 teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan. Mix together the flour, cocoa, baking powder, and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla.  Beat in the flour mixture alternately with the dissolved coffee and buttermilk. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 60 to 70 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 20 minutes, then turn out onto a wire rack and cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Pound Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SDFS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.542553191489362,
            "ratingCount": 376,
            "itemReviewed": "Chocolate Pound Cake III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "394.2 calories",
            "carbohydrateContent": "52.6 g",
            "cholesterolContent": "104.5 mg",
            "fatContent": "19.7 g",
            "fiberContent": "1.8 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "11.8 g",
            "servingSize": null,
            "sodiumContent": "318.4 mg",
            "sugarContent": "38.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-01T23:58:46.14Z",
                "reviewBody": "I have a dessert business & several clients asked for a chocolate pound cake for the holidays.  After experimenting with several cookbooks, I tried Shelley's recipe.  What a success.  This cake is very moist, rich and has the best chocolate taste.  After making the cake 2-3 times, I made a few minor changes.  I cream the butter and sugar for 5 minutes (with stand mixer; longer with hand held mixer) and mix 30 seconds after adding each egg.  I can adjust the amount of coffee depending on the client, but 2 tsp is perfect.  I use a dark 12 cup, 10 inch bundt pan and have to reduce the baking temperature to 300 and bake for 70 minutes.  Occasionally, I bake the cake at 285 for 75-80 minutes and it is wonderful--no burning or dry chocolate taste.  I usally glaze the cake with one of the satiny chocolate glazes on this site or dust with powdered sugar.  It is fun to fill the center of the cake with either whole raspberries or strawberries and serve.  I agree with other reviewers that this cake is better the next day or even after refrigerating (wrap really well-the cake will pick up refrigerator odors).  It freezes beautifully.  Great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TLBRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-25T04:33:22.437Z",
                "reviewBody": "A great recipe!  I omitted the coffee and put in 1/4 cup extra buttermilk (I also made my own buttermilk with milk and lemon juice).  Cut back on the sugar by 1/2 cup, it was pefectly sweet.  I used Ghiradeli's cocoa which added to the great flavor.  Frosted with my own white chocolate glaze and had this for Christmas Eve!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-15T18:28:01.767Z",
                "reviewBody": "From all the reviews, I thought this cake would come out with a very intense chocolate flavor, but I was disappointed.  The chocolate taste was very mild.  The batter was delicious; I could have sat down with a spoon and a glass of milk and just eaten a bowl of it.  And I should have.  Although I followed the recipe exactly, and used a 10 inch bundt pan, the batter overflowed the pan during the baking process.  Luckily I had set the pan on a baking sheet, so I didn't have to clean my oven.  My husband asked me why I keep trying new recipes when my old standards are so much better.  I have rated this 2 stars because of the overflow problem, but regardless of the lack of chocolate flavor, it is, after all, cake, and certainly edible.  It won't go to waste, but I won't make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-07T03:29:57.073Z",
                "reviewBody": "I don't write many reviews, BUT...I thought I had the best choco pound cake recipe and I was wrong.  This is the absolute best cake I've ever eaten.  I put the satiny glaze recipe on it and yum... My husband the non desert eater has eaten more of it than any cake I've ever made.  Oh, and I'm diabetic so I've made it twice with splenda, 2 c. white and 1 c. brown sugar splenda and I think he likes that even better. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "krashzmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/491153/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-23T22:13:29.907Z",
                "reviewBody": "This is the most amazing chocolate cake i've ever made, it's won hands down with all the family, so much so that i have numerous orders/ requests for more.  It is a dense almost fudge like cake with just a hint of coffee to give it a nice lift. \n\nI love this cake so much, i just had to come back to write more.\n\nI recently thought, it is such a beautiful cake- I wonder if it would work as a vanilla/plain. I tried it, and no surprises, it is devine!!!\n\nTo make substitute the cocoa for an extra 3/4cup of flour, discard the coffee, but add between 1/4cup and 2T of hot water to the mix, keep everything else the same and voila you have a stunningly beautiful vanilla/plain cake that people will be raving about for ages.\n\nThe good thing about this cake also is that it keeps for days and still stays moist, just make sure you keep it in a sealed container, and if it's warm make sure you keep it in the fridge, especially if you are going ice it.\n\nTrust me, you won't be disappointed in this cake!  Enjoy. =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Mac",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2773040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-10T16:16:01.047Z",
                "reviewBody": "This is to die for. In a month, I baked it at least for 6 occasions. People want recipe and make me bake more! Mine only took about 45 minutes to bake however.  The cake has dense chocolate taste. I tried 1 teaspoon instant coffee in Bailey Irish Cream instead of water and use 3 teaspoons vanilla extract and half a vanilla bean. Also I use 1 cup milk and 1 tablespoon vinegar instead of buttermilk. It smells as delicious as it tastes. The cake is good by itself but it also works well with raspberry glaze...I stir no-sugar-added raspberry jam with some water, a teaspoon corn maize and gelatin over low heat and let cool a bit before spreading on top.  The cake is very good after one night in a refridgerator but some of my friends love it reheated in microwave as well...they said it's moist and delicious. I'm baking it again and again for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "essensual911",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/essensual911/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-25T18:00:09.143Z",
                "reviewBody": "Perhaps it's just a matter of individual palates and taste preferences that explain the wide disparity of ratings and reviews for this recipe. I can only speak for myself and as far I'm concerned this is a less than mediocre cake even tho' I'm sure it turned out exactly the way it's supposed to. The cake is just mildly chocolate first of all and sort of a light milk chocolate in color. When I want a chocolate cake I want CHOCOLATE not some wimpy facsimile. But that's not the biggest issue I have with this cake which is that while it's moist enough it's just plain too dense. Compact is more like it with virtually no crumb to it at all. (Please note that I am very familiar with proper creaming technique) I think the solution might be to cut the butter back to just one cup but for me the cake didn't have potential enough to tinker with the recipe. Its saving grace was the chocolate ganache I topped it with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-02T12:54:33.577Z",
                "reviewBody": "I tried this first time this week but made it twice already (first with only two cups sugar, second with 2 1/2, which is just perfect for me.  I think 3 cups sugar is too sweet). I also sprinkled a few semi-sweet choco chips on top.  Other than those, I didn't change anything.  It's soft, it's really good and tastes better than other chocolate cakes.  try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MYRNA GUEVARRA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/440753/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T22:08:24.827Z",
                "reviewBody": "This is truly the BEST chocolate cake I have ever had. I used Valrhona 100% cacao Plugra butter and 1/4 cup freshly brewed espresso. I also decreased the sugar to 2 1/2 cups and used whole buttermilk. This is very moist and chocolatey and definitely gets better the next day. Just a simple dusting of powdered sugar is all it needs. Thank you for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSMELBA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/922351/"
                }
            }
        ]
    }
]