[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14671/desserts/cakes/cheesecake/chocolate-cheesecake/",
                    "name": "Chocolate Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25986/chocolate-caramel-cheesecake/",
        "name": "Chocolate Caramel Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3956722.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2020-06-19T03:06:38.000Z",
        "description": "I got this wonderful recipe from a bed and breakfast my hubby and I stayed at. It is always a hit every time I make it! Garnish with caramel or chocolate sauce if desired.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 9 inch springform",
        "recipeIngredient": [
            "2 cups graham cracker crumbs",
            "⅓ cup white sugar",
            "½ cup butter, melted",
            "30 individually wrapped caramels, unwrapped",
            "3 tablespoons milk",
            "¾ cup chopped pecans",
            "1 cup semisweet chocolate chips",
            "3 (8 ounce) packages cream cheese, softened",
            "¾ cup white sugar",
            "1 teaspoon vanilla extract",
            "3 eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine graham cracker crumbs, sugar and melted butter. Mix well and press into the bottom and 1 inch up the sides of a 9 inch springform pan. Pour on melted caramel/pecan mixture and chill for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the Caramel Filling:   In a small saucepan, combine caramels and milk. Cook over low heat, stirring, until smooth. Stir in chopped pecans. Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm. In a large bowl, beat cream cheese, sugar and vanilla until smooth. Beat in the eggs one at a time. Fold 1/3 of the filling into the melted chocolate, then pour the chocolate mixture back into the filling and mix until no streaks remain. Pour into crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 50 minutes, or until center is almost set.  Place a pan of water on rack underneath cheesecake as it bakes to help keep it from cracking. Cool in oven with door cracked open.  Refrigerate at least 5 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "Chocolate Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "-OLIVE-"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.725352112676056,
            "ratingCount": 142,
            "itemReviewed": "Chocolate Caramel Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "623.8 calories",
            "carbohydrateContent": "59.8 g",
            "cholesterolContent": "130.5 mg",
            "fatContent": "41.1 g",
            "fiberContent": "1.9 g",
            "proteinContent": "9.3 g",
            "saturatedFatContent": "21.3 g",
            "servingSize": null,
            "sodiumContent": "387.4 mg",
            "sugarContent": "47.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-31T00:13:43.56Z",
                "reviewBody": "This is a fabulous cheesecake recipe, but I wanted to warn all those low-fat junkies out there that this recipe should not be modified.  I made it once as directed (except used Oreo crumbs for the crust, which I highly recommend) and it turned out perfectly - tasted amazing!  I made it a second time with 1/3 less fat cream cheese and it was really disappointing.  I'm usually all for low-fat modifications because often you can't really tell and it makes sweets a lot healthier, but resist the temptation here.  It just doesn't taste right and the texture is off.  Go all out on this if you're going to make it.  And do make it because you will seriously impress your friends and family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baker Bee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/808637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-06T16:59:58.997Z",
                "reviewBody": "WOW If i could I would give this recipe 10 stars. I made it for a church function last night and I had people coming up to me all night telling me how fabulous it was one girl scraped the bottom of the platter and showed me she had to o that just to get a taste. another man ate his and his wife's peice and tried to steal some one elses! I must have said thank you 100 times. I Used chocolate graham cracker for the crust milk chocolate intead of semi-sweet and baked it in a water bath. I was perfect. I cut it first into slices ( so it would be easier to serve) then I melted some more caramel and some chocolate and alternates swirling them over the cut peices which worked out nicely becuase it oozed down into the slices and made it taste even yummier and It looked prettier than if I had to cut it already decorated! thnak you so much for this reipe definetly making this again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "momtovn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2147870/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-20T20:24:50.653Z",
                "reviewBody": "This cheesecake was absolutely delicious!! The caramel layer was not hard as some \"turtle\" type cheesecakes get I followed the recipe exactly making sure the ingredients were at room temperature. I baked in a 325 oven for exactly 50 mins. with a 9\" cake pan full of hot boiled water on the oven rack beneath the rack the cheesecake was on. The cheesecake had a 2-3\" wobbly circle in the centre at this point. I turned my oven off cracked the door open and left it for a good 4-5 hours until it was completely cool. It set up beautifully with NO cracks. I then transferred it to the fridge and decorated it the next day with sweetened whipped cream that I had added some whip cream stabilizer to. I also sprinkled the piped cream with some chopped pecans and added a cherry on top of each dollop of cream. To cut I ran hot water on the knife and wiped it off between each cut. It cut beautifully!! I served it with some Smucker's caramel sauce. Delish!! My sil absolutely loved it!! (i made it for her 40th b-day)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori Guilderson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/372015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-24T03:00:24.25Z",
                "reviewBody": "I've made many cheesecakes, but this certainly cracks the top three! The recipe is relatively easy and a cinch to alter to make it your own. I used the Nestle chocolate/caramel swirl chips and as always, substituted a can of Dulce de Leche (La Lechera) for the caramels. Using La Lechera gives you the same results but in a fraction of the time. The cheesecake was rich and creamy-- a big hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Meghan Ely",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/955356/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-29T02:04:14.967Z",
                "reviewBody": "This is a great cheesecake! Cheesecakes are so hard to get perfect-make sure cream cheese is at room temperature along with the eggs! If you do get tiny lumps they don't ruin the cheesecake; it's just not as pretty. Make sure your crust doesn't have any leaks for the caramel layer to go through or you'll have a hard time getting the pie out of the pan! I will probably pour the caramel over the top when serving instead next time. The caramel is chewy in the crust something some people may not like. Excellent recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SYRIELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/195843/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-11T20:13:10.013Z",
                "reviewBody": "This was the first time I've ever made a \"real\" cheesecake and it was a big hit! It wasn't too difficult but I did make a few changes...I made my crust out of Oreo crumbs instead and I would say it needs more caramel for the layer over the crust (maybe 50 caramels instead because you could hardly see the layer) and then maybe more pecans too...but it was great and everybody asked for the recipe! Thanks!!! Renee - MN",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RLR12473",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683962/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-06T23:37:02.53Z",
                "reviewBody": "I must agree with 'Chaenyn' in saying \"what do you do with the carmel sauce???\"  I assume from the line in the 'intro' about the ribbon of carmel through the cake, it is to be poured in as a swirl or layer?  Clarifying that would be MOST helpful.  It was delicious and I did swirl it in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JKV1127",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/787705/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-12T23:43:24.297Z",
                "reviewBody": "Great recipe. I too made the crust using chocolate graham crackers (2 packages). Instead of making the caramel I purchased smuckers caramel to save time. Just make sure it's the thicker caramel. I toasted the pecan pieces before adding them to the caramel. I also used Ghirardelli milk chocolate (about a cup and a half of chips). I baked as instructed but with no water bath. 50 minutes in a 325 degree oven and then let it set in the oven for 2 hours. Do not open the oven door! It turned out perfectly no cracks!! So good so rich! I made this for my bosses birthday and everyone raved about it. The whole thing was gone in no time! Unfortunately I didn't grab a piece in time to take home to my husband as promised. Looks like I'll have to make another one!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kkcmyk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/760273/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-01T00:35:59.263Z",
                "reviewBody": "I too substituted Oreo cookie crumbs for the graham crackers. I made this for a belated birthday cake for my husband (he's an over the road trucker) and it's definitely a WINNER! I'm also a first-time cheesecake maker and the recipe is very easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KITTYMOM11001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/691078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-27T15:26:14.677Z",
                "reviewBody": "Not sure what I did wrong but it bombed out of me big time! Was as hard as a rock so had to throw away:-(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Cajun Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cajungirl/"
                }
            }
        ]
    }
]