[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26018/cream-filled-cupcakes/",
        "name": "Cream Filled Cupcakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F621676.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:06:40.000Z",
        "description": "Delicious and simple to make, a creamy filling is piped into chocolate cupcakes with a pastry bag. Frost with your favorite chocolate frosting.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "36 cupcakes",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "2 cups white sugar",
            "⅓ cup unsweetened cocoa powder",
            "2 teaspoons baking soda",
            "1 teaspoon salt",
            "2 eggs",
            "1 cup milk",
            "1 cup water",
            "1 cup vegetable oil",
            "1 teaspoon vanilla extract",
            "¼ cup butter",
            "¼ cup shortening",
            "2 cups confectioners' sugar",
            "1 pinch salt",
            "3 tablespoons milk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Line 36 muffin cups with paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the flour, sugar, cocoa, baking soda and 1 teaspoon salt. Make a well in the center and pour in the eggs, 1 cup milk, water, oil and 1 teaspoon vanilla. Mix well. Fill each muffin cup half-full of batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 15 to 20 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make filling:  In a large bowl, beat butter and shortening together until smooth. Blend in confectioners' sugar and pinch of salt. Gradually beat in 3 tablespoons milk and 1 teaspoon vanilla. beat until light and fluffy. Fill a pastry bag with a small tip.  Push tip through bottom of paper liner to fill each cupcake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Grace W."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.437371663244353,
            "ratingCount": 487,
            "itemReviewed": "Cream Filled Cupcakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "195.9 calories",
            "carbohydrateContent": "26.9 g",
            "cholesterolContent": "14.4 mg",
            "fatContent": "9.4 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.9 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "151.4 mg",
            "sugarContent": "18.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-02T23:42:00.79Z",
                "reviewBody": "Here is the EASIEST tip for filling the cupcakes.  Take an APPLE CORER and use that to pull a cylindrical plug of cake out of each cupcake (once they've cooled).  Save the plugs on the side while you pipe filling into each hole you've created.  \"Plug\" up each hole using the plugs/caps you had removed with the apple corer.  Simple and fast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hina Khan-Mukhtar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2112544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T19:34:03.903Z",
                "reviewBody": "I thought this was a great idea, but not the greatest recipe.  The chocolate cupcakes weren't the tastiest -- I'd use a different recipe for that part next time.  The cream filling was great, so I wound up using a double batch of filling for one batch of cupcakes.  I didn't like the idea of pushing it in from the bottom (sounded way too messy for me).  So I used a knife and cut a cone shape out of the top, spooned the filling in, and replaced the top.  (Just be sure to wait until the cupcakes have cooled, or the cream filling just melts!)  Then I frosted them using the great chocolate frosting recipe mentioned in another review, and you can't tell they're anything but chocolate cupcakes until you bite into them.  My boyfriend says these are now his FAVORITE dessert!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AJHESS1027",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/816498/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-19T12:22:28.563Z",
                "reviewBody": "Great dessert for our Father's Day barbeque!  The cupcake portion of the recipe is so easy to make and tastes so much better than boxed mixes.  It doesn't take any longer to make than the boxed mixes either, so try it.  As for the reviewers that thought it was too much work to put the filling inside, it's actually very little work and quite a bit of fun.  All you need is a pastry bag and tip.  Each cupcake takes about 10 seconds to fill.  I made my cupcakes in the pan without wrappers, filled them after they were cool, then arranged a dozen or so to a platter and drizzled them with chocolate ganache.  They looked surprisingly elegant for cupcakes.  Everyone loved them and ate seconds and thirds.  I can't wait to try the same cupcake recipe with different fillings.  UPDATE:  I have made these cupcakes dozens of times since my first review because they are always requested.  I like to ice them with Satiny Chocolate Glaze.  I have also filled them with chocolate cream cheese frosting, nutella, and whipped peanut butter frosting.  I like to fill them from the top and then spoon the glaze on.  After the glaze is set, I pipe a small flower in the center of each cupcake with whatever filling I used.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SEY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1067716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T04:41:16.59Z",
                "reviewBody": "This is a super recipe!  I usually always mess up new recipes, but this turned out perfect, it was easy, and everyone at work loved it.  I used an incredible chocolate frosting receipe I found on this same site:  1/4 cup margarine, melted; 1/2 cup unsweetened cocoa powder; 1/3 cup milk; 1 teaspoon vanilla extract; 3 1/2 cups confectioners' sugar.  In a large bowl, beat margarine and cocoa together until combined. Add milk and vanilla; beat until smooth. Gradually beat in confectioners' sugar until desired consistency is achieved. Adjust with more milk or confectioners' sugar if necessary.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OCEAN011",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/720292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-13T22:57:09.28Z",
                "reviewBody": "Five stars for a great filling! I needed a cocoa filling to fill cupcakes for my son's birthday so I just changed 2 ingredients in this cream filling recipe and it turned out great! I used all butter (didn't have shortening) and I replaced 1/4 cup of the confectioner's sugar with unsweetened cocoa powder. I also filled my cupcakes from the top since I was going to frost them. By the way I used a triple chocolate fudge cake mix for the cupcake and a vanilla buttercream for the frosting (my son's favorite). The cream filling recipe with the changes I made generously filled 24 cupcakes. Everyone loved the finished cupcakes - kids and adults!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "renorunningmommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485555/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-28T06:53:12.673Z",
                "reviewBody": "These are so delicious and they turned out wonderful! I left out the shortening in the filling and they still tasted magnificent! I think these are the best cupcakes I have ever made and I will definately make them again. It took some time for me to fill all of the cupcakes but it was worth it because they taste great. They remind me of Hostess cupcakes only better. They are probably good with chocolate chips in the batter as well...maybe I'll try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "F.D.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1959818/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-08T04:53:30.763Z",
                "reviewBody": "This recipe was OK. Here's what I did to simplify it- cupcake dough=Pilsbury cake mix(choc.) filling=Betty C. whip-cream frosting Frosting= Betty C. choc. frosting THIS MAKES IT SOOOOOOO EASY!!!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jenni_luv_baking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2500844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-10T16:47:11.997Z",
                "reviewBody": "Loved this recipe.  Had been looking for a filled cupcake recipe for a long time and now I have a winner!  The cupcake turned out perfect.  Used the frosting suggested by OCEAN011 and decorated with leftover filling.  UPDATE:  Have made these several times since I first reviewed them and experimented with different fillings, just made the filling by adding a Tbsp or 2 of cheesecake pudding mix (dry) to the original recipe and whipping it...OMG...that is good...really thinned it out so had to add more powdered sugar.  Also I have been just piping the filling into the top of the cupcake with a piping bag and small tip...that way you can leave the liner on and the hole at the top is covered with frosting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NEgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2366917/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-24T02:51:57.013Z",
                "reviewBody": "Just to be clear, I'm not reviewing the cake part of the recipe, just the filling and the idea of a technique for applying it inside. The cake you use doesn't matter. The filling and technique will work with any cupcake recipe. The filling is light and sweet. Instead of milk, I used coffee creamer and the texture and flavor were just perfect. As for putting the filling into the cupcakes, I went from the top instead of breaking the bottom paper, (which makes for an unholy mess on your serving plate.) I was going to frost them anyway, so it didn't matter that a dot of white filling showed through the top. I used a pastry bag with a #22 tube. Buried the tube all the way to the coupler into the cupcake. I squeezed until the cake started to expand, then eased off the pressure as I withdrew it. Worked very well, and it's infinitely easier and faster than cutting the core, removing it, filling and replacing the core. No need for any such gyrations. If you have cake decorating equipment, I recommend this time-saving technique.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cream Filled Cupcakes",
            "description": "Watch how to make easy, moist cream filled cupcakes from scratch.",
            "uploadDate": "2012-09-05T19:47:18.618Z",
            "duration": "PT3M58.738S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd29bfe00-f36c-4c93-a625-464e1e894213%2F2814fbcc-5ae3-4761-a524-add3dbb3b5f6%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1824697362001"
        }
    }
]