[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1256/desserts/fruit-desserts/cranberry-desserts/",
                    "name": "Cranberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26016/cranberry-upside-down-coffee-cake/",
        "name": "Cranberry Upside-Down Coffee Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1082890.jpg",
            "width": 1920,
            "height": 1280
        },
        "datePublished": "2020-06-19T03:06:40.000Z",
        "description": "Cranberries and pecans are baked in the bottom of this cake. Turn the cake over for ooh's and ah's.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 9 inch springform",
        "recipeIngredient": [
            "⅔ cup packed brown sugar",
            "⅓ cup butter",
            "1 ¼ cups cranberries",
            "½ cup chopped pecans",
            "½ cup butter, room temperature",
            "¾ cup white sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "1 cup sour cream",
            "1 ½ cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "1 teaspoon baking soda",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Wrap the outside of a 9 inch springform pan with aluminum foil to prevent leaking. Sift together the flour, baking powder, baking soda, cinnamon and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium heat, combine brown sugar and 1/3 cup butter. Bring to a boil, then pour into bottom of springform pan. Sprinkle with cranberries and pecans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and 3/4 cup sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the sour cream. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Cool in pan for 10 minutes, then invert onto serving platter and carefully remove pan. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Cranberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marjorita Whyte"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.686046511627907,
            "ratingCount": 344,
            "itemReviewed": "Cranberry Upside-Down Coffee Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "355.1 calories",
            "carbohydrateContent": "39.4 g",
            "cholesterolContent": "73.3 mg",
            "fatContent": "21.1 g",
            "fiberContent": "1.4 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "11.2 g",
            "servingSize": null,
            "sodiumContent": "314.9 mg",
            "sugarContent": "25.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-21T10:16:10.21Z",
                "reviewBody": "This cake is very delicious moist and not to mention absolutely beautiful. The tartness of the cranberries the crunchiness of the nuts and sweetness of the gooey topping complement each other extremely well. I did make adjustments though.For the topping ingredients I chose to chop a few of the cranberries in half so it would cover the bottom of the pan more evenly. I used a mix of crumbled pecans walnuts and a sprinkle of sunflower seeds instead of using only pecans. I didn't have enough sour cream to fill 1 cup so I used 1/2 cup sour cream and 1/2 cup vanilla yogourt which worked just as well. I used an 8\" springform pan and because it is slightly smaller in diameter compared to the average 9\" pan that most people used I knew I had to increase the baking time a little bit. Also according to some reviews 60min was not long enough to fully bake the cake and 350 degrees was too high. From this info I baked my cake at 325 degrees for around 75-80min and it came out perfect and even. For this cake I'd definitely recommend using a pan no bigger than 9\" because it's a pretty short cake. In the future I will continue using an 8\" or maybe even a 7\" pan. For me this cake took quite a bit of prep and baking time but it's definitely worth the trouble and wait. When serving I decorated each slice with a light sprinkle of toasted coconut and a dallop of whipped cream on the side.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ggglitch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1506712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T15:10:26.33Z",
                "reviewBody": "I cannot believe I did rate this recipe. Everyone loved it. My aunt made it with walnuts and she said it was delicious. I didn't change anything in the recipe and it was great. My husband did ask for a little more cranberries next time though. I always wrap the springform pan in alum. paper and set it on a pan. I also found that putting a square of parchment paper at the bottom of the pan (bigger so that the edges are outside the pan in between the bottom and the round) prevent any leakage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "XVELVETX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1164899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-26T05:08:28.367Z",
                "reviewBody": "This cake looks very impressive!!! I give it five stars for its appearance and four stars for its taste. I say just forget about wrapping the springform pan in foil. My foil sprung a leak! It would be much better to slip a foil-lined cookie sheet under the pan itself. Much easier and more foolproof.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SQUEAKYCHU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/269220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-30T23:27:40.56Z",
                "reviewBody": "There is no reason to use a springform pan for any upside down cake.  Use a cake pan which should be heavily buttered bottom only, not the sides. After baking let sit 5 minutes (not 10) then run a knife around cake. Place serving plate upside down on cake pan and invert.  It is a great recipe except for the spring form pan, but I knew better, thank goodness.  Just had to let other cooks know too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Patsy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5940610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-04T19:27:14.22Z",
                "reviewBody": "Wow! What a beautiful and delicious coffee cake - perfect for the Christmas holiday season. I followed the batter part exactly but for the topping I used 1/2 c. of butter a 12 oz. bag of cranberries 3/4 c. of nuts (you could use walnuts or pecans) and a little more than 2/3 c. of tightly packed brown sugar. I didn't bother using a saucepan to boil the butter and brown sugar I just used a microwave safe bowl to melt the butter and then added the brown sugar. I put a cookie sheet under the foil lined spring form pan and it took a little longer to bake - about 70 minutes. I drizzled the top with melted white chocolate - mmmmmmmm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-14T18:38:43.687Z",
                "reviewBody": "This is a Delicious and very easy Recipe! I used dried cranberries instead of the fresh cranberries. I poured the dried cranberries into some hot water for 1 minute to reconstitute. I dried the wet cranberries off with paper towels and then added them to the mix. I took this Coffee Cake to a morning Red Hat Society Meeting. There was nothing left except the plate to bring home. I took a copy of the recipe with me in case someone asked for the recipe. Several people asked for a copy of the recipe. I will positively bake this Recipe again for my family and friends.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CREWZETTE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/613206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T21:24:05.763Z",
                "reviewBody": "This was heavenly. I used my Pampered Chef deep dish baker for this (12 inch stoneware round dish). The topping needed to be increased due to the larger size pan. I used 3/4 cup brown sugar 1 cube butter 2 cups cranberries 1 cup chopped pecan 1/4 tsp. salt. for the cake batter I increased the vanilla to 1 tablespoon cinnamon to 1 teaspoon and salt to 1/2 teaspsoon. I prepared the pan by buttering the bottom and sides. It slipped right onto the serving dish with no problems after cooling for 10 minutes. Rave reviews in presentation and flavor. Perfect spicy sweet/tart combination. Thank you Marjorita for sharing this fabulous recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANINE PERKINS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/671975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-22T23:48:08.717Z",
                "reviewBody": "I made this in a Pampered Chef deep dish baker by increasing some ingredients as listed by another baker below. For topping-3/4 C brown sugar 1 stick butter 2 C cranberries 1 C pecans. For cake-1 TB vanilla 1 tsp cinnamon 1/2 tsp salt. What a beautiful cake this is once it's turned over on a glass pedestal dish. It is just as delicious as it is beautiful. Heat up in the microwave once it cools to bring back the wonderful warm taste of the topping. Can't go wrong with this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAULAV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-22T04:06:51.5Z",
                "reviewBody": "I found this recipe right before Christmas last year and it was such a hit at our Christmas Eve party that I've had requests to bring it again. I switched it up with blueberries for a baby shower and made it with cherries and almonds for a summer barbeque.......this is one of my favourite recipes ever!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FAIRUZAH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/277659/"
                }
            }
        ]
    }
]