[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15852/appetizers-and-snacks/meat-and-poultry/meatball-appetizers/",
                    "name": "Meatball Appetizer Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26616/lanas-sweet-and-sour-meatballs/",
        "name": "Lana's Sweet and Sour Meatballs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F666917.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2020-06-19T03:06:59.000Z",
        "description": "A wonderful savory meatball and sweet sauce recipe that works as a main dish, or you can use just the meatball recipe part for parties. I recommend serving over white rice.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds lean ground beef",
            "2 eggs",
            "1 cup dry bread crumbs",
            "½ cup finely chopped onion",
            "½ teaspoon ground ginger",
            "1 teaspoon seasoning salt",
            "½ teaspoon ground black pepper",
            "2 teaspoons Worcestershire sauce",
            "2 teaspoons granulated sugar",
            "1 (20 ounce) can pineapple chunks, drained with juice reserved",
            "⅓ cup water",
            "3 tablespoons distilled white vinegar",
            "1 tablespoon soy sauce",
            "½ cup packed brown sugar",
            "3 tablespoons cornstarch",
            "½ teaspoon ground ginger",
            "½ teaspoon seasoning salt",
            "1 large carrot, diced",
            "1 large green bell pepper, cut into 1/2 inch pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a large, shallow baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, thoroughly mix the ground beef, eggs, bread crumbs and onion. Sprinkle with ginger, seasoning salt, pepper, Worcestershire sauce and sugar. Shape into one inch balls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place meatballs in a single layer on prepared baking sheet. Bake in preheated oven for 10 to 15 minutes; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the sauce, mix enough water with the reserved pineapple juice to make 1 cup. In a large pot over medium heat, combine the juice mixture, 1/3 cup water, vinegar, soy sauce, and brown sugar. Stir in cornstarch, ginger and seasoning salt, until smooth. Cover and cook until thickened.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir pineapple chunks, carrot, green pepper and meatballs into the sauce. Gently stir to coat the meatballs with the sauce. Simmer, uncovered, for about 20 minutes, or until meatballs are thoroughly cooked.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Meat and Poultry",
            "Meatball Appetizer Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LANAN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.546255506607929,
            "ratingCount": 908,
            "itemReviewed": "Lana's Sweet and Sour Meatballs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "427 calories",
            "carbohydrateContent": "42.1 g",
            "cholesterolContent": "124 mg",
            "fatContent": "16.5 g",
            "fiberContent": "2.1 g",
            "proteinContent": "27.4 g",
            "saturatedFatContent": "6.2 g",
            "servingSize": null,
            "sodiumContent": "479.3 mg",
            "sugarContent": "27.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-30T09:05:38.053Z",
                "reviewBody": "Delicious recipe!  As other reviewers have mentioned, the amount of sauce is very scant in proportion to the meatballs (this made about 50 one-inch meatballs).  If you're serving as an appetizer, I'm sure the single batch of sauce is fine.  But if you're serving as a meal and like enough sauce to flavor your rice as well, you'll definitely need to double the sauce recipe.  I did so (using 4 TBS cornstarch) and it made just the right amount.  I think I will increase the oven time for the meatballs to 20 mins next time since I believe they'll hold together a little better in the sauce if they're cooked just a tad longer in the oven first.  I added the pineapple chunks during the last 5 mins of simmering as suggested by another reviewer.  I'm sure this yummy sauce would work well with just about any kind of meat.  Thanks for a wonderful recipe! :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DISCOBUNNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/153632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T03:32:57.903Z",
                "reviewBody": "This recipe was simple and easy to follow - the results were yummy too. However the amount of sauce indicated isn't nearly enough to allow for a proper simmer so you should probably make 1.5 times the amount or double it. If you are in a hurry (or wish to confirm that the meatballs are thoroughly cooked) you can let the meatballs bake a little longer (additional 5 minutes) while you prepare the sauce. FYI - The finished product will almost fill a 9\" x 13\" container (depending on the amount of the sauce).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AVE.LEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/920827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-06T08:51:44.937Z",
                "reviewBody": "Still the best sweet and sour meatball recipe ever! Need a fast dinner?  Use the sauce recipe with store bought meatballs and use frozen bell pepper slices. The sauce is great over chicken too.\nHINT**Don't add any salt to the sauce until after you have added the soy sauce. It can make a big difference! I had never thought to cook meatballs in the oven before, this works great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2689573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-30T23:32:05.043Z",
                "reviewBody": "This is a family favourite at our house! I omit the carrot green pepper onion and ginger for personal preference and use crushed pineapple. (my husband hates pineapple but likes it crushed in this recipe! lol) I half the recipe but make the full recipe for the sauce. I serve it over rice I have made this several times and it always turns out great! Thanks Lana!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MJLEPAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1206248/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T03:00:06.657Z",
                "reviewBody": "Outstanding! The meatballs were delicious. VERY tasty...I cut the meatball recipe in half and used the same amount of sauce without cutting that part in half and it was just enough sauce. Would even double the sauce next time and still only use 1 lb. of ground beef. Hubby said he could eat these meatballs every night! I served it over brown rice and it was a hit! Great recipe. I can't say enough good about it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PEGGY1407",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/800730/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T19:47:45.747Z",
                "reviewBody": "Some of the best meatballs I have ever tasted. I doubled the recipe and made two batches, one for each party. Everyone loved the recipe so much at each party, I was told I need to make it for every family party. \r\n\r\nIn addition - I have since made this for a family reunion. Other extended families came up to me and told me they KNEW these were not frozen meatballs from the store. I was referred to as the 'meatball girl' and they have begged me to share the recipe with them. I am telling you - this is a great recipe for meatballs!\r\n\r\nWhen I was done making these meatballs, I transfered it to a crockpot and left it on low and it kept them nice and warm for the party. A must make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DESIGNSBYBRIANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/832196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T09:24:14.467Z",
                "reviewBody": "The meatballs were one of the best I've made so far hence the 5 star rating. I enjoyed the sauce but it was a tad too thick in my opinion. I would reduce the cornstarch down to 2 tbls next time. I added a dash of allspice to the meatball mixture and left out the carrots. I'll definitely use this recipe again for the meatballs and serve them with spaghetti. Good recipe Lana.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-14T18:54:33.793Z",
                "reviewBody": "This is an awesome recipe! I used premade meatballs which made it a little easier. I will add this to our family favorites. Quick and easy all the way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TLACPAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/650841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T20:47:38.74Z",
                "reviewBody": "VERY tasty...I cut the meatball recipe in half and used the same amount of sauce without cutting that part in half and it was just enough sauce. Would even double the sauce next time and still only use 1 lb. of ground beef. Didn't add the drained pineapple as husband wouldn't have liked it and just served the pineapple as a side dish. Hubby said he could eat these meatballs every night!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HappyHousewife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/85893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-18T05:48:32.227Z",
                "reviewBody": "Eh. These were average at best. I guess I'm in the minority here as these seem to be a winner for most folks. I still stand true to MEMBER81872's sweet and sour meatballs. They were the first I ever tried (I stumbled upon the recipe in the Allrecipes cookbook I received ages ago) and are by far the best - EVER!!!:) Lana's MB's were mediocre in comparison. It just goes to show you that sometimes the overlooked recipes on here are the real gems (Member's recipe has only 24 reviews). I usually find myself tweaking new recipes but didn't make any major changes this time. All I did was substitute a red bell pepper for the green one called for (happened to have one handy) and halve the MB portion. I don't consider either of these modifications drastic enough to significantly alter the recipe and they in no way swayed my rating. I kept everything else as is and am glad I did. I had plenty of sauce to cover my MB's and veggies with. Served atop steamed white rice with Hawaiian rolls on the side this was an allright meal. I'm glad to have given your recipe a try but the vote at my house is no repeat (sorry!). Thanks anyways Lana!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            }
        ]
    }
]