[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/712/world-cuisine/european/eastern-european/",
                    "name": "Eastern European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/716/world-cuisine/european/eastern-european/russian/",
                    "name": "Russian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26670/taylors-piroshki/",
        "name": "Taylor's Piroshki",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2681614.jpg",
            "width": 2165,
            "height": 1465
        },
        "datePublished": "2020-06-19T03:07:00.000Z",
        "description": "These are as authentic Russian as you can get without traveling to Russia. I received the recipe from my Russian language teacher in high school and have been making them ever since. The kids like them too! They take a little time to roll out - but then doesn't anything 'authentic' take a little time?",
        "prepTime": "P0DT1H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "35 to 40 piroshki",
        "recipeIngredient": [
            "1 ½ pounds ground beef",
            "1 onion, finely chopped",
            "1 teaspoon salt",
            "ground black pepper to taste",
            "dried dill weed to taste",
            "1 (.25 ounce) package active dry yeast",
            "¼ cup warm water",
            "1 cup milk",
            "3 eggs",
            "½ cup vegetable oil",
            "2 tablespoons granulated sugar",
            "1 teaspoon salt",
            "4 cups all-purpose flour",
            "3 cups oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium skillet over medium heat, cook the ground beef until evenly browned; drain. Stir in the onion and cook with the beef until translucent. Sprinkle in salt, pepper and dill weed to taste. Allow to cool before using.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve the yeast in the 1/4 cup of warm water and place in a warm location until frothy, about 10 to 15 minutes. In a medium saucepan over low heat, warm the milk and gently whisk in the eggs, oil, sugar and salt. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place half the flour in a large mixing bowl and gradually stir in the milk mixture. Then add the yeast solution alternately with the remaining flour, stirring after each addition. Mix well. Knead until the dough forms a ball and does not stick to the bowl. (Note: Start with the 4 cups of flour. You may need to add more, a little at a time, as you knead the dough). Cover the bowl with a clean cloth. Set in a warm location and allow to rise until doubled in volume.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove dough from bowl and place on a lightly floured surface. Pinch off pieces approximately the size of golf balls. Roll the pieces into disks about 3 1/2 to 4 inches in diameter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill center of each disk with a heaping tablespoon of the cooled meat mixture. Fold disks over the mixture and firmly pinch edges to seal. Arrange on a flat surface and allow to sit approximately 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In an large, heavy skillet or deep fryer, heat the oil to 375 degrees F (190 degrees C). Deep fry the piroshki in batches until golden brown on one side; gently turn and fry the other side. Remove and let drain on a plate lined with paper towels.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Eastern European",
            "Russian"
        ],
        "recipeCuisine": [
            "European",
            "Eastern European",
            "Russian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "TAYLORSMOMMY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.58235294117647,
            "ratingCount": 170,
            "itemReviewed": "Taylor's Piroshki",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "446.5 calories",
            "carbohydrateContent": "42.4 g",
            "cholesterolContent": "67.1 mg",
            "fatContent": "24.7 g",
            "fiberContent": "2 g",
            "proteinContent": "13.5 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "478 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-09-29T03:50:00.727Z",
                "reviewBody": "I have noticed that many people have complained about the dryness of the meat. Im russian and I have made countless piroshkis in my lifetime and would have to say this recipe is almost spot (for the dough that is). I wouldn't cook the ground beef and actually I would use half ground pork half ground beef and add about 1/4 cup of water to the meat mixture, the more onions and garlic and other seasonings you add the tastier it will be so don't skimp on that and please please don't use dried ingredients that takes away the authenticity of this awesome dish. There is absolutely no reason to cook the meat before you fry or bake them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "midnitglory",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2508659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-18T22:20:00.483Z",
                "reviewBody": "THank YOU!!! I have been trying for several years to duplicate the delicious piroshki recipe my late Grandmother, born and raised in Russia, used to make us as children. The night we made these my brother walked in and grabbed one.  \"THESE ARE THEM, THESE ARE THEM!!\"  It was a great acheivment after so many failed attempts that never even came close.  I made so many batches night after night this holiday I think my family and friends finally had enough piroshi till next Christmas.  My Mother reminded me that my Grandmother also used to make them with cabbage and hard boiled eggs.  We did'nt do the eggs but we did have some with cabbage that were good.  We also thought of using the dough but adding spaghetti sauce, peperoni and chese for an Italian version.  (Sorry Grandma) Anyway if I never use another recipe again I will treasure this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JILL BABAJKO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/547301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-25T02:07:11.637Z",
                "reviewBody": "I didn't fry these, but baked them at 400 for 17-18 minutes.  I think I made them bigger than recipe stated, but they were very filling and the kids seemed to like them.  Only negative comment was that it was a little \"plain\", even with cheese added to it.  I LOVED them. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Corinna Campbell Kirk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1811133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-13T02:13:47.373Z",
                "reviewBody": "EUREKA! This recipe does taste like the piroshkis I remember eating in my childhood when I would be treated to piroshkis at my friend's russian grandmother's house. They were always fondly remembered but never duplicated until now. Mine turned out a little dry perhaps I drained the meat too well? I'm looking at other web sites now for similar recipes and one says a russian chef told her that dryness is a problem the chef adds bits of suet in the meat or chopped up frozen beef stock. Another recipe adds beef stock and butter to the meat to make it wetter. Some recipes add chopped up hard boiled eggs. I notice reviewers here added cheese. I cut mine open and added some cheese and it tasted good. Roll your dough thin thinner is better it puffs up thicker when you fry it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MSPIGGLEWIGGLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/993251/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T22:12:21.323Z",
                "reviewBody": "This recipe is best using the time-honored tradition of using roasted beef and then grinding it in a hand-cranked meat grinder. Totally old-fashioned, yes, but it yields unmatched richness. (Ground meat lends a much harsher and hollow flavor) (Trust me, I've eaten these for 40+ years). Ironically, though, if you want to cut time on making the dough- frozen Bridgefield bread loaves, thawed and rolled out, yields virtually the same taste as far as the bread is concerned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1592675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T04:26:29.307Z",
                "reviewBody": "these are the best...they taste just like the ones i look forward to each year at the local fair.  i fried some and baked the rest for about 15-17 mins at 400---like suggested.  great recipe, will definitely make these again :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chryzc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1583982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-16T06:39:59.687Z",
                "reviewBody": "Overall I give it a five this was delicious I add some mushrooms bacon bits with some cheese but it was great either way. Quickness I rated five because I alway prepare my indgredints before I make it by two hours so I just through it together eainess a five also because it goes in hand with Quckness. Kid friendly a five for obvious reasons Thankyou for giving us the recipe I've never made these before Im very impressed!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAPPY FROG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/564905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:57:08.257Z",
                "reviewBody": "I'm making 25 bag lunches for fishermen who will be out on a lake with no cooking facilities on Saturday. I decided to enclose the Easy Ham and Cheese sandwiches using this Piroshki dough. Talk about excellent! The dough was pliable and soft enough to enclose the ham cheese and sauce. It should be less messy for the guys than a regular sandwich. Thanks Taylor's mommy! I'll come back another day and make the filling that goes with this Piroshki.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T18:04:37.387Z",
                "reviewBody": "They just didn't taste like I remember a piroshki tasting. I'll have another go at them and see what happens.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Marc Minish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2980716/"
                }
            }
        ]
    }
]