[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
                    "name": "Custards and Puddings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14442/desserts/custards-and-puddings/rice-pudding/",
                    "name": "Rice",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27131/creamiest-rice-pudding/",
        "name": "Creamiest Rice Pudding",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1065253.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2020-06-19T03:07:03.000Z",
        "description": "OK, so it's a little time-consuming to make this on the stovetop, but for a real rice pudding fan, it's worth every minute. My husband says it reminds him of the rice pudding he used to get as a child at a restaurant.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT8H0M",
        "recipeYield": "1 - 9x13 inch dish",
        "recipeIngredient": [
            "½ gallon milk",
            "1 cup white sugar",
            "1 cup uncooked long-grain white rice",
            "3 eggs, lightly beaten",
            "¼ cup milk",
            "¼ teaspoon salt",
            "2 teaspoons vanilla extract",
            "ground cinnamon to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium-low heat, combine 1/2 gallon milk, sugar and rice.  Simmer, covered, 1 hour, stirring frequently.  Remove pan from heat and let rest 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine eggs, 1/4 cup milk, salt and vanilla.  Stir into rice mixture and return pot to low heat, stirring constantly, for 2 minutes.  Pour into a 9x13 inch dish and cover with plastic wrap, folding back the corners to allow the steam to escape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When pudding has cooled to room temperature, remove plastic wrap and sprinkle surface of pudding with cinnamon.  Cover tightly (with fresh wrap) and refrigerate 8 hours or overnight before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Custards and Puddings",
            "Rice"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BONNIE Q."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.575136612021858,
            "ratingCount": 732,
            "itemReviewed": "Creamiest Rice Pudding",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "227.9 calories",
            "carbohydrateContent": "37.7 g",
            "cholesterolContent": "59.8 mg",
            "fatContent": "4.7 g",
            "fiberContent": "0.2 g",
            "proteinContent": "8.3 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "134.8 mg",
            "sugarContent": "24.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-07T21:47:43.327Z",
                "reviewBody": "I absolutely LOVE this recipe!  I have made it at least 6 times now and have learned a couple tricks along the way...  After trying several different things, some on my own, some according to some other reviewers, I have learned that the original ingredient suggestions are best, except I add one additional egg for extra richness/thickness.  I prefer this recipe with whole milk, although I think any milk will work.  The key to this recipe is in the length of time you cook it.  You have to be patient!  I found it works best if you bring the mixture to a boil first before starting your \"1 hour\" cooking time.  Once you add the egg mixture, cook this until it gets to the thickness you want it...  it does NOT get thicker while standing or overnight.  However you take it off the stove is how thick it will be - period.  So if it seems too runny to you, KEEP COOKING!  Also, making the egg mixture before you begin so that it comes to room temp is also key, and then stirring constantly for about 2 minutes once you add it.  Also, I think this pudding is just as good warm as it is cold.  It's very versatile that way and would be great served either way.  Overall this is a very easy and very affordable recipe that just turns out DELICIOUS every time!  I must make it once a week now!  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Cinaglia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/663620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-15T23:53:50.613Z",
                "reviewBody": "This is the greatest. I needed a good rice pudding recipe for a party a freind was having, so i looked here and found this one. I figured i would try it, well my stove stopped working so I put the milk and sugar and rice in my crock pot. It turned out to be the hit of the party. So the next time i made it i did it in the crock pot again this time i waited for the milk to get warm before adding the rice and it was even better. This should be rated more than 5 stars and it is worth the wait. In the crock pot it took almost three hours but if your not in a hurry it's a great way to do it cause you don't have to babysit it.i just didn't poor the egg mixture in until it came to the thickness I wanted then after the egg mixture was in i put in on low and let it cook for 20 more minutes. it was the first thing gone at the party",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bobbi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2206970/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-19T01:34:55.61Z",
                "reviewBody": "I'm a rice pudding afficionado, and this is a fantastic recipe. Some recipes you see call for the rice to be cooked in water first, which is a bit easier and faster, but doesn't make for very creamy pudding. \n\nI've made this particular recipe several times and found that an hour of cooking time simply isn't enough. I cooked the pudding on VERY low heat for 80 minutes after the rice, milk, and sugar came to a low simmer. You have to be patient and check/stir the pudding often (every few minutes), or it will boil over (doesn't really hurt the pudding but makes a heck of a mess). \n\nI increased to sugar by 1/3 cup (we like our desserts sweet) and tempered the egg mixture (I only use 2 eggs or it tastes too custardy) with the cooked pudding before adding the egg mixture to the pudding. Once you add the egg mixture to the pudding, you can only cook the pudding for a few minutes; if you cook it longer than that, you will overcook the eggs, and the pudding will be more like a custard and will have a grainy consistency. The pudding does thicken slighly as it cools, but only slightly, so make sure it's as thick as you want it before adding in the eggs and chilling. \n\nThis takes a bit of effort, but it's well worth it. My husband says it tastes just like our favorite rice pudding we get from a local European bakery. I wouldn't go that far, but I think by substituting heavy cream for some of the milk (a cardiac nightmare but SO good), it would be very close.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANIELA92",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1216770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-06T20:26:41.34Z",
                "reviewBody": "Wow. I used 1 percent milk and short grained rice. A few tips (perhaps obvious to some): 1. Do bring the rice/milk/sugar mix to a low boil first over medium heat, stirring pretty often. This is usually the most annoying part, since it takes a while (~15 min?) and you have to monitor it pretty closely. 2. Once it starts to bubble set the heat to the lowest flame and cover. Check back every 10 minutes or so to stir and to make sure the rice doesn't simmer right up to the lid and start spilling over. If you really can't be bothered, just leave the lid slightly ajar and set the flame a tiny bit higher so the pudding simmers. A wooden spoon set on the rim of the pot helps keep the bubbles down, though it really is best to use a deep pot so there's plenty of room above the surface of the liquid.\n3. i prepare a small mixing bowl with the remaining ingredients: milk, eggs, salt, some ground nutmeg, and a liberal splash of vanilla extract and whisk until uniform  4. This mixture i pour gradually in increments as i stir the ricemix.\nAt the end I also stir in about 2 tablespoons' of cold butter.... YUM...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TERRA3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/566249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-06T22:27:55.963Z",
                "reviewBody": "I have to say if I could I would give this recipe a million stars!! It turned out WONDERFUL!  I followed someone else's advise and made it in the crock pot.. it was just way too easy. I used 1/2 quart of cream, and the rest 2% milk, put that in the crock pot on high.  Once it warmed up I added the rice and sugar, someone else suggested 1/3 cup more sugar so I did that, perfect!  I cooked it on high for awhile, then turned down to low..when the rice was finally tender and whole crock pot was thickened, I then added about 4 big spoon fulls of rice mixture to  my eggs (beaten), 1/4 cup cream, vanilla and cinnamon (to your desired taste), stirring well, then cooked it for another 20 minutes or so.  Divided into 2 glass serving dishes (not sure on the size, 7 x 8 maybe).  YUMMY! Move over Uncle Ben's...we've found a new recipe that is definitely a KEEPER! Thank you for submitting this recipe! LOVE IT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Connie V.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1102020/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-27T02:11:54.86Z",
                "reviewBody": "I edited the recipe to fit into my weight watchers program.  I used non-fat milk, fat free egg substitute and splenda for the sugar and it turned out GREAT!  This is definitely a hit with everyone because it works for me (weight watchers) my father (diabetic) and my hubby (low cholesterol)... this was a winner all around!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Indira",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/402708/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-08T19:34:23.287Z",
                "reviewBody": "My favorite Rice Pudding as a child came from the Horn and Hardarts restaurant chain; one supermarket still carries it. This is what I have been searching for, I am so happy to find this recipe because I can finally make it myself.  After reviewing other comments I knew to stir it on low heat to the consistency of my liking.  \n\nI love coconut so I split the amount of milk cooked with the rice in half using coconut milk; which can be purchased in cans.  Also used a vanilla bean where as I split the pod and scraped out the beans and placed them in the egg mixture. I then took the vanilla pod and placed it in the pot to cook with the rice mixture, removed it when the pan was taken off the heat to cool prior to adding the egg mixture.  I love raisins so I soaked them in hot water to plump them up and added them to the pudding once in the dish to cool. Don’t be afraid to make this recipe it is really easy , and I did not have to consistently stand there and stir it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alfy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2450739/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-21T10:08:26.593Z",
                "reviewBody": "I don't know where to begin. This is the best rice pudding recipe I have ever tasted and I'm not a big fan of rice pudding.This was GGRREEAAT! I read all the reviews and followed the most important directions:1.let the eggs mixture sit out while the rice cooks, 2.add the milk mixture to the eggs before adding it to the pot, and 3. I inceased the sugar by 1/2 cup. But I must say that an earlier review stated that the pudding does not thicken after standing/refrigerating. mine did and very nicely. THANKS EVERYONE FOR THE TWEEKING.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "foodlover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2167386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T05:50:54.983Z",
                "reviewBody": "This recipe was awesome!  I am not sure why people are having trouble with it setting.  Mine was definitely creamy.  I used 2 litres of milk (I converted for Cdn. measurements) and then 1/4 cup of milk for the egg/vanilla mixture, and I beat it really well before mixing into the rice mixture.  You don't have to let it sit overnight - mine was creamy enough already that we ate it warm and covered the rest.  It was great the next day cold as well, and it didn't get soupy or really soggy.  It was worth the hour cooking it.  I did use homo milk (3.25%) and maybe the thicker milk helped?  Great pick!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NLTZGRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/250933/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-07T20:27:51.473Z",
                "reviewBody": "Unfortunately, this recipe didn't make pudding for me. I follwed the recipe exactly, letting it simmer and stirring frequently. I used whole milk. Having read more reviews now I can see that the 1 hour time on the stove wasn't sufficient for many people. But the recipe is poorly written; it gives you no help as to what the pudding should look like after the one hour, doesn't instruct you to keep cooking if you havent reached a particular consistency. So I just proceeded with the recipe and ended up with all liquid. I'm planning on putting it back on the stove to see if I can salvage it but as written this is pretty much a zero star recipe for me. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "notoriousJEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2798486/"
                }
            }
        ]
    }
]