[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27136/emilys-famous-tiramisu/",
        "name": "Emily's Famous Tiramisu",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3212897.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:07:04.000Z",
        "description": "If you really want an all-out fancy restaurant style tiramisu with all the fixin's this is the one.  People will speak of this for years to come.  You can also make it in a bowl like a trifle!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT5H0M",
        "recipeYield": "1 - 9-inch round",
        "recipeIngredient": [
            "5 eggs, separated",
            "¾ cup white sugar, divided",
            "1 cup all-purpose flour",
            "1 teaspoon vanilla extract",
            "¾ cup confectioners' sugar for dusting",
            "1 cup white sugar",
            "1 cup boiling water",
            "½ cup strong brewed coffee",
            "¼ cup rum",
            "1 (8 ounce) container mascarpone cheese",
            "2 cups confectioners' sugar",
            "¼ cup dark rum",
            "1 teaspoon vanilla extract",
            "2 cups heavy cream",
            "2 (1 ounce) squares semisweet chocolate, grated",
            "⅛ cup confectioners' sugar for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Line baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, whip egg yolks and 1/4 cup of sugar with an electric mixer until thick and pale. In a separate bowl, whip egg whites (with clean beaters) to soft peaks. Gradually sprinkle in the remaining 1/2 cup sugar while whipping to medium stiff peaks. Fold the egg yolk mixture into the egg whites. Gently fold in the flour and 1 teaspoon vanilla. The batter should be thick and pale yellow.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Trace two 9 inch circles onto the parchment paper using a cake pan as a guide. Spread or pipe batter to completely fill inside the lines of the circles. Batter should be about 1/2 inch tall.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Load the remaining batter into a pastry bag fitted with a half inch tip or hole. Draw parallel lines onto another piece of parchment that are 3 inches apart. Pipe the batter back and forth just between the lines in a compressed S motion, until you run out of batter. This is the part that wraps around the outside of the cake. (It helps to have it in one piece, but you can pipe individual fingers using the guidelines drawn on the paper, if you prefer.)  There may be extra.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven 10 to 15 minutes, until firm but not browned.  Remove from the oven and dust generously with confectioners' sugar.  Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the syrup, stir together 1 cup sugar, boiling water, coffee and 1/4 cup rum until sugar is dissolved.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the filling, combine mascarpone, 2 cups confectioners' sugar, dark rum and 1 teaspoon vanilla in a large bowl.  Whisk together until completely smooth, scraping the bottom of the bowl to remove any lumps. Gradually whisk in the heavy cream. Whip with an electric mixer until soft peaks form. Stop whipping when the mixture shows the first sign of graininess.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble, line the sides of a 9-inch springform pan with parchment or waxed paper.  Place one of the ladyfinger rounds in the bottom of the pan.  Brush generously, but do not soak completely, with syrup.  Place the 3-inch high ladyfinger strips around the inside edge of the pan, so that the sides are completely covered.  Brush generously with syrup.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread half of the filling mixture over the first ladyfinger round in the pan.  Place the remaining ladyfinger round on top of the filling.  Soak the second ladyfinger round with syrup until it cannot take any more.  Spread the remaining filling over that and smooth the top.  Sprinkle with grated chocolate.  Refrigerate at least 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, remove the sides of the pan and carefully remove the parchment or waxed paper from the outside of the cake.  Dust with confectioners' sugar just before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "HBIC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.626865671641791,
            "ratingCount": 134,
            "itemReviewed": "Emily's Famous Tiramisu",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "558.4 calories",
            "carbohydrateContent": "70.2 g",
            "cholesterolContent": "155.2 mg",
            "fatContent": "27 g",
            "fiberContent": "0.6 g",
            "proteinContent": "6.2 g",
            "saturatedFatContent": "15.3 g",
            "servingSize": null,
            "sodiumContent": "55.7 mg",
            "sugarContent": "60.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-11T18:10:42.467Z",
                "reviewBody": "I love this recipe! The homemade l;ady fingers are awsome and easy to make. I'll never use stale packaged ladyfingers again. I made several modifications to this recipe. Fisrt of all like one other reviewer I found this recipe very sweet. I omitted sprinkling of powdered sugar on the lady fingers. I substituted coffe liquour and creme de cacoa for the rum to give it more chocolate flavor which was one of the coments I recieved the first time I made it. Because they are very sweet I reduced the sugar in the filling by about 1/4 cup. To give it more chocolate flavor I also sprinkled grated chocolate and powdered cocoa on top of both layers. The result was perfect. I also make this in a square pan without the lady finger \"sides\" when I need to bring it to a function. Much easier to cut and serve and still delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NHBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/820675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-26T05:45:42.363Z",
                "reviewBody": "I have made this tiramisu many times. Each time I received RAVE reviews (some people are still talking about the first one I did over 2 years ago). Anyhow...the only thing I change is that I use an equal amount of Irish Cream instead of rum as I personally do not like the flavor of the rum. Aside from that this last time that I made it I tried what one reviewer suggested doubling the marscapone. I would NOT recommend it. The finished product was much firmer and easier to cut (more like that of a cheesecake) but the flavor was just totally off balance. I would recommend following the ORIGINAL recipe amounts exactly as that is the way that I received the most amount of compliments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Torie Fraser Hadjis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/920146/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-11T22:28:03.733Z",
                "reviewBody": "This is tooo sweet. Please do the following: Only lightly dust the ladyfingers For the syrup only use cup sugar 1/2cup water 1/4cup coffee and 2tbs rum For the filling only use 4ozs mascarpone 1/2c sugar 2tbs rum 1/2tsp vanilla 1cup heavy cream use only one ounce chocolate for the topping and dusting confectioner s sugar at the end should be optional.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms.KWilliams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1553316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-16T02:00:29.2Z",
                "reviewBody": "My wife's Mother worked in an authentic Italian deli most of her life. My wife grew up enjoying the best Tiramisu by real Italian cooks. Being who I am I had to make a better Tiramisu to win her heart even more. I made this recipe and I have completely won her heart. I have made this with the ladyfinger recipe and with store bought. The homemade lady fingers taste so much better. The store bought will work in a pinch though. Thanks Emily!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "phreakyzen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2027888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-20T13:42:49.39Z",
                "reviewBody": "Super recipe. To substitute mascarpone you can use cream cheese 16oz 1/2c whipping cream 5 Tbls sour cream. You need about 27-30\" X 3\" to wrap the cake. I make the long side using a cookie sheet lined with a 6\" wide strip of parchment. I spread the cake batter 1/2\" thick on the parchment and bake. I then use a sizzor and cut the strip in half then square up the ends. (You end up with 2 strips that when cut square on the ends is un-noticeable) I leave the parchment paper on and brush with coffee mixture and place in the spring form pan (parchment facing outwards) I use a 9\" spring pan and make 8\" rounds with parchment lined cake pans for the bottom and middle layers. The presentation is incredible. This way you can only see the sides when the pan is removed. I also used emrils coffee and filling recipe with 2 cups of whipping cream instead of one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THOMJANICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/541571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T18:10:28.59Z",
                "reviewBody": "Oh my...!!! I opted out the rum and used cream cheese instead and this was still the best tasting and easiest Tiramisu I've ever made. Even my great cook mom says so. She really loves it and has asked me to make it again next week. The ladyfingers batter was easy to manage and didn't spread out like other recipes I've tried. I was afraid the cheese mixture wouldn't set but it did. So I really had no problems. This recipe is definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hartini",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/441617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-29T14:11:38.777Z",
                "reviewBody": "This was my first time making this and I did not care of it too much. I followed the recipe to a T. The rum flavor was too much to handle for me. The heavy cream layer did have a nice texture and mine did not leak. Also I didn't have enough batter for the outter circle of ladie finger. Although the lady fingers were yummy and I will use the recipe with a diff. filling recipe. I ended up buying ladyfingers for the circumfrance. If any of you live by a Polish deli I suggest the Polish ladyfingers as they are A LOT softer than the Italian ones. Look for a box that says \"Biszkopty\" on them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ChicagoCookie84-Anita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chicagocookie84/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T18:10:37.03Z",
                "reviewBody": "Yum Yum! Wonderful Recipe. Tastes better the longer you let it sit in the fridge. The strong Rum taste went away after the second day. Will Make again. My Husband loved this. One thing I will do differently is soak the bottom layer a little more with the syrup. Mine was just a bit too bready still while the midddle layer just melted away in your mouth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Ayala Simmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/898470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T00:31:32.373Z",
                "reviewBody": "This recipe has WAY too much sugar in it. The ladyfingers were fine but 3/4 cup of powdered sugar was too much; I could not even taste the marscapone cheese over the powdered sugar in the filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "THREERINGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/443706/"
                }
            }
        ]
    }
]