[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15494/desserts/cakes/cake-mix-cakes/layer-cake/",
                    "name": "Layer Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27511/giant-ding-dong-cake/",
        "name": "Giant Ding Dong Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1125765.jpg",
            "width": 5312,
            "height": 2988
        },
        "datePublished": "2020-06-19T03:07:10.000Z",
        "description": "If you are a true lover of the small snack cakes, you will LOVE this version!!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "1 - 10 inch round cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package devil's food cake mix",
            "1 (3.9 ounce) package instant chocolate pudding mix",
            "4 eggs",
            "1 ¼ cups water",
            "½ cup vegetable oil",
            "¼ cup all-purpose flour",
            "1 cup milk",
            "½ cup shortening",
            "½ cup butter",
            "1 cup white sugar",
            "2 teaspoons vanilla extract",
            "1 cup chocolate chips",
            "¼ cup shortening",
            "3 tablespoons light corn syrup",
            "2 ¼ tablespoons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the cake mix and instant pudding.  Make a well in the center and pour in the eggs, oil and water. Mix until well blended. Spread evenly into the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 45 to 50 minutes in the preheated oven, or until a toothpick inserted into the center comes out clean. Cool cake completely on a wire rack before removing from pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice a 1 inch thick slice off of the top of the cake and set aside. Scoop out the cake for  the center of the bottom part to within 1 inch of the sides. Discard or save for another use. To make the filling, whisk together the flour and milk. Cook over medium heat, stirring constantly until thickened. Set aside to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the flour and milk mixture has cooled, beat the 1/2 cup shortening, butter, sugar and vanilla on high speed until light and fluffy. Add the milk mixture and continue to beat for 4 more minutes. Spoon into the center of the cake and replace the layer sliced from the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the chocolate chips, 1/4 cup shortening, corn syrup and water in the top of a double boiler. Heat, stirring frequently  until melted and smooth. Pour warm glaze over the top of the cake and smooth over the sides. Refrigerate until serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Layer Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TheThreeDogKitchen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.703517587939698,
            "ratingCount": 199,
            "itemReviewed": "Giant Ding Dong Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "671.8 calories",
            "carbohydrateContent": "72 g",
            "cholesterolContent": "84 mg",
            "fatContent": "42.7 g",
            "fiberContent": "2.3 g",
            "proteinContent": "6.5 g",
            "saturatedFatContent": "14.2 g",
            "servingSize": null,
            "sodiumContent": "577.3 mg",
            "sugarContent": "49.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-09T12:22:56.627Z",
                "reviewBody": "This is a FUN recipe!  I have made it as a cake and as cupcakes.  For the cake version, I agree that you should make it in layers, rather than putting all the filling into the center.  As cupcakes, I used a pastry bag with a large tip, inserted it into the top of each cupcake and filled until I saw the top of the cupcake rise.  I dipped the top of each cupcake into the glaze and let set before adding the white swirl.  I got 21 cupcakes, filling each 3/4 full and cooking for 18 minutes.  These are better made the day before.  Also, you really need to whip the filling mixture to incorporate all the ingredients well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Auntie D in MN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861084/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-12T16:39:41.263Z",
                "reviewBody": "The flavor of this cake was very good but I guess I'm not a bit \"Ding Dong\" fan....I thought there was too much cream filling in one place. I made this again but as a 3-layer torte with half the cream between each layer and covered with the chocolate glaze. As a torte -- it was one of the BEST cakes I've ever made. The comments were \"which bakery did you get this from?\" -- I love refrigerated chocolate cake and this one is AWESOME!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMP70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/575740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:46:42.87Z",
                "reviewBody": "Loved it! Made it twice in one week! Just a few helpful hints that I feel were left out of the recipe. 1st the recipe doesn't clarify which kind of choc. chips. Don't use milk chocolate use semi-sweet. the milk chocolate never really dried they just stayed shiney sticky and were too sweet. 2nd in the instructions where it says to whip the white center for four minutes I think it should be more like 8-10 that's how long it took for mine to get really fluffy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dori Montoya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/791458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-08-27T23:09:02.137Z",
                "reviewBody": "Well I made this cake just yesterday. I just couldn't do the cutting and scooping out the cake. So I spooned the filling into a decorator's bag and pipped the filling into the cake. I made several holes on top of the cake (I had flipped the cake upside down on a cake plate). Please use the tip that is the most narrow as you do not want big holes at the top of the cake. I must of had about 25 small holes from the nozzle of the bag placing just enough filling making the cake rise a tad. I was able to use all the filling into the cake. I then went and let the cake set while I did the frosting. For the frosting I put more of the chocolate chips in then what I orginally posted the recipe at most likely about 1/2 cup more. This cake is a must for the frig it seems to be more abundance with flavor when it sets for about 2-3 hours. I hope this helps someone. Try using cupcakes! and dip them in the frosting let cool on tray. WOWZA Enjoy everyone Cheryl @ the three dog kitchen",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheThreeDogKitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/41402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-24T17:04:55.037Z",
                "reviewBody": "This cake was a delicious one in deed. However i have to agree that having all the cream in the centre is a little too much. As stated in some reviews that it was not as dry as the real ding dong. It is because you didn't bake it long enough. Made two batches and one was left in the oven for 15mins longer than the other and this is where i found one was dryier than the other. Also i think next time i make this i think i will make it into a jelly roll that you can get from the stores and it tastes like the ding dongs too. over all i think it is best when the cake sits in the refidgerator for at least 12 hours before you eat it. Way better when you wait for it. Thanks for the recipe...it is a definate keeper!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cory Albert Houle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1431675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-20T20:13:42.013Z",
                "reviewBody": "Holy Moly is this good! I made this 3 times in 10 days as everyone loved it!!! It's definitely the new favorite in our home. I used 2 9-inch pans instead of a 10 inch--that way I wouldn't have to scoop out the inside. I think it would be great using 3 pans...made like a torte. A couple of things I've learned...make sure you take the top layer off of the cooked milk/flour combo. It doesn't fully beat into the filing mixture otherwise. Also I put this immediately into the fridge once I've filed it and it sets quite a bit while the topping is made. I plan to make chocolate cookies fill them with the filing and covered them with the chocolate. I think those will be fabulous too!! Oh yeah it melts quickly in the heat so if it's hot where you are don't take it out until you serve it. Great cake!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gennabear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1531432/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-25T22:48:27.607Z",
                "reviewBody": "This recipe was SO good!!! I tested it out on fiance and kids first then took it to work after receiving their 5 star rating. The girls at work went crazy!! All are begging for the recipe!! I did not hollow out the cake - instead I did as someone had recommended and made two 9 inch layer cakes and then split them in half to make a torte-like layer cake. It was so pretty and delicious. People are even wanting to PAY me to make this cake for birthdays!!! Can you believe it!! Thanks again for this great recipe...it was fun to construct and tasted fantastic!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tina Robison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kitchenwitch04/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-30T03:36:18.037Z",
                "reviewBody": "Wow this was such a great idea! I made mine into cupcakes and used a pastry bag to fill them for a birthday party and people were begging for the recipe. I would recommend that you not skip steps and try to use a pre-made filling like cool-whip or whatever. The filling is really nice because it is a cooked frosting essentially so it is not terribly sweet and definitely not grainy so you don't get a cavity per bite!! Just be sure to get the milk and flour thick like paste before taking it off the heat. I thought everything tasted fine with the shortening but I will try to experiment with replacing it for health reasons. Finally I also added the hostess cupcake swirl on the tops since I made cupcakes. They turned out really cute. To make the swirl I mixed a couple tablespoons of butter with about a half cup of powdered sugar and a dash of vanilla and milk (I really hate store-bought frosting and that is so easy anyway). To pipe it I just put it in a plastic baggie and snipped the corner off. Also I thought they tasted better after they sat overnight since the flavors melded together more. Overall excellent idea will do again. So little effort for such a great result!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "brandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2551346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-03T17:23:45.66Z",
                "reviewBody": "Great recipe. Didn't change anything.....but I made mini cupcakes. Got 36 mini's out of this recipe. For those who plan to make this cupcakes are best the day after. If you taste test right away it won't be as good. At least wait til they chill in the fridge. I piped frosting in the middle....used a number 3 wilton tip pushed 1/2 inch down piped til the cupcake plumped up. Super yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "natbakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3615019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-12T18:22:23.92Z",
                "reviewBody": "It was ok - I expected something a little different I suppose. I put marange on top & that was a nice little edition!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefKatie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6283935/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Giant Ding Dong Cake",
            "description": "If you enjoy the tiny snack cakes, you’ll love this!",
            "uploadDate": "2018-01-15T17:54:50.638Z",
            "duration": "PT1M59.052S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2bc00dc9-ca06-41e8-b2ed-7e464cadccaa%2F4986ee89-df42-4f86-b1c9-3a883826f2a2%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5711924196001"
        }
    }
]