[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27342/danish-pastry/",
        "name": "Danish Pastry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6188262.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2020-06-19T03:07:09.000Z",
        "description": "Rich buttery flaky dough that turns pastries into a sinful delight. Worth the effort and extra work involved.",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT0H8M",
        "totalTime": "P0DT3H8M",
        "recipeYield": "3 dozen pastries",
        "recipeIngredient": [
            "2 cups unsalted butter, softened",
            "⅔ cup all-purpose flour",
            "2 ½ cups milk",
            "½ cup white sugar",
            "2 teaspoons salt",
            "4 ½ teaspoons active dry yeast",
            "8 cups all-purpose flour",
            "2 eggs",
            "1 teaspoon lemon extract",
            "1 teaspoon almond extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the butter and 2/3 cup of flour. Divide into 2 equal parts, and roll each half between 2 pieces of waxed paper into a 6 x12 inch sheet. Refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the dry yeast and 3 cups of the remaining flour. In a small saucepan over medium heat, combine the milk, sugar and salt. Heat to 115 degrees F (43 degrees C), or just warm, but not hot to the touch. Mix the warm milk mixture into the flour and yeast along with the eggs, and lemon and almond extracts. Stir for 3 minutes. Knead in the remaining flour 1/2 cup at a time until the dough is firm and pliable. Set aside to rest until double in size.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the dough in half, and roll each half out to a 14 inch square. Place one sheet of the cold butter onto each piece of dough, and fold the dough over it like the cover of a book. Seal edges by pressing with fingers. Roll each piece out to a 20x 12 inch rectangle, then fold into thirds by folding the long sides in over the center. Repeat rolling into a large rectangle, and folding into thirds. Wrap in plastic and refrigerate for at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from the refrigerator one at a time, and roll and fold each piece two more times. Return to the refrigerator to chill again before shaping. If the butter gets too warm, the dough will become difficult to manage.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make danishes, roll the dough out to 1/4 inch thickness. The dough can be cut into squares, with a filling placed in the center. Fold 2 of the corners over the center to form a filled diamond shape. Or, fold the piece in half, cut into 1 inch strips, stretch, twist and roll into a spiral. Place a dollop of preserves or other filling in the center. Place danishes on an ungreased baking sheet, and let rise until doubled. Preheat the oven to 450 degrees F (220 degrees C). Danishes can be brushed with egg white for a shiny finish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven, or until the bottoms are golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cindy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.405063291139241,
            "ratingCount": 79,
            "itemReviewed": "Danish Pastry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "226 calories",
            "carbohydrateContent": "26.8 g",
            "cholesterolContent": "36.2 mg",
            "fatContent": "11.2 g",
            "fiberContent": "0.9 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "142.4 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-06T00:50:53.25Z",
                "reviewBody": "Don't be intimidated by this recipe if you have some experience with baking.  It truly makes excellent danish.  Here are my modifications:  Use your Kitchenaid stand mixer to mix all the ingredients for the butter-less basic dough, then attach the dough hook and knead, adding flour as necessary (about 6-7 minutes of kneading).  I did not use all the flour (I was short by about 1 cup as the dough was getting saturated and I did not want it to dry out or become tough).  Secondly, remove dough hook, remove dough from bowl, spray inside of bowl with non-stick cooking spray, place ball of dough back in sprayed bowl, and spray top of dough with non-stick cooking spray.  Third, cover entire stand mixer with a large plastic bag and allow to rise for about 45-60 minutes (or until dough basically is filling the whole bowl).  Those three steps right there take out all the work of kneading by hand.  I followed everything else to the letter except:  I made an apple filling by peeling 4 large granny smith apples and chopping into very small pieces, adding 1/2 cups of sugar and 1 teaspoon of ground cinnamon.  I then placed the apple mixture on the stove on medium-high heat, added about 1/3 cup of flour, and allowed apple mixture to cook, stirring frequently, until the apples were soft but still held their shape (about 15-20 minutes of simmering).  I then took the apples off the stove and allowed them to sit until I was ready for them.  When I was ready to form the pastries, I took one of th",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1758599/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-20T19:39:39.92Z",
                "reviewBody": "This was one of the best danish pastry recipes I have ever tried!! I cut the recipe in half just in case it didn't turn out (hate to waste good ingredients) and did alter it just a little to be honest. I did use a non dairy margerine and water instead of milk but I had to for dietary reasons. I cannot imagine it coming out better though. It was flakey and light not greasy at all. The recipe called for lemon and almond I was a little eh about that so I used vanilla and nutmeg wich is really just a preference. I also gave the dough 2 turns and then left it in the fridge overnight giving it the last turn in the morning before rolling out. This is a sticky dough so please do not add more flour to it as that will make it tough. Instead flour the table or pastry board evenly not neccessarily generously when rolling. use flour to roll as needed but watch how much you use as with any pastry dough. I also like to brush off the excess as I fold the dough over to minimize the addition of flour. This should be a very soft dough. Also I recommend wrapping in parchment paper as opposed to wax paper. It will not stick as much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Berger ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/michelleberger/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T13:17:08.233Z",
                "reviewBody": "This recipe is somewhat complicated and probably not for the novice baker. But the result is out of this world. The directions are clear easy to follow and give a good idea of the amount of time needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca Crist",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/600966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-01T21:37:42.45Z",
                "reviewBody": "Excellent recipe, though a lot of preparation time is needed.\r\n\r\nI would suggest doing steps 1-3 the day before you want to make the danishes, then keep refigerated overnight.\r\n\r\nIf you like pecans you should try cutting the rolled out dough into 14x1 inch strips, cover with broken pecan nuts and maple syrup. Roll up strips and bake. When done, add a thin glaze of almond icing.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "B.D.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/788415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-13T23:46:36.573Z",
                "reviewBody": "I'm a fourteen year old kid and i could fully understand this. They were wonderful. Try using apple butter or strawberry preserves as a filling. It's yummy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Logan jake cub and eimers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3735261/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-26T13:33:51.047Z",
                "reviewBody": "This is a good basic recipe. I like the simplification of the puff pastry dough method. To begin I halved the recipe. For filling I used one large granny smith apple peeled and thinly sliced cinnamon cup sugar cup brown sugar 3 tbsp. cornstarch and cup water. It cooked over low heat until thickened then pulsed in food processor. I allowed it to cool while I made a cream cheese filling: 1 block cream cheese 2 tsp. sour cream 1 tsp. lemon juice tsp. vanilla extract 1 tsp. corn starch. Other than those changes I followed the recipe. Beautiful pastries! The family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J Fran Blackmon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/landabee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-22T22:04:42.847Z",
                "reviewBody": "Thank you, thank you for this wonderful technique!!! I'm one of those people who rarely follow a recipe exactly. In fact, this time, I used my own dough recipe but wanted to leave a GLOWING review on how this member explained on adding butter & rolling out the dough to make a real Danish pastry.\n\nI've made puff & Danish pastry before but not much as I find it too labour intensive. Placing tiny bits of cold butter on the rolled dough & then folding & rolling, endless number of times got to me.\n\nBut the idea of mixing some flour with soft butter, rolling it into a thin layer, made cold & then used is BRILLIANT! I laud the person who thought of this.\n\nI made my pastry today & am so happy with the results. I used a home-made mix of ground roasted almonds with baked mashed apples, raisins, cinnamon, sugar & some butter as a filling. I dare not make this too often as it tastes so good but is so rich. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jujube Judy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2892304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-05T17:19:02.277Z",
                "reviewBody": "I arbitrarily decided yesterday that I wanted to serve pineapple danish for this morning.  I had the frozen pineapple  to make a filling, just wasn't sure on the pastry.  This is definitely a more sophisticated recipe then many but it works well and is scalable.  I used about a quarter of most ingredients and used one envelope of dry yeast.  Worked like a charm.  Wife loved the result.  If you haven't been successful with this, print out the recipe and read it carefully.  Slow down.  Chill the dough a bit longer.  Don't forget to roll the dough out and fold it extra times.  On your final roll make sure you get it down to 1/4 inch.  Don't forget the rise after you fill the pastry.  It will double - it really will especially if you set it on the stove with the oven on (or recently on).  Good luck and good pastry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jim Wass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7289772/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-01T21:37:47.89Z",
                "reviewBody": "This makes a tasty danish, but, in my opinion, is a little too labor intensive to make it worthwhile.  It was yummy though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LYTHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/37701/"
                }
            }
        ]
    }
]