[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17532/desserts/fruit-desserts/blueberry-desserts/",
                    "name": "Blueberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27478/white-chocolate-blueberry-cheesecake/",
        "name": "White Chocolate Blueberry Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2367440.jpg",
            "width": null,
            "height": null,
            "caption": "White Chocolate Blueberry Cheesecake"
        },
        "datePublished": "2020-06-19T03:07:10.000Z",
        "description": "What could be better? White chocolate, cheesecake and blueberry topping!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "1 - 10 inch springform pan",
        "recipeIngredient": [
            "2 cups crushed graham crackers",
            "1 cup slivered almonds",
            "½ cup white sugar",
            "¼ cup clarified butter, melted",
            "2 tablespoons caramel topping",
            "1 pound white chocolate, chopped",
            "4 (8 ounce) packages cream cheese, softened",
            "¾ cup white sugar",
            "4 eggs, beaten",
            "2 egg yolks",
            "1 tablespoon all-purpose flour",
            "1 teaspoon vanilla extract",
            "½ cup white sugar",
            "1 teaspoon cornstarch",
            "¼ cup water",
            "1 pint fresh blueberries",
            "2 teaspoons lemon juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 275 degrees F (135 degrees C). Make the crust:  In a food processor, blend together the graham cracker crumbs, almonds and sugar until the almonds are ground fine. Pour in the melted butter and caramel while processing, until mixture is combined. Press the mixture onto the bottom, and half way up the side of a 10 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make the filling:  In a metal bowl over a pan of barely simmering water, melt the white chocolate, stirring until smooth. Remove from heat and set aside. In a large bowl, beat the cream cheese and 3/4 cup sugar until smooth. Beat in the eggs and the egg yolks, one at a time. Beat in the flour and the vanilla and blend in the melted white chocolate slowly, beating until the filling is well combined. Pour filling into crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the middle of preheated oven for 1 hour. Then turn off the heat, and crack the oven door an inch, letting the cheesecake cool in the oven to room temperature. Cover loosely and refrigerate overnight before removing from pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make the topping: In a saucepan, combine 1/2 cup sugar and cornstarch. Stir in water and blueberries. Bring to a boil, then simmer for 10 minutes, stirring occasionally. Press through a fine sieve. Stir in lemon juice, allow to cool, and store in a glass jar.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Blueberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Scott M."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7075471698113205,
            "ratingCount": 106,
            "itemReviewed": "White Chocolate Blueberry Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "602.8 calories",
            "carbohydrateContent": "55.5 g",
            "cholesterolContent": "147.9 mg",
            "fatContent": "39.2 g",
            "fiberContent": "1.9 g",
            "proteinContent": "10.7 g",
            "saturatedFatContent": "20.9 g",
            "servingSize": null,
            "sodiumContent": "282.7 mg",
            "sugarContent": "44.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-01T03:20:23.257Z",
                "reviewBody": "I have made this cheesecake several times and it has been devoured each time.  The important thing to note is that it must be refrigerated overnight because thickening occurs as it gets COLD, not as it cools in the oven to room temperature.  I think the first reviewer did NOT follow the instructions on cooling properly. You must make this recipe the day before it is to be served or it will not be firm enough to cut properly.\n\nIt also tastes good and looks beautiful without the blueberry topping- substitute drizzled caramel topping as used in the crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dejadeb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2229423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-23T03:43:11.88Z",
                "reviewBody": "With some alterations. Eliminated one egg. I used 3 eggs and 2 egg yolks. I cooked it according to the instructions but after an hour it was still very loose. Raised the temp to 325 degrees and cooked for another 15 to 20 minutes (watch over it). When golden and appeared more firm I lowered temp back to 275 for about 10 minutes to ensure filling was set. Followed cooling directions as written. For topping I substituted the blueberries with strawberries and then drizzled melted white chocolate over top for presentation. Also did not use almonds in the crust. GOT RAVE REVIEWS FROM GUESTS. Definitely a crowd pleaser.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kareykinns",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/320713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T06:09:46.873Z",
                "reviewBody": "I followed the directions on the crust and the cooking time and I even took an extra step and whipped creme for an additional topping. When this cheesecake cooled it was runny and undone. (in fact I had left it in the oven for an additional 5 min. cooking time before I turned off the oven and let it cool in there) I felt like it was a waste of ingredients and it was a dessert for company so it was disappointing to cut into it and have the consistancy of pudding. Due to all the egg yolk and eggs in it I scraped off the whip creme and returned it to the oven and sent company home without dessert. For cheesecake it had the appearance of being done-but was runny on the inside and the crumbs didn't hold together like a cheesecake crust should-it was like sand. Too much work-too expensive-too bad! I cannot think of anything I did wrong on this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Gunkel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-22T19:28:56.263Z",
                "reviewBody": "This was excellent. I also increased the oven temperature to 300 degrees and kept it in about 10 minutes longer. I found that I had to double the clarified butter to get the crust to a consistency that I could press it into the pan - but it was great. I think I will double the sauce next time - I ran out and had to use pie filling - the sauce is truly worth it. It was quite big so I cut it into slices and froze it - it thawed beautifully. My husband raved about it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KaperKate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/589188/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-13T21:49:02.2Z",
                "reviewBody": "Fantastic. This is my first time baking a whole cheesecake and i couldn't be more pleased. i baked it for my sister's birthday celebration and all her friends loved it and complimented me profusely...(one even cliamed he was going to have a food orgasm haha)I followed the recipe exactly (except I did not have a food processor so I used my blender for the crust) but found that I had to bake it for an extra 20 minutes or so at 300 degrees then turned off oven and left cake inside to let it cool for about half an hour before opening the door a crack. I let it sit like that for approximately another hour then took it out and let it sit on the counter for a bit to finish cooling. I did not have time to refrigerate it overnight but the few hours it had in the fridge was enough. I could not believe it: no cracks (even though I was lazy and did not use a water bath) and no sinking! I smothered some blueberry topping around the border drizzled on melted white chocolate chips wrote on it with icing and garnished it with 16 blueberries that I saved it looked really nice and tasted even better. Oh yeah and I used chocolate graham crackers for the crust yum! My friends and I are both raving over this cheesecake look how long this comment is! Excellent recipe I only wish I could give more than 5 stars! I will definitely be using this recipe again and again! THanks Scott for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JessicaT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-01T17:55:38.707Z",
                "reviewBody": "This was very very very good and I got rave reviews at the potluck I took it too. I used canned blueberry pie filling for the topping because I had it on hand and actually was looking for a recipe to use it in when I found this one... It is a little time consuming and truthfully there are other similar recipes on this site that you get almost as good results so I'm not sure how often I will take the extra time to make it but it will stay in my books as one of my all time best creations!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bev511",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3447252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-11T04:57:53.623Z",
                "reviewBody": "This was absolutely fantastic. EVERYONE loved it. I melted the white chocolate in the microwave on med-high for about 4 minutes total stiring every minute. The taste is like from a fine restaurant. I would have cooked it a little longer before turning oven off and opening the door. Texture would have been a little firmer. But I definately would make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINDY1065",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/387453/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-05T15:34:48.38Z",
                "reviewBody": "I made this cheesecake for our church's 4th of July baking contest and won a blue ribbon! It turned out perfectly with the additional 20 minutes in the oven. Very yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kathy m",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2418479/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-02T19:05:00.983Z",
                "reviewBody": "The recipe is a good one but the cook time and temp are inaccurrate. So anyone who thinks they did something wrong - it's not you. There's 2 lbs of cheese in the recipe. You need at least a 325 degree oven and 1 hour cook time. If you opt for 275 then bake it for 2 hours. At the end of an hour at 325 turn the oven off crack the door and set the timer for another hour. Refrigerate the cake overnight - then remove from the springform pan. p.s: add freshly ground nutmeg to the blueberry mixture. The nutmeg brings out the flavor of the blueberries.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RESONNANT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23167/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "White Chocolate Blueberry Cheesecake ",
            "description": "Blueberries and cheesecake go hand in hand beautifully for this delicious dessert. ",
            "uploadDate": "2019-03-27T20:34:47.381Z",
            "duration": "PT1M39.285S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fbe469b18-a9ee-42be-a695-e98b4e0bb21b%2F70674d70-5e55-48a2-91da-bf675a3bbf17%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6018858231001"
        }
    }
]