[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/699/world-cuisine/asian/japanese/",
                    "name": "Japanese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/31400/chi-chi-dango-mochi/",
        "name": "Chi Chi Dango Mochi",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6899927.jpg",
            "width": 1536,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:07:15.000Z",
        "description": "Soft and chewy Japanese dessert.  A tradition of boy's or girl's day.  Great for a snack for picnics or parties. This recipe is easy to make, but do not try cheating and double it.  The directions should be followed exactly.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "1 pound mochiko (glutinous rice flour)",
            "2 ½ cups white sugar",
            "1 teaspoon baking powder",
            "2 cups water",
            "1 teaspoon vanilla extract",
            "1 (14 ounce) can coconut milk",
            "¼ teaspoon red food color",
            "1 ½ cups potato starch"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan. Whisk together the rice flour, sugar and baking powder; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the water, vanilla, coconut milk and red food coloring. Blend in the rice flour mixture. Pour into the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover the pan with foil and bake for 1 hour. Allow to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the pan of mochi out onto a clean surface that has been dusted with potato starch. Cut into bite size pieces using a plastic knife. The mochi does not stick as much to plastic knives.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Japanese"
        ],
        "recipeCuisine": [
            "Asian",
            "Japanese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "dewny (dewny)"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.656565656565657,
            "ratingCount": 99,
            "itemReviewed": "Chi Chi Dango Mochi",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "140.7 calories",
            "carbohydrateContent": "29 g",
            "cholesterolContent": null,
            "fatContent": "2.5 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "11.8 mg",
            "sugarContent": "13.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-04T18:18:39.51Z",
                "reviewBody": "HELPFUL Hints...Follow recipe to a \"T\".  After baking for an hour it will not look done (except for an inch around the perimeter).  It's OK and really IS done.  Leave it overnight loosely covered with foil.  Must be completely cool before cutting otherwise you end up with odd shapes.  I used the straight edge of my cutting scraper to get even cuts (that you scoop cut veggies etc with).  The purpose of the potato starch is to keep the edges from sticking to everything.  Go EASY as it masks the flavor of the mochi.  I \"spank\" the excess off so they are very lightly covered.  I've baked in both types (metal and glass) and prefer the pyrex as the edges don't get as hard.  Plus the edges soften overnight and are fine to keep.  I added a picture to show how lightly to coat and how neatly the shape turns out when you wait for it to cool (on the yellow plate).  I also grew up in Hawaii and found this to beat out all my Hawaiian recipe books.  Thanks for the post Dewny!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1034121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-18T23:45:57.583Z",
                "reviewBody": "This recipe came out terrifically!  I live in Hawaii and buying Chi Chi Dango is expensive relative to the ingredients and ease of making.  (About a dozen 1.5 inch pieces will sell for $5!)  So I decided to find a recipe and make it myself.  I've made it three times within a week and each time it has come out perfectly.  \n\nI will share some lessons.  For some reason, some stores only have 13.5 oz (not the 14 oz in the recipe) cans of  coconut milk.  It was not a problem.  Also, if you let your kids help you with the potato starch dusting, make sure they go easy.  To them it looks like powdered sugar so they think, the more the better.  I ended up individually dusting off the excess from each piece.  I agree with the previous reviewer to make sure the pan is completely cool before removing so that it keeps its shape.  Lastly, trim and discard the hard edges.  (The sides get crisp as it is against the pan.)  \nI shared the results with many different people and they all said it was the best they ever had.  Thank you Dewny!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NAKAKURA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/772516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-29T15:22:34.84Z",
                "reviewBody": "this came out perfect! be patient and let it cool before cutting it into pieces..otherwise they come out shapeless.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUJUMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/693299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-20T17:09:55.833Z",
                "reviewBody": "It's so good it allows you to play with colors and flavorings! I have tried green tea powder, strawberry, lemon, melon, cinnamon, cappucino, and chocolate flavorings. And all turned out fabulous.   It's so easy to make, too! I just dump everything to food processor and process it for a 10 or 15 seconds before pouring it into the lightly greased pan. Fool proof.  Also try substitute half coconut milk with non dairy whipping cream and you will never look back.   Some tips: a) I bake mine in water bath, bottom rack, for about 1 hour to avoid the crusty edge problem. b) Let it cool down completely at least two hours, overnight better, before flipping it out of the pan. c) Use lightly greased plastic cake knife for easier cutting. d) For safer option, toast the coating starch without oil for few minutes and cool it down completely before using. e) For the neat coating, put coated mochi in a big strainer and shake the excessive starch off.   Excellent recipe! The only bad thing about this mochi is that I can't stop eating them!!  Definitely a keeper. Thanks, Dewny!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrot Cake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/carrotcake/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-22T17:29:01.99Z",
                "reviewBody": "I'm from Hawaii, moved to California and have been looking for a good mochi recipe. This recipe is perfect. The mochi comes out soft and chewy. I made mine pink. Just be patient and let it cool completely. Best is to make it a day ahead and let it cool overnight, then cut in pieces the following morning. Much easier to handle and slice. Also used the trick of wrapping a plastic knife in saran wrap. I never used that method before and it made the cutting soooo easy! I used potato starch to coat. Wonderful - just like the old japanese grandmas used to make for me back home. Followed the recipe to the \"T\". Can't go wrong. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUIW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1304877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T16:11:11.573Z",
                "reviewBody": "In case anyone can only get a larger than 1 LB box of sweet glutinous rice flour and needs to know how much equals 1 lb: I  measured the contents of a 1LB box of Mochiko and it came out to 2 Cups + 3/4 Cup + 1 tsp + 1/4 tsp. give or take a smidge ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cremefilled",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1363503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-12T16:02:27.17Z",
                "reviewBody": "I made this recipe numerous times. The first two times the center took forever to bake, but the third time I raised the foil in the middle and it baked great.  The sides always seemed to overbake, but overall it was yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKINGPASSION",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1373436/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T22:54:02.773Z",
                "reviewBody": "This recipe is terrific! Instead of baking it a 350 degree I bake it at 325 degrees for 1 hour and turn off the oven and left it in for 15 minutes. I also used parchment paper and the edges weren't as hard. My grandchildrens thought I steamed it because it came out so soft and the recipe is easy and they are able to do it on their own. Linda",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Naomi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3436511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-01T23:50:57.013Z",
                "reviewBody": "We enjoyed this quite a bit; couldn't find potato starch to roll the gel sweet in; used tapioca starch instead with great results. (Tried powdered sugar but it threw off the flavor.) Next time we are going to try Mango juice instead of coconut milk and I bet we like that too! Thank You for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AMADOOFUS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/458202/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T22:12:15.89Z",
                "reviewBody": "I attempted making this. I followed the recipe to a T! But I think an hour was way too long on my oven at 350. It seems a bit over cooked and doesn't have the texture that store bought mochi has. the bottom and sides have all crusted slightly. I might give this another go but cutting some of the bake time in the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5805368/"
                }
            }
        ]
    }
]