[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/696/world-cuisine/asian/filipino/",
                    "name": "Filipino",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/32010/filipino-lumpia/",
        "name": "Filipino Lumpia",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8145413.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:07:16.000Z",
        "description": "My stepmother is Filipino. I would watch her make these on special occasions. She never measured what she did, but I think I've got the knack of it. This is one of the best Filipino foods next to pancit - and unfortunately, I don't know how to make that!! You can find lumpia wrappers in Asian food stores wherever they keep their frozen food, and also (if you're lucky) in very large supermarkets.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (12 ounce) package lumpia wrappers",
            "1 pound ground beef",
            "½ pound ground pork",
            "⅓ cup finely chopped onion",
            "⅓ cup finely chopped green bell pepper",
            "⅓ cup finely chopped carrot",
            "1 quart oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Make sure the lumpia wrappers are completely thawed. Lay several out on a clean dry surface and cover with a damp towel. The wrappers are very thin and the edges will dry out quickly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, blend together the ground beef and pork, onion, green pepper and carrot. Place about 2 tablespoons of the meat mixture along the center of the wrapper. The filling should be no bigger around than your thumb or the wrapper will burn before the meat is cooked. Fold one edge of the wrapper over to the other. Fold the outer edges in slightly, then continue to roll into a cylinder. Wet your finger, and moisten the edge to seal. Repeat with the remaining wrappers and filling, keeping finished lumpias covered to prevent drying. This is a good time to recruit a friend or loved one to make the job less repetitive!!\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a 9 inch skillet at medium to medium high heat until oil is 365 to 375    degrees F (170 to 175   degrees C)  Fry 3-4 lumpia at a time. It should only take about 2-3 minutes for each side. The lumpia will be nicely browned when done. Drain on paper towels.\n"
            },
            {
                "@type": "HowToStep",
                "text": "You can cut each lumpia into thirds for parties, if you like. In the Philippines, lumpia was eaten with banana ketchup, but I've never seen it sold in America.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Filipino"
        ],
        "recipeCuisine": [
            "Asian",
            "Filipino"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Jen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.255813953488372,
            "ratingCount": 43,
            "itemReviewed": "Filipino Lumpia",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "550.1 calories",
            "carbohydrateContent": "42.6 g",
            "cholesterolContent": "75 mg",
            "fatContent": "30.6 g",
            "fiberContent": "1.2 g",
            "proteinContent": "24.9 g",
            "saturatedFatContent": "8 g",
            "servingSize": null,
            "sodiumContent": "60.4 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-01T21:22:06.56Z",
                "reviewBody": "These are lumpia's are very good, but in my family we call them Shanghai lumpia.  Regular lumpia to me are a little easier to make.  In my family we used ground beef and cook it before rolling it.  While the beef is cooking add your seasonings depending on what you like, we add garlic powder, salt, and pepper.  When the meat is cooked add frozen mixed vegetables (or fresh veggies what ever you prefer)and whatever else you'd like.  Just cook long enough to let the water and oil on the bottom cook away.  We add teriyaki sauce for more flavor and then let cool.  If you try to roll right away the wrappers will break.  Once you've rolled the lumpia you can either freeze them for another day or cook 'em in oil until golden brown.  Remember the meat inside is already cooked so all you have to do is brown them.  Also with the wrapper, a lot of people have said they've had a hard time with wrappers breaking, my suggestion is to use the square lumpia wrappers because they tend to be a little thicker than the round once.  You also don't have to wait until the wrapper is completely defrosted, as long as you can work with it you can start rolling right away.  I also use a beaten egg to try to keep the seam closed",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "XQUISITE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/722310/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-01T21:21:05.687Z",
                "reviewBody": "Very good, but not the way I remember them.  I  could have done without the carrots, maybe less bell pepper too.  May I suggest frying them in a shallow layer of oil instead of fully immersing them, to keep the inside ingredients from getting overly oily.  \r\n\r\nI found banana ketchup labeled \"banana sauce\" in a Philipino grocery store.  For those who have not tasted it, it's basically a sweet & sour & hot (or mild) mix of banana and cayenne pepper.  It looks just like ketchup but it has no actual ketchup in it.  It tastes better than you would think on lumpias.  My son and I liked it so much we tried it on everything else we could think of, just to taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANNYANNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/715751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-01T21:22:46.293Z",
                "reviewBody": "My Filipina co-worker and her mother in law taught me how to make this and it has become a party favorite. The easiness level depends on your deftness with the wrappers but don't let it sway you away from trying this. They omit the beef and green pepper and add celery and water chestnuts for crunchiness. To help the filling stick together they add oyster sauce which really gives it a great flavor. It is served with a spicy sweet and sour sauce that I am trying to get the recipe for but your favorite from the store will due. I have never heard of or seen the banana ketchup but I will be asking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISOFORA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/531952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-01T21:21:12.793Z",
                "reviewBody": "This recipe was pretty good; however, I added some basic spices, such as salt, pepper, and garlic powder. The key is to keep the lumpia thin, about as big around as your finger. I also added a few more vegetables, such as green onions and water chestnuts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula Stotts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/680301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-11T21:53:26.08Z",
                "reviewBody": "In my family we use chopped green onions instead of regular onion. It also helps to mix the meat with an egg or two (1 egg per pound of meat) and then seal all the edges with egg as you fold it. We use the round lumpia wrappers cut them in half spoon a heaping teaspoon of meat mixture on top near the cut edge and thin it out in a line about the length of your index finger. Then you you wet the cut edge with egg and fold it over the meat mixture. Wet the two sides with egg and alternately fold them over the meat mixture. Then wet the remaining edge with egg and roll towards it sealing it smooth with your finger. Trust me you now have a heavy-duty eggroll!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "stareynoso",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/876859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-16T00:08:33.03Z",
                "reviewBody": "I cooked my beef and pork before I added the veggies. I also added about 1 tbl. of soy and one egg to the meat and veggie mix. The square wrappers work the best. Make sure to seal them well with water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sahmof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1478596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-26T13:44:07.297Z",
                "reviewBody": "Heavenly!!!! These were the best I've ever tasted. I used egg roll wrappers as I had a hard time finding lumpia wrappers. Thank you for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NINA_BINA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/495012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-20T19:54:00.467Z",
                "reviewBody": "If you can't find lumpia wrappers you can substitute with spring roll wrappers. They work well. Also banana ketchup can be found at most asian markets. I also make lumpia with ground pork and chopped salad shrimp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kinikia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1142951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-05T14:55:15.06Z",
                "reviewBody": "YUMMMMMMMMMMM is all I can say!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGIESTANFIELD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/634756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-15T16:09:08.94Z",
                "reviewBody": "Last night we followed this recipe to the T what we ended up with was bland and burnt food that was not cooked in the middle and we had to microwave to get it cooked. Reason why was because 2 tbsp of filling is WAY too much and it also needs some seasonings added. Today with the leftover meat I added freshly ground pepper and Worcestershire sauce to taste and browned the meat and vegetables. Then I only put 1 tbsp filling into the wrapper and used less oil to cook them in they came out the right size and cooked through and much better tasting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "TheEissilent",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4409890/"
                }
            }
        ]
    }
]