[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/31972/peking-duck/",
        "name": "Peking Duck",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F662217.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2020-06-19T03:07:16.000Z",
        "description": "I have made this recipe and it is delicious. It can be served with plum sauce as well as a fruit sauce. This is actually a short-cut version but it is fantastic.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H35M",
        "totalTime": "P0DT3H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (4 pound) whole duck, dressed",
            "½ teaspoon ground cinnamon",
            "½ teaspoon ground ginger",
            "¼ teaspoon ground nutmeg",
            "¼ teaspoon ground white pepper",
            "⅛ teaspoon ground cloves",
            "3 tablespoons soy sauce",
            "1 tablespoon honey",
            "1 orange, sliced in rounds",
            "1 tablespoon chopped fresh parsley, for garnish",
            "5 green onions",
            "½ cup plum jam",
            "1 ½ teaspoons sugar",
            "1 ½ teaspoons distilled white vinegar",
            "¼ cup finely chopped chutney"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse the duck inside and out, and pat dry. Cut off tail and discard. In a small bowl, mix together the cinnamon, ginger, nutmeg, white pepper and cloves. Sprinkle one teaspoon of the mixture into the cavity of the duck. Stir one tablespoon of the soy sauce into the remaining spice mixture and rub evenly over the entire outside of the bird. Cut one of the green onions in half and tuck inside the cavity. Cover and refrigerate the bird for at least 2 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place duck breast side up on a rack in a big enough wok or pot and steam for an hour adding a little more water, if necessary, as it evaporates. Lift duck with two large spoons, and drain juices and green onion.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Place duck breast side up in a roasting pan and prick skin all over using a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast for 30 minutes in the preheated oven. While the duck is roasting, mix together the remaining 2 tablespoons of soy sauce and honey. After 30 minutes, brush the honey mixture onto the duck and return it to the oven. Turn the heat up to 500 degrees F (260 degrees C). Roast for 5 minutes, or until the skin is richly browned. Do not allow the skin to char.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the duck sauce by mixing the plum jam with the sugar, vinegar and chutney in a small serving bowl. Chop remaining green onions and place them into a separate bowl. Place whole duck onto a serving platter and garnish with orange slices and fresh parsley. Use plum sauce and onions for dipping.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Allison"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.433333333333334,
            "ratingCount": 120,
            "itemReviewed": "Peking Duck",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "555.7 calories",
            "carbohydrateContent": "48.1 g",
            "cholesterolContent": "91.1 mg",
            "fatContent": "31 g",
            "fiberContent": "2.3 g",
            "proteinContent": "22.4 g",
            "saturatedFatContent": "10.6 g",
            "servingSize": null,
            "sodiumContent": "747.8 mg",
            "sugarContent": "42 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-04T17:31:23.75Z",
                "reviewBody": "This recipe was absolute rubbish. You need a good few hours (8+) to render the fat before even thinking about making the skin crispy. An utter failure",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "STARFLOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1126515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T00:21:24.937Z",
                "reviewBody": "I changed this recipe slighty - becasue I don't have a steamer - and I roasted the duck for 2 hours befoer basting it. I also added chinese plum sauce to my honey baste.\r\nIt was delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RVANNIEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-04T01:41:11.45Z",
                "reviewBody": "Very easy compared to tradional peking duck recipes, and very tasty.  I added grated ginger and pieces of star anise into the cavity and used all the spice rub for the skin.  A notes of caution, watch duck very closely when increasing heat (especially if using a convection oven).  Didn't make the homemade plum sauce, instead heated 2 tsp. canola oil in saucepan until hot, then added 1 cup hoisin sauce (it will sizzle) and jusce of 2 limes.  Usually, peding duck is served with \"pancakes\" for wrapping the meat - instead, I used lettuce leaves to wrap the duck, along with basil leaves & mint, then added the sauce - fabulous!  Serve with fried rice or noodles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JPLONG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1453883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-05T18:01:36.08Z",
                "reviewBody": "This is the third time I've made this recipe, its wonderful.  I made it for a small dinner party last.  I bought two 5 pound ducks and marinated for 24 hours with a little garlic on in inside with the green onions. Also used fresh ginger. I don't have a steamer big enough so I just roast it at around 425 for 40 minutes, basting it every ten minutes, then I put on the glaze and turn the oven down to 350 for about 30 minutes glazing and basting every ten minutes then 250 till done.  When I need to crisp it I turn it to broil or 450 checking it often.  I wait until its internal temp is 165.  I serve with Wontons and rice.  Hope this wasn't confusing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kate Last",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1856475/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-13T20:07:24.357Z",
                "reviewBody": "this was excellent. I made the following changes I split the duck along the breast bone and layed it flat before the spice rub, refrigerated overnight.I gently pricked the skin to render most of the fat. Steamed for about 2 hours. I made 3 different dipping sauces, the plum in the recipe, orange sauce made with orange marmalade, and a sweet and sour sauce. The duck was juicy with a nice crispy skin. Not a scrap was left. \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOGAN813",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/891509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-27T16:15:51.383Z",
                "reviewBody": "My husband said this was the best duck he ever had, and he has had Peking Duck in Peking!  The roasted crust was great and the meat very succoulant.  I prefer a saltier taste, so I will add salt next time.  The steaming then roasting process was key to the tenderness of the meat, as duck is often cooked too dry.  Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "texanbelle71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1208380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-30T19:02:46.157Z",
                "reviewBody": "I have never made peking duck; however i tried it when friends and family came over (guinea pigs). I didn't have a steamer but I had a roasting pan with holes on top  as well as a rack that went with it on top. I poked holes in the duck with the fork after I had it sit with the spice marinade overnight. I did place green onions and a chopped garlic clove in the cavity. I placed water in the bottom of the pan and cooked with foil cover at 375 degrees in convection oven for an hour. I drained the fat and then placed it back on the rack with foil. At this point I basted it with the soy/honey every half hour. (still returned foil on top) I tried to turn up to 475 but smoking and too hot. Turned it down to 400 and continued cooking, basting with the sauce every 20 minutes. It did get a bit darker and not too fatty. I turned on broiler for about 5-10 minutes to make skin crispier. Delicious. Friend who doesn't like duck and had tried peking duck before truly enjoyed it. I doubled the sauce recipe but used plum sauce instead of jam and used mango chutney (did chop up the bigger chunks). Delicious. First time making duck. Definitely a hit. Will make again. Took approximately 2 1/2 hours to cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EntertainingHen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1332749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-05T16:35:40.757Z",
                "reviewBody": "I absolutely love duck! I was so excited to see this on here. Followed exactly and it turned out wonderful. If you really like duck I would get a little bigger duck for more servings. I used a 5lb and it was barely enough for my husband and I once you get the meat off.Very good and will make again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kara Davidson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1740897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-01T13:15:47.777Z",
                "reviewBody": "How about Peking Chicken? I made this using chicken instead of duck. the steaming process really made for a very moist and tender chicken. You may want to very slightly reduce the spices a little since the chicken has a milder flesh. Overall very nice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "seaweasel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861202/"
                }
            }
        ]
    }
]