[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
                    "name": "Apple Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/32737/crescent-pastry-puff/",
        "name": "Crescent Pastry Puff",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F75436.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:07:22.000Z",
        "description": "Apples are in a custardy base wrapped in crescent roll dough. This dessert is finished off with a brush of melted butter and generous sprinkling of cinnamon sugar. The first time I made it I had to copy it for 10 different people and make it again the next day for the rest to sample. Then again copy the recipe 10 more times. Please try, you will love it!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "⅓ cup white sugar",
            "1 egg",
            "1 (8 ounce) package cream cheese, room temperature",
            "½ teaspoon vanilla extract",
            "½ teaspoon ground cinnamon",
            "¼ cup white sugar",
            "3 Granny Smith apples - peeled, cored and chopped",
            "2 (10 ounce) cans refrigerated crescent roll dough",
            "1 tablespoon butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Mix together the cinnamon and 1/4 cup sugar in a cup or small bowl, sprinkle about 1 tablespoon of this mixture over the apples, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together 1/3 cup of sugar with cream cheese until smooth. Beat in the egg until light and fluffy, and then stir in vanilla. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Unroll the crescent roll dough, and place the pieces side by side on a large cookie sheet. Pinch seams together to form one big sheet. Place the apples lengthwise down the center. Use scissors to snip the edges into a fringe with strips about 1 inch wide. Pour the cream cheese filling over the apples, and bring the strips from the side up over the apples in an alternating fashion to cover the filling. Pinch ends closed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 35 minutes in the preheated oven, or until golden brown. While still hot, brush the top with butter, and sprinkle the remaining cinnamon sugar over the top.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Apple Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Heidi Gibbons"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.375,
            "ratingCount": 48,
            "itemReviewed": "Crescent Pastry Puff",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "474.7 calories",
            "carbohydrateContent": "49.4 g",
            "cholesterolContent": "57.9 mg",
            "fatContent": "26.8 g",
            "fiberContent": "1.1 g",
            "proteinContent": "8.1 g",
            "saturatedFatContent": "11 g",
            "servingSize": null,
            "sodiumContent": "652.4 mg",
            "sugarContent": "25 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-14T22:41:00.213Z",
                "reviewBody": "Ok here are my suggestions: the custard filling is wayyy too much so I would cut it down by 1/3 next time. Second I used 3 granny smith apples which was more than enough. For the crescent pastry it is very simple. All you do is unroll it carefully and pinch all the seams of the triangles together to restore the rectangular shape without cuts in it. Then placed the apple mixture down the center of the dough lengthwise. Cut a few slits perpendicular to the apples (horizontally in direction of the apples) and bring each band to the top of apples one by one to wrap the apples in a nice almost lattice manner. Pinch sides well to avoid any overflow in the oven. Also to minimize cleanup line your baking tray with parchemint paper or foil b4 putting the pastry on it. Tastes wonderfully delicious! Such an easy recipe and the filling doesnt taste like cheese at all. It tastes more like the custard filling in a danish! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-13T16:08:07.45Z",
                "reviewBody": "This was FABULOUS! Not only did it taste wonderful it looked beautiful too! The only change I made was to add a little bit more of the cinnamon sugar mixture in with the apples. This will become a frequently made item in my household...thanks Heidi!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JWINTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/738082/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-31T21:20:15.733Z",
                "reviewBody": "This was very easy, and it was very tasty too.  I had a hard time trying to figure out how to do the lattice work.  I couldn't figure out how to put the two rolls of crescent dough together - it doesn't say anything about rolling it out or anything.  Anyway, I used the cuts in the rolls themselves to criss-cross over the apples and cream cheese mixture.  I've done stuff like this in a wreath pattern using the same technique (Pampered chef recipes), but you lay out the crescent dough in a circle, then fold it over - I think that would be good too.  Also - I used more of the cinnamon/sugar mixture with the apples.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVLILYNNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1229618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-25T02:14:51.957Z",
                "reviewBody": "This was a huge hit!  The cream cheese filling firms right up after baking to make a nice filling (so don't be afraid of doing the whole amount).  I also prefer MORE apples (with much more of the sugar and cinnamon mixed in)- there is plenty of dough to cover the apple and cheese filling.  I also pre-cooked the apples for about 5 minutes in the microwave so they would be nice and soft in the pastry.  \r\n\r\nSome tips on handling the crescent dough:\r\n\r\nFirst of all make sure your dough is straight out of the fridge and is still cold while handling.  Use a LARGE cookie sheet or jelly roll pan so both cans of dough fit.  Lay them out side by side (longer end of rectangle together) and pinch all seams (or even just buy the new SEAMLESS crescent dough!!).  Before putting filling down the center, make cuts along the two longest sides about 3-4 inches long, and one inch wide.  Then assemble filling to your liking (I liked pouring the cream cheese first and spreading lightly to be even and then spooning the apples over the top of the cheese so the apples peek through the top).  To make a braid pattern- take each strip of dough, twist once and lay across the filling (it doesn't have to go all the way across, just past the middle).  Do this in an alternating pattern switching from one side to the next until the whole pastry is \"braided\".  \r\n\r\nI hope these tips help!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wilsons1998",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7923324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-06T23:30:18.663Z",
                "reviewBody": "This drove everyone crazy just smelling it cook - let alone eating it. I also put more than 1T of the cinnamin sugar mix on the apples - I put at least half and that still left plenty for the topping. Only problem I had was not getting my crescent seams pinched together enough. When I went to cross the 1\" pieces some broke. I also found 3 apples a little too much to easily cover. Maybe 2 to 2 1/2 would be better - depends on the size of the apples. It looked pretty brown after 35 minutes but it tasted perfect. Really great when it's still warm out of the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOMMETT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/860921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-21T00:45:03.937Z",
                "reviewBody": "This recipe turned out very nice. Instead of using cresent roll dough I used the butterhorn recipe from this site as the dough. I let it chill overnight and then rolled the dough very thin on a cookie sheet. It puffed up nicely and came out great! I think next time I make this I won't brush it with butter I think I will just drizzle some carmel sauce over the top. Thanks for this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ali",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1274392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-15T19:56:48.94Z",
                "reviewBody": "Fantastic dessert!! Everybody raved over it at my family reunion. The only thing I changed was that I substituted canned apples for the fresh ones and it was still delicious. Thanks for such a yummy recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GrannyDot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3283050/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-06T14:47:18.827Z",
                "reviewBody": "This did not turn out well for me. There was to much filling and it was gooping out everywhere. No way to \"braid\" it with the filling oozing all over so I finally wrestled it into a pocket of sorts. Wasn't impressed with the final product either. Tasted like apple cheesecake with a cresent roll crust. Leftovers had to be refrigerated and next day were a soggy mess that I ended up just throwing out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Jaxmom35",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1521151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-25T16:39:41.687Z",
                "reviewBody": "This was so yummy! The filling was simple but delicious and using crescent rolls made it very easy. It also had an impressive presentation since the criss-crossed dough over the top looked very pretty - I almost hated cutting it! I made this and another dessert for a gathering and this was definitely the hit. I'll be keeping this recipe in my favorites! Thanks Heidi!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MELISSA_B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247041/"
                }
            }
        ]
    }
]