[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17575/bread/yeast-bread/english-muffins/",
                    "name": "English Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/33121/portuguese-muffins-bolo-levedo/",
        "name": "Portuguese Muffins - Bolo Levedo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8137087.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:07:23.000Z",
        "description": "These are tasty English muffin-like breads from Titia Teolinda in St Micheal, the Azores. They're baked on a griddle, like pancakes.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "15 cakes",
        "recipeIngredient": [
            "1 (.25 ounce) envelope active dry yeast",
            "¼ cup warm water",
            "6 cups all-purpose flour",
            "1 cup white sugar",
            "3 eggs",
            "¼ cup melted butter, cooled",
            "½ teaspoon salt",
            "1 ¼ cups milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, dissolve yeast in warm water with a pinch of the sugar. Set aside to ferment, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the yeast mixture to a large bowl, and stir in the sugar, eggs, salt, flour, and milk until the dough comes together. Stir in the melted butter, then turn the dough out onto a floured surface, and knead for about 10 minutes, or until smooth and elastic. Cover dough with a cloth and set aside to rise until doubled in bulk, about 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough into about 15 to 20 pieces, and shape them into flat round cakes about 1/2 inch thick. Place a cloth on the table and dust it with flour. Arrange the cakes on the cloth, allowing space for rising. Allow them to set for 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the cakes in a heavy ungreased skillet, and cook over low heat. Fry the cakes on each side until golden.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "English Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "J. Pacheco"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.76,
            "ratingCount": 25,
            "itemReviewed": "Portuguese Muffins - Bolo Levedo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "286.6 calories",
            "carbohydrateContent": "52.7 g",
            "cholesterolContent": "47 mg",
            "fatContent": "5 g",
            "fiberContent": "1.4 g",
            "proteinContent": "7.3 g",
            "saturatedFatContent": "2.6 g",
            "servingSize": null,
            "sodiumContent": "123 mg",
            "sugarContent": "14.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-25T01:28:01.657Z",
                "reviewBody": "These were really good - I cooked some in my cast iron skillet, and some in the oven at 325.  The oven ones came out better - the ones in the skillet ended up with gummy sides.  Maybe if they had been thinner, that wouldn't have happened.  These are great for sandwiches, butter & jam, anything.  I could even see them being hamburger buns if you cut down on the sugar and increased the salt by about 1/4 t.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "madball911",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1114625/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-15T20:59:06.74Z",
                "reviewBody": "My family loves bolos and they can be quite expensive. I made 16 from this recipe. I heated my cast iron skillet on low for about ten minutes. I cook 4 at a time and I make sure they touch the side of the pan and then I twist them every few minutes to cook the sides. They do take a while to cook but worth it. I also had to add more flour. I also sometimes add lemon zest or cinnamon and raisins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRETY25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/833611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-22T23:07:29.463Z",
                "reviewBody": "i have no words for how good these are! okay, well...maybe i have a few. ;) my mom's fam is from massachusetts and throughout the years i've always looked forward to being able to eat my portuguese muffins whenever we visit--but these truly surpass anything i've bought in new england. only things i changed: i used a packet of instant yeast instead--it was all i had--and just added it to the flour and sugar before mixing in the wet ingredients. i also added about a tabls. of vanilla extract and 1-2 teaspoons pure lemon extract to make them taste more like the bakery ones. only problem i've experienced is my yeast taking forever to rise--quite ironic since it's quick rise. so i asked a good baker and she said to microwave the dough in a bowl with plastic wrap covering it for 30 seconds on 4 power, and repeat 15 minutes later, and that totally did the trick! anyway, these are awesome, and yummy, and freeze and defrost well too! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarahjay93",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3095851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-20T22:58:16.197Z",
                "reviewBody": "This recipe is fantastic.I did add about 1/2 Cup flour more for it was too sticky.I also used my mixer to knead the dough for about 10 minutes and it came out perfect.When they were ready to cook i used my large electric griddle and was able to cook 6 at a time.I used low heat at about 250 to 300 degrees.My family loved them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRUCKERSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/362193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-20T01:38:14.607Z",
                "reviewBody": "I've had store-bought Portuguese muffins from a nearby natural foods chain many times in the past and they don't compare at all to this recipe! It took quite a long time to cook the muffins on low heat but it could have been that my apartment was on the humid side as the dough also took almost a cup more flour than the recipe called for. Despite how time-consuming these muffins were I will definitely be making them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1601652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-27T22:17:49.257Z",
                "reviewBody": "I used to get these years ago at a little cafe in Burlington Ontario where I'm from. I am so glad I found this recipe because now I can have them any time I want. I kneaded the dough in my stand mixer for 10 minutes then let it rise in a warm oven. I did first pan fry them in butter to get that dark golden brown crust then I baked them in the oven for 10 minutes just to make sure the center was baked through. omg beyond delicious!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Graham",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1012265/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-12T16:34:37.923Z",
                "reviewBody": "Like some of the reviewers the dough took a long time to rise so I now use 1 Tbs plus 1/2 tsp of yeast about one and a half packages of dry yeast. This seems to work fine for me and no it is not too much yeast nor does the dough smell yeasty. I also used 1 tsp of salt instead of 1/2 tsp called for in the recipe. I found that it accentuated the sweetness without the calories. This is truly the best recipe ever for bolos lêvedos. If you use a kneading machine 10 minutes is enough. Make sure you save about 1/2 cup of flour from recipe to add in the end so that the dough pulls away from the sides of the bowl. It makes it easier on the machine. I used King Arthur's flour for bread making and it works. There is no comparison between these bolos lêvedos and the store-bought ones. I have been making this recipe every week. I freeze the bolos in zipperlock bags and thaw one at a time. Thanks Titia Deolinda! P.S. if you are watching what you eat and if you make 16 bolos (not hard at all) out of this recipe each bolo is 5 Weight Watchers points. Good size bolo too...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Açoreana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4773184/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-08T18:16:16.133Z",
                "reviewBody": "Not only was this recipe fairly easy (at least with a kitchen aid doing the work), but the bolo's came out perfectly.  These were a favourite treat growing up when my mother brought them home from the shop and now they are going to be a favourite of my daughters (and husband) when I make them at home.  \n\nI read through the reviews and my experience was so different from many of the others.  Although we all seemed to love the results, it seems that some put way more effort in than I did.  I placed all the ingredients at once into my Kitchen aid and let it go for about ten minutes.  Then I let it rise in my oven with the oven light on for an hour or two.  This resulted in a nice, elastic dough that I kneaded lightly and cut in to 16 parts.  With a rolling pin I rolled (only three rolls in total) the dough balls into flat circles.  I let them rise again on a well oiled parchment paper and gave them an extra coating on top to make sure they didn't stick.  \n\nWhen they were ready to cook, I heated a cast iron griddle on med-low heat and gently placed each patty on to the pan and cooked for 2 minutes a side.  They were perfect.  \n\nHonestly, if I spent more than hour of actual labour on these I would be surprised.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Piques",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3515977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-05T19:14:01.79Z",
                "reviewBody": "I found these extremely time consuming. They turned out just okay and my dad found them quite heavy compared to the ones he had growing up. I'll try altering the recipe to see if I can make them slightly lighter. The taste was fine but I could only eat one or two before I was STUFFED.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "GIRLIESOGROOVY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2892313/"
                }
            }
        ]
    }
]