[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/33625/cake-doughnuts/",
        "name": "Cake Doughnuts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F635290.jpg",
            "width": 2608,
            "height": 1446
        },
        "datePublished": "2020-06-19T03:07:25.000Z",
        "description": "Lightly spiced with cinnamon and nutmeg. Preparation time is short and well worth the effort.",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "16 doughnuts and holes",
        "recipeIngredient": [
            "2 ½ cups all-purpose flour",
            "½ cup white sugar",
            "1 tablespoon baking powder",
            "½ teaspoon salt",
            "1 teaspoon ground cinnamon",
            "¼ teaspoon ground nutmeg",
            "1 cup milk",
            "1 egg, beaten",
            "¼ cup butter, melted and cooled",
            "2 teaspoons vanilla extract",
            "2 quarts oil for deep frying",
            "½ teaspoon ground cinnamon",
            "½ cup white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, 1/2 cup sugar, baking powder, salt, 1 teaspoon of cinnamon and nutmeg. Make a well in the center and pour in the milk, egg, butter, and vanilla. Mix until well blended. Cover and refrigerate for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep heavy skillet or deep-fryer to 370 degrees F (185 degrees C). On a floured board, roll chilled dough out to 1/2 inch thickness. Use a 3 inch round cutter to cut out doughnuts. Use a smaller cutter to cut holes from center. If you do not have a small cutter, use the mouth of a bottle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry doughnuts in hot oil until golden brown, turning once. Remove from oil to drain on paper plates. Combine the remaining 1/2 teaspoon cinnamon and 1/2 cup sugar in a large resealable bag. Place a few warm donuts into the bag at a time, seal and shake to coat.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Christina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.121076233183857,
            "ratingCount": 223,
            "itemReviewed": "Cake Doughnuts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "256.9 calories",
            "carbohydrateContent": "28.6 g",
            "cholesterolContent": "20.5 mg",
            "fatContent": "14.7 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "167.1 mg",
            "sugarContent": "13.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-30T18:34:39.81Z",
                "reviewBody": "This recipe DOES have the correct amount of flour to make the donuts light & fluffy.  By placing the dough on a floured surface & sprinkling with flour, it removes the tackiness of the dough.  The dough does not stick to the rolling pin.  The only suggestion would be to let the donuts drain & cool somewhat before adding sugar/cinnamon coating.  If the sugar coating is added too soon, the donuts will retain too much sugar mixture and drown the taste of the donut & you will only be tasting the sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NETTE52",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/669786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-14T01:14:52.3Z",
                "reviewBody": "We are first time doughnut makers, so take that for what its worth.  We made doughnuts and doughnut holes out of our center pieces we cut out.  By the time we got to our holes (we did them last) we had it down pat.  Our doughnuts came out very crunchy and greasy, and not very doughy in the centers at all.  I think our mistake was not letting the oil get to temp (It really needs to be 370 or even a tad higher) or else the doughnuts just float around soaking up oil for too long.  Use high heat, and don't over cook (golden does not mean brown!  It took us a few tries to see the difference)  Personally, I think the flour ratio is right on.  I can see how adding extra flour could dilute the taste as another poster mentioned.  Do use extra flour when rolling out.  We will be doing these again soon to iron out our wrinkles and I'll review again.  In our case, I think the failure was our fault, not the recipe!  Use high heat!  Don't overcook!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "twilly09",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3552229/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-04T13:41:05.647Z",
                "reviewBody": "These were excellent like the difference sliced grocery store bread and homemade. I've never made doughnuts before so I was really impressed. I read the other reviews before making these and have some hints for people who were finding the dough too sticky. I made the recipe as stated with two notable exceptions. First I used Becel margarine because that was all I had on hand. I don't buy butter unless I need it for shortbread. I will buy butter for this recipe. I think the butter would help the dough firm. After making the dough I divided it in half and added two tablespoons of dutch process cocoa in an attempt to try to make chocolate doughnuts for variety without making two different recipes - I lack willpower and my waistline doesn't need dozens of doughnuts in the house. The cocoa didn't work and that half of the batch was compost. It did however roll out better than the plain batch which was probably due to the extra dry ingredients. I let the dough sit in the fridge uncovered overnight. Also I rolled these out on a board slightly more floured than I would use for pastry. After cutting the doughnuts out I let them air dry while the oil was heating and then fried them for 1 1/2 minutes per side. We dusted only half of them with sugar/cinnamon mix and they were equally good without as they were with it. I've promised the family that next weekend will have a dougnut extravaganza and freeze the majority.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristinaKlarenbeek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2191546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T18:33:56.047Z",
                "reviewBody": "Where I come from in Upstate New York these are called Fried Cakes. They are often sold in the fall to accompany fresh apple cider. They are not meant to be like Krispy Kremes. Those are yeast based donuts. These are supposed to have a denser texture. It is also customary to coat them with cinnamon and sugar or eat them plain but they are never iced. Thanks for this old time recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUSTCYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/36207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-28T03:12:01.043Z",
                "reviewBody": "This recipe is fabulous!  I don't have a donut cutter so I dropped batter by spoonsful.  Just use very small spoons, though.  The first batch came out big as tennis balls.  Still delicious, but quite large.  I then tried dropping a scant teaspoon, and they came out about the size of golf balls.  The smaller ones are wonderfully crunchy and crispy while the larger ones are more cake-like.  Yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATSROAMIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1080636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-28T17:25:15.077Z",
                "reviewBody": "Ive used this multiple times followed it exactly using the spoon drop in the oil method (to save myself time) and have had raving success every single time. Thank you for a smokin doughnut recipe! YOU ROCK!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carin M. Cole-Burkhart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2630711/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-20T16:08:01.767Z",
                "reviewBody": "Ihave been baking MANY years. Wanted sonething to do with my grandchildren so I thought I'd try this. WHAT A MESS!! The dough was SO sticky that it could't be handled. I thought I made a mistake in the recipe so I mixed up another batch of dough and the same thing. This recipe is just awful! It doesn't even deserve 1 star.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Carder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/191773/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-13T20:14:11.897Z",
                "reviewBody": "This recipe had a very great flavor; however the dough was too sticky. I added (about 1 c.more flour) till it was not so sticky.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Helen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2980685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T18:34:46.5Z",
                "reviewBody": "This recepie is inacurate in the whole point of view the time to refrigirate the ingridients is not enogh and need more flour is very messy and with the actual ingridients like the flour amount is not enogh to make the consitency that the doughnuts need to be able to take them and fry them..my kids did not like them either",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JOA30906",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/427369/"
                }
            }
        ]
    }
]