[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14443/desserts/specialty-desserts/bread-pudding/",
                    "name": "Bread Pudding Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/34014/bread-pudding-with-whiskey-sauce-iii/",
        "name": "Bread Pudding with Whiskey Sauce III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F612775.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:07:25.000Z",
        "description": "This bread pudding is absolutely delicious!",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "6 eggs, lightly beaten",
            "1 ½ cups white sugar",
            "4 cups milk",
            "1 cup heavy cream",
            "1 tablespoon vanilla extract",
            "½ tablespoon ground cinnamon",
            "1 (1 pound) loaf bread, cut into 1 inch cubes",
            "½ cup golden raisins",
            "1 ½ cups white sugar",
            "¾ cup butter",
            "¾ cup corn syrup",
            "½ cup whiskey"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, whip together eggs and sugar. Mix in milk, heavy cream, vanilla extract and cinnamon. Whip until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange bread cubes in a medium baking dish, and top with golden raisins. Cover with the whipped mixture. Allow the bread to become saturated with the mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 45 minutes in the preheated oven, until lightly browned.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the sauce, mix sugar, butter and corn syrup in a medium saucepan over low heat. Remove from heat when thoroughly blended, and whisk in the whiskey. Serve warm over bread pudding.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Bread Pudding Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LADYEM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.698841698841699,
            "ratingCount": 259,
            "itemReviewed": "Bread Pudding with Whiskey Sauce III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "641.3 calories",
            "carbohydrateContent": "93.8 g",
            "cholesterolContent": "157.2 mg",
            "fatContent": "24.2 g",
            "fiberContent": "1.2 g",
            "proteinContent": "9.4 g",
            "saturatedFatContent": "13.9 g",
            "servingSize": null,
            "sodiumContent": "428.6 mg",
            "sugarContent": "61.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-05T04:10:10.46Z",
                "reviewBody": "Mmmm!!! This was great! I followed the suggestion of turning up the oven to 350 degrees, and I took it out after 50 minutes. It still looked very wet, and I was worried that it wouldn't be done, but it was perfect after it sat a few minutes. I also increased the cinnamon to 1 tablespoon - personal preference.\n\nI think I found the trick to the sauce. Instead of just heating it until it was blended, I tried to get the sugar to dissolve so it would be clear. It never was clear, but it was a little bubbly. Then when I added the rum (didn't have whiskey), the sauce bubbled a lot. I think it burned off the alcohol, so it had a great rum flavor instead of too alcohol-y. It also got thicker as it cooled. Make sure you use great liquor - I used Appleton Estate V/X rum (highly recommended by reviewers of another recipe) that I bought especially for making a rum sauce. It was WONDERFUL! Half the sauce recipe unless you want to use it for something else. Also, since you add the rum at the end, start with half and add more if you like it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JLANAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jlanam/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-20T19:27:14.127Z",
                "reviewBody": "Great Recipe! I did scale back the serving to half which made a 9x13 pan. I also cut back on the whiskey (way to much whiskey)and I added more cinnamon and nutmeg. I also added chopped pecans to my rum sauce. Next time I will add some drained, crushed pineapple to the bread.It does take longer than an hour to cook though. Thanks for the wonderful recipe and making me look like a pro chef! I will definitely make this again!\nps. I forgot to add that cooking this in a hot bath (a pan with hot water) will cook faster and more even. You will not be left with the gooey parts in spots.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANAED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1212373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-05T19:05:35.09Z",
                "reviewBody": "Excellent!!! One of the best I've come across.Made the whiskey sauce using Bourbon and it received the highest raves. Used french bread.  Of restaurant quality...many requests for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PSWEST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/547449/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-23T00:58:09.543Z",
                "reviewBody": "Wonderful Recipe!! I was looking for a recipe similar to a bread pudding that I had at a fancy place in Monroe, LA. My husband and I both thought that this recipe was actually better. \n\nThe sauce is wonderful! I did use rum rather than whiskey, though. I also cut the sauce recipe in half and it was more than enough. I poured the entire batch of sauce over the bread pudding when it first came out of the oven to let it soak into the pudding.\n\nI used a loaf of white bread and left the crust on. I used a 9 x 11\" glass pan and it did rise to about an inch above the top, but settled upon cooling to be almost level with the top of the pan. \n\nThe only change that I made was that I increased the cooking temperature to 350 and I cooked it for 60 minutes. It came out very moist and was a wonderful texture. I'll be cooking this one next time I want to show off for a family gathering. Thanks for a great recipe!!\n\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TALACHEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/347100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-20T17:03:18.793Z",
                "reviewBody": "I have been experimenting with Bread Pudding recipes for YEARS!  Finally I have found the perfect Bread Pudding and whiskey sauce creation.  Thank you for sharing this!  Ande in CA",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ande16",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7443/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-26T19:25:20.893Z",
                "reviewBody": "All Gone!  ;-)  A Winner!\nI've had my eye on this recipe for awhile now and decided to make this last minute when I found out my Mother-in-Law made pumpkin pie for Christmas dessert. I had no intention to compete with her dessert, just that Hubby hates pumpkin pie.\n\n*NOTE:> Made a half recipe in a loaf pan.*\nI thought the recipe was a bit wet; I used very dry French bread and raised the oven temp like the others to 325 for at least 60 minutes. Threw in a half  of a Gala apple and some raisins; also added a little All Spice. The bread pudding fluffed up nice and not dry at all. Next time I make this, I'm going to try half & half and cut the liquid a little.\n\nThe sauce was lovely and smooth. Totally  FAB!\nFor the sauce, I used \"1792\" bourbon instead of whiskey.  When I finally tried it (at my Mother-in-Laws), I thought it needed more liquor and couldn't understand the other reviewers fuss about the sauce being kinda strong.  When I got home, I discovered I accidentally grabbed the 1/3 cup, instead of  the 1/2 cup measure. I'm going to make sure I use more next time, but a 1/3 cup was tasty and subtle for those who want a lighter flavor.\n\nIn the end, it was all gone; even my Mother-in-Law opted for my dessert over hers.  I was then delegated to make next years Christmas bread pudding and asked to think about making extra sauce offering a couple different flavors... some that come to mind.\nMalibu Coconut Rum, Sailor Jerry Spiced Rum, Brandy and maybe Chambord? but cut the sugar. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "penoir",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1705528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-23T16:41:48.93Z",
                "reviewBody": "I usually try a recipe first before making changes and trying to 'improve' on what I have yet to try in the first place. On this one I followed it to a tee. It came out excellent. Very rich - and yes the whiskey was a bit strong but the bite of it countered the sweetness of the bread pudding. I think it worked. There was a lot - was able to feed my husband and I my brother my parents and still have enough left over for 2nds and 3rds. My only suggestion would be to 1/2 it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Native",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1738393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-31T16:12:02.053Z",
                "reviewBody": "This recipe is marvelous! I used torn French Bread and oh what a difference! Wonderful flavor! I added Allspice and doubled the Golden raisins. Be careful though if you use rum instead of whiskey in the sauce. One-half cup of rum is way too much! Rum was all I had on hand",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLUESTEM54",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-21T03:51:35.767Z",
                "reviewBody": "Great recipe!  Eating it right now!  We followed the directions exactly but cooked for 1hr 20 minutes. Probably could have stood another 15 minutes.  We used 1/2 cup Southern Comfort in the sauce.  Outstanding!  Thanks for posting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AFN222",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/435094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-08T19:34:46.967Z",
                "reviewBody": "I didn't make the bread pudding portion of this recipe as I already had a bread pudding. I only made the sauce as I was specifically looking for a whiskey sauce to use up what I had on hand. I halved the recipe for the sauce but didn't take the recommendations to reduce the whiskey by half again. I absolutely should have. This sauce smelled like the worst drunk and tasted about as bad. There was WAY TOO MUCH whiskey for the rest of the ingredients. If making a full batch of the sauce definitely reduce the whiskey by half. The texture was OK.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SHCMEOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/313595/"
                }
            }
        ]
    }
]