[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/34018/baked-doughnuts/",
        "name": "Baked Doughnuts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6310938.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2020-06-19T03:07:26.000Z",
        "description": "These aren't like deep-fried doughnuts, but they are a yummy breakfast treat! Shape them however you like - by any other name, they'll taste as sweet!",
        "prepTime": "P0DT0H18M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 cup white sugar",
            "2 teaspoons baking powder",
            "1 teaspoon baking soda",
            "1 teaspoon ground nutmeg",
            "½ teaspoon ground cloves",
            "2 teaspoons ground cinnamon",
            "3 cups all-purpose flour",
            "1 cup buttermilk",
            "3 eggs",
            "1 tablespoon honey",
            "½ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet, or donut baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix sugar, baking powder, baking soda, nutmeg, cloves, cinnamon and flour. Mix buttermilk, eggs, honey and butter in a separate medium bowl, and stir into the dry ingredients. Spoon the mixture onto the prepared pan in doughnut shapes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 12 minutes in the preheated oven, until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "sal"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.606896551724138,
            "ratingCount": 145,
            "itemReviewed": "Baked Doughnuts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "280.3 calories",
            "carbohydrateContent": "43.7 g",
            "cholesterolContent": "67.7 mg",
            "fatContent": "9.5 g",
            "fiberContent": "1.1 g",
            "proteinContent": "5.6 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "259.2 mg",
            "sugarContent": "19.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-18T00:28:13.5Z",
                "reviewBody": "I made these for our tailgate Oct. 1 to have in the parking lot line. The only thing I changed was to reduce baking time to 10 min. I used my own recipe for Pumpkin Cream Cheese Icing to top them while a little warm. They were so wonderful! A person we feel obligated to take to games insisted she'd bring store-bought donuts so no one would have to eat mine if they weren't any good. Not one person, including herself, even opened the store-bought box! I also didn't have the problem as others that they didn't last long. I made 4 dozen, some to take and some to keep. The ones I kept at home were still moist up to the day they were finished off 6 days after baking. (The icing may have made that difference though.) My husband has aked for these every couple of days now! The only thing to remember is that these are cake doughnuts and are going to be a little heavy. However, sifting the flour does help if they turn out too heavy. Thanks for posting-these are a new breakfast staple in our house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/530270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T19:13:06.357Z",
                "reviewBody": "Phenominal! Away goes the so-so recipe that came with my doughnut pan. I get the cringes when I go to a well know shop where you can watch the doughnut floating along in an enormous tank of oil! This makes me feel a little better about such a sweet treat. I made a few modificatons as follows: Substitued maple syrup for honey, also I added a package of instant pistachio pudding in an attempt to make the one Dunkin Doughnuts used to make. It worked! And the pudding makes the batter a bit thicker. However they do rise a bit more so don't add quite as much batter to the pan. I am going to try chocolate pudding next, but the plain batter is good too!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Miss  Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/578876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-18T14:03:12.45Z",
                "reviewBody": "The bestest everest baked doughnuts!  I substituted Maple syrup for the honey which made them EVEN BETTER!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMBERISCOOL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/449547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-13T03:39:26Z",
                "reviewBody": "These were great. They are so yummy. I just plopped them into 13x9 pans and baked them. They may not be like doughnuts but they are a wonderful treat and really easy to make. Don't worry if you don't have buttermilk I just added 1 TBSP of white vinegar to 1 CUP of milk and let it sit a while mixed it well and added one cup to the mixture to the wet ingredients. I also used syrup because I had no honey and they came out perfect. I am serving mine with icing on them. You must try this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelley Farmgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1970744/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-18T00:17:10.733Z",
                "reviewBody": "These were excellent!  I doubled the recipe as some reviews I read said it would not make very many- that was not necessary!! It made 10 Dozen Donuts!  I have 4 pans, so it was really easy to make so many.  A suggestion- another thing people were saying the Donut Pans were hard to fill- and I agree- they were.  If you have a Spritz Cookie maker- that is the perfect tool to fill your Donut Pans with no mess and the perfect amount of batter!  In fact, if you don't have one- I would reccommend it, otherwise, the pans really are messy to fill. Fill them a little less than half!  My first batch looked like muffins, they rise quite a bit! I topped the Donuts with a Chocolate Icing- 1/4 cup milk, 1-2 tsp Vanilla and 2 cups confectionary sugar. Heat the items together and  keep warm and just drizzle over the donuts either in a circle on the top or a stripe pattern! If you add sprinkles- you have to do it right after you ice each donut before the icing hardens- that was a little bit of a pain in the neck- but if you have someone to help sprinkle them, that would make it easier!! The chocolate icing was very complementary to the Donuts!  They were the hit of the party!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bijou143",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2814973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-03T17:56:32.637Z",
                "reviewBody": "While these were good the name is deceptive.  These should be called muffins not doughnuts.  The batter was a muffin batter.  The final result was a muffin. I tried several shapes: animal shapes using animal for cookie sheet (filled about 3/4 full these were just as thick on the top side as they were on the pan side [double the depth of the mold]), mini muffins (these baked up the same as any other muffin recipe), and rounds on a regular cookie pan (these spread out an ended up like big flat muffins). I think this would work well as a muffin snack cake (just poured into a greased pan and baked at about 375 degrees until the top springs back when touched.  The first pan I put in got too dark on the pan side after about 10 min. at 400 d.  I reduced the temp. to 375 d. for the rest of the batter.  From the recipe as it was I got 12 animal shapes, 24 mini muffins, and 6-8 4.5 inch flat muffin rounds.  My kids gobbled these up (they love muffins).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandi O.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1606432/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-09T21:39:57.403Z",
                "reviewBody": "These are nothing like doughnuts but we liked them just the same. We didn't even try to make them look like doughnuts. Just plopped them on a cookie sheet like cookies. We topped them with a mixture of powdered sugar and cinnamon. The next time we make them I'd like to try using a mixture of whole wheat flour & white flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSIEJDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T19:12:53.327Z",
                "reviewBody": "I brought these to work yesterday and they're already gone and I got excellent comments. They're not over-sweet the sweetness is just right. I can see why people had problems with the batter if not using a doughnut pan but I had one so it was no problem for me. I got almost 36 doughnuts but maybe my pan just had smaller wells.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZERDBITS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/184868/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-05T20:57:20.873Z",
                "reviewBody": "Pretty good tasted pretty much like actual fried donuts they just took a while to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "STRAWBERRY SWIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/523639/"
                }
            }
        ]
    }
]