[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
                    "name": "Rice",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14363/main-dish/rice/fried-rice/",
                    "name": "Fried Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/34911/fried-rice-with-cilantro/",
        "name": "Fried Rice with Cilantro",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3826137.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2020-06-19T03:07:30.000Z",
        "description": "A delicious fried rice. You can use either chicken, pork, bacon or seafood - great with calamari and prawns.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 tablespoons vegetable oil",
            "5 cloves garlic, finely chopped",
            "2 green chilies, diced",
            "2 cups cubed skinless, boneless chicken breast meat",
            "2 cups cooked jasmine rice, chilled",
            "1 tablespoon white sugar",
            "1 tablespoon fish sauce",
            "1 tablespoon soy sauce",
            "2 teaspoons chopped green onion",
            "2 tablespoons chopped fresh basil leaves",
            "5 tablespoons chopped fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a wok or large skillet, over medium-high heat. Fry the garlic until golden, then add the chili pepper and chicken meat, and stir-fry until cooked through.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the chicken is cooked, add the rice, sugar, fish sauce, and soy sauce. Cook over medium heat, stirring gently. When the mixture is well blended, stir in the green onions, basil, and cilantro. Cook for 1 more minute, then serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rice",
            "Fried Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MITCHNSTEVE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.603658536585366,
            "ratingCount": 328,
            "itemReviewed": "Fried Rice with Cilantro",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "633.6 calories",
            "carbohydrateContent": "84.4 g",
            "cholesterolContent": "68.3 mg",
            "fatContent": "17.3 g",
            "fiberContent": "1.7 g",
            "proteinContent": "32.8 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "562.4 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-23T20:57:50.797Z",
                "reviewBody": "This was fabulous.  We eat a lot of Thai food, so the ingredients really caught my eye.  The only changes I made this time were: substituted one of the tbl of veg oil with sesame oil, prawns instead of chicken, reserved one of the tbl of cilantro and sprinkled it on top of the rice to serve, and squeezed fresh lime over the entire dish.  My husband said it reminded him of the rice he had in Thailand.  (I did not know what kind of \"green\" chile the original recipe calls for.  In San Diego, all types of chiles are available, so I used jalapeno.)   Next time, I will add an egg, reduce the oil by at least a tbl, and top with chopped roasted peanuts (unsalted).  03/22/09: I have made this recipe several times since this review.  Now I use a bit less oil, but still use 2 parts canola to 1 part sesame oil.  Before I add the rice I scramble in 1-3 beaten eggs (sometimes I double the recipe).  I add the unsalted chopped peanuts before serving.  I have also made with just chicken, just shrimp, and a mixture of chicken and shrimp.  It is so good.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Miller Motley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cook4mycrew/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-08T03:12:05.5Z",
                "reviewBody": "This is EXCELLENT! It makes a great base for fried rice, with limitless options for add-ins.    I made mine without the chicken and cilantro; threw in a handful of julienned carrots with the garlic and cooked for a couple of minutes; turned the heat up really high and added the rice, then made a well in the center and scrambled an egg and mixed it in. I then added the sugar, fish sauce, and soy sauce, along with a scant teaspoon of sesame oil, which in my opinion is a necessary ingredient for authentic-tasting fried rice. Don't skimp on the fresh basil either; wow, that is a great taste!  I don't have a wok or a gas stove, but even with a large skillet on an electric stove, this worked really well.  Just remember to turn the heat up really high before adding in the rice, so that it cooks quickly and doesn't get \"gummy\".   \nMy DH raved about this fried rice!! He thought it was fantastic, and my 3-year old gobbled it up as well.  Be sure to double the recipe if you want to have even a chance at leftovers.  It's good cold or rewarmed.   This will become a staple in my recipe repertoire.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Practically Organic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/642513/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-25T16:20:46.507Z",
                "reviewBody": "I am eating this as we speak.  I made exactly as written except I used olive oil instead of vegetable oil.  It is so easy to throw together and is not your traditional fried rice that I am used to but is a welcome change.  Great taste!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Odom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1139284/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-22T13:04:50.35Z",
                "reviewBody": "Very good rice! Important note: the rice measurement should be for UNCOOKED rice not cooked rice. I made this recipe measuring out 2 cups cooked rice and it was very oily. Use 2 cups uncooked rice to get the proper consistancy. I doubled this to freeze for OAMC and it is great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HORSEZ001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/679835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-21T16:48:18.86Z",
                "reviewBody": "This is one of the best recipes I've made from this site! I LOVE pad thai but find it a little time consuming to make. I did add a few ingredients mainly because they are in pad thai. I cooked the garlic in sesame oil instead of vegetable oil. I added 2 scrambled eggs and used shrimp instead of chicken (my husband loves shrimp) and also added chili powder. I chopped up extra cilantro and green onion to put on the table (I like lots of both) and added bean sprouts. My rice came out a little on the thick/sticky side but I've never cooked with jasmine rice before so I wasn't sure how it was supposed to look. It still tasted FANTASTIC and I will be making this recipe for many years to come!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "buggymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1077512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-08T05:47:12.123Z",
                "reviewBody": "This is a wonderful recipe and incredibly easy to cater to your specific tastes. I used pork instead of chicken and sesame oil instead of vegetable oil and because I live somewhere that fish sauce is not readily available I substituted another tablespoon each of oil and soy sauce. I also added finely diced zucchini and an egg. It came out fantastic. I'd never thought of using cilantro in fried rice before!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZENOSTORTOISE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/701450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-01T00:14:54.983Z",
                "reviewBody": "I will give it 5 because it is the best \"base\" for thai style fried rice I have found so far. I actually spiced this up a bit by adding a teaspoon of crushed red pepper (if this is too hot for you then seed your chiles), other better additives were celery, carrot and white onion to the garlic mixture so they all could caramelize together and then added the rest of the recipe. Will definitely make again - my way - thanks for sharing the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DENEKA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/696778/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-19T19:13:09.867Z",
                "reviewBody": "I wish I could give this 4.5 stars instead of only 4!  After 12 years of marriage to a lovely Thai woman, I can tell you that this a pretty close to the way she makes it and would be delicious as is. Of course every Thai cook has their own recipe and for me, the following changes put this recipe over the top. The differences are that she uses red chilies (not that important), spicy Thai basil (pronounced: bi-g'pow) - which makes a huge difference in flavor; she omits the sugar and regular soy sauce and uses sweet soy sauce and thin soy sauce (available at SE Asian markets) which is a significant substitution (sweet soy has a subtle blackened cane sugar flavor and the nutty flavor of the soy bean is more pronounced in Thai thin soy sauce than in either Chinese or Japanese soy sauces). She also adds chopped tomatoes and butterflied prawns in the last minute of cooking and tops each serving with a fried egg (not scrambled - cooked to desired doneness) and finely chopped peanuts. serve with fresh cilantro, lime wedges, white sugar, red chili flakes and fish sauce with green chilies as condiments. This is so scrumptious - you HAVE to try it just once! BTW the Thai name for this is Khao Phad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Scuba_Steve",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3233741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-30T22:25:50.39Z",
                "reviewBody": "This is a very flexible recipe. I have made it with chicken shrimp and most recently scallops. I think it works best with seafood. The complementing tastes of the basil and cilantro make this dish and should not be left out. The only changes I make are substituting olive oil for the vegetable oil and adding 2 tablespoons of hot sesame oil. Since there are so many dominate flavors in this dish do not waste money on expensive fresh shrimp or scallops. The frozen bulk variety from Sam s Club or other warehouse stores work just fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GUYCHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-01T11:11:19.91Z",
                "reviewBody": "I did not care too much for this rice. Although this is my first time cooking jasmine rice I do not like the fish sauce flavor added into this rice. The reason I rate this a three is because even after adding some honey in rice to enhance the flavor I still did not like it that much. This is not the best fried rice I've eaten. Thanks anyway for posting this recipe on site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sabray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sabray/"
                }
            }
        ]
    }
]