[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/36410/bavarian-cream/",
        "name": "Bavarian Cream",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F929779.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:07:37.000Z",
        "description": "Bavarian Cream taken from my Great-Grandmother's recipe book.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H5M",
        "recipeYield": "4 cups",
        "recipeIngredient": [
            "2 tablespoons unflavored gelatin",
            "½ cup cold water",
            "4 egg yolks",
            "½ cup white sugar",
            "1 pinch salt",
            "2 cups milk",
            "1 teaspoon vanilla extract",
            "2 cups heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together the gelatin and cold water. Set aside to soften. In a medium bowl, whisk together the egg yolks, sugar, and salt until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, bring the milk to a boil. Pour the hot milk in a steady stream into the yolk mixture, whisking constantly. Return the mixture to the saucepan and cook and stir over medium heat until the mixture coats the back of a spoon. Remove from heat and pour the custard through a strainer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the softened gelatin and vanilla and stir to melt the gelatin. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the mixture has cooled almost to room temperature, whip the heavy cream to medium stiffness and fold it into the custard. Immediately transfer the Bavarian cream to parfait glasses, molds, or on prepared cake layers, as it will firm up quickly as the gelatin sets. Refrigerate at least one hour before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CAROL_67"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.1636363636363636,
            "ratingCount": 55,
            "itemReviewed": "Bavarian Cream",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "312 calories",
            "carbohydrateContent": "17.4 g",
            "cholesterolContent": "188.8 mg",
            "fatContent": "25.4 g",
            "fiberContent": null,
            "proteinContent": "4.5 g",
            "saturatedFatContent": "15.3 g",
            "servingSize": null,
            "sodiumContent": "51.7 mg",
            "sugarContent": "15.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-25T06:36:42.657Z",
                "reviewBody": "I was looking for a good filling to fill my Dark Chocolate cake with. This was the best ever. Good in the cake good all by itself. A big hit at my family function.!!! A keeper!! Thank you Carol for sharing:) 9/01/07 I also wanted to add that when I go to events THIS is the most requested dessert for me to bring. 1/24/11 Another update: This is still the most requested desert. I follow the recipe to a T. I do have to whip it again before I use it. I think it has great flavor. Enjoy. It is worth the bother!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Charlotte Sybil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392562/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-19T03:17:04.983Z",
                "reviewBody": "Normally I hate it when people review recipes after they make a bunch of changes, but it just turned out so good that I decided to go ahead. I decided to try and make it more carb friendly and so I used splenda for baking instead of sugar and half and half instead of milk. I followed the rest of the directions to a T and was very impressed with the final product. The only thing is, I was expecting it to be more pudding like, and when I added the whipped cream it turned out more like, well, whipped cream. I tasted it before I added the whipped cream and it was amazing. This could be used in boston cream pie or as pudding if it is made without the whipped cream. It could be used for cream puffs or other pastries as is. My lower carb version turned out fabulous. I give this recipe an A+.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTEN-RENEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/761894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-15T17:41:24.483Z",
                "reviewBody": "This is very creamy and very rich only let kids eat small amounts. My only problem was deciding what to do with it once I had made it I made it for Food Tech class. We had to make a dessert that had to be frozen and I chose this it made like 4 cups and afterwards I didn't know what to do with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAH1984",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-21T18:28:02.01Z",
                "reviewBody": "To someone that has never made custard of any kind before, this recipe is slightly confusing.  I have made this twice.  The first time, I followed all directions and ingredients exactly.  I believe I overcooked the custard because I was using a plastic spoon, not a metal one.  It is difficult to tell when the mixture coats the spoon, so metal works best.  Overcooking resulted in the yolk of the egg scrambling.  The second mistake I made was with the straining.  The recipe does not indicate which portion to keep when straining and because my egg cooked I had a significant amount in the strainer as well as in the bowl under it.  I did not know which part to keep and I believe I used the wrong part of the custard for the remainder of the recipe.  My end result was very little flavor and bits of solid pieces in my Bavarian Cream.  However, the second time that I made it with the metal spoon, I took the mixture off the stove as soon as the back was becoming coated.  I strained it and it became obvious that the portion to keep is the liquid that comes out of the strainer.  I used this to complete the recipe and it turned out beautifully.  We used the Bavarian Cream to make delicious filled homemade donuts for breakfast.  Probably a novice mistake overall, but I feel the author should have indicated exactly what to do after straining the mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "stephanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3372995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-03T00:28:44.99Z",
                "reviewBody": "This recipe did not work. maybe i did something wrong? i double checked ingredients...but in end it never got thick enough to use for cake filling. Was the mixture supposed to be thick like custard before adding the whipped cream? mine wasnt...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "lucyford",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2389012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-29T18:01:55.173Z",
                "reviewBody": "i thought this was very yummy and very easy to make. It was very thin when I finished folding in the whipped cream buy if you let it chill for ten minutes it is perfect. If you are filling a cake with it just make sure to make a dam with the buttercream so that it won't sqeeze out the sides. Also I know this recipe says you can eat it as pudding but I wouldn't and I would never let my kids. It is full of fat with all that heavy cream and sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMBEROGIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822700/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-10T22:50:35.123Z",
                "reviewBody": "This recipe was great! I used it to fill crepes and everyone loved it! It was different than I expected bavarian cream but I followed it to a T and it turned out amazing! We will definately use it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SaresMama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1974294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-02T16:12:15.597Z",
                "reviewBody": "Disappointing. I was hoping for more of a pudding taste to it and it isn't. It has the taste of the whipping cream rather than a vanilla flavor. I will not be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MrPinkdiamond10011",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3228136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T00:18:24.45Z",
                "reviewBody": "This recipe called for ingredients I don't normally have around the house, which would be okay if the taste was worth it. Unfortunately, the description is accurate when it calls the cream \"light,\" since it was nearly tasteless... the gelatin somehow ended up really chunky, and the overall texture of the cream was less than pleasant... also, if you do choose to use this, be sure to stir constantly when boiling the milk, I seared the bottom of my pan by accident. \r\n\r\nI had to add extra sugar and vanilla to this to make it taste somewhat decent, but decided it would ruin my cake if I were to use it for a filling, and it didn't taste good enough on its own. It could be that I did something wrong, but I reviewed the recipe again after I was finished to make sure I did everything right and... well the result just wasn't very good at all. :(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jadewyn <3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1673231/"
                }
            }
        ]
    }
]