[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14731/soups-stews-and-chili/soup/vegetable-soup/tomato-soup/",
                    "name": "Tomato Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/39544/garden-fresh-tomato-soup/",
        "name": "Garden Fresh Tomato Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F05%2F1869714.jpg",
            "width": 650,
            "height": 465,
            "caption": "Photo by LazyFoodieGirl"
        },
        "datePublished": "2020-06-19T03:07:58.000Z",
        "description": "A quick and easy recipe for real homemade tomato soup like no other you've had before.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "4 cups chopped fresh tomatoes",
            "1 slice onion",
            "4 whole cloves",
            "2 cups chicken broth",
            "2 tablespoons butter",
            "2 tablespoons all-purpose flour",
            "1 teaspoon salt",
            "2 teaspoons white sugar, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a stockpot, over medium heat, combine the tomatoes, onion, cloves and chicken broth. Bring to a boil, and gently boil for about 20 minutes to blend all of the flavors. Remove from heat and run the mixture through a food mill into a large bowl, or pan. Discard any stuff left over in the food mill.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the now empty stockpot, melt the butter over medium heat. Stir in the flour to make a roux, cooking until the roux is a medium brown. Gradually whisk in a bit of the tomato mixture, so that no lumps form, then stir in the rest. Season with sugar and salt, and adjust to taste.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Tomato Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Charlotte"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.587073608617594,
            "ratingCount": 1671,
            "itemReviewed": "Garden Fresh Tomato Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "80 calories",
            "carbohydrateContent": "9.4 g",
            "cholesterolContent": "11.8 mg",
            "fatContent": "4.3 g",
            "fiberContent": "1.8 g",
            "proteinContent": "1.8 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "742.9 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-30T04:43:03.013Z",
                "reviewBody": "This soup is absolutely delicious! Although, I must admit I made several changes - mostly based on previous reviews!  I've made this several times and always double the recipe. I saute lots of chopped garlic in olive oil and then add the chopped onions (2 large) and saute until tender. I add chopped tomatoes (with skin and seeds) and bring to a boil. I then add the chicken stock and cook for about 20 minutes.  I cool slightly and add fresh chopped basil (about 3 TBSP). I puree with a submergible blender (you can use a regular blender) and then add the roux as described in the recipe. I only add a half tsp sugar. In addition to the salt I add pepper to taste. I add 2 TBSP balsamic vinegar and about an 1/8 tsp cayenne pepper. I add 1 cup heavy cream. I've only made this soup with home grown tomatoes. Now that the season is over I'm going to try it with store bought or even canned tomatoes. This soup is very sophisticated and I think would be great for a dinner party.  It was so good my Hubby wouldn't let me share it!!  I'm already looking forward to next years tomato crop - I'll never have too many now!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VIVIBO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/69195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-01T08:15:45.443Z",
                "reviewBody": "This recipe turned out excellent; the soup tasted so fresh and healthy.  A few notes about this recipe.  First, the recipe says \"1 slice onion\"; I treated this as though it said \"1 sliced onion\", and it worked out perfectly (I am sure this is what was intented).  Also, as someone else noted, this recipe as it stands does not make enough soup.  I doubled the recipe and it made enough for 5 people to have one medium sized bowl of soup each.  At least double this recipe, if not triple it.  Also, by substituting vegetable stock for chicken broth, this recipe is vegetarian-friendly.\r\nIn addition, I made the following alterations:  added 1 bay leaf, 1 tsp crushed garlic, 1 tsp cayenne pepper, 1/2 cup milk, 1 Tbsp oregano, 1 tsp thyme, pepper to taste.\r\nDelicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UJOHNC00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/639712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-08T21:57:31.243Z",
                "reviewBody": "I always get a kick out of the reviews that change a recipe so much that it is no longer anything near the original! Look, the whole point of this recipe is that it is uncomplicated. There are plenty of really good fancy-sassy tomato soup recipes to try, if that's what you want. But this soup sticks to a great principle: simple recipes are often the best. And the result is what tomato soup should taste like. Few additives and fresh, ripe tomatoes. Real tomato flavor. Don't change a thing and you will be rewarded.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEVERAMSEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/757964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-08T16:50:49.467Z",
                "reviewBody": "This soup was the best.  I didn't have cloves around the house, but it still turned out wonderfully, I added some garlic instead.  Also, Rather than discarding all of the tomatoes after they'd cooked, I pureed them for a few seconds in the blender, and added them to the rue.  It was fabulous.  Thanks!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kirsten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/411277/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-03T13:40:20.983Z",
                "reviewBody": "Very Very Good.  This is by far MUCH better than canned tomato soup.  I’ve been making it for two summers now.  I peel the tomatoes first because I do not have a food meal.  I used to seed them too, but I found that a lot of the seeds come out while chopping them and any seeds left usually disappear in the blender.  I put the entire pot of soup in my blender (be careful! Once I burnt myself) and blend it to make it very smooth.  I take out the onion first.  I use one whole onion cut in half.  It adds a good flavor to the soup.  Some of us put a little milk in our individual servings.  We all enjoy the soup very much!  (TIP: Dunk tomatoes in boiling water for 30 sec to make the skin come right off.  I’ve also have held them under hot tap water until the skin came off easily.  Chopping them while they are still a little warm causes even more seeds to be left on the cutting board and not in your soup.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELIZRA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1469257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T11:21:08.2Z",
                "reviewBody": "This was a delicious soup Charlotte.  I did not have any fresh tomatoes on hand, so I used 2 (28 oz) cans of San Marzano Italian Peeled Tomatoes by \"Cento\".  They are one of the BEST brands of canned tomatoes and the next best thing to fresh!  I did use the liquid from one can, but drained the other and mashed the tomatoes by hand.  I sauteed 1 chopped onion and 2 cloves of garlic in a little oil and butter until soft and threw in 1 bay leaf and the cloves for a few seconds before adding the tomatoes and broth.  I sprinkled in a little thyme and oregano after adding the tomatoes and skipped the roux.  I stirred in 4 Tbls of butter to give the soup a heartier taste and instead of a food mill, I used my hand mixer to blend it all together.  At the end I stirred in 1/2 cup of whipping cream and about 15 fresh minced basil leaves.  Just a quick tip...always add basil at the end of your cooking time.  You never want to \"cook\" fresh basil very long because it will loose it's flavor.  Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-08T16:51:30.59Z",
                "reviewBody": "This recipe was wonderful.  Best tomato soup I've ever had.  I added 2 cloves of crushed garlic, an extra bay leaf, and whole peppercorns (green, black, white, and red) along with the cloves.  I also used vegetable broth to make it vegetarian.  Top each bowlful with a handful of garlic croutons, and enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carey Cox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/445656/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-06T02:42:53.357Z",
                "reviewBody": "Every Saturday I get blemished tomatoes free from our local farmer's market and use them to make this soup.  Everyone loves it.  I can't imagine leaving out the cloves -- I think that's what makes it!  I use an electric stick blender to make it smooth and top it with a sprinkling of fresh grated Romano Cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MTEDWARDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-25T09:23:58.103Z",
                "reviewBody": "Great flavor. I used garlic cloves. I'll try to experiment with cloves in the future as well and see which I like better. I don't have a food mill and tried to blend it all in my blender. I was short on time, and put it in hot. I've learned to NEVER do that again, it just exploded out of the blender, creating a huge mess. Served it anyways, but everyone was limited to 1 small bowl because I lost some of the soup in the explosion.  A bit chunky, but good flavor. Will give myself more time to cool it off and blend the soup in the future.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "inthekitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2222443/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-27T09:50:56.363Z",
                "reviewBody": "Try the Greykitty customized version of this recipe.  I used whole tomatos, no peeling of the skin necessary, and the seeds.  use 1 whole onion for the recipe. Double it.  And I was just short of 8 cups of tomatos and had a can of stewed on hand and used them.  Use fresh basil, not dried.  I do not have a food mill so blended after cooled and was delicious without the extra work or waste of peeling and de-seeding.  Also this recipe does not say to add basil so you have to use some common sense and add some if you use this recipe as is.  The customized version was delicious and will make it over and over. canned tomatoes will work too.  Loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9639716/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Garden Fresh Tomato Soup",
            "description": "See how to make quick tomato soup from scratch.",
            "uploadDate": "2012-07-27T16:44:38.414Z",
            "duration": "PT3M3.016S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0cfe8854-628d-433a-a9b1-2b49ba9e6c99%2F3157758f-acc3-464c-8723-b5000abcf7d6%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1757900673001"
        }
    }
]