[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14671/desserts/cakes/cheesecake/chocolate-cheesecake/",
                    "name": "Chocolate Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/40028/orange-chocolate-swirl-cheesecake/",
        "name": "Orange Chocolate Swirl Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1001624.jpg",
            "width": 1834,
            "height": 1834
        },
        "datePublished": "2020-06-19T03:08:00.000Z",
        "description": "A majestic orange flavored cheesecake swirled with chocolate goodness. Orange liqueur may be substituted for the orange juice in equal amounts. These cheesecake not only looks fabulous, but the flavor will send you to cheesecake heaven.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 9 inch springform pan",
        "recipeIngredient": [
            "1 ½ cups graham cracker crumbs",
            "¼ cup white sugar",
            "⅓ cup butter, melted",
            "4 ounces semisweet chocolate, chopped",
            "3 (8 ounce) packages cream cheese, softened",
            "1 cup white sugar",
            "5 eggs",
            "2 tablespoons orange juice",
            "½ teaspoon grated orange zest"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). In a medium bowl, mix together the graham cracker crumbs, sugar and butter until well blended. Press into the bottom and 1 1/2 inches up the side of a 9 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 minutes. In a metal bowl over a pan of simmering water, melt chocolate, stirring occasionally until smooth. Set aside to cool, but do not allow to harden.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the cream cheese and 1 cup sugar until smooth. Mix in the eggs, one at a time on a low speed, or by hand. Gradually stir in the orange juice, and orange zest. Reserve 2 cups of the batter. Pour the remaining batter over the baked crust. Stir the melted chocolate into the reserved batter. Drop the chocolate batter by large spoonfuls onto the white batter. Use a knife to cut through the batter, and leave a swirling design.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 60 minutes in the preheated oven, or until the center is almost set. Run a spatula or thin knife around the edge of the pan while it is still warm, so the cake will not crack. Allow cake to cool completely before removing the sides of the pan. Refrigerate for at least 4 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "Chocolate Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Eloise Liberty"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.358208955223881,
            "ratingCount": 67,
            "itemReviewed": "Orange Chocolate Swirl Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "443.4 calories",
            "carbohydrateContent": "36.2 g",
            "cholesterolContent": "152.7 mg",
            "fatContent": "30.8 g",
            "fiberContent": "1 g",
            "proteinContent": "8.3 g",
            "saturatedFatContent": "18 g",
            "servingSize": null,
            "sodiumContent": "294.8 mg",
            "sugarContent": "29.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-22T18:39:22.49Z",
                "reviewBody": "I'm giving this 4 stars because the original recipe does need a little help. First of all the orange juice and zest contain nowhere near enough flavor to make this cheesecake taste orange-y at all. I suggest using a teaspoon or two of orange extract as well. I added all the orange flavors to the white batter only. I reserved the two cups for the chocolate before I added them so the chocolate and orange would contrast nicely. The crust is great. Be sure you let your cream cheese and eggs sit out until they are at room temp or you'll over beat the batter trying to get the lumps out. Over beating leads to all kinds of cheesecake problems! Anyway lined my springform pan with foil and baked my cheesecake in a water bath. I had no structural or textural problems except for a few bubbles from slightly over beating. After it was done (60 min) I turned off the oven and let it cool for an hour inside. Then I took it out and let it cool completely on a wire rack. I chilled the cake overnight. I removed the hoop and bottom of the pan (tricky) and scored the top of the cake into 12 even portions. Garnished it with whipped cream from a pastry bag with a large star tip chocolate filigree and orange twists. I also served it with the Marmalade Drizzle from the Orange Pudding Cakes with Marmalade Drizzle recipe from this site as a sauce. It was a perfect addition to this cheesecake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KitchenWitch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2978108/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-21T23:36:47.53Z",
                "reviewBody": "This is a very tasty easy recipe. I made it with Grand Marnier instead of the orange juice and the cake had a lovely light flavor. It's more of a creamy cheesecake and it's very dense. My only complaint is that the graham cracker crust was too crumbly. When I was marbling my two batters the crust was pulled away from the pan and into the cake. When it was done baking and chilling the crust stayed mostly together but I think it was just fused to the cake. Next time I think I'll make a chocolate cookie crust and use a darker chocolate in the cake (the semi-sweet didn't prove to be quite chocolatey enough). Thanks very much for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ABURK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/367363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-14T02:31:36.387Z",
                "reviewBody": "Oh my goodness was this good the only change I made was to use 4 teaspoons orange concentrate instead of 2 tablespoons of orange juice because I really like the taste of orange and chocolate. I also melted the chocolate in the microwave. Thanks so much for the wonderful recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Maccc's Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/388146/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-14T13:00:54.007Z",
                "reviewBody": "This is my goto recipe for cheesecake. It is dense and creamy. Also very versatile; I've substituted the chocolate and orange with both blueberry and strawberry puree. It makes a very pretty dessert garnished with the fresh fruit and always satisfies. Also can be frozen and enjoyed later. I always put the springform pan on top of a muffin pan filled with water when baking and it helps prevent cracks. Thanks for sharing. This dessert always wins rave reviews from friends and family members.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ann Clingerman Douglas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1651392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:50:10.6Z",
                "reviewBody": "Excellent. I added 2T orange juice plus an additional 1 teaspoon of orange extract. This was perfect for me. Next time I will reduce the amount of sugar in the crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "schmerna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T23:15:15Z",
                "reviewBody": "I made this wonderful recipe for my orange adoring husband for his birthday this past weekend. He along with our guest raved over this chessecake. I followed the advice of the other posts using 2TBSP of orange juice and 1 teaspn of Orange Extract. The cake had a lovely orange flavor (not at all overpowering) with a nice accent of chocolate. I would highly recommend trying this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nicole/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T20:23:05.17Z",
                "reviewBody": "I made this for a party and everyone loved it. I did use orange extract instead of orange juice and the flavor was wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NANUQ2003",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/866565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T21:46:58.237Z",
                "reviewBody": "This cheesecake was wonderful! Dense and creamy and amazing. Like other reviewers I decided to up the orange flavor. I didn't have orange extract or orange juice concentrate so I measured out about 1/3c. orange juice and cooked it down until reduced by half. I also used the orange zest of about one whole medium orange ( 2-3 teaspoons). Baked the cheesecake in a hot water bath for exactly one hour then turned the oven off and let it cool inside for another hour. Cooled on a wire rack for a good while (had to fend of some tempted family members at this point haha) and then chilled overnight. I served this on Christmas Eve and Christmas Day and everyone LOVED it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "zephyr2003",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5190877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-18T01:21:09.083Z",
                "reviewBody": "This was very good. I liked the texture of the cheesecake it was creamy and dense and not crumbly melded well in the mouth. I did wish it had more orange flavor. I had even added extra zest and it was still too mild. The chocolate overpowered the orange. Next time I would reduce the amount of chocolate batter but use a darker chocolate. Would also maybe add the orange extract as well. Was happy with the crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Naryia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sleepytealeaf/"
                }
            }
        ]
    }
]