[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/40322/meringue-mushrooms/",
        "name": "Meringue Mushrooms",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1871085.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2020-06-19T03:08:03.000Z",
        "description": "These take a bit of work and time, but are spectacular. They are highly prized for Christmas gift-giving! As with other meringue recipes, these should only be made on a dry day. You will need a pastry bag with a plain tip. If you can save some green plastic berry baskets from the summertime, these mushrooms look totally realistic placed in them.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "36 mushrooms",
        "recipeIngredient": [
            "½ cup egg whites",
            "¼ teaspoon cream of tartar",
            "¼ teaspoon salt",
            "1 teaspoon vanilla extract",
            "1 cup white sugar",
            "1 tablespoon unsweetened cocoa powder",
            "4 ounces chocolate confectioners' coating "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 225 degrees F (110 degrees C). Line 2 cookie sheets with parchment paper or aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large glass or metal bowl, use an electric mixer to whip egg whites until foamy. Add cream of tartar, salt, and vanilla. Continue whipping until the whites hold soft peaks. Gradually sprinkle in the sugar so that it does not sink to the bottom, and continue whipping until the mixture holds stiff shiny peaks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a round tip into a pastry bag, and fill the bag half way with the meringue. To pipe the mushroom caps, squeeze out round mounds of meringue onto one of the prepared cookie sheets. Pull the bag off to the side to avoid making peaks on the top.  For the stems, press out a tiny bit of meringue onto the other sheet, then pull the bag straight up. They should resemble candy kisses. Do not worry about making all of the pieces exactly the same. The mushrooms will look more natural if the pieces are different sizes.  Dust the mushroom caps lightly with cocoa using a small sifter or strainer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 1 hour in the preheated oven, or until the caps are dry enough to easily remove from the cookie sheets. Set aside to cool completely. Melt the coating chocolate in a metal bowl over simmering water, or in a glass bowl in the microwave, stirring occasionally until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Poke a small hole in the bottom of a mushroom cap. Spread chocolate over the bottom of the cap. Dip the tip of a stem in chocolate, and press lightly into the hole. When the chocolate sets, they will hold together. Repeat with remaining pieces. Store at room temperature in a dry place or tin.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Holly Wilkins"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.803370786516854,
            "ratingCount": 178,
            "itemReviewed": "Meringue Mushrooms",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "38.7 calories",
            "carbohydrateContent": "7.1 g",
            "cholesterolContent": null,
            "fatContent": "1.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.6 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "21.9 mg",
            "sugarContent": "5.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-20T20:29:51.54Z",
                "reviewBody": "These are super cute.  I found that if you make a little hole in the bottom of the caps, you can fill them with chocolate for an extra little surprise.\nFor super realistic mushrooms, paint the bottom of the cap with chocolate, add the stem, then use a toothpick to make the 'gills' going out from around the base.\nEveryone thought these were real mushrooms.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Wilgus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jenn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-30T20:17:09.403Z",
                "reviewBody": "I didn't find these took much time at all! There aren't a lot of ingredients to assemble and when you beat on high it only takes a few minutes to get a good meringue, and the piping was really easy too...I don't have a pastry bag so i just cut a corner out a zip-lock and used that, and it worked fine. The only real comment I have is that this recipe makes a lot of merigue. I guess you could make the mushrooms a lot bigger than life sized, but i'd say you could probably halve it and still get 36.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hungrygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/890100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-18T01:07:41.25Z",
                "reviewBody": "definitely a fun recipe - not the easiest but a fun challenge. This is not a recipe for a humid day-the meringue is sticky and never dries out. ***Don't use a silicone mat, use parchment. They stick bad enough that you will damage them prying them off.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "foodaholic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/afreshphoto/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-06T04:02:24.39Z",
                "reviewBody": "These mushrooms are absolutely magical. They look so real, my husband was convinced I'd gone to the farmer's market without him! The only changes I made to the recipe were in the assembly. After removing the caps from the oven, I used a pastry brush to lightly smear the cocoa powder, going for a 'wild mushroom' look. After they had cooled, I sliced the pointed tips off of the stem pieces to make them flat. One at a time, I painted melted dark chocolate on the bottoms of the caps with a small craft brush, then pressed the cut end of the stem piece into the center. As each one was finished, I placed them cap side down in empty egg cartons so they wouldn't topple over. I left them to dry for a few hours, then sealed them in an airtight container. These were perfect on our Buche de Noel, but I can't wait until next Christmas to make these again. I think they'll be great for Easter, too. Thank you so much, Holly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "trufflebun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1731932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-23T01:36:09.633Z",
                "reviewBody": "Being a young adult, I hadn't heard of these small confections before. So I just had to include them into my holiday cookie gift assortments. Although many people had seen them before, my age group were just floored! A definate treat to leave an impression. The chocolate cofentioners---  I wasn't sure what EXACTLLY is was, so I used Cocoa powder, tasted great ( almost like really marshmallowy hot chocolate!)\n\nI also dyed some coconut green, mixed into some corn syrup and dipped the stem bottoms in there for some added realness. For some fantasy-- we made some colored corn syrup and painted little spots to resemble Wonderland mushrooms. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill Jakubiszen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillza/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-13T04:12:22.62Z",
                "reviewBody": "Oh and many thanks to foodaholic for the great professional-looking photos! Thanks to everyone's comments! I like the idea of using colored corn syrup to paint polka dots and make 'fantasy' mushrooms; also to make the 'gills'. So sorry about the confusion of chocolate to use. The brand I used to use was Wilton Candy Melts. Now I like to use Giardhelli (sp?) dark semisweet chips melted. Note - I tried tonight to make these with the pasteurized egg whites you buy in cartons? They did not whip to the same stiffness as natural whites though the volume seemed about the same. Maybe a little less. They are in the oven now...I will report back on any major differences. But I am thinking one should stay with the natural separate-them-yourself egg whites. I'm back! the only difference I found between the whites from carton and natural whites - was that the stems from the carton whites did not quite keep their shape as well during baking. I tried to make them tall and they didn't quite stay tall. But still fine. I've tried some new final touches too - before the chocolate hardens on some I sprinkle the tiny colored balls to look like 'spores'...also on some I sprinkle finely chopped candy canes...and on the tops of large mushrooms I put a couple dabs of melted chocolate then 'paste' on 3 tiny nonpariels (\"snowcaps\" candies\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly Wilkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1044138/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-01T14:19:23.633Z",
                "reviewBody": "These were the definite show-stealer at my New Year's Party. I was SO impressed with both how easy they were, and how realistic they looked! If you're like me (and the baker at my local supermarket) thinking, \"What the heck is chocolate confectioner's coating?\", then don't panic. I melted 6 or 7 Hershey kisses and they did the trick perfectly. I've heard meringue can be tricky, so I made sure to slowly sprinkle the sugar one tbsp at a time, and beat it lots and lots and lots, and it worked. Thanks to hungry girl for the zip-lock bag tip. I'll be making these for years and years to come. Thanks Holly!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Margaret",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1339289/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-01T14:08:49.45Z",
                "reviewBody": "These candy mushrooms are awesome.  I like to serve mine in a basket.  I also dust mine with cinnamon instead of cocoa...gives it a nice taste.  These do take a lot of time but are well worth it",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGIESKI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1241833/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T17:28:00.047Z",
                "reviewBody": "These were wonderful! Not only are they gorgeous but they're tasty too. I cut the sugar back to 1/2 cup; I don't like my meringue to be very sweet. I'm odd though. The rest of my family prefers a sweeter meringue.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sugar Lotus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T00:07:12.39Z",
                "reviewBody": "I'm sorry but even when I went over the tops of the caps with a wet finger my mushrooms turned out horribly uneven. I even started them without the tips on top! I even watched the Martha Stewart episode on making meringue mushrooms! Any suggestions? I thought this was going to be a fairly easy task but it turned into a horrible mess.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "dmkrenek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6097240/"
                }
            }
        ]
    }
]