[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/40332/guava-chiffon-cake/",
        "name": "Guava Chiffon Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F706698.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:08:03.000Z",
        "description": "Moist and fluffy with a tropical twist. Great for a Hawaiian-style party! I frost the layers with either coconut or cream cheese frosting.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "1 9-inch layer cake",
        "recipeIngredient": [
            "2 ¼ cups all-purpose flour",
            "⅔ cup white sugar",
            "1 tablespoon baking powder",
            "1 teaspoon salt",
            "½ cup vegetable oil",
            "½ cup water",
            "6 fluid ounces guava nectar",
            "5 egg yolks",
            "2 teaspoons vanilla extract",
            "2 teaspoons grated lemon zest",
            "3 drops red food coloring",
            "8 egg whites",
            "½ teaspoon cream of tartar",
            "½ cup white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).  Prepare three 9-inch cake pans by lightly greasing them, dusting with flour, and shaking out the excess.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together the flour with 2/3 cups of sugar, the baking powder, and salt into a large bowl.  In a separate bowl, beat together the oil, water, nectar, yolks, vanilla, and lemon zest until well combined.  Pour the yolks into the flour, and mix until the batter is smooth, mix in food coloring until desired shade is reached.  Beat together egg whites with the cream of tartar in a clean bowl until soft peaks form.  Gradually add the 1/2 cup of sugar, and beat until stiff.  Gently fold whites into batter. Pour into prepared cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes.  Run a metal spatula or small knife around the edges of the cake to loosen, and allow to cool in the pans for 10 minutes before inverting onto a cooling rack.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Laura Sacks"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1875,
            "ratingCount": 16,
            "itemReviewed": "Guava Chiffon Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "285.2 calories",
            "carbohydrateContent": "40.4 g",
            "cholesterolContent": "85.4 mg",
            "fatContent": "11.2 g",
            "fiberContent": "0.8 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "319.3 mg",
            "sugarContent": "21.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-28T22:48:08.747Z",
                "reviewBody": "I made this 5 times in the past week.  I wanted guava chiffon cake w/whipped cream and guava topping.  Cake flour is the only way to go to get the light, fluffy chiffon.  All-purpose flour creates a denser and sometimes fallen cake.  Use frozen guava juice concentrate (or passion fruit) in batter for a stronger flavor.  1 c. of egg whites is enough (6 jumbo/7 large eggs), just beat them until very stiff to hold volume.  If not beaten long enough, you’ll have baked guava pudding.  For guava topping, the ideal recipe is 1 c. concentrate thickened on stove with previously mixed 1 T. corn starch and 2 T. water.  I only had guava pulp (Goya brand) available and made my own concentrate:  2 c. guava pulp with 1/4 c. sugar to reduced to 1 c.  I thickened with the corn starch/water mixture.*  When desperate, thin some guava jam with water, and it works fine!\n*Using the reduced pulp in the cake makes for a flavorful though denser cake, more like guava bread.  I wouldn’t recommend it if you want a real chiffon.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cinzia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3052895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-23T23:21:07.17Z",
                "reviewBody": "The cake was moist and light, but needed a little something more.  I decided to try and duplicate the way the cake is served from this well known Hawaiian Bakery in LA.  I began by  making a filling combining 2 cups guava nectar and 1/4 cup sugar.  Bring to a boil and remove from heat.  Blend in 1/4 cup cornstarch mixed with a small amount of water.  Let cool.  Frost each layer with whipped cream and some guava filling.  You can then frost the entire cake with whipped cream.  For color, you can also spread some of the filling on the top of the cake.  Chill before serving.  Not exactly the same as the Hawaiian bakery, but close enough to satisfy my tastebuds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lil' menehune",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/483481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-27T18:55:58.757Z",
                "reviewBody": "Made this as my own birthday cake and loved it!! I frosted it with whipped cream and made some guava glaze to go in the middle and on top. Everyone loved it and I ended up making it just a week later for 20 people. For the glaze I used 1 c. guava concentrate thickened by 2 T. corn startch and 2 T. water. Thats enough to put between 3 layers and go on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "rissag",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3873927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-13T18:20:16.62Z",
                "reviewBody": "Please use cake flour instead of all-purpose. At least half the quantity. Also did not use red food coloring- no reason to make it schmancy for internal use. However for a party that would be festive! Delicious! I frosted with a pineapple-cream cheese frosting which was delicious but I would like to try with guava glaze and whipped cream like some other reviewers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Southernbelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5682136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-02T02:10:47.27Z",
                "reviewBody": "The cake was tasty but it's definitely not from Deelite bakery. I had trouble frosting the cake with cool whip. I think I will put the cake in the freezer so it is extra chilled when ready to frost.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Lou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2921946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-28T19:35:57.627Z",
                "reviewBody": "Followed the recipe to a tee and was dissapointed. It didn't have the chiffon-like texture I was anticipating. It was a lot denser than other guiava cakes I've had. Perhaps it would have been better using cake flour. The taste was okay but you can achieve similar taste with less work by doctoring a white cake mix with guava nectar juice. Excellent topped with guava glaze. I found other recipes online. (Side note- an actual picture of the cake would be appreciated instead of what I'm guessing is a stock photo since that I've seen this same pic posted on several other websites)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "LynC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4799359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-17T02:08:00.95Z",
                "reviewBody": "This was a very good and light summer dessert. I made a glaze to go on top of each cake layer by heating up guava nectar with powdered sugar and corn starch. After the nectar thickened and cooled off on the sove I put it in the fridge and covered the cake with it the next day. It was nice and thick and delicious. I frosted the sides of the cake with cream cheese frosting mixed with whipped cream and the top of the cake with just the whipped cream. Everyone loved it. Definitely make a guava glaze to get the guava flavor to come through.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "dirrtyredd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5194655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-15T17:08:45.233Z",
                "reviewBody": "My DH absolutely loves this cake. Since discovering this recipe I have made it four times in two months lol. I made a glaze to go in the middle for a little extra quava flavor but my dh thought it was too bitter so I mixed the glaze with some cream cheese frosting and wow it was fantastic. Making it for his birthday again today. One to keep for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crystalmc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4888233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-26T20:07:13.803Z",
                "reviewBody": "It's okay not impressed by it. Definitely Hawaiian style. It wasn't spongie enough for me. Followed the recipe to the \"t\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "A. Besada",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3394639/"
                }
            }
        ]
    }
]