[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/42968/pad-thai/",
        "name": "Pad Thai",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5354620.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2020-06-19T03:08:30.000Z",
        "description": "This is a traditional Pad Thai recipe used by a friend's mother. You can use chicken, pork, beef, tofu, or a combination. You may want to start with less pepper, and work your way up.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (12 ounce) package rice noodles",
            "2 tablespoons butter",
            "1 pound boneless, skinless chicken breast halves, cut into bite-sized pieces",
            "¼ cup vegetable oil",
            "4 eggs",
            "1 tablespoon white wine vinegar",
            "2 tablespoons fish sauce",
            "3 tablespoons white sugar",
            "⅛ tablespoon crushed red pepper",
            "2 cups bean sprouts",
            "¼ cup crushed peanuts",
            "3 green onions, chopped",
            "1 lemon, cut into wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak rice noodles in cold water 30 to 50 minutes, or until soft. Drain, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat butter in a wok or large heavy skillet. Saute chicken until browned. Remove, and set aside. Heat oil in wok over medium-high heat. Crack eggs into hot oil, and cook until firm. Stir in chicken, and cook for 5 minutes. Add softened noodles, and vinegar, fish sauce, sugar and red pepper. Adjust seasonings to taste. Mix while cooking, until noodles are tender. Add bean sprouts, and mix for 3 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "TRANSMONICON"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.971316818774446,
            "ratingCount": 767,
            "itemReviewed": "Pad Thai",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "523.8 calories",
            "carbohydrateContent": "58.5 g",
            "cholesterolContent": "178.1 mg",
            "fatContent": "20.7 g",
            "fiberContent": "2.9 g",
            "proteinContent": "26.4 g",
            "saturatedFatContent": "5.7 g",
            "servingSize": null,
            "sodiumContent": "593.6 mg",
            "sugarContent": "8.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-16T19:39:26.81Z",
                "reviewBody": "This is a bare bones recipe for Pad Thai. Here are my observations: Make sure your wok is very hot, to the point where the oil is about to smoke. add a clove or two of chopped garlic and a couple chopped scallions to the hot oil and fry for 30 seconds. Add thinly sliced chicken and some shrimp and fried tofu and fry for a couple minutes. Crack the eggs in there and stir for a minute or two. Turn in the noodles and fry for a 30 seconds. Add the fish sauce which has been mixed with a little rice vinegar, soy sauce and lime juice. Add some ground peanuts and stir fry the whole mess for a few more minutes. Remove from heat and serve with additional peanuts and fish sauce, crushed red pepper, cilantro leaves, fried scallions and lime wedges. Oh yeah, and omit the butter. It's really not necessary. I also omitted the bean sprouts because I don't care for them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ERINJW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/449876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-24T23:33:44.523Z",
                "reviewBody": "I am obsessed with Pad Thai and spend more than an ungodly amount of money on take out.  Having said that, this is a good, basic Pad Thai recipe.  I made the following changes:\n\n1.  Doubled the sauce (should have tripled it)\n\n2.  Cooked the chicken with four cloves of minced garlic in olive oil, not butter.\n\n3.  Added one teaspoon of peanut butter for each dose of the sauce, but will probably reduce that to 3/4 teaspoon, next time.\n\n4.  NOT ENOUGH HEAT.  I like my Thai food hot and will have to increase the heat next time by adding the seeds and placenta of a harabenero pepper, maybe even of two peppers.\n\nThis is a good recipe.  I gave it an 8 on a scale of 1 to 10 and my husband gave it a 9.5.\n\nIt's definately worth trying!  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Maria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1557852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-14T03:38:42.89Z",
                "reviewBody": "This didn't look like the real deal but tasted pretty close! Everyone loved it, but most have not had it before. I made mine with shrimp, doubled the sauce and used limes instead. Yum! Also I didn't have directions on rice noodle package, so I called my mom. Toss the noodles in boiling water for 1 min then turn off the heat. Let it sit for 5 min in the hot water, check for softness, then rinse with cold water. So much faster than letting them soak!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mommycooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/974418/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-30T17:47:27.827Z",
                "reviewBody": "Excellent Recipe!  This is one of my favorites.  I made the following changes:  1)  used only about 3/4 pack of noodles, 2) substituted sesame oil for vegetable, 3) tripled the sauce (white wine vinegar, fish sauce and white sugar) but only doubled the sugar. 4)  added sweet chili sauce and some minced garlic to the sauce.  5)  used 3/4 tbsp crushed red pepper and also added some cayenne.  6)  added some grated carrot with the bean sprouts (nice for color too), and 7) used lime instead of lemon.  Next time I'm going to try splenda instead of sugar and to reduce oil by frying chicken with Pam instead, or at least reduce the oil.  Also, I didn't follow noodle instructions - I cooked as per package and then added.  This recipe would be good with Shrimp as well.   Thanks for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2182776/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-19T13:27:05.06Z",
                "reviewBody": "This recipe was really good and very easy to make.  Based on the reviews of others, I made a few modifications to the recipe.  I would recommend doubling the sauce - there just won't be enough if you only make what the recipe calls for and you likely won't enjoy it as much.  I cooked the chicken in peanut oil with some garlic to give it some extra flavour.  I bought Thai rice stick noodles and the instructions on the bag said to put them in a bowl and cover them with boiling water and let sit for 7 minutes - this was much quicker than what the recipe called for (but double check the instructions for the noodles that you buy).  After the chicken was cooked and removed, I cooked the rest of the dish in a bit of sesame oil.  I garnished with lots of peanuts and green onions and it was extremely good.  My husband gave it a 10 and wants to have it weekly.  Very quick to make (providing you don't have to soak the noodles for up to 50 minutes).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPORTSNUT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1117966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-31T20:10:12.263Z",
                "reviewBody": "I was hesitant to review this because I made so many changes. But I just had some of the leftovers for lunch.  Straight out of the frig and it's a great cold noodle salad!  I like it even better than warm......\n \nI did what others suggested. No butter. Veggie oil and a bit of sesame oil with some chopped garlic. Lime instead of lemon.  I used rice vinegar. I tripled the amount of sugar, fish sauce and vinegar. Although double might have been plenty.  I used more red pepper. I added about two TBSP. of peanut sauce.  I used cubed deli turkey and NO bean sprouts.  I also threw in some yellow bell pepper (to use it up) and some thinly sliced carrots.......  \nMy thought is that pad thai is like making chili or soup.  You can make all kinds of changes.  What I would not leave out of this recipe is the vinegar, sugar, red pepper, fish sauce, and garnish of peanuts, green onions, and lime. (I also added some chopped cucumber and cilantro as garnish. I just love cilantro).....\n\nI had never made pad thai before and the sauce in this recipe really did the trick.  Delish.  I will be making pad thai a lot.  Thanks for the recipe, Transmonicon!........\n\nOne last tip learned from another reviewer.  I put the rice noodles in a bowl and poured boiling water over them.  After 5 minutes I drained and rinsed with cold water.\n ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sally",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/510578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-16T19:41:19.14Z",
                "reviewBody": "I can only imagine that the reviewers who said this was 'nothing like Pad Thai' have never been to Thailand!! This is very close to the Thai dish, the only thing that i can think of that the Thais add are tiny dried shrinps. Outside of Thailand I think this is as authentic (and delicious)as you are going to get!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HELENUK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-12T19:47:08.39Z",
                "reviewBody": "This recipe tasted like an unfinished take on Pad Thai. It lacked true Pad Thai seasonings and accordingly taste. When I prepared the recipe the sauce appeared to be miniscule in comparison to the main ingredients (noodles chicken sprouts). This was a problem as Pad Thai noodles must soak up a lot of flavor in order to compensate for their lack of taste. Upon completion it tasted as though the flavors were sparse and overall it felt bland. I would not use this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ELEMENTOPIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/912958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-11T23:47:21.96Z",
                "reviewBody": "This is almost one of the best Pad Thai recipes out there.  I did alter it slighty, and this is what I did:\n\n-Doubled the sauce.\n-Omitted the butter.\n-Substituted chicken for tofu and white vinegar for rice vinegar.\n-Added peanut sauce, sweet chili sauce, soy sauce more crushed red pepper & cayenne.\n\nI'll definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kasya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/943280/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Pad Thai",
            "description": "See how to make a great pad thai at home.",
            "uploadDate": "2014-01-01T22:39:42.285Z",
            "duration": "PT3M1.682S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F94043c92-f0dc-421d-8b38-b553458637a3%2Ff8b95005-0d47-4067-8d18-227f6ca296b1%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2998568697001"
        }
    }
]