[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/43941/gingerbread-biscotti/",
        "name": "Gingerbread Biscotti",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2942870.jpg",
            "width": 1944,
            "height": 1944
        },
        "datePublished": "2001-11-27T03:28:49.000Z",
        "description": "These spicy Italian cookies are the perfect accompaniment for cocoa or coffee during the holiday season! Serve with lemon curd or drizzle with lemon flavored almond bark for a special treat.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "⅓ cup vegetable oil",
            "1 cup white sugar",
            "3 eggs",
            "¼ cup molasses",
            "2 ¼ cups all-purpose flour",
            "1 cup whole wheat flour",
            "1 tablespoon baking powder",
            "1 ½ tablespoons ground ginger",
            "¾ tablespoon ground cinnamon",
            "½ tablespoon ground cloves",
            "¼ teaspoon ground nutmeg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Grease a cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together oil, sugar, eggs, and molasses. In another bowl, combine flours, baking powder, ginger, cinnamon, cloves, and nutmeg; mix into egg mixture to form a stiff dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough in half, and shape each half into a roll the length of the cookie. Place rolls on cookie sheet, and pat down to flatten the dough to 1/2 inch thickness.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 25 minutes. Remove from oven, and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When cool enough to touch, cut into 1/2 inch thick diagonal slices. Place sliced biscotti on cookie sheet, and bake an additional 5 to 7 minutes on each side, or until toasted and crispy.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "CRISTINA GOMEZ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.413461538461538,
            "ratingCount": 416,
            "itemReviewed": "Gingerbread Biscotti",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "70 calories",
            "carbohydrateContent": "12.1 g",
            "cholesterolContent": "11.6 mg",
            "fatContent": "2 g",
            "fiberContent": "0.6 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "26.5 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-21T04:50:32.783Z",
                "reviewBody": "These were pretty darn good. With a couple changes, the texture came out just perfect; they weren't too crunchy or too soft as other reviewers have stated. First, I replaced the oil with butter. I make a few different kinds of biscotti, and I've never seen a recipe call for oil. I figured the butter would be tastier. Second, to ensure a crucnchy yet not-too-hard texture, I mixed the ingredients according to most biscotti recipes I've tried. I mixed all the dry ingredients, incuding the sugar. Then I cut the butter into the dry ingredients until the mixture resembled course crumbs. In a seperate bowl, I lightly beat the eggs and the molasses together. I added this to the dry mix. I mixed this concoction until it was just combined. No overmixing! The dough should still be crumbly. I divided the dough in half and formed them into their log shapes on the cookie sheets. It's still pretty crumbly at this point, but it all firms up when you bake it. This looser dough allows the biscotti to cook up crunchy without being dense or hard. I think that's the reason some people ended up with tough cookies. You have to keep the dough kinda loose. Anyway, when I finsihed the baking process, I dipped them in white chocolate. Deliciousness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Firefly08",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2333403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-19T18:09:23.583Z",
                "reviewBody": "This is a good recipe after I changed a few things from what other reviewers have said and from other biscotti recipes I use.  I used 6 T marjarine instead of oil.  I omitted the whole wheat flour and ended up using about 4 cups white flour to get the right consistancy.  I also added a teaspoon vanilla and used 3 1/2 t. Pampered Chefs Cinnamon Plus instead of all the seasonings, it's just easier as it has all of them in it.    Next I divided into 3 logs and rolled them in Raw sugar mixed with a little cinnamon then flattened them.  It gave it a nice look after baking.  The easiest way to make biscotti is to bake on a Pampered Chef Bar stone(yes there is a difference in stones) They won't burn and when you bake the 2nd time, you just stand them up about 1/2 inch apart and don't have to flip them.  I'm not sure if I will do any white chocolate on them or not.  They do look pretty the way they are.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Betty McCommon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/881560/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-08T01:15:01.953Z",
                "reviewBody": "this may be the best biscotti I have ever had! I followed the recipe exactly (even the cooking time) and they came out perfectly. I don't know why some others had so much trouble. The dough wasn't sticky at all. Even my 6 year old had one with milk tonight and loved it! This is a keeper. Thanks so much Christina!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cristy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2168412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-12T21:23:36.547Z",
                "reviewBody": "Nice crispy, crunchy, spicy little treats. I followed the recipe as written with the oil, because butter is not normally used in genuine Italian biscotti, which never have a buttery taste. Those who think these taste bland might benefit from the addition of 1/2 tsp salt. Also, adding 1/4 tsp baking soda will keep the spices from giving a slightly bitter edge. If you want the spiciness to have a kick, 1/8 tsp black pepper or a couple of good shakes of cayenne will accomplish what you're looking for. I baked for exactly the time specified (25 minutes,) sliced and baked another 7 minutes per side. They came out properly light, dry and crunchy. Also avoided overmixing, which kept them from turning out tough. Painted the bottoms with white chocolate. Also, used half Splenda and half sugar. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-22T01:38:02.19Z",
                "reviewBody": "Look out Starbucks! This recipe is fantastic. I've made a lot of biscotti in the past so I decided to use butter instead of oil (1/3C). To get the gingerbread into the right size logs I wet my hands and had no problem shaping them into the desired shape. I baked them for 20min let them cool for 5min then cut them and turned them on their sides baked for 4 more minutes and they were done. I drizzled white chocolate on them when cool. I will make this over and over again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2747382/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-26T03:28:00.58Z",
                "reviewBody": "Maybe it's me, but I always like a little bite to my gingerbread so I add a dash (or two in my case) of finely ground black pepper.  This is one cookie that I always get recipe requests for. And people are impressed that biscotti is not something that has to be purchased.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Cookworm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-03T23:00:53.343Z",
                "reviewBody": "I thought this was a great recipe. I did sub 1 stick of butter for the oil Blackstrap molasses for regular molasses used all wheat flour and rapidura suger instead of the white. I also followed \"Firefly07\"s instructions for how to mix it up They said \"Second to ensure a crunchy yet not-too-hard texture I mixed the ingredients according to most biscotti recipes I've tried. I mixed all the dry ingredients incuding the sugar. Then I cut the butter into the dry ingredients until the mixture resembled course crumbs. In a seperate bowl I lightly beat the eggs and the molasses together. I added this to the dry mix. I mixed this concoction until it was just combined. No overmixing! The dough should still be crumbly. I divided the dough in half and formed them into their log shapes on the cookie sheets. It's still pretty crumbly at this point but it all firms up when you bake it. This looser dough allows the biscotti to cook up crunchy without being dense or hard.\" Thank you Cristina & Thank you Firely 07..this is the first time I ever made biscotti and it was awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RAPHAELLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1159649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-10T19:27:25.963Z",
                "reviewBody": "GREAT taste! I did use all purpose flour in place of the whole wheat flour as I didn't have any. The only other change I made was to lower the temperature to 325 degrees for the second baking. I put them in for 10 minutes on each side. The recipe was hard to follow because I had to make adjustments for the spices. They are written in fractions of a tablespoon and my measuring spoons are not that size. The ground ginger at 1 1/2 tablespoons would be 1 tablespoon plus 1 1/2 teaspoons...the cinnamon at 3/4 tablespoon would be 2 1/4 teaspoons....the ground cloves at 1/2 tablespoon would be 1 1/2 teaspoons..the nutmeg is fine! I hope this helps others so you don't have to figure it out. (and myself the next time I make it. lol) The biscotti is so good the recipe is still worthy of 5 stars! The aroma of this baking will knock your socks off! Thank you Cristina for sharing. It is being included in my assortment of biscotti Christmas gifts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-13T22:10:53.693Z",
                "reviewBody": "Delicious and easy! Fills the house with the smells of Christmas! I dipped them in white chocolate melts and hubby loved them! I did reduce the baking time as they were burning a bit on the bottom.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "deesquared",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2120063/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-28T16:21:54.993Z",
                "reviewBody": "These are decent but really need a little more kick! Next time I am going to add real ginger (either crystallized or fresh rather than ground) and some more cloves. Also they benefited from some icing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jolene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479521/"
                }
            }
        ]
    }
]