[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
                    "name": "Custards and Puddings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14445/desserts/custards-and-puddings/flan/",
                    "name": "Flan Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/44497/baked-flan/",
        "name": "Baked Flan",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4588238.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2020-06-19T03:08:34.000Z",
        "description": "This is a quick and easy baked flan recipe that is prepared in the blender. It's great served warm or cold and has a creamy texture like custard. Slice the flan and spoon a little of the melted sugar onto the top of the slice.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "⅔ cup white sugar",
            "1 (14 ounce) can sweetened condensed milk",
            "2 cups heavy cream",
            "1 cup milk",
            "5 eggs",
            "2 teaspoons vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small nonstick saucepan, heat the sugar over medium heat. Shake and swirl occasionally to distribute sugar until it is dissolved and begins to brown. Lift the pan over the heat source (4 to 6 inches) and continue to brown the sugar until it becomes a dark golden brown. You may slightly stir while cooking, but continually stirring causes the sugar to crystallize. Pour caramelized sugar into a 1 1/2 quart casserole dish or a large loaf pan, and swirl to coat the bottom of the pan evenly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a blender, combine sweetened condensed milk, cream, milk, eggs and vanilla. Blend on high for one minute.  Pour over the caramelized sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the filled casserole dish into a larger pan and add 1 inch of HOT water to the outer pan. Bake in preheated oven for 50 to 60 minutes, or until set.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Custards and Puddings",
            "Flan Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Beth"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.682730923694779,
            "ratingCount": 498,
            "itemReviewed": "Baked Flan",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "490.1 calories",
            "carbohydrateContent": "46.8 g",
            "cholesterolContent": "216.9 mg",
            "fatContent": "30 g",
            "fiberContent": null,
            "proteinContent": "10 g",
            "saturatedFatContent": "17.7 g",
            "servingSize": null,
            "sodiumContent": "141.2 mg",
            "sugarContent": "45.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-10T17:24:26.083Z",
                "reviewBody": "This recipe was very good and simple to prepare. Here's 2 suggestions - don't make this in a blender or you'll have to do it in 2 batches.  I used my Kitchen Aid mixer and it worked well.  I beat the eggs first, then added the remaining ingredients and beat it on speed 5 (medium) for about 2 min.  Also, remove it from the water bath immediately upon taking it out of the oven or it will overcook while you think it is cooling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2342558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-15T22:02:52.31Z",
                "reviewBody": "My husband is half Cuban and said that as far as taste and texture goes, this is as good as he remembers from his Grandfather or Abuela. \n\nI, too, really liked the taste and texture. It was very smooth and creamy and was the best flan I've had by far.\n\nThe issue that I had though was with the directions being incomplete.\nThe recipe didn't indicate at what point or how you got the flan onto another dish or if it should be cooled first. And when I poured the hot sugar into a cold dish it quickly became hard and stuck in the bottom of the pan. So I would follow the advice of another reviewer and carmelize the sugar in the pan you plan to use or make sure you're swirling the dish you're baking it in while you're pouring the sugar. After you cook it let it cool completely before you transfer it to a serving plate. Which you can do by putting your serving plate on top of the cooking dish and then turn it over. Maybe those instructions aren't there because it is assumed that everyone knows that but I'm sure there are some that don't.  \n\nHaving said that, the instructions for carmelizing the sugar were very helpful and I didn't have a bit of problem with that. I would give this recipe 5 stars for taste and 3 stars for incomplete instructions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Button",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1719029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-22T18:00:11.833Z",
                "reviewBody": "I have another recipe I normally use for flan, but didn't want to use all canned ingredients because I had some cream to use up.  I tried this recipe and we really liked it.  Based on the reviews and by comparing to my normal recipe I changed a few things.  I only carmelized 1/3 cup sugar and used 6 eggs instead of 5 because I needed to use up some eggs. I used my immersion blender to mix it up - easier cleanup. I also find it easiest to carmelize the sugar in my baking pan - saves dishes and eliminates the problem of it hardening up too fast.  Just sprinkle the sugar all over the bottom of your baking pan and place pan on stovetop over the lowest heat setting.  As pan heats, sugar will melt and using hot pads you can tilt pan until it is all melted and a nice brown.  Remove pan and set aside to cool as you mix other ingredients.  I wouldn't use a glass dish for this because if your dish is still too hot, when you add the cold or cool ingredients, your dish may crack.  I always use an 8 or 9 inch steel or aluminum cake pan and set it in a 10 inch cake pan for the water bath.  One more thing...mine wasn't done in 50 minutes, so I loosely placed a piece of tinfoil over the pans, slightly tented and cooked an additional 20 minutes until my knife came out clean after inserting in the middle.  If you like flan, you will like this recipe.  Very yummy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sspan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2374408/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T06:19:18.607Z",
                "reviewBody": "I followed the recipe exactly and after 50 minutes, the top was dark brown but the center wasn't even a bit set--completely liquid. I am an accomplished cook, and have no idea what what went wrong. If someone can tell me, I'd like to know!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MNmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/787920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T06:19:16.56Z",
                "reviewBody": "This was great!  I made two of them, one for New Year's Eve, & and one for New Year's Day.  They were big hits on both occasions.  I liked it because the ingredients were simple & basic, & the directions were specific & clear.  I found that the advice regarding melting the sugar was very helpful (I have burnt sugar before when I didn't pay close attention).  Everything came off without a hitch, except that I tried it in a blender the first time, but it was too full & ended up messy when I tried to pour it.  So, the second time, I just used a regular mixer & bowl & it was fine.  I also put the finished flan into the refrigerator overnight, so that it would set a little more & be cold when served.  Very yummy & classy!  Thanks, Beth!  (I'm making it again tonight for a baby shower tomorrow!)  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAYCO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549727/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-25T22:11:34.077Z",
                "reviewBody": "I made this recipe for some friends after we all came back from a trip to Mexico.  They said it tasted better than any of the flan we had in the restaurants there.  I used brandy instead of vanilla extract, and stirred a bit of brandy into the caramelized sugar at the end of melting, and that added a nice flavor.  I also used 12 ramekins instead of one large dish and they came out perfect – I reduced the cooking time by about 10 minutes to accommodate for the smaller bowls.  Highly recommended!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1743100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-13T00:28:06.39Z",
                "reviewBody": "The best flan I've tasted. Took me a few times to get the caramel right but it's fantastic and well worth the persistence to get it right. I took another reviewer's advice and used a big bowl and a mixer instead of a blender. I also fill one large pie dish and a smaller little casserole dish (like a single serving size) and it uses up the little leftover mix that I have. My mom usually takes that little dish home with her. She is a veteran cook and she licked her plate clean the first time she ate this. Also I cook the small dish for the same time with no problems. I like to eat it cold so after I let it cool (it will be runny when you take it out of the oven but will set nicely after it cools) I put it in the fridge. It makes it easy to cook the day before a dinner party.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLEANDRAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1158996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T20:31:19.763Z",
                "reviewBody": "This is very similar to the Spanish Flan (my favorite). I'm from Chile and this is a very popular dessert over there. A tip to prevent sugar from crystallizing is to add a few drops of lemon (2-4) while stirring the sugar in the pan. If you don't want to worry about burning the sugar, it's best to use the \"wet\" method which simply means adding a few drops of water (10-20) to the sugar so the sugar will be all wet but still solid in the pan and stir it until it becomes liquid and brown. You don't need to use the lemon when you use the \"wet\" method.  Also, after you mix all the ingredients and pour the mix into a deep baking pan (like those for cakes), you place the baking pan on top of a \"handless\"  deep pot that is filled with water half way. Then, you place both in the oven and cook it as per cooking time. I used to use a tooth pick or knife to check for consistency/texture before taking it out of the oven. Once the flan is ready, you prepare the caramel as per above instructions and pour it over the cooked flan when you are ready to serve it (not before!).  Let it stand at room temp or in the fridge for about 20 minutes until the caramel is fixed to the top of the flan. I prefer to let it stand at room temp so only the top caramel will be solid at time of serving because it only takes a few seconds for the caramel to solidify. If still in doubt, check the recipe for Spanish Flan (which is the original) for detail instructions about the caramel. Hope this helps. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Soulful-Writer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4224610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-17T20:29:18.717Z",
                "reviewBody": "BETH -- thank you!!! I have been searching for a good flan recipe for about a year now. This is the simplicity I was longing to achieve. This recipe I have ranked highest above all. It was easy to make and now it is a definite family favorite. This is a true Mexican dessert. (Anyone reading this..look no further - this is it.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTINAM13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1250921/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Baked Flan",
            "description": "See how to prepare a creamy, custard-like flan that’s super easy.",
            "uploadDate": "2012-11-29T22:55:43.550Z",
            "duration": "PT3M9.147S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F90c245d1-8689-4706-b2c9-cb09a7b66146%2F51e8bd0a-78ab-49bd-afe0-389ddda644f9%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1998339418001"
        }
    }
]