[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/45204/ravioli-dolci-sweet-ravioli/",
        "name": "Ravioli Dolci (Sweet Ravioli)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F53712.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-06-19T03:08:37.000Z",
        "description": "These are the tastiest little ravioli-like cookies, filled with your favorite preserves (I like cherry). Everybody likes them.",
        "prepTime": null,
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H10M",
        "recipeYield": "64 cookies",
        "recipeIngredient": [
            "1 cup butter, softened",
            "⅔ cup white sugar",
            "1 egg, beaten",
            "1 ½ teaspoons vanilla extract",
            "¼ teaspoon almond extract",
            "1 teaspoon grated lemon zest",
            "2 ½ cups all-purpose flour",
            "¼ teaspoon baking soda",
            "⅛ teaspoon salt",
            "½ cup cherry preserves",
            "½ cup confectioners' sugar for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the butter and sugar until smooth. Beat in the egg, then stir in the vanilla and almond extracts and lemon zest. Combine the flour, baking soda and salt; stir into the creamed mixture until a smooth dough forms. Divide dough into halves. Roll each portion out between two sheets of waxed paper into a 12 inch square. Refrigerate for at least one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove one piece of the dough from the refrigerator, remove the top layer of waxed paper, and cut into 1 1/2 inch squares. Place about 1/4 teaspoon of the cherry preserves into the center of the first sheet of squares. Set aside. Remove the remaining piece of dough from the refrigerator, remove top layer of waxed paper, and cut into 1 1/2 inch squares also. Poke holes for venting in these squares using a fork. Place each vented square over one of the filled squares, and gently seal the edges by pressing with the tines of a fork. Place cookies 2 inches apart onto prepared cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 9 to 11 minutes in the preheated oven, or until the edges are lightly browned. Allow cookies to cool for 5 minutes on the baking sheets before removing to wire racks to cool completely. Dust cookies with confectioners' sugar while they are still warm.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Justin Sinclair"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.55,
            "ratingCount": 40,
            "itemReviewed": "Ravioli Dolci (Sweet Ravioli)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "63.4 calories",
            "carbohydrateContent": "8.5 g",
            "cholesterolContent": "10.5 mg",
            "fatContent": "3 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.6 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "31.9 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-30T02:43:39.83Z",
                "reviewBody": "I made these as circles and they baked up better looking than they were raw. I used Nutella instead of jam. Next time I'll roll the dough thinner as there seemed a lot more cookie than filling and I didn't get that many cookies from 1 batch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CCSargent",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/137731/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-17T19:52:30.74Z",
                "reviewBody": "Okay.  I'm rating this recipe a 5 because anyone who tasted them even without knowing how much work went into them, gave them 5 stars.  I made them for an Italian themed espresso and cookie night when some friends from where I lived in Padova, Italy were coming to the states to visit.  They definately passed as \"Italian\" and everyone loved how they tasted.  I was frustrated with how long they took to make and the fact that the dough was impossible to work with after being out of the fridge for even 5 minutes.  I had to keep popping it in the freezer to make it cold enough to be workable.  This added to the time-consuming aspect of the recipe.  I am going to try it again for a gallery opening event I'm going to tomorrow night, but this time I'll take the advice of other reviewers and make the cuts after the two sheets are layed on top of one another with the filling already in between.  Hopefully this will cut down the time and frustration and not take away from the pleasing taste!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEZIREE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1739946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-21T21:29:19.653Z",
                "reviewBody": "Way too much work for what you get but if you have plenty of time to spare go for it. Used strawberry perserves and the cookies reminded me of mini Pop Tarts. Tasty cute just too much work for me. Advice: When you cut the squares in the dough cut them with one dough square on top of the other so all cut squares are evenly matched with a top and bottom piece.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BakingBot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1150630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T21:50:03.327Z",
                "reviewBody": "Out of the nine recipes all five star rated of Italian favorite cookies I made for my daughter's wedding these went first! Everyone loved them. Please follow the recipe; do not substitute pie filling. Thank you so much alaskababa",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALASKABABA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/849896/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-21T05:03:53.003Z",
                "reviewBody": "My family loved these cookies. I used my own cherry almond preserves. These cookies are just perfect for the Christmas table. The dough is easier to work with when kept chilled. I made both round and square shapes. If the dough becomes too soft simply put it in the fridge for a few minutes. I even put the squares (still on the waxed paper) back on a shelf in the fridge while I filled half a sheet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anita Louise McKennon-Paxton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2845682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T19:27:14.983Z",
                "reviewBody": "These are pretty good when you want something kind of light. They're kind of like two butter cookies with some fruit filling between them. Maybe on taste they were four stars but because they were so cute I had to give them five stars. They were also really fun to make. I used cherry raspberry and peach preserves (Smuckers) I liked the raspberry ones the best because they were the most tart. I think the only thing I will do differently if I make these again is to put more filling in each one. I used just 1/4 teaspoon of filling per square like the recipe said but I found that I wanted to taste the fruit a little bit more once I actually ate them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SQUIRRELGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/649376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-07T19:36:32.71Z",
                "reviewBody": "Oh man this recipe is one of the hardest I have ever made! Rolling the dough was incredibly difficult forming the cookies even more difficult... wow! I'm not sure this is worth the effort for what you get and that's saying something since I often make cakes that take 3 hours to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Chels",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2957355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-03T21:32:35.73Z",
                "reviewBody": "These cookies are excellent. I made 3 batches during the holidays and everyone loved them. I used a round cookie cutter so they looked more like little tarts than ravioli's.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stacey16303",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2677067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-12T16:13:06.6Z",
                "reviewBody": "I gave this five stars because the finished product is fabulous and so tasty! I made this in two batches and I made the first batch as directed. It was a little messy and hard to work with so here are some simple changes that worked great on the second batch. (The key is not to touch the dough too much after it is chilled.) After the dough is mixed separate into two balls. Refrigerate for at least an hour. After dough is sufficiently chilled remove one ball from the refrigerator place between two sheets of wax paper and roll till it's fairly thin. Peel one piece of paper off this layer. Draw out a grid pattern on this layer with a knife. Don't slice through the dough; just press enough to make lines. Place 1/2 tsp of preserves or nutella in each grid section. Set aside or place back in refrigerator. Remove second dough ball from refrigerator and roll between two pieces of wax paper to same thickness as the first layer. Take one piece of wax paper off the second layer then GENTLY turn the layer over and place on top of the first layer. Remove the wax paper from the top layer. Cut the cookies between the filling plops this time cutting all the way through. GENTLY turn the cookies over and place on the greased cookie sheet. Peel off the final piece of wax paper separate cookies and seal with fork tines. Sprinkle with sugar and bake as directed. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Checkett Farver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4408601/"
                }
            }
        ]
    }
]