[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/45921/crispy-and-creamy-doughnuts/",
        "name": "Crispy and Creamy Doughnuts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F09%2F10%2F3929613_original.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:08:39.000Z",
        "description": "I have tried so many versions of glazed doughnuts, and this one finally came out perfect! Just like the ones at my favorite doughnut shop.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "18 doughnuts",
        "recipeIngredient": [
            "2 (.25 ounce) envelopes active dry yeast",
            "¼ cup warm water (105 to 115 degrees)",
            "1 ½ cups lukewarm milk",
            "½ cup white sugar",
            "1 teaspoon salt",
            "2 eggs",
            "⅓ cup shortening",
            "5 cups all-purpose flour",
            "1 quart vegetable oil for frying",
            "⅓ cup butter",
            "2 cups confectioners' sugar",
            "1 ½ teaspoons vanilla",
            "4 tablespoons hot water or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle the yeast over the warm water, and let stand for 5 minutes, or until foamy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the yeast mixture, milk, sugar, salt, eggs, shortening, and 2 cups of the flour. Mix for a few minutes at low speed, or stirring with a wooden spoon. Beat in remaining flour 1/2 cup at a time, until the dough no longer sticks to the bowl. Knead for about 5 minutes, or until smooth and elastic. Place the dough into a greased bowl, and cover. Set in a warm place to rise until double. Dough is ready if you touch it, and the indention remains.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the dough out onto a floured surface, and gently roll out to 1/2 inch thickness. Cut with a floured doughnut cutter. Let doughnuts sit out to rise again until double. Cover loosely with a cloth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a saucepan over medium heat. Stir in confectioners' sugar and vanilla until smooth. Remove from heat, and stir in hot water one tablespoon at a time until the icing is somewhat thin, but not watery. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer or large heavy skillet to 350 degrees F (175 degrees C). Slide doughnuts into the hot oil using a wide spatula. Turn doughnuts over as they rise to the surface. Fry doughnuts on each side until golden brown. Remove from hot oil, to drain on a wire rack. Dip doughnuts into the glaze while still hot, and set onto wire racks to drain off excess. Keep a cookie sheet or tray under racks for easier clean up.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kelly"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6419753086419755,
            "ratingCount": 1377,
            "itemReviewed": "Crispy and Creamy Doughnuts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "330.5 calories",
            "carbohydrateContent": "47.3 g",
            "cholesterolContent": "31.3 mg",
            "fatContent": "13.4 g",
            "fiberContent": "1.1 g",
            "proteinContent": "5.3 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "171 mg",
            "sugarContent": "20.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-05T15:47:39.64Z",
                "reviewBody": "This is a great recipe. I have followed it more than a dozen times and I have tried variations. Most of the failures reported here are yeast-bread related. This, of course, means that you must take a lot of care with the bread basics. As described in the recipe, proof your yeast in the warm water. Give it 5 minutes or more. If you do not see a good healthy foaming action, toss it and start over. Dough handling is key. This is a rich dough with milk, egg and shortening. It is stretchy and yes, sticky. You don’t need to get stuck to it. When handling it, in the kneading and in the rolling and cutting, use flour to keep it manageable, but take care not to add so much flour that you change the ratio. I believe this recipe is correct. Some bakers reviewing here have noted the bread of the donut as being “not sweet enough”. This yeast bread rises prior to frying and then gets a big lift when dropped in the oil. Do not increase the sugar. I have tested in steps all the way to a doubling of the sugar. The only effect is that the dough becomes heavy and the taste approaches that of a cake donut. The recipe is correct. For this donut you want the lightness and the lift. The sweetness is in the glaze. If you want it sweeter, top it with a heavier glaze. For those of you with a BREAD MAKER, try it. Put the ingredients in exactly as listed and run on a dough-only setting. Turn the dough out onto your surface. Do not knead again, the machine did that. Avoid a full punch down. Press and rol",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eric",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2720181/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-20T22:21:23.673Z",
                "reviewBody": "These were absolutely delicious! Not Krispy Kreme in texture, but I think they are as close as you can get at home and the taste was RIGHT ON THE MONEY! \n    *I saw where someone said they would scald their milk, I highly reccomend you NOT do that as it will kill your yeast. Anyone who knows yeast will automatically know that. You can't have your yeast mixed with anything warmer than lukewarm. \n   *If you don't have enough glaze, just thin it a little with some more water. I would not change a thing, including adding more sugar as some have recommended. If you have a really sweet tooth, okay, but the glaze makes them sweet enough for me and my family.\n    *I also saw where someone said they could get greasy if not eaten right away. To avoid your doughnuts absorbing the grease, simply make sure your grease is hot enough. I alway heat my oil for at least five minutes or so on medium high to ensure this and then turn it down to medium before cooking with it. NOTE: Use cooking oil with a high smoke point to avoid fires! \n I will definitely make these again. Perhaps with cake flour next time and see if the texture is close to Krispy Kreme, but they are THE BEST homemade doughnut I have had to date.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HomeEcLady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/878636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-23T07:31:00.92Z",
                "reviewBody": "I really liked this recipe, the donuts tasted very good.  However, I omitted the half cup of warm water and sprinkled the yeast directly into the milk.  Reducing the liquid allowed the dough to develope much better with less flour. To keep the donuts from \"deflating\" after they have risen, place them on a square of waxed paper that has been sprayed with Pam or cooking oil.  When transferring to pan for frying, pick up waxed paper carefully by the edges and gently let the donut slide into the hot oil.  Any attempt to move the donuts with a spatula resulted in the donut \"falling\" and having a heavy texture when cooked.  Cook only light brown and turn, as any more cooking results in a dry donut.  These were fun to make but a little labor intensive.  The recipe makes GREAT bread rolls!  JIMBO",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JIMBO6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1056923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-28T19:42:38.773Z",
                "reviewBody": "These are a little time consuming but are worth the effort!! First of all, the recipe made almost double the amount stated, but that may have been due to my using a glass instead of a regular donut cutter, then a tiny round cookie cutter for the hole. I have never tasted KK donuts as I'm in Canada, but my b/f is from NY and when he tasted them the first thing he said is \"they taste just like Krispy Kreme's\".  I never showed him the recipe or any reviews, or even told him they were supposed to taste like KK's.  So I'm thinking they MUST taste a least a little bit like them if that's what someone says after taking just one bite. Anyway, whether they taste like KK's or not, the are EXCELLENT donuts.  I had to make extra glaze because there just wasn't enough for the 30 donuts & 30 holes this recipe made.  I added a small amount (approx 1/8 tsp) of maple extract to the glaze for the second half of the batch for a slightly different flavour.  I also noticed that when I cooked them at 325 (as recommended by a previous reviewer) they came out a lighter colour and slightly more tender than cooking @ 350. But really, whatever temp you cook them at, you really can't go wrong.  I've made this recipe 3X so far and I have yet to screw it up.  I think the only way you could mess it up is if you have the yeast or the oil at the wrong temp....or maybe don't let the dough rise long enough.  Other than that, this recipe is pretty fail proof...and probably the best donuts I've ever tasted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherise Montie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/889956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-31T17:39:00.34Z",
                "reviewBody": "Glaze doesn't have to be anything more than 10x sugar and a little milk and perhaps a splash of vanilla .. heat the mixture in the microwave til it crystallizes and it will stand the test of a day... for chocolate add the cocoa to the sugar first, mix then add milk til it reaches a nice soupy paste heat and use!  I bake for a local bakery and make doughnuts every weekend for the farmers' markets trust me the glaze doesn't need to be complicated.  BTW I dip the glazed doughnuts while wet into coconut and they are a big hit!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke Q Hébert",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2006380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T18:40:31.543Z",
                "reviewBody": "I live in England and I was looking for a recipe similiar to a Krispy Kreme from the US or Tim Hortons in Canada, and this recipe is it.  They are so good that they are to die for and they were gone as soon as I glazed them.  One note fry them at about 325 at 350 I burned some of them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Corkygal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/833670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-02T16:20:44.373Z",
                "reviewBody": "I have never visited the doughnut shops these doughnuts are named after and now I'll never have to when I can produce such fabulous product right in my own home!\r\nI saved some time by placing ALL ingredients at once in my mixer and let the dough hook do the kneading.  First rising takes slightly less than an hour. \r\nGlazing: I threaded the doughnuts onto chopsticks to drain, than placed on rack to cool.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan Mowbray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookinkiwi-1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-19T23:02:38.483Z",
                "reviewBody": "This recipe delivered *exactly* what it said it would.  The doughnuts tasted really (ahem) crispy and creamy but were slightly heavier than the store-bought ones (which is, I think, more the fault of the flour than the recipe).  If you follow the directions carefully the doughnuts will turn out delicious.  For perfect dough rising: heat your oven to 200 degrees F for one minute, let the door stand open for a few seconds then place the covered dough inside.  Remember to keep an eye on it so it doesn't over-rise and collapse!  For this recipe the dough should be doubled in 30-40 mins (but remember, this all depends on how warm you keep your oven).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Meryl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1363328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-13T01:00:39.92Z",
                "reviewBody": "I was amazed - my first time making these I came darned close to those glazed donuts we all love (and can't yet get where I live)! I am looking forward to my next batch.:-) I tried both large and small sized donut cutters and the small made a better donut. I also made donut holes and they were fabulous. It is important to keep the glaze relatively thin or you will get too much on the donuts and they will get heavy and too sweet. A little goes a long way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAPPIES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494861/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Crispy and Creamy Doughnuts",
            "description": "See how to make perfect glazed doughnuts.",
            "uploadDate": "2012-10-24T01:49:47.138Z",
            "duration": "PT5M20.683S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F02beb321-95f5-47c0-9156-785e83ef335f%2F5b328bf7-0224-41b7-ad3e-25a7ace137f1%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1920526580001"
        }
    }
]