[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/230/world-cuisine/latin-american/caribbean/",
                    "name": "Caribbean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46182/sharons-jamaican-fruit-cake/",
        "name": "Sharon's Jamaican Fruit Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1089704.jpg",
            "width": 1936,
            "height": 2592
        },
        "datePublished": "2020-06-19T03:08:40.000Z",
        "description": "A dark, rich fruit cake for wine and fruit lovers! This is a recipe I use at Christmas and for Birthdays.  I prefer to use Jamaican Red Label Wine and White Rum. But you may use your Favorites....ENJOY!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "2 - 9 inch round cake pans",
        "recipeIngredient": [
            "2 cups butter",
            "2 cups white sugar",
            "9 eggs",
            "¼ cup white rum",
            "1 tablespoon lime juice",
            "1 teaspoon vanilla extract",
            "1 tablespoon almond extract",
            "1 grated zest of one lime",
            "2 pounds chopped dried mixed fruit",
            "2 cups red wine",
            "1 cup dark molasses",
            "2 ½ cups all-purpose flour",
            "3 teaspoons baking powder",
            "½ teaspoon ground nutmeg",
            "½ teaspoon ground allspice",
            "½ teaspoon ground cinnamon",
            "1 pinch salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 - 9 inch round cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until light and fluffy. Beat in eggs, then add rum, lime juice, vanilla, almond extract, and lime zest. Stir in mixed fruit, wine, and molasses. Sift together flour, baking powder, nutmeg, allspice, cinnamon, and salt. Fold into batter, being careful not to over-mix. Pour into prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 80 to 90 minutes, or until a knife inserted into the center comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Caribbean"
        ],
        "recipeCuisine": [
            "Latin American",
            "Caribbean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sharon"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.37,
            "ratingCount": 100,
            "itemReviewed": "Sharon's Jamaican Fruit Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "862 calories",
            "carbohydrateContent": "124.2 g",
            "cholesterolContent": "220.8 mg",
            "fatContent": "35.1 g",
            "fiberContent": "0.8 g",
            "proteinContent": "9.6 g",
            "saturatedFatContent": "20.7 g",
            "servingSize": null,
            "sodiumContent": "418.4 mg",
            "sugarContent": "49.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-30T23:39:18.357Z",
                "reviewBody": "I used this recipe and it came out just as I  wanted it.  I love it and it is just like the Christmas cake my mother bakes in Jamaica. I live in the U.K. now and I have search the internet looking for a good recipe and Sharon's is the best of them all.  Although I had the fruit blended instead of having them in as they were just soaked and I have also added 1/2 bottle of red label wine, 1/2 bottle of Grace Browning and even 1/2 cup more of white rum to my cake. While baking I placed a baking tray with water below to ensure my cake remain soft.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SUZETTE2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/978808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T21:24:06.937Z",
                "reviewBody": "I'm really disappointed at this recipe.  After I spent time and money, it turned out to be something completely different from what I was expecting.  I ended up with so much batter, I filled up the two 9-inch round cake pans the recipe asks for, plus one 9x13 rectangular pan!!  When I put the cake pans in the oven, the batter started to rise nicely, but it suddently flattened, and I didn't open the oven door or did something to make it flatten.  The taste is not bad, but I couldn't taste the wine or rum at all.  I don't know if I did something wrong, but I read the instructions very carefully to make sure I was doing everything right.  This fruitcake turned out to be a pain in the neck.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "PANARICAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/976069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T05:55:58.59Z",
                "reviewBody": "YUMM i tried this once and ever since i have made it about 20 times!!! ITS GOOD!!!!!!!!!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yummdood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/908507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-23T17:48:10.927Z",
                "reviewBody": "Ok this got 2 stars but only because the flavor is really good. This was a really difficult recipe partly because the directions don't seem very clear. Specifically the wine. If you soak the fruit in wine as suggested in the tips in small print on the bottom are you supposed to use the 2 cups that is listed in the recipe ingredients? Or is that 2 cups in addition to whatever the soaking takes? Same with the rum. I assumed maybe incorrectly that it was in addition to what was used in soaking. It did seem a little wet. But maybe it was supposed to... And as far as cooking time goes I inserted a knife in and it came out clean. Unfortunately after trying to get it out of the pan I discovered that it was cooked on the top actually starting to get a little darker than I like and still gooey toward the bottom and very dark on the very bottom. The cooked part must have been scraping off the gooey part as I was removing the knife. So I have a very good tasting but gooey mess that will be eaten by my immediate family (who are used to being guinea pigs) instead of something special I had wanted to take to a family dinner tonight. Fortunately there's still time to go to the store for something else. Some additional direction clarification by those who have been successful with this recipe would be helpful. I'd try it again if such help were available since as I said the taste even of the goo was very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SUEMYERS67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2172448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-15T18:43:11.62Z",
                "reviewBody": "this came out great! my mother always told me about how she used to make her jamaican rum cakes with her mother. and after so many years we finally made one. the batter was a little bit to watery so we added more flower. but other than that this recipe was the best!! and we werent sure if we were supposed to add more red wine or if it was the wine used to soak tje fruits so we didnt add more and it turned out fine. definately will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "natasha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2250251/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-22T16:55:25.33Z",
                "reviewBody": "I tried this last year but I made sure I read all of the reviews first. My cakes came out beautifully but I had to make some changes. First of all you must add more flour to this recipe use your own judgment based on the consistency of the batter. Next if you like it dark then use more browning sauce. With regard to the rum/wine/brandy like another reviewer said I only put what I drink so I soaked my fruits for a week then boiled them on the stove for about an hour over medium low heat. I soaked them in Jamaican Appleton Brown Rum. That was fun! The most important thing I had to change for this recipe was the baking temperature. This has to bake slowly I turned my oven down to 250-275 for almost 1.5 hours. It is not going to rise much if at all but thats how a real rum fruitcake is. Once you take the cakes out pour more rum wine etc over them for that great moist taste. I am getting ready to make my batch for this year my husband keeps reminding me he loves this cake and can't wait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "charlene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4346890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-25T16:50:43.347Z",
                "reviewBody": "This is a REAL Jamaican Fruit Cake recipe - NOT the things that comedians make fun of every holiday season.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kiki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2221657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-28T21:36:48.87Z",
                "reviewBody": "THIS IS THE BEST! Well atleast that is the reviews I have gotten since Christmas. I had never attempted a fruitcake before and this year did it to surprise my husband who is also a Chef. He LOVES it as did my Dad who normally only eats my Grandmother's. Unlike most fruit cakes...this one is rich and moist using the real dried fruit (which I soaked for a week in the fridge with 2 cups red wine) sets it above all others! If you want to make an award winning (well atleast in our family) fruitcake then this is the one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Buttrflylace3535",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/861324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-27T21:07:24.487Z",
                "reviewBody": "Like some of the other reviewers I thought this recipe was a little vague. I soaked the fruit for several weeks in the wine and didn't add anymore wine to the batter. The cakes baked beautifully and smelled divine. Unfortunately I gave both of them away as presents! I didn't even get a taste. I got great comments from the receivers so I will definitely try it again. I used a mix of a lot of dried fruits.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TEXASNANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/texasnana/"
                }
            }
        ]
    }
]