[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/219/salad/vegetable-salads/",
                    "name": "Vegetable Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46168/spicy-italian-salad/",
        "name": "Spicy Italian Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F374700.jpg",
            "width": 2136,
            "height": 2169
        },
        "datePublished": "2020-06-19T03:08:40.000Z",
        "description": "Requests for this salad are never ending at any gathering!!!",
        "prepTime": "P0DT0H30M",
        "cookTime": null,
        "totalTime": "P0DT4H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ cup canola oil",
            "⅓ cup tarragon vinegar",
            "1 tablespoon white sugar",
            "1 teaspoon chopped fresh thyme",
            "½ teaspoon dry mustard",
            "2 cloves garlic, minced",
            "1 (8 ounce) can artichoke hearts, drained and quartered",
            "5 cups romaine lettuce - rinsed, dried, and chopped",
            "1 red bell pepper, cut into strips",
            "1 carrot, grated",
            "1 red onion, thinly sliced",
            "¼ cup black olives",
            "¼ cup pitted green olives",
            "½ cucumber, sliced",
            "2 tablespoons grated Romano cheese",
            "ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium container with a lid, mix canola oil, tarragon vinegar, sugar, thyme, dry mustard, and garlic. Cover, and shake until well blended. Place artichoke hearts into the mixture, cover, and marinate in the refrigerator 4 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, toss together lettuce, red bell pepper, carrot, red onion, black olives, green olives, cucumber, and Romano cheese. Season with pepper. Pour in the artichoke and marinade mixture, and toss to coat.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Vegetable Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Diana"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.596774193548387,
            "ratingCount": 124,
            "itemReviewed": "Spicy Italian Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "248.1 calories",
            "carbohydrateContent": "13.2 g",
            "cholesterolContent": "2.6 mg",
            "fatContent": "21.1 g",
            "fiberContent": "3.7 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "462.2 mg",
            "sugarContent": "5.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-01T15:59:18.827Z",
                "reviewBody": "Per my preference, I used olive oil instead of canola oil.  I omitted the red peppers  and carrots, and added cherry tomatoes, sliced in half.  I also added a little bit of table salt.  I also used all black olives instead of green and black.  As another reviewer suggested, I marinated ALL the vegetables (minus the lettuce of course) together and then tossed right before we ate dinner.  I topped with homemade croutons.  It was delicious!  I served with lasagna, and many guests had second helpings of salad, rare!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NikkysNiche",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/654348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-28T06:28:23.263Z",
                "reviewBody": "I wanted a special salad to accompany the pasta dinner I made for my father-in-law's 90th birthday and I'm thrilled to have found this tasty recipe! So many salads are forgettable but this one stands out; everyone loved it. For maximum dresing flavor be sure to drain the artichoke hearts really well. I placed each piece upside down on a paper towel and pressed down lightly to remove as much liquid as possible. I also added some mozzarella fresca (fresh marinated mozzarella balls) just before serving. This one gets a rave review from my family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COLAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1408445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-10T12:19:31.34Z",
                "reviewBody": "Very tasty and hearty salad. I chopped all of the vegetables in advance (adding tomatoes) and marinated them ALL in the dressing and tossed with lettuce right before serving. I will be making this salad again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "1SUNNYGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1347392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-03T17:57:48.64Z",
                "reviewBody": "This salad was a great \"hit\" with our neighbors and they have all asked me to make it again or give them the recipe.  I made a few changes as suggested by previous reviews.  I used olive oil instead of canola, added more veggies (and definitely more garlic), marinated the carrots and black olives with the artichokes, added gourmet mozzarella cut into bite size pieces and put more grated Romano cheese on top of the salad when serving.  I wasn't too sure about \"chopping\" the lettuce, so, I just tore it into bite size pieces. I am making it again today (one week later) and will add more artichokes. This is definitely a recipe I will keep, but with the changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1761793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T05:22:33.373Z",
                "reviewBody": "This was awesome with an Italian meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T17:02:40.563Z",
                "reviewBody": "Very Nice! For those wondering about tarragon vinegar Heinz makes a very popular brand. But if you can't find it you can make your own but it can take between 2 and 3 weeks. Recipes can be found for it if you Google it. I don't think It'd be as good with plain vinegar. To up the spiciness that everyone said it lacked I did add about a 1/2 tsp. red pepper flakes to just the oil 4 days before putting together the salad. It certainly added to the \"spiciness\" and it has one heck of a kick! I probably could have gotten away with just 1/4 tsp or letting it sit for fewer days. I will do that again when I make it the next time! I also added Yancy's Peppadew cheese (a local mildly spicy sweet pepper cheese) mozzarella and capocollo ham. We did leave out the carrots because we don't care for raw carrots. It might be really good with roasted red peppers and maybe some mushrooms and a couple of shakes of Italian seasoning in it too. Can't wait to taste this after it has sat for a night! I'm hoping this won't get gobbled up tomorrow this is one dish that won't get tossed out; I'd love leftovers of this! WOW! OK.....UPDATE: NOT A GREAT LEFTOVER MEAL!!!! It did taste wonderful that day. This salad doesn't get better as it gets older. if it doesn't get ate the day you add the lettuce you will only ending up tossing it out. So think about how much might get eaten that day because it might just end up being a waste of money!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BEARLYBARBIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1375810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T05:22:44.013Z",
                "reviewBody": "This took awhile to prepare but it was really worth it! The artichoke dressing was wonderful! I left out the carrot and added a green pepper and some crumbled blue cheese. We also added some pepperoni to make it a complete meal rather than a side dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TINYDOT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/414951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T05:22:40.403Z",
                "reviewBody": "A good salad however not very unique. The artichokes had the most flavour from the marinade and the rest of the salad was rather ordinary. I guess I missed something in the \"spicey\" part. I would use this recipe as a base but would certainly add more herbs spices to zip it up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GOGOLF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/559957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-10T02:31:13.38Z",
                "reviewBody": "Given that my mission was to clean out the fridge of ingredients I had on hand before I leave for home in the morning I didn't do a bad job of following the recipe pretty closely. I don't care for tarragon vinegar or canola oil and I had a lemon to use so I made my dressing of olive oil fresh lemon juice the fresh thyme dry mustard garlic. salt and pepper following the measurements as directed in the recipe. I did not include the sugar which never appeals to me in a salad dressing. I grilled fresh baby artichokes and skipped the step of marinating them in the dressing. Regardless of insignificant individual modifications to this recipe it is one worth trying. As long as you preserve the basic intent of the submitter and her recipe you will be rewarded with an excellent salad your fork will return to until your plate is clean. It is layers of refreshing and compatible flavors a rare and refreshing alternative to the typical tossed green salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            }
        ]
    }
]