[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/730/world-cuisine/latin-american/south-american/",
                    "name": "South American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1278/world-cuisine/latin-american/south-american/brazilian/",
                    "name": "Brazilian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/47436/brazilian-passion-fruit-mousse-maracuja/",
        "name": "Brazilian Passion Fruit Mousse (Maracuja)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9077673.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:08:47.000Z",
        "description": "This is Brazilian favorite (and an old family recipe), and takes no cooking at all.  It's a little tart and tangy for those of you who don't like your desserts to be too sweet.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "8 passion fruits",
            "1 tablespoon white sugar",
            "1 (14 ounce) can sweetened condensed milk",
            "2 cups cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Break passion fruits in half, and empty contents into a bowl. Use a little water to help rinse the juice out of the skins. Mix with hands to soften pulp. Strain through a sieve or cheesecloth. Stir in sugar and sweetened condensed milk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a chilled bowl, beat cream until stiff peaks form. Fold 1/3 of the cream into the passion fruit mixture, then quickly fold in remaining cream until no streaks remain. Refrigerate for 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "South American",
            "Brazilian"
        ],
        "recipeCuisine": [
            "Latin American",
            "South American",
            "Brazilian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "VALERIEKOOKA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.285714285714286,
            "ratingCount": 42,
            "itemReviewed": "Brazilian Passion Fruit Mousse (Maracuja)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "514.8 calories",
            "carbohydrateContent": "45.4 g",
            "cholesterolContent": "130.9 mg",
            "fatContent": "35.2 g",
            "fiberContent": "2.5 g",
            "proteinContent": "7.3 g",
            "saturatedFatContent": "21.9 g",
            "servingSize": null,
            "sodiumContent": "119.8 mg",
            "sugarContent": "40.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-28T04:00:59.25Z",
                "reviewBody": "This is a great recipe and I've already made it 3 times.  Three notes: one, condensed milk is already so sweet, I don't add sugar.  second, in order for it to have a mousse consistency, it's best to let it sit in the refrigerator overnight (if it doesn't refrigerate long enough, it will taste yummy but won't have the right consistency).  The last note is that once I didn't have enough passion fruit juice, I added lemon juice - it turned out really great!  Since (as I've mentioned) condensed milk is so sweet, I'd imagine you can substitute the passion fruit with citrus/acid fruits.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DeborahYael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2510542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T18:26:28.707Z",
                "reviewBody": "This is a wonderful recipe and so easy to make. For people in the US who may have trouble finding (or affording) fresh passion fruit, a good alternative can be found in Latin markets. The Goya brand makes frozen tropical fruit pulps that are 100% fruit. They come in 14 oz. bags - enough to make 2 batches of this recipe. I break the frozen pulp in half and put the extra half in a Ziploc bag to keep frozen for another day. The people who are reporting problems with texture are making one of two errors. They are either using juice which is too thin or are not beating the cream to full stiff peak stage. Stiff peak can be difficult to judge because you really need to take the cream to the edge of butter.  I like to use this as the base for parfaits, layering the mousse with fresh chunks of mango and fresh raspberries (don't use frozen as they will seep water resulting in a soggy product).  Goya makes the same frozen fruit pulps in a number of fruits and I have tried this recipe with their guava and mango pulps as well and both yielded wonderful results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Okie Steve",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3587295/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-20T10:04:28.357Z",
                "reviewBody": "Passion fruit mousse is a favorite of mine here in Rio.\nI also find the creamy texture (which Brazilians love) to be a little sloppy.  I use six passion fruit - I find blending the pulp and seeds in a baby mixer, then sieving the bits out leaves to a niced texture, but that's just me.\nBlend the juice with equal amounts of condensed milk to heavy cream.  An electric hand mixer seems to get a good consistency.  I also add a third to one half of a packet of gelatine, just to make it set that little bit firmer.\nIt does not need any sugar as passion fruit are sweet enough usually.\nGood luck.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "316",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2621305/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-26T21:58:11.13Z",
                "reviewBody": "This recipe is wonderful! I used a can of frozen passion fruit juice instead of fresh and it was still fabulous. This recipe is a keeper. UPDATED VARIATION: I have tried this with limeade concentrate and it is great! I pour it into two graham cracker pie shells and let it sit for three hours to overnight before serving. It makes a light tart summer treat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steph",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2110812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-08T08:30:58.277Z",
                "reviewBody": "I've made this twice now and had rave reviews both times. The first time I used one can of passionfruit pulp in syrup because we can't get frozen juice here and passionfruits are too expensive. I also cut out the sugar. Mine set overnight you also have to be very careful when folding in the passionfruit mixture not to knock the air out of your cream. The second time I made it I used two cans of passionfruit and kept the sugar and instead of setting in the fridge overnight used my ice cream machine to make the most awesome icecream anyone in my house has tasted. Next time I make it I will go back to one can but this is a keeper for my family. Nice mousse brilliant ice cream!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SILVERMOONDRAGON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1203936/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-25T15:09:11.847Z",
                "reviewBody": "I have been on the hunt for passion fruit after seeing this recipe because I want to impress my friend from Brazil who is coming for dinner tonight. (I've dipped a pinky into the refrigerated finished product a couple of times and already after chilling for only an hour it's an out-of-this-world dessert!) Did not change a thing except that I added half a pkg of gelatin as one reviewer suggested. The mousse is of perfect consistency but I also whipped the cream for a long time as someone else mentioned. I feel that the 1 TBS of sugar is perfect too because I used only fresh fruit (not frozen concentrate). Later I will transfer the mousse to individual dessert cups and garnish with fresh mint from the garden. Now for the best part -- I spent half of today combing my city for passion fruit pulp passion fruit frozen juice passion fruit anything to no avail. I finally found the fruit itself at a high-end grocery store and purchased 8 of them for 12. Pricey and will need to locate more economical sources. The 8 fruits equalled almost 1/2 cup of juice. I had some fresh mangos on hand so squeezed part of one mango to make a tad over 1/2 cup of juice. I will try other juices in the future as well to experiment. BTW the main dish will be Picadinho'A Brasiliera a rather rich Brazilian meat dish so this light and fluffy mousse will be perfect! Thank you VALERIEKOOKA! Update: I now use the Goya brand of frozen Passion Fruit Pulp. Search in local Hispanic markets.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin Stevens-Beaver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2738930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-15T22:59:31.763Z",
                "reviewBody": "I tried two recipes and this was one of them. It tasted good but it didn't set up. It was just creamy. I tried it again adding gelatin and it didn't set up then either. My friend told me that there isn't enough acid in the passion fruit to help it set so I modified this recipe and it turned out GREAT! What I did was I added 1 can sweetened condensed milk to a blender. After straining 7-8 passion fruits through a sieve (I also added a tiny bit of water)(reserving the seeds for a topping) I put the passion fruit juice in the empty condensed milk can and then added the juice of a lime (or lemon) until the can was a little over 1/2 full and threw that in the blender. I also added heavy cream. It set up immediately and it tasted great. I put the mousse in a bowl and added the seeds to the top. I couldn't taste the lime at all. We ate half the bowl before it was chilled but it definitely tasted better chilled.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "drspear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2528061/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-14T04:05:43.72Z",
                "reviewBody": "This is a great recipe, I have made it twice so far and it turned out great every time. Since passion fruits vary greatly in size, the asked-for amount of 8 passion fruits is very non-specific. After reading through the comments, I altered the recipe slightly. I used a little over 1 cup of passion fruit pulp (no seeds), added one can of condensed sweetened milk and and about 1 1/2 cups of whipping cream. I dissolved 1 pack of gelatin in part of the juice before I added it to the cream mixture. I also omitted the sugar, the condensed milk added enough sweetness and I think the tartness is what gives passionfruit its zing, so I didn't want to tone that down too much. I mixed it all up, put it all in my Kitchenaid with the whisk attachment, and beat it for a good 3 minutes until it was foamy. Then I chilled it overnight. The result was a light, sweet and tart heavenly mousse. This has become my favorite passion fruit recipe, and both times I made it, it was gone within a day - even my picky son eats it. Next time, I may serve it with a fresh raspberry sauce or as a cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naturalbornhealer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3661724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-07T08:46:05.84Z",
                "reviewBody": "This was nothing like a mousse. It ended up being a cream consistancy which didn't set at all. The taste however was beautiful. It would probably work better as a side dish ie. to serve on the side with fresh fruit or with a sponge cake. Passionfruit Cream would be a more appropriate name!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Hot Chilli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/678930/"
                }
            }
        ]
    }
]