[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/718/world-cuisine/european/austrian/",
                    "name": "Austrian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/48308/potato-plum-dumplings/",
        "name": "Potato Plum Dumplings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4558276.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:08:51.000Z",
        "description": "Sweet dark plums are wrapped in a potato dough, and boiled before rolling in sweetened toasted bread crumbs. My Austrian grandmother made these delicious dessert dumplings for us every fall. These take some time to make, but to me, they're well worth the effort.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H55M",
        "recipeYield": "12 dumplings",
        "recipeIngredient": [
            "4 large russet potatoes",
            "½ teaspoon salt",
            "1 tablespoon butter, softened",
            "2 eggs, beaten",
            "¼ cup farina",
            "1 cup all-purpose flour, or as needed",
            "12 Italian prune plums",
            "12 cubes  white sugar",
            "½ cup butter, melted",
            "¼ cup white sugar",
            "1 cup dry bread crumbs",
            "additional melted butter and sugar for garnish (optional)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Scrub potatoes, and place them into a large pot with enough water to cover. bring to a boil, and cook until tender, about 40 minutes. Drain, and cool. When potatoes are cool enough to handle, peel, and press through a ricer into a large bowl. Set aside to cool. This part of the process can be done as much as one day in advance.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the prepared potatoes, salt, egg, and 1 tablespoon of butter until well blended. Gradually stir in the farina, and then the flour. If dough is still wet, more flour can be mixed in. Turn dough out onto a floured surface, and knead until smooth, about 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Split open each plum where it cracks, and remove the pit. Replace each pit with a sugar cube, and close.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a floured surface, roll out the dough to 1/4 inch thickness. Cut into  twelve 3 inch squares. Place one plum into each square, and bring the corners around to the top. Pinch together all of the seams to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a slow boil. Place about 4 dumplings into the water at a time. Once they float to the surface, continue to cook them for about 5 more minutes. Transfer cooked dumplings to a covered bowl, and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the remaining 1/2 cup of butter in a small skillet over medium heat. Stir in bread crumbs, and 1/4 cup of sugar. Continue to cook and stir until browned. Remove the bread crumbs to a plate, and roll warm dumplings in the mixture until entirely coated. To serve, place a dumpling or two on a plate, sprinkle with a little sugar and a little extra melted butter, if desired.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Austrian"
        ],
        "recipeCuisine": [
            "European",
            "Austrian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "LINDA MCLEAN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.534883720930233,
            "ratingCount": 43,
            "itemReviewed": "Potato Plum Dumplings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "326.1 calories",
            "carbohydrateContent": "53 g",
            "cholesterolContent": "53.9 mg",
            "fatContent": "10.4 g",
            "fiberContent": "4.4 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "5.9 g",
            "servingSize": null,
            "sodiumContent": "243.5 mg",
            "sugarContent": "14.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-14T04:42:37.717Z",
                "reviewBody": "Hi guys! I'm the submitter of this recipe and I just wanted to say how happy I am that this dish has brought back many wonderful memories for you. I stated that these were time consuming and I certainly wasn't kidding because I'm making them now as I'm writing. \"Prairie Dixie\" I give you so much credit for saying that you'll be making this every fall for the rest of your life. I haven't made my own recipe in several years and I now know why!! I am however making 32 of them so it's taking a bit of time. I just wanted to say that some of my raw \"knoedels\" were sticking to the plate and breaking open the dough so I went back and used cooking spray on the plate. It helped a lot. I hope my Oma is looking down and smiling at me because I'm definitely looking up at her and appreciating all of her efforts and of course love. Happy cooking gang!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-13T16:07:04.063Z",
                "reviewBody": "Update: I combined this recipe with 'Peach Dumplings' on this site. I wasn't sure what farina was so I just added more flour. Thanks so much Linda Caleb and I had such fun making this. It was messy but so worth it! (See posted pics). You're as sweet as a sugar cube! (: Love you! Day Original review: This recipe is so awesome and I was extremely pleased to see such a treasured heirloom recipe submitted here. My family used to make peach dumplings like this but I thought the sugarcube in the center was such a nice touch! It added an extra sweetness to an already wonderful recipe! The best recipes in the world are the ones made with love and time and this is definately one of those recipes. Thank you so much Linda for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanaquil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1982546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T00:29:05.013Z",
                "reviewBody": "Great!  My Austrian grandmother also makes these, and I'm glad mine turned out as well as hers.  I tried this recipe twice, once making the potatoe dough from scratch and then using store bought potato dumpling mix.  Both work great, but the store bought method is a lot faster :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EMARIE83",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-24T00:14:24.497Z",
                "reviewBody": "I am German and I usually get food like this fresh on the local fairgrounds. I am used to haven it served with a creamy vanilla sauce on top. This time I am too busy to go so I though I'd try making them myself. This is a pretty good recipe. Advice from a Southern Germany where potatoe dumplings are a regular on a Sunday lunch table: the secret is the slow boil rapid boil will make them fall apart. Thanks for the recipe and regards from the other side of the big pond:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mangowww",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2266231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-08T22:43:56.127Z",
                "reviewBody": "It's so nice to see family heirloom recipes posted. This one was fun to make & the sugar cube replacing the plum pit is just pure genius. Loved it thanks so much for sharing:o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEE C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1987747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-11T16:28:51.7Z",
                "reviewBody": "My Hungarian Grandmother made these for us our whole lives they are wonderful just how we remembered. we add cinnamon to the bread crumbs and brown sugar. When you can taste childhood memories its just wonderful....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALESIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1044328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-29T22:24:33.413Z",
                "reviewBody": "Thank you Linda!!! My Grandmother used to make these when I was a little girl and our family recipe was lost years ago. As soon as I saw this I had to try them and am I ever glad I did. These are even better than my Grandma used to make and make sure you make lots I have already made 6 batches and am still getting requests for more. The only thing I changed is that we don't serve them with bread crumbs I mix sour cream with sugar and spoon it over luke warm dumplings. I also used much more flour than called for to get the dough a consistency for rolling. Thanx so much for the recipe Linda I will be using it every fall for the rest of my life! I just wish plums were in season all year.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "prairie pixie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1165733/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-09T00:31:39.107Z",
                "reviewBody": "These are as stated in the recipe a bit time consuming but it is worth it! Good things do come to those who are willing to wait and trying out any new recipe especially one that is traditional in another country... it will take some time and patience.....You'll love these if you try them! Thanks Linda for sharing your Oma's recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jody1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-08T19:45:55.583Z",
                "reviewBody": "I tried these and I absolutely loved them! I personally don't mind a recipe that takes a little time especially if it's authentic but maybe if you don't truly enjoy cooking you may want to stick with some simpler recipes that require less cooking experience. Definitely worth the time and effort. Thank you Linda! It's a very special recipe and I know that I'll try it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon :) ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1811206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-30T17:36:35.283Z",
                "reviewBody": "Boy these are as stated \"time consuming\". Not worth making at all. The taste just was not there for all the effort",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "RACHEL1070",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/571830/"
                }
            }
        ]
    }
]