[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
                    "name": "No-Bake Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/49640/two-tier-strawberry-pie/",
        "name": "Two Tier Strawberry Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F679322.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:08:57.000Z",
        "description": "This pie has a delicious twist. I no longer make regular strawberry pie because this one is so good.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 (3 ounce) package cream cheese",
            "½ cup confectioners' sugar",
            "½ teaspoon vanilla extract",
            "½ teaspoon almond extract",
            "1 cup heavy cream",
            "1 (9 inch) baked pie shell",
            "⅓ cup white sugar",
            "2 tablespoons cornstarch",
            "⅓ cup water",
            "⅓ cup grenadine syrup",
            "1 tablespoon lemon juice",
            "2 cups fresh strawberries, hulled"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together cream cheese and confectioners' sugar until smooth and creamy. Stir in vanilla and almond extract. In a separate bowl, whip cream until peaks form. Fold into cream cheese mixture. Spread over bottom of baked pie shell. Chill.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan, mix together sugar and cornstarch. Stir in water until smooth. Add grenadine and lemon juice. Bring to a boil over medium heat. Cook 5 minutes, stirring constantly, or until thickened. Allow to cool, then chill.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Just before serving, stir together strawberries and cooled cornstarch mixture until evenly coated. Spread over cream cheese layer.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "No-Bake Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Julie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.641891891891892,
            "ratingCount": 148,
            "itemReviewed": "Two Tier Strawberry Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "377.9 calories",
            "carbohydrateContent": "41.6 g",
            "cholesterolContent": "52.4 mg",
            "fatContent": "22.6 g",
            "fiberContent": "1.1 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "11.1 g",
            "servingSize": null,
            "sodiumContent": "169.3 mg",
            "sugarContent": "24.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-05-03T02:17:45.903Z",
                "reviewBody": "Awesome! I didn't have any grenadine and didn't want to make a special trip to get some, so I just used a few tablespoons of strawberry jello powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-29T01:23:09.647Z",
                "reviewBody": "Wow. This is a great tasting easy pie and I can't wait to adapt it to other berries later in the season! Like other reviewers I used an 8 oz. package of cream cheese instead of 3 oz. and a graham cracker crust. Next time I will have to try chocolate crust for a bit of rich variety. It seems that cookie based crusts don't get nearly as soggy as a traditional dough crust would. (I learned this by accident as I arranged the berries on the pie assuming we were going to eat it rather quickly but we ended up having to leave the house so the pie wasn't actually served or cut into until the next day. The glazed berry topping firmed up beautifully and the pie wasn't soggy at all. (I had it on the coldest shelf on my fridge so the cream layer stayed firm as well) Other additions/thoughts: When whipping heavy cream ensure your bowl and beaters are cold. (I pop mine in the freezer for a few minutes before whipping) For those who prefer their cream a little sweeter add a teaspoon of vanilla and 1/4 cup of sugar to the whip cream while it's whipping up. The cream filling will stay together if you whip the heavy cream just until stiff peaks form and the cream holds its shape when the beaters move through it. Instead of using Cool Whip or flavored cream cheese I added a splash of grenadine to the cream cheese mixture as well as the whip cream. Later on I made just the glaze recipe warmed it up with the remaining berries to top a pound cake. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MllePandora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/108170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-10T17:18:00.927Z",
                "reviewBody": "Everyone loved this pie!  I did have  to make a couple changes. I did not have the grenadine so I substituted red wine (sangria - but any would work I've found) and added more sugar (I used half a cup instead of 1/3) and I also put the strawberries in the sauce right before I took it off the heat so that some of the juices were cooked into the sauce. I make this every summer and the requests for the recipe never end.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lenora Bettencourt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/967433/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-17T04:20:59.203Z",
                "reviewBody": "WOW!!!  This pie was awesome.  I took it to work and shared with co-workers.  It was gone in no time.  I had never heard of grenadine syrup before.  It really added a great taste to the strawberry topping.  I failed to make sure I had all the ingredients before I started.  I didn't have any heavy cream.  I substituted it with about 3/4 of a small container cool whip.  It turned out great.  The other thing I did - I melted some semi-sweet chocolate and brushed it on the pie crust then refrigerated until chocolate was set.  After that I put the cream cheese filling in the pie shell.  (I read about someone doing that in another recipe so I thought it would be a great touch to this pie and it definitely did.)  It kind of gave you the feeling you were eating chocolate dipped strawberries.  I will share this with many and probably be making it soon again.  I wish I could put more than 5 stars because to me it should have 10 stars.  Thank you Julie for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CKuhn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2403529/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-23T15:31:26.34Z",
                "reviewBody": "This pie is fantastic... I didn't make a single change, except that I doubled the recipe for a larger crust. I also made my own grenadine syrup (which is very easy to make... Equal amounts of 100% pomegranate juice and sugar, bring the juice to a boil and add sugar, stir until sugar is completely dissolved and then chill).  In addition, I also put blueberries on the pie with the strawberries and as suggested by someone else, I lined the crust with melted semi-sweet chocolate.  This pie was fantastic, I will definitely make it again and give the recipe to some friends and family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Swiger-Imhoff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3606214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-26T17:46:14.393Z",
                "reviewBody": "Good flavour. Glad I read the reviews. I used a graham crust and reduced the whipping cream by about a third. I also added 1/4C cocoa to the cream cheese mixture along with a pinch of salt. I combined strawberries and raspberries for the topping. The cornstarch mixture really thickens a lot on chilling. I suggest beating it up with a whisk or spoon before trying to use it. If I'd added fruit and tried to mix it right away the fruit would have turned to mush from the effort of trying to get the cooled gelled mixture to soften to a usable state.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mama_B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mama__b/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-01T00:08:29.413Z",
                "reviewBody": "Fabulous!!! With only one change...used a whole package of cream cheese & 1 cup of confectioners sugar replacer(Ideal brand) And whipped the snot out of my heavy cream before folding in everything else. But will say. I'm going to omit the almond extract next time, it was fine, but rather it didn't over power the other flavors that were trying to come threw. I could see adding strawberry extract in it's place. But My favor part about the whole recipe was making the glaze....it was outstanding. And quick. Very flavorful...no more will I buy what I thought was a decent strawberry glaze from the produced department..now is on my ugh nasty list. It was always ok..BUT this glaze...by far hands down...AWESOME! It totally made the whole pie for us. The pie feed my hubby & 5 kids. Just hmmm! Thank God for premade pie crust. TY Julie, It's going to be a staple for summer desserts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-17T03:25:59.653Z",
                "reviewBody": "This was great but I made subtle changes which wouldn't really affect anything.  I didn't have almond extract so I used Amaretto.  Used a 8 oz block of cream cheese because if 3oz is good 5 more ozs would be killer.  I used frozen fresh strawberries from earlier this season.  They are fine, just don't have the crunch that fresh would.\n This is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321285/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-27T17:15:16.607Z",
                "reviewBody": "This pie was amazing! I actually made a second one a few days later since I gave all of the first one away. I did read a bunch of the reviews beforehand and made a few changes to the original. Graham cracker crust is definitely the way to go. Sogginess factor aside, it adds a really great flavor that normal pie crust wouldn't.  I also used 8oz. of cream cheese instead of three. It ended up being quite a bit of the cream layer, but it was delicious, so no complaints from me.  I used arrowroot starch instead of cornstarch for the sauce. Cornstarch probably would have worked fine, but if you have arrowroot I would recommend that. Not only is it flavorless, but it thickens quickly and evenly and stayed semi fluid for me, so I didn't have the problem of the cornstarch mixture being too thick after cooling. Arrowroot also has a beautiful shiny, clear appearance that works great with fruit desserts. As for the strawberries, I didn't measure the exact amount I used, but it was probably closer to three cups.  That made my topping more strawberry and less sauce dominant.  I also sliced the strawberries using an egg slicer and threw them into the sauce mixture right after it had thickened.  That way I didn't have to worry about stirring them in later, they cooked a little which softened them, and having them sliced made the pie much easier to cut later since I didn't have to navigate my knife around big chunks of strawberry. Not too difficult to make and delicious. Five stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Audrey Reale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5626958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-16T22:02:17.357Z",
                "reviewBody": "I didn't like the top tier to this pie. The texture was not what I was hoping for. I will keep looking for a better homemade glaze to use as a topper to this otherwise tasty pie. And can't imagine it with anything but a graham cracker crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "5Foot3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4012560/"
                }
            }
        ]
    }
]