[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1236/appetizers-and-snacks/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/49785/spam-musubi/",
        "name": "Spam Musubi",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F02%2F39977.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:08:58.000Z",
        "description": "Spam Musubi is a popular snack in Hawaii. It is a type of sushi that has marinated cooked spam in sushi. I got this recipe from a local Hawaiian friend when I was living there.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT5H25M",
        "recipeYield": "10 pieces",
        "recipeIngredient": [
            "2 cups uncooked short-grain white rice",
            "2 cups water",
            "6 tablespoons rice vinegar",
            "¼ cup soy sauce",
            "¼ cup oyster sauce",
            "½ cup white sugar",
            "1 (12 ounce) container fully cooked luncheon meat (e.g. Spam)",
            "5 sheets sushi nori (dry seaweed)",
            "2 tablespoons vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak uncooked rice for 4 hours; drain and rinse.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan bring 2 cups water to a boil. Add rice and stir. Reduce heat, cover,  and simmer for 20 minutes. Stir in rice vinegar, and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl, stir together soy sauce, oyster sauce, and sugar until sugar is completely dissolved. Slice luncheon meat lengthwise into 10 slices, or to desired thickness, and marinate in sauce for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat oil over medium high heat. Cook slices for 2 minutes per side, or until lightly browned. Cut nori sheets in half and lay on a flat work surface. Place a rice press in the center of the sheet, and press rice tightly inside. Top with a slice of luncheon meat, and remove press. Wrap nori around rice mold, sealing edges with a small amount of water. (Rice may also be formed by hand in the shape of the meat slices, 1 inch thick.) Musubi may be served warm or chilled.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rashad Maiden"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.581005586592179,
            "ratingCount": 179,
            "itemReviewed": "Spam Musubi",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "275.6 calories",
            "carbohydrateContent": "34.7 g",
            "cholesterolContent": "23.5 mg",
            "fatContent": "12 g",
            "fiberContent": "0.9 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "866.2 mg",
            "sugarContent": "10.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-10T19:59:30.81Z",
                "reviewBody": "I've been making spam musubi like this for years, except that I omit the oyster sauce, add a little ginger, bake the marinated spam at 350 deg F for 8-10 minutes, and sprinkle toasted black and white sesame seeds onto the molded rice. Here's a tip: use the spam can as a mold by CAREFULLY cutting the bottom out of it with an x-acto knife. Also, it helps if you use \"pre-toasted\" nori sheets. Untoasted nori can be tough. Another tip to keep the rice from sticking to your hands; have a bowl of water handy to wet your hands and the musubi mold.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Blancheskid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/628387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-17T03:55:00.72Z",
                "reviewBody": "growing up in hawaii, i ate spam musubi all the time.  i've always made it with a sugar and soy sauce marinade but when i saw this recipe with oyster sauce, i thought i'd give it a try.  i made two kinds to see if i could taste the difference and the one with the oyster sauce is the way to go.  it really adds that extra something that makes a great spam musubi.  i was shocked because i didn't think it would make that much of a difference, but it did.  note that using non toasted nori can be really chewy and therefore can be difficult to eat.  i use korean seaweed instead, which is usually toasted and seasoned with sesame oil and salt.  you can get it at a korean market.    ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "es",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2104407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-13T01:32:09.267Z",
                "reviewBody": "Being an \"Island Boy,\" I like to find recipes for 'local' food. It reminds me of home and is usually considered comfort food to me. I've been making musubi for years but have never made it with the marinade. Very good! Like others suggested, cook on low heat. That sugar will start to caramelize real quick and burn if your heat is too high. I put some furikake mix in with the rice just for some extra flavor. You can get furikake mix from many asian food stores. I usually get the basic 'nori komi' mix (great over steamed rice too). I make big batches and individually saran-wrap them. Perfect on the go snack. Regular steamed rice works fine. No need to soak for four hours. Just wash it and cook it like you would normally.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHOZENBOI671",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1441018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-05T21:21:12.093Z",
                "reviewBody": "After going to Hawaii for the first time a few years ago, my fiance and I fell in love with spam musubi. I'm so glad that I found this recipe. BUT, I really don't like oyster sauce (I did a test batch of 2 spam slices marinated as directed in this recipe, and didn't like the way it came out) and after doing a bit more research for other musubi recipes online, I decided to substitute the oyster sauce with mirin (Japanese sweet cooking wine that you can find at any Asian grocery store/market). YUMMY YUM YUM!!! It was perfect, just like in Hawaii! My fiance couldn't get enough! (And neither could I!) TIPS: You don't have to use sushi rice, regular rice is just fine. When you cook the marinated spam slices, be sure to do it at a low heat, as the sugar in the marinade really does make the spam burn very easily. When I assembled my musubi, I kept a small bowl of water next to me to continually wet my fingers and the musubi maker (as well as using it to seal the seaweed strips). Speaking of the seaweed, before you cut it into strips, be sure to \"toast\" it - simply take each sheet and quickly make three-four passes over your stove burner and it will toast fine (don't let it linger over the burner or have the burner set too high or it will burn). I'll definitely keep this recipe as one of my favorites.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brenda Sawyer Adamson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2723733/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-31T06:58:43.967Z",
                "reviewBody": "I'm from Hawaii and I love making/eating spam musubi.  Recipe looks good, I would suggest buying a musubi maker from any Japanese market, it will make the end product a lot easier to make.  To add more flavor to the rice, I add 1 cup of rice vinegar with 1 cup sugar mixed into the hot rice just after it's finished cooking (for 3 cups of uncooked rice).  I would try to get 10-14 slices from 1 can of spam for best spam to rice ratio.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PUNANICHENG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1389435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-21T23:33:01.967Z",
                "reviewBody": "This is a great recipe. But it doesn't have to be that hard. My family just uses calrose rice (fresh or day old) Spam and nori. The only thing we do to the spam is fry it in brown sugar and shoyu. But I'm sure this makes really great spam musubis.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LaurenAshley!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2257736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-16T18:38:10.67Z",
                "reviewBody": "On our 7th trip to the Hawaiian Islands, we finally tried Spam Musubi!  It is \"ono\"!  I have to say I only used this recipe as a guideline.  I made a few changes.  I marinaded the spam in teriyaki,  and cut nori into 1 1/2 inch strips.  I also bought a musubi mold, which I got in Maui, but you can buy them online. Dip mold in water before molding each musubi, it will make removal much easier.  Also lay a piece of plastic wrap on flat surface, lay nori on top, center mold and fill with rice then spam and then rice again, press.  Remove mold, wrap seaweed around rice and wrap in plastic.  I gave my sister two musubi's to take home...one for her and for her husband...she ate both!  Mahalo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim O",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/531406/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-07T22:26:11.097Z",
                "reviewBody": "I lived in Hawaii for many years and your recipe is spot on except for one thing.   I have no idea why you'd soak your rice at all, much less for 4 hours.   I put the rice into the rice cooker... add water and push the button.  Perfect rice in less than 30 minutes.    A fun way to shape the rice so it fits the spam slices just right,  is to pat the rice out on a sheet of parchment paper to the thickness you want.   Then use the spam can like a cookie cutter to cut the rice.   (Works best if you cut off both the top and bottom of the can)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2871766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-07T00:40:07.247Z",
                "reviewBody": "Hubby and I had SPAM musubi everyday when we were in Hawaii. I couldn't figure out what's the \"secret sauce\" that made it so good. When I tried out this recipe I was surprised that the \"secret sauce\" is a combination of something so commonly found in a Chinese kitchen. A few suggestions - 1. use low sodium SPAM and soy sauce. You can enjoy it even more without drinking tones of water afterward. 2. cook SPAM in low heat and watch carefully. With the sauces and sugar it burns really fast. 3. If you aren't use to wrap sushi and molding cooked rice scoop the rice into a piece of plastic wrap and press to form the rice. This will give you a nice a firm rice cake without the mess. 4. Adding a little bit of sesome seeds to the rice if you like. Love this recipe. Definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookingMaMa08",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2723363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-05T02:55:00.850Z",
                "reviewBody": "it was good because it tasted like spam. Marinating spam in the mixture of soy sauce and oyster sauce just makes spam saltier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeegie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1368221/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "SPAM® Musubi",
            "description": "Marinated and cooked slices of SPAM® on top of seasoned rice, wrapped in a piece of nori.",
            "uploadDate": "2014-09-05T18:58:10.253Z",
            "duration": "PT3M29.92S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F07789d90-ed97-4583-be59-5be498a57e3f%2F4dc4adf1-4390-46a4-aa13-02cfc9aef184%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3769720038001"
        }
    }
]