[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/49762/decadent-chocolate-orange-cake/",
        "name": "Decadent Chocolate Orange Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F439471.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:08:58.000Z",
        "description": "Moist orange cake layers separated by dark chocolate ganache and orange flavored cream cheese filling.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "1 - 4 layer 8 inch cake",
        "recipeIngredient": [
            "2 orange peels, cut into 1/4 inch strips",
            "⅓ cup white sugar",
            "¼ cup orange marmalade",
            "¾ cup unsalted butter, softened",
            "1 teaspoon vanilla extract",
            "1 cup white sugar",
            "4 eggs",
            "2 ½ cups cake flour",
            "½ teaspoon baking powder",
            "¼ teaspoon baking soda",
            "¾ cup orange juice",
            "1 ¼ cups heavy cream",
            "4 tablespoons unsalted butter",
            "15 ounces semisweet chocolate chips",
            "1 (8 ounce) package cream cheese, softened",
            "1 tablespoon white sugar",
            "2 tablespoons orange marmalade"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Coat two 8 inch round cake pans with cooking spray, and line bottoms with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using a vegetable peeler, remove zest from oranges in strips. Place in food processor, and coarsely chop, stopping occasionally to scrape down sides of bowl. Add 1/3 cup sugar and blend until peel is minced. Add 1/4 cup marmalade, and pulse until mixture is pureed. Transfer to a large bowl. Add 3/4 cup unsalted butter, and 1 teaspoon vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With an electric mixer, cream mixture until light and fluffy. Beat in 1 cup sugar. Add eggs 1 at a time, beating well after each addition. Sift together flour, baking powder, and baking soda into small bowl. Beat in the flour mixture alternately with the orange juice, mixing just until incorporated. Divide batter into prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For the Chocolate Ganache:  Bring cream and butter to simmer in heavy large saucepan. Remove from heat, add chocolate chips and stir until melted.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For Orange Cream Cheese Filling: in a small bowl, beat together cream cheese, 1 tablespoon sugar, and 2 tablespoons marmalade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble cake:  Cut each cake into 2 layers. Place 1 layer on plate. Spread filling on the  bottom cake. Pour hot ganache over bottom layer, let cool slightly. Top with second cake layer. Spread with filling. Pour hot ganache over second layer. Repeat for third layer. Top with fourth cake layer. Pour remaining ganache over entire cake for a shiny finish. Refrigerate uncovered cake until ganache is a hard coating.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "schmerna"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.428571428571429,
            "ratingCount": 42,
            "itemReviewed": "Decadent Chocolate Orange Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "704.8 calories",
            "carbohydrateContent": "77.5 g",
            "cholesterolContent": "157.2 mg",
            "fatContent": "43.5 g",
            "fiberContent": "2.8 g",
            "proteinContent": "8.1 g",
            "saturatedFatContent": "26.3 g",
            "servingSize": null,
            "sodiumContent": "141.5 mg",
            "sugarContent": "50 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-02T19:55:24.27Z",
                "reviewBody": "GREAT! If you like chocolate and orange you have to try this cake! This cake is so good and it is not hard to make but looks very professional. The only thing I did differently is I used the remaining ganache that was to be pored over the final layer as a fluffy icing. I chilled it and then whipped it until light in color and fluffy. Then I just iced the cake as you normally would. I do recommend bringing this cake to room temperature before serving. It was a huge hit and I will defiantly make it again. I give it five starts! ( I used Large eggs)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAS4U",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/204290/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-07T00:40:11.53Z",
                "reviewBody": "My husband wanted an orange cake for his birthday and this was one of the few I could find that was not a bundt cake. It was fantastic; it looked good and it tasted wonderful--restaurant quality in appearance texture and taste. Next time I think I'd double the filling. To optimize the appearance of the cake it's a good idea to trim around the edges to make sure the layers are even--this makes the ganache looks its best. Strong orange and chocolate flavors for anyone out there who really likes that combo! Thanks for an outstanding recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JILLYH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/687712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-10T17:29:11.927Z",
                "reviewBody": "THIS RECIPE IS SOOOO DECADENT..EVERYONE LOVED IT..IT TAKES A LITTLE TIME BUT IT WORTH IT..I DIDN'T CHANGE A THING..I DECORATED IT FOR A BIRTHDAY WITH GOLD CANDLES AND MANDARIN ORANGES SLICES AROUND THE BASE AND TOP OF CAKE. MY HUSBAND SAYS TO THROW AWAY ALL MY OLD RECEIPES AND JUST MAKE THIS ONE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gerry & Detty Edgecombe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1065154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-26T20:03:52.063Z",
                "reviewBody": "Just perfect!!!! After reading others reviews I was a little nervous because I am not a fan of marmalade and was worried that the cake would taste too much like it. Not the case at all. I followed the recipe exactly and served it for company. I did however take the advice of other readers and add canned mandarins for appearance and flavor and it was awesome that way. Everyone raved. Not only does it look fabulous but the individual layers and flavors are so well balanced. The cream cheese frosting went perfectly with the chocolate ganache and the orange cake. And none of it is too sweet which I really appreciate. It takes a bit of time to prepare but not too much and it certainly isn't difficult. We will definitely be having this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carlie Smith McCracken",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1082846/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-29T23:30:32.03Z",
                "reviewBody": "I personally did not care for this recipe thought because it was homemade I would get past all the orange pieces...wrong! the combination of the orange peel and the marmalde was just to way to much. That was all I could taste. Now ever one else seemed to like it I made it for Thanksgiving however I won't be making again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly Ramsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/466166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T22:28:37.583Z",
                "reviewBody": "While time consuming this cake is definitely a show stopper. I am the pastry chef for a small restaurant in my city and brought this in yesterday. I checked to see today how the guests liked it and it was a hit! I did change the way I frosted it though covered both seperate layers in the ganache and waited for it to harden. I spread the orange cream filling on the bottom layer and topped it with the second later. Instead of covering the entire cake (sides and all) with the ganache I made a simple cream cheese frosting and spread that along the sides and piped some decorative icing along the top edge of the cake. It was beautiful! I am rating this cake as four stars though because while I loved the density of it the layers were just a bit dry. I'm going to try playing with the recipe a bit to see if I can achieve a bit more moistness. All said though this is DELICIOUS! The orange flavor is not overpowering and the combination of the orange and chocolate is wonderful! Thank you so much for sharing! If anyone has any ideas on how to deal the moistness please let me know.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana Fijalkowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3057709/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-22T09:11:45.623Z",
                "reviewBody": "Delicious!!! I used about 1 1/2 cups less ganache and 1 cup less cream cheese filling and it tasted totally great anyways.(this is an easy way to cut out excess fat and calories! b/c there is a LOT in this recipe!). To decorate I used canned mandarin oranges. (You can use fresh ones in season but then you need to peel the pulp off. Shape is easier retained in the canned ones). The oranges on top can make a very pretty star shape:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheeza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1782937/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-07T15:50:21.263Z",
                "reviewBody": "I made this cake for my husband's birthday and it was a hit. The ganache is so creamy and the cake so soft and fluffy with just the right amount of orange flavour. I will definitely be making this again. Not least of all because it is so easy. I had never baked a cake before in my life but it came out perfectly:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "megan78",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1131763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-01T20:38:24.25Z",
                "reviewBody": "I made this for my husband's surprise birthday party. Either people loved it or hated it. Everyone LOVED the frosting. Even my hubby the orange lover wasn't over the moon about it as he didn't like the minced orange rind in it. I will keep the recipe for the frosting. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Arizona Desert Flower",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/arizonadesertflower/"
                }
            }
        ]
    }
]