[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17656/main-dish/beef/salisbury-steak/",
                    "name": "Salisbury Steak Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/50674/sorta-salisbury-steak/",
        "name": "Sorta Salisbury Steak",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4465638.jpg",
            "width": 1704,
            "height": 1704
        },
        "datePublished": "2020-06-19T03:09:04.000Z",
        "description": "This is a somewhat altered version of the original, thus the name. Everybody loves it! Water may be used in place of beef stock.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 tablespoons vegetable oil",
            "1 cup all-purpose flour, divided",
            "6 (4 ounce) cube steaks (pounded round meat)",
            "1 large onion, sliced into strips",
            "2 cups beef stock",
            "2 tablespoons Worcestershire sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a Dutch oven, or deep iron skillet. Dredge steaks in some of the flour, reserving the rest of the flour. Brown steaks in the oil a few at a time, and remove to a plate. When all of the steaks are browned, place a layer of sliced onions into the Dutch oven, and alternate layers of steak and onion. Pour in beef stock and Worcestershire sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and bake for 2 hours in the preheated oven. Remove steaks and onions from the pan, and whisk in 2 tablespoons of the remaining flour. Bring to a boil over medium heat, and cook, stirring until thickened. Serve steaks and onions with gravy with mashed potatoes or noodles.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Salisbury Steak Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Nanci"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.345177664974619,
            "ratingCount": 197,
            "itemReviewed": "Sorta Salisbury Steak",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "369 calories",
            "carbohydrateContent": "20.5 g",
            "cholesterolContent": "70.8 mg",
            "fatContent": "18.3 g",
            "fiberContent": "1.2 g",
            "proteinContent": "28.7 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "144.2 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-12T23:39:26.483Z",
                "reviewBody": "To my mind, not at all like Salisbury Steak.  This was very, very good on its own.  I cooked on low in the crockpot for 8 hrs; dredged the meat in flour and seasoned salt, then browned, then layered in crockpot with onion and all the liquid called for.  \nAfter 8 hours, I pulled everything out and made a delicious gravy with the liquid.  The cube steak was falling apart as it was being served - I've never had such great-tasting, tender cube steak!  I served with buttered egg noodles and brussel sprouts.  Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MACLEOD26",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/965171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-05T01:39:59.99Z",
                "reviewBody": "Cube steaks are tough and very bland so they need lots of \"doctoring.\" This recipe adequately tenderizes the steaks but contributes hardly any flavor. The only seasoning is a bit of Worchestershire. Even after adding salt and pepper my family found the meat and gravy to be ho hum. Another problem with this recipe is the gravy prep. When making gravy properly you blend flour with fat and get a smooth paste before adding liquid. This recipe has you add flour to the fat AND broth so the flour immediately clumps up. The solution would be to retain your pan drippings when you brown the meat add flour to those drippings and then add broth last.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Marie Sweden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/annemariesweden/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-13T15:06:24.077Z",
                "reviewBody": "Yes, yes, yes!  These are soooo good.  Nice and warm and homey feeling.  I only use 4 cube steaks, dry onion soup mix instead of the onion (4 yr. old won't touch them), and add mushrooms.  All the other recipes I'd found called for mixing ground meat with bread crumbs, then frying, etc.  I call those meatloaves, not salisbury steak..lol.  Thank you, Nanci, for such a great comforting recipe. *Update* : I've found that seasoning the steaks before you dredge them in flour makes them even better.  I just use salt, pepper, and garlic powder, but you could use whatever you like.  I have also started thickening the broth with a cornstarch/water mixture.  That way, you definitely don't get any lumps from the flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Raoulysgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/572250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-04T13:48:23.95Z",
                "reviewBody": "I have made this twice using 4 cube steak. First time I added quartered mushrooms and chopped the onion instead of slicing. Came out pretty good so I tried again. Second time I omitted to worchershire chopped the onion and sliced 8 oz mushrooms. Seasoned steaks with salt and pepper and then dredged in flour and browned. Then I added onions and sauted until limp and then added mushrooms and lightly browned. Added two cans beef stock salt & pepper to tasted and added 1/4 teas. garlic powder. Simmered on stove for 2 hours. Last 30 minutes of simmering I removed some broth and blended well with 1 tables cornstarch and returned to pan and continued simmering 30 minutes. Served with mashed potatoes and sauted zuchinni. Great gravy! Thanks so much for submitting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie E",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/993402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-04T19:55:50.363Z",
                "reviewBody": "My family loved it. Used lipton onion soup mix instead of onions. And served with rice. Was very tender and my husband asked for more. Didn't make enough gravy for my family so I made our favorite packaged gravy and mixed it in with the gravy as noted in the recipe. Turned out perfect. This is a keeper in our home.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2792834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-30T00:15:01.81Z",
                "reviewBody": "This was great but I only really used it for cooking technique. I used New York Steaks pounded and cut in thirds. More seasoning all around:  about a teaspoon each of celery salt, garlic salt, fresh ground pepper in the flour.  Added about 2 Tbsp. fresh rosemary, then some thyme and bay leaf sprinkles,  and 2 cloves garlic to the broth.  Used one fewer spoons of Worchester -- because of other comments. And splashed in about 1/4 cup cabernet sauvignon-- to make sure it tenderized.  Great flavor.  Also strained and de-fatted the remaining broth after adding flour and whisking.  Made the gravy very smooth. Placed steaks back in gravy to serve.   Will continue to tweak, but really good start. Great comfort food. Update -- Now, I saute the onions in the pan after browning to scrape up the bits of goodies on the pan, then deglaze with a splash or two of red wine. Bring to boil to cook out a bit of the alcohol, then add the broth and other seasoning. Also, if you're using an iron skillet (recommend), you might need a bit more broth if the pan is larger...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nette/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-25T22:32:43.747Z",
                "reviewBody": "My husband and boys really liked this recipe. It was so gooood.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WN2COK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-21T15:33:12.153Z",
                "reviewBody": "This was a VERY decent dish. I only had three cube steaks so I scaled the recipe. I also omitted the onion as my daughter wouldn't eat them. I used parsley garlic powder onion powder and pepper to season the flour then dredged and cooked everything on the stove in a can of beef stock then thickened with the remaining flour as needed. It was YUMMMMMMM over the steaks and some baked potatoes. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Arizona Desert Flower",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/arizonadesertflower/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-30T13:47:17.64Z",
                "reviewBody": "This recipe smelled so good cooking and the first few bites were great then the Worcestershire sauce started overpowering the dish. I would make this again but cut the Worcestershire sauce back to maybe one teaspoon or not use it at all. All in all it was an easy dish to make and the meat was fork tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1559111/"
                }
            }
        ]
    }
]