[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/50836/curry-coconut-shrimp/",
        "name": "Curry-Coconut Shrimp",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6703180.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2020-06-19T03:09:05.000Z",
        "description": "Jumbo shrimp in a lightly spiced coconut curry sauce. Serve over hot cooked brown rice.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 teaspoon canola oil",
            "½ cup minced onion",
            "½ cup minced red bell pepper",
            "1 clove garlic, minced",
            "1 teaspoon ground cumin",
            "¾ teaspoon ground coriander",
            "½ teaspoon curry powder",
            "½ cup light coconut milk",
            "1 teaspoon sugar",
            "¼ teaspoon crushed red pepper flakes",
            "1 pound jumbo shrimp, peeled and deveined",
            "1 tablespoon cornstarch",
            "1 tablespoon water",
            "2 tablespoons chopped fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in large, nonstick saucepan over medium heat. Saute onion, red pepper, and garlic until vegetables begin to soften, about 3 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season with cumin, coriander, and curry powder. Cook for 1 more minute. Stir in coconut milk, sugar, and crushed red pepper flakes. Bring to a boil. Reduce heat, and simmer, uncovered for 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in shrimp, and increase heat to medium-high. Cook and stir until shrimp is cooked through, about 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine cornstarch with 1 tablespoon water. Stir into shrimp mixture, and cook until sauce has thickened, about 1 minute. Stir in cilantro, and remove from heat.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "dakota kelly"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.208163265306123,
            "ratingCount": 245,
            "itemReviewed": "Curry-Coconut Shrimp",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "190.8 calories",
            "carbohydrateContent": "8.5 g",
            "cholesterolContent": "172.5 mg",
            "fatContent": "6.1 g",
            "fiberContent": "1.1 g",
            "proteinContent": "24 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "175.1 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-05T03:13:35.087Z",
                "reviewBody": "After reading the other reviews I made some changes. The end result was PERFECT!!! IT CAME OUT BETTER THAN MY FAVORITE RESTAURANT. If you make it this way you will not be dissapointed. This is what I did: I mixed in the blender 1/4 c canola oil, 1 medium onion, 1 red bell pepper and 5 cloves of garlic to create a chunky paste. I then sauted it for 4 min, lowered the heat to simmer and added 2 tsp minced ginger, 2 tbsp curry powder, 1 tsp ground cumin, 1 tsp sugar, 1/4 tsp crushed red pepper flakes and 2 tbsp flour, mixing energetically for 2 min. I then gradually added 2 c of light coconut milk all the while mixing energetically untill the sause thickened and became uniform. I simmered the sauce for 4 min, then increased the heat to medium-high again, added the shrimp, mixed well to coat and cooked for 4-5 min. Finally I added 1/2 c chopped fresh cilantro and 3/4c shredded coconut, mixed one last time and turned off the heat. THE RESULT WAS HARDLY ENOUGH FOR 2 CURRY LOVERS!!! YUM, YUM, YUM! THANK YOU DAKOTA and all the reviewers! I also plan on making this with chicken and I will try peanuts instead of shredded coconut next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "aglika",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2131972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T19:31:03.92Z",
                "reviewBody": "This recipe needs to have the roux made in the beginning of the sauce (to eliminate any pasty taste).  I used a combination of butter and oil (3 TBPS) and sauted the onions in that, then I added the spices and 2 TBPS of flour, eliminating the cornstarch.  Cook for one minute then add the coconut milk.  I used 2 TBSPS of curry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Fastcooker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/632097/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-28T23:08:07.513Z",
                "reviewBody": "This was absolutely fantastic.  The only changes I made were I doubled the coconut milk, curry powder, and crushed red pepper flakes, and just before I served it I added some shredded coconut.  Wow.  I will definietely make this again.  I think it would also be great with tofu or chicken instead of shrimp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Arcticwoman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/833863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-18T06:28:05.95Z",
                "reviewBody": "The way I made it was only worth four stars but I made some poor alterations. I didn't have coriander or cilantro and I love both... so I shouldn't have made it without them. Secondly I didn't see the need for the teaspoon of sugar but in hindsight I should have. On a good note I did what a prior review AGLIKA recommended and put the first few ingredients in a food processor before sauteeing. This thickened the sauce nicely and I didn't have to add the cornstarch/H20. I also up'd the red pepper flakes which gave it more heat. I cannot wait to make this recipe again THE RIGHT WAY. On a Side Note: I always loved curry-coconut shrimp in restaurant eventhough nutrition-wise it's right up there with alredo sauce. So I could never bring myself to make this at home considering how terribly fattening it is. However this recipe is LowFat LowCal and LowCarb... amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1524223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-05T21:21:48.47Z",
                "reviewBody": "This was a delicious recipe. I stuck with the recipe substituting only light coconut milk for the regular variety (save a couple of calories) and omitted the red pepper because I didn't have it on hand. I added a little cornstarch at the end but I think I would leave this out next time - it was actually a little too thick. BONUS SIDE DISH: I made a middle eastern coconut rice on the side (cooked the rice in half light coconut milk and water) then after cooking added toasted coconut (toasted in a pan with a little olive oil) toasted almond and toasted raisins all mixed through the rice (do all the toasting separately). With the curry-coconut shrimp it was absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1790812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-12T13:44:52.453Z",
                "reviewBody": "1/2 cup of coconut milk was not enough and I did NOT need to use the cornstartch. If I had then it would have been way too thick. This tasted good...just not made exactly as written. UPDATE: I made this tonight and the general consensus is there needs to be more sauce. I used 2 tsp of sugar instead to suit our taste hubby thought it was too spicy I thought it was just right. Next time I will cut the red pepper and double the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Grumpy's Honeybunch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/grumpys_honeybunch/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-18T16:06:13.34Z",
                "reviewBody": "This curry sauce is absolutely delicious and goes really well with the shrimp and brown rice. It's not too spicy but still has some kick. I'd love to try it with chicken and veggies. I'll omit or use less of the cornstarch next time though; it made the sauce too thick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MORPHEUS42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688155/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-26T19:47:45.813Z",
                "reviewBody": "Warning - if you're not a fan of either coconut or cilantro pass this recipe by! Hubs fits into this category and rates this two stars! If these aren't your issues however read on. This was a beautiful dish in terms of both presentation and flavor. Seasoned just right in my judgment so that no one spice dominates. Quick and easy to prepare this recipe really delivers. I enjoyed it a lot! (Again Hubs not so much) I served this over jasmine rice with steamed baby bok choy and yellow patty pan squash. A treat for both the eyes and the palate. Oh - and I didn't find it necessary to add any cornstarch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-11T18:30:31.427Z",
                "reviewBody": "I made this recipe last week and my husband looooved it. He's not a big fan of coconut but he really enjoyed the sweet spicy taste. I give this recipe 4 stars because its easy to prepare and make. I used regular coconut milk instead of light and the sauce thickened without the need of cornstarch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kai",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2201154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-16T00:21:45.49Z",
                "reviewBody": "way too bland- i was expecting a lot based on the reviews but it was nothing like good thai take out unfortunately. After looking at other recipes - it seems that it needed tumeric fish sauce and ginger.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "mrsc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7671764/"
                }
            }
        ]
    }
]