[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/51039/chicken-vicious/",
        "name": "Chicken Vicious",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8895.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2020-06-19T03:09:06.000Z",
        "description": "This fast EASY one-skillet recipe utilizes only a few basic scary-sounding ingredients, but yields the most delicious spicy Mandarin/Szechuan flavor you ever tasted!  Serve over white rice. WARNING: Only for the brave and daring of tongue!  I give you 'Chicken Vicious'!!!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 teaspoons vegetable oil",
            "4 skinless, boneless chicken breast halves - cut into 1 inch pieces",
            "1 ½ cups distilled white vinegar",
            "1 cup white sugar",
            "½ cup soy sauce",
            "1 tablespoon red pepper flakes, or to taste",
            "2 tablespoons garlic powder, or to taste",
            "1 tablespoon onion powder, or to taste",
            "½ teaspoon ground ginger",
            "1 (8 ounce) package button mushrooms, sliced",
            "1 cup frozen green peas",
            "3 green onions, chopped",
            "3 teaspoons cornstarch",
            "2 tablespoons cold water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large heavy skillet over high heat. Add chicken pieces, and fry, stirring, until browned. Pour in the vinegar, soy sauce, and sugar; stirring to dissolve sugar. Season with red pepper flakes, garlic powder, onion powder, and ginger. Reduce heat to low, cover, and simmer for 15 minutes. Taste the sauce at this point and adjust seasoning to taste. The sauce should be very sweet. If it is too tart, add more sugar; if it is too sweet, add more vinegar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the sauce is to your liking, add the mushrooms, peas, and green onions. Simmer gently over low heat for another 5 minutes, until the mushrooms shrink a bit. Stir together the cornstarch and water, and stir it into the sauce. Continue to simmer until it reaches the desired thickness.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "TOCOYOTE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.169117647058823,
            "ratingCount": 136,
            "itemReviewed": "Chicken Vicious",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "442.2 calories",
            "carbohydrateContent": "67.9 g",
            "cholesterolContent": "68.4 mg",
            "fatContent": "4.6 g",
            "fiberContent": "3.9 g",
            "proteinContent": "34.3 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "1930.6 mg",
            "sugarContent": "55.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-05-04T01:49:06.777Z",
                "reviewBody": "Again, thanks for all the great suggestions on this!  I do have one bone of curious contention... why is it that nearly all the folks who rate this at a \"one star\" rating pretty much complain that it is 'too spicy' or 'too tangy' or 'too sweet'.. after reading the clear and detailed dish description, then rate it down complaining that it is just as I said it is??  I specifically outlined the tastes so that those who would not be interested in the taste would not bother to make it.  Don't rate me down to ground because it doesn't suit your personal tastes.  Just don't make the dish to begin with.  This is a first-rate recipe!!  And thanks again to all you who continue to lend input and suggestions!  Only makes the recipe better suited to a wider group of folks!!  Bon Appetit!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOCOYOTE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/637962/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-12T13:13:14.367Z",
                "reviewBody": "This was very tasty and would have gotten 5 stars except that 1) hubby complained it didn't taste \"authentic\" and I have to agree 2) it gave me a rather nasty sugar buzz and 3) the technique needs to be changed for stir-frying the chicken and the ginger and garlic need to be fresh. For those who will be making it again you get a MUCH more tender chicken if you mix the chopped chicken with a bit of soy sauce sherry cornstarch and oil before frying it in the pan. If you just put the chicken in \"naked\" like the recipe says the chicken is tougher. Too tough for my taste. Another tip for those who think it's too strong in the vinegar taste or want more sauce but not more vinegar. It's okay to add half a cup or more of water to this recipe. Just adjust everything to taste. You don't have to keep adding only soy sauce vinegar and sugar to make more sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Loladear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/383920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-20T22:02:46.857Z",
                "reviewBody": "This recipe is fantastic. I modified it. We are on a diet so I used 3/4 cup Splenda instead of sugar and just used Pam instead of oil. I did not add peas mushrooms and did not thicken. We put the chicken on top of green salad and used the sauce as a hot spicy vinagrette dressing. It was awesome. As another reviewer stated it does taste a lot like General Tso's without breading. Will use time and time again. Thanks so much!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwen Langham Howell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/725394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-16T13:25:59.607Z",
                "reviewBody": "Unless you like drinking white vinegar straight up this is not for you. I added so much sugar to cover up the pungent vinegar taste but even when the vinegar taste is covered up by sweetness your nose takes an assault every time you inhale. Thank goodness I cut the recipe in half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnInHK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/422932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T21:37:28.373Z",
                "reviewBody": "loved it!! easy to prepare... soo very yummy!!! But of course I changed it to fit my tastes. Tastes ten times better if you use fresh ingredients instead of powdered or dried.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSEPEDAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/158052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-14T20:54:38.803Z",
                "reviewBody": "I read through the reviews before making this dish. As a result I made numerous modifications to this recipe and it came out absolutely delicious. I made the following changes: (1) I used one fresh yellow onion about six cloves of garlic and about 2 tablespoons of fresh chopped up ginger. I'm a big believer in using fresh ingredients where possible and here I think it really adds to the flavor. Before adding the chicken I sauteed the onion garlic and ginger in the oil for about two minutes. (2) In terms of the sauce I used 1/2 cup white vinegar 1/4 cup reduced sodium soy sauce and 1/2 cup brown sugar. (3) In addition to the 8 ounces of mushrooms and one cup of peas I added one chopped green bell pepper and one chopped red bell pepper. I did not include the cornstarch. It gives a great Asian flavor and is much tastier than what you would get in most Chinese restaurants. Plus there is the added advantage that it tastes so much healthier because I was able to use all organic and fresh ingredients. I will definitely make this again maybe rotating different vegetables (I think this recipe would also work with broccoli green beans sugar snap peas bamboo shoots water chestnuts bok choy baby corn a lot of things). I also think it is really important to accompany this dish with rice. My rice really absorbed the sauce well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwen on the West Coast",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4015948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-24T21:52:38.37Z",
                "reviewBody": "This was great!!!  i didn't follow the amount of spices exactly, but I have apretty good feel for what we like, and it came out great.  I agree with the submitter -- if you read the description and it doesn't sound like your taste, don' review it with a bad rate.  I will def do this again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Good EatNZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/goodeatnz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-13T03:07:10.923Z",
                "reviewBody": "I used rice vinegar just because I had it; doubt it would make any noticeable difference. I used fresh garlic fresh ginger and chopped up some fresh onion as well as the powdered garlic onion ginger and green onions. I used Sugar Twin rather than sugar (1/8 c and it was sweet enough). Also added fresh broccoli and snow peapods. Next time I would reduce the amount of vinegar a bit (1 c from 1.5 c) and also the soy sauce (1/4 c from 1/2 c) as it was too salty (or try low sodium soy sauce). It was a pretty good stir-fry but just too salty for my tastes. My friend also made it and used low-sodium soy sauce and said it came out perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-02T01:41:59.42Z",
                "reviewBody": "I have made this twice once with chicken and once with beef it was great both times. I substitute some brown sugar for the white sugar (have to increase the amount of brown sugar though) and I pour in quite a lot of hot pepper. I like to make the sauce in a separate pot so I can get it to the consistency and taste that I want prior to putting it in with the meat and veggies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Verena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/728275/"
                }
            }
        ]
    }
]