[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/54600/hong-kong-style-egg-tarts/",
        "name": "Hong Kong Style Egg Tarts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3235951.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2020-06-19T03:09:27.000Z",
        "description": "Very easy to make Chinese style Egg Tart, you can put the leftovers in the refrigerator for later use for up to 3 days. You can reduce the sugar used on the crust and the filling to fit your taste, this recipe is lightly sweetened. If you want to you, can add more sugar to the filling. Hope you enjoy it!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "12 tarts",
        "recipeIngredient": [
            "1 cup confectioners' sugar",
            "3 cups all-purpose flour",
            "1 cup butter",
            "1 egg, beaten",
            "1 dash vanilla extract",
            "⅔ cup white sugar",
            "1 ½ cups water",
            "9 eggs, beaten",
            "1 dash vanilla extract",
            "1 cup evaporated milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the confectioners' sugar and flour. Mix in butter with a fork until it is in small crumbs. Stir in the egg and vanilla until the mixture forms a dough. The texture should be slightly moist. Add more butter if it is too dry, or more flour, if the dough seems greasy. Shape dough into 1 1/2 inch balls, and press the balls into tart molds so that it covers the bottom, and goes up higher than the sides. Use 2 fingers to shape the edge into an A shape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 450 degrees F (230 degrees C). Combine the white sugar and water in a medium saucepan, and bring to a boil. Cook until the sugar is dissolved, remove from heat and cool to room temperature. Strain the eggs through a sieve, and whisk into the sugar mixture. Stir in the evaporated milk and vanilla. Strain the filling through a sieve, and fill the tart shells.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 20 minutes in the preheated oven, until golden brown, and the filling is puffed up a little bit.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "wildcat"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.978609625668449,
            "ratingCount": 187,
            "itemReviewed": "Hong Kong Style Egg Tarts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "421.2 calories",
            "carbohydrateContent": "47.8 g",
            "cholesterolContent": "201.8 mg",
            "fatContent": "21.4 g",
            "fiberContent": "0.8 g",
            "proteinContent": "10.1 g",
            "saturatedFatContent": "12 g",
            "servingSize": null,
            "sodiumContent": "190.3 mg",
            "sugarContent": "23.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-06-14T04:29:15.327Z",
                "reviewBody": "Boy were my parents surprised to come home to find fresh homemade egg tarts! We're a Chinese family living in San Francisco who go out to Chinatown every weekend so we know our Chinese dim sum! After starting the crust I realized I didn't have any evaporated milk so I substituted instant skim milk powder reconstituted in water (we don't keep milk around the house). It still turned out great! The custard is perfect - just like the ones from Chinatown! Next time I'll reduce the sugar in the crust because it reminded me of a sugar cookie. I also used a mini muffin tin because I didnt' have any tart shells. I would recommend rolling the dough into balls and rolling them out with a rolling pin because the crust was uneven and a little too thick in some of them. I would also lower the oven temperature next time because the crust was brown before the custard was set though it may be because I used the mini muffin tin. The house smelled wonderful while these were baking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "poofietomato",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1242249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-26T15:41:06.257Z",
                "reviewBody": "These are absolutely delicious! I hesitated after seeing the mix reviews but decided to go ahead anyway.The recipe is easy to follow, and yes, the tarts taste like bought-from-store. I've reduced the sugar for the dough to 90gm and 100 gm for the custard as I do not like them too sweet. And yes, there is too much custard for the dough - you'll need 1.5 times of the dough to use up the custard. I've substituted evaporated milk with fresh milk and they still turn out great. I've tried replacing butter with margarine and regretted it - the tarts were bland. So just stick to butter. Will definitely make this again. My dad and husband were totally impressed! Thanks for the recipe :}",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "myk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2159630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-12T09:14:54.81Z",
                "reviewBody": "the egg custard was good taste just like the ones from the chinese bakery shop. however the pastry is somewhat flat - suggest using cake flour instead of plain flour for added fluffiness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Howzerr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1766385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-24T13:16:57.03Z",
                "reviewBody": "I halved the recipe. There was indeed too much custard for the amount of dough. I derived 10 medium sized tarts from this recipe though the leftover custard could have filled 5 more tart shells. I baked the tarts in 2 batches the first batch was baked at 200 degrees celsius for 13 minutes. The tart shells came out perfect and golden but the custard was overcooked on the top- there was a thick gel-like layer instead of wobbly custard goodness. I baked my second batch at 190 degrees celsius for 17 minutes; they turned out fantastically!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2250245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-17T22:45:16.337Z",
                "reviewBody": "I tried using this recipe but face some problems from the start when I went to purchase the INGREDIENTS. I couldn't find CONFECTIONER'S SUGAR OR ALL-PURPOSE FLOUR. Maybe it's because the ingredients are different here. I had to use Self Raising Flour which didn't turn out the way it should like the picture. I also have plenty of eggs left from the 9 eggs that were beaten. I thought it would be easy but it wasn't as easy as I thought. Could you tell me if its ok to use SELF RAISING FLOUR and should I purchase foil styled baking cases? As I found the paper baking cases weren't as good as the egg pours out of the tart. The tart also raise to high that it burns so fast at the top but that's because I've been using SELF RAISING FLOUR because I couldn't find ALL-PURPOSE FLOUR. Anyway I hope you can help as I love Chinese Egg Tarts and want to learn how to make it so I can share with my friends and family. It cost 80p each for a Chinese Egg Tart here in Scotland and that's very expensive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "A Lee - Scotland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2430199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-15T20:25:27Z",
                "reviewBody": "My family loved it! The filling was perfect. Except it was just a tad too sweet, i would use a different crust (no sugar added preferably) Just like from the bakeries and shops! would make again for sure. btw, i used a fork and made marks along the edges of the crust for a pretty effect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LIANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1978237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-20T17:26:22.95Z",
                "reviewBody": "The custard tasted okay and the crust is more like a sugar cookie. It'd be good just as a regular custard tart (maybe a 9 inch tart pan) and not Hong Kong Style. The Hong Kong egg tarts I've had in SF and in Hong Kong always had a puff pastry kind of crust so next time I'll use puff pastry. I used a muffin (12) mini muffin (24) and 2 four-inch tart pans and still had enough dough to make more. There was also a lot of the filling left maybe about 2 cups. I had to use almost an extra stick of butter for the dough to hold together and instead of using a fork I used a pastry blender. It d probably be easier to use a food processor. My first batch the crust browned too much before the custard was set so I lowered the temp and baked until the middle jiggled then took it out of the oven. The middle of the tart should be more like a flan. I thought it tasted a bit eggy I might just use less eggs next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cocooned",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/37431/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-13T00:46:42.35Z",
                "reviewBody": "This recipe was a failure because the temperature was way too high...my eggs were overcooked and chewy. I was so disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "foodaholic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2425702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-03T20:22:17.857Z",
                "reviewBody": "I used the store bought frozen tart shells (in the section where the frozen pie crusts are) which makes this recipe easy and quick to make. I gave it four stars only because I have yet to make the shell myself and the store bought ones doesn't match the egg filling as well. This recipe yields 24 of the store bought frozen tart shells.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamerica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2591086/"
                }
            }
        ]
    }
]