[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14712/desserts/cookies/gingerbread-cookies/",
                    "name": "Gingerbread Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/56673/eileens-spicy-gingerbread-men/",
        "name": "Eileen's Spicy Gingerbread Men",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F07%2F26402_original.jpg",
            "width": 636,
            "height": 846
        },
        "datePublished": "2002-12-01T01:34:49.000Z",
        "description": "Spicy gingerbread men.  This is the only recipe we have ever used. For best flavor, do NOT use blackstrap molasses.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "2 1/2 dozen",
        "recipeIngredient": [
            "½ cup margarine",
            "½ cup sugar",
            "½ cup molasses",
            "1 egg yolk",
            "2 cups sifted all-purpose flour",
            "½ teaspoon salt",
            "½ teaspoon baking powder",
            "½ teaspoon baking soda",
            "½ teaspoon ground cinnamon",
            "1 teaspoon ground cloves",
            "1 teaspoon ground ginger",
            "½ teaspoon ground nutmeg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the margarine and sugar until smooth. Stir in molasses and egg yolk. Combine the flour, salt, baking powder, baking soda, cinnamon, cloves, ginger, and nutmeg; blend into the molasses mixture until smooth. Cover, and chill for at least one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). On a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into desired shapes with cookie cutters. Place cookies 2 inches apart on ungreased cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven, until firm. Remove from cookie sheets to cool on wire racks. Frost or decorate when cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Gingerbread Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie Schneidewind"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.533022014676451,
            "ratingCount": 1499,
            "itemReviewed": "Eileen's Spicy Gingerbread Men",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "88.4 calories",
            "carbohydrateContent": "14 g",
            "cholesterolContent": "6.8 mg",
            "fatContent": "3.3 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "103.4 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-11T13:25:10.03Z",
                "reviewBody": "I have tweaked this recipe, after a few attempts, to perfection (for my tastes).  First of all, I think the variances in dough texture people are having is in the way they measure their flour.  I am one of those bakers that measures flour by spooning it into the measuring cup lightly and using a knife to level off.  The first time I made these(exactly as the recipe states) the dough was like mush.  I ended up working in an extra cup of flour with my hands.  I rolled in between two pieces of parchment because of the toughness extra flour always adds to cut-outs.  The cookies were tasty but to floury with a cardboard texture.  I finally ended up using 1 and 1/2 cups flour. I substituted 3/4 c brown sugar for the white sugar, because I thought they needed to be sweeter as well, and I thought the brown sugar would help to keep them moist. I used a 3 inch gingerbread cutter and cooked for 7 minutes.  Delicious, soft and chewy.  The spices are perfect, it is a spicy cookie just as the recipe says.  I used white chocolate to pipe on the features, buttons, bowties, and scarfs. Not only are they adorable, they are out-of-this-world tasting. I will try to upload a picture later today.  Thanks Eileen, at last, a gingerbread man I can actually eat!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DarlingDash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/701266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-20T21:47:15.87Z",
                "reviewBody": "This recipe barely misses a 5 star rating for one reason only. The cookies are not \"spicy\" as the title promises. They have a pleasant, mildly spiced flavor, but this recipe lacks the \"bite\" usually associated with genuinely spicy gingerbread. For those, however, who have palates that appreciate milder spices, this recipe is perfect. If you long for a spicier kick to your gingerbread, double the listed spices except cloves, and add a liberal dash or two of cayenne. The dough was very easy to work with, after chilling. I made it before going to bed, then rolled them out the next morning, taking only what could be rolled and cut at one time out of the fridge. The dough is, like any recipe made with a large quantity of any syrupy substance (i.e. molasses, corn syrup, honey,) sticky if not adequately chilled. Sticky dough is impossible to work with. The temptation is to add more flour to the dough, but resist it! More flour toughens your product. In fact, when rolling, it is always advisable to use a pastry cloth on your board and pastry sock on your rolling pin. This enables you to incorporate the least amount of flour possible, yet still work easily with the dough. Another good quality is that these don't puff up and lose their shape when baked. In fact,  what you see when on the sheet before baking is just about what you get. They're good keepers, still soft a week after baking (kept in an airtight tin.) Excellent recipe, but some tinkering with the spices could improve it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-26T15:14:14.293Z",
                "reviewBody": "Just okay. I agree that too much cloves leaves an aftertaste. Dough is sticky --I'd add another 1/2 cup of flour. Separate the dough into 3 small amounts to chill. Don't overbake because the cookies'll dry rock hard. Had a hard time not overbaking because they were so soft and looked raw in the middle, but the ones I removed on time cooled perfectly soft but not mushy. \n\nMy cookies spread, & my Better Homes & Garden cookie mag says it might be caused by using margarine w/ \"less than 80 percent vegetable oil\" and putting the dough on hot cookie sheets. BH&G says your margarine should be at least 100 calories per T. I didn't know that about the hot cookie sheet either, so next time I'll alternate sheets.\n\nI love the idea of rolling the dough on parchment, cutting the shapes, removing scraps, & baking on the parchment. \n\nI prefer the Joe Froggers recipe on this site, which is easier to roll, eggless, uses shortening (which doesn't compete with the spices), and 1/2 as much cloves for 2x as much flour! But I do like the cinammon in this recipe so I'll add some to my Froggers.\n\nAlso, just FYI for anyone getting psyched to make gingerbread cookies this season, my Better Homes & Garden cookie mag says this about dark vs. light molasses: \"When describing molasses, light refers only to flavor, not color or calorie or sugar content. Light is sweet in flavor. Dark molasses is not as sweet but has a distinctive robust flavor. Light and dark are interchangeable in recipes.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-05T20:27:17.227Z",
                "reviewBody": "Made these in our cookie shop this past week  and everyone who tried them loved them, especially when they were still warm out of the oven.  I'm very impatient and time is always limited, so I never wait for dough to stiffen in fridge.  I added a about 3 extra tbsp of flour so the dough would be dry enough to roll out immediately.  Turned out great.  Easy to roll out and it didn't toughen the finished product at all.  Even on Friday (four days after they were baked) cookies were still delicious and tender.  This is definitely our new gingerbread recipe.  And I wouldn't change the proportions of the spices at all.  The taste was wonderful as is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUGARPLUMSCOOKIES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1463149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T23:28:04.75Z",
                "reviewBody": "I was looking for a classic, soft, delicious gingerbread cookie recipe, and I found it! This recipe makes such a nice, soft dough with the perfect blend of spices. I used Grandma's original molasses (not robust) and light brown sugar. I think you could get away with adding about 1/4 cup more flour to make it a little firmer. You may want to double the recipe for your holiday cookie baking.\r\nI don't remember liking gingerbread so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Spongebob7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/755376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-29T15:04:29.463Z",
                "reviewBody": "This is a very good gingerbread recipe. However, one must watch the men carefully when you open the oven, lest they jump out and run out the door yelling, \"Run, run, as fast as you can, you can't catch me; I'm the gingerbread man!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "embarck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7763759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T05:42:38.187Z",
                "reviewBody": "These turned out really well and my kids loved cutting them out and decorating them. ( Don't be discouraged by the amount of dough - it makes a LOT more cookies than it looks like it will.) After adding the ginger I substituted an equal amount of Pumpkin Pie Spice (2 tsp.) for all the other individual spices and it worked perfectly. I will be pretty generous with the spices next time though - by the time my 14-year-old worked in enough flour to handled the dough it was a little bit diluted. Still yummy and we'll probably make them a few more times this holiday season. Just remember to use a pastry brush to get all the excess flour off your cookies (top AND bottom) before placing them on the baking sheet - prettier and tastier!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-28T03:12:02.89Z",
                "reviewBody": "Delicious! The recipe was perfect- no extra flour needed and no tampering with the spices. Dough WILL be a little sticky but the trick is to make it as cold as possible. Freezing for a short while may help and using small portions at a time may help. I also followed the advice of rolling it between 2 lightly dusted sheets of baking paper. I used a broad lightly floured spatula to lift it up. Again the colder the dough the easier it is to lift. If u like your gingerbread a little chewy and soft then 8min at 350F is great. But if u like 'em a little crispy then try baking it a second time at (300F 7-8min) or perhaps longer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KatGrrrl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1548204/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-08T17:07:36.06Z",
                "reviewBody": "My kids husband and I had as much fun baking and making these as we did eating them and giving them for gifts! If you want to hang them on the tree make sure to roll a bit thinner and poke a hole for a hook. If they are for eating just bake for about 6 1/2 to 8 minutes for a softer cookie unless you like a ginger snap textured cookie. I rolled mine out between lightly floured wax paper. Used powdered sugar/milk mixture for \"glue\" and used raisins mini m&m's and red licorice to decorate. Love the way the smell of them baking sends out a great Christmasy smell as well as a warm home feeling. This is a Christmas Classic Recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOYCE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/278128/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Eileen's Spicy Gingerbread Men",
            "description": "Watch how to make these spicy gingerbread cookies!",
            "uploadDate": "2018-10-29T19:30:24.367Z",
            "duration": "PT2M26.901S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2de8cff5-1a2c-4099-8fc8-7be819aab65c%2F58f106b4-fc61-4087-92a2-ad7dfed36cff%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5849657952001"
        }
    }
]