[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/58640/fortune-cookies-so-easy/",
        "name": "Fortune Cookies So Easy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F22391.jpg",
            "width": 2580,
            "height": 1932
        },
        "datePublished": "2020-06-19T03:09:49.000Z",
        "description": "Taste and look just like the ones you get at a Chinese restaurant!  I was very pleased with my first attempt baking these!  Adding your own personalized message allows you to create great favors for any occasion! Alternatively, I have rolled these into tube-like cigar shapes and filled them with icing for other occasions which have been a crowd pleaser!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "36 servings",
        "recipeIngredient": [
            "3 egg whites",
            "¾ cup white sugar",
            "½ cup butter, melted and cooled",
            "¼ teaspoon vanilla extract",
            "¼ teaspoon almond extract",
            "1 cup all-purpose flour",
            "2 tablespoons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets, or line with parchment paper. Have fortunes ready to go on small strips of paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large glass or metal bowl, whip egg whites and sugar on high speed of an electric mixer until frothy, about 2 minutes. Reduce speed to low, and stir in melted butter, vanilla, almond extract, water and flour one at a time, mixing well after each. Consistency should resemble pancake batter.  Spoon the batter into 3 inch circles on the prepared baking sheets. Leave room between for spreading.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 5 to 7 minutes in the preheated oven, or until the edges begin to brown slightly. Quickly remove one at a time, place a message in the center, and fold in half. Fold the ends of the half together into a horse shoe shape. If they spring open, place them in a muffin tin to cool until set.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "BABYCAKES291"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8160919540229883,
            "ratingCount": 87,
            "itemReviewed": "Fortune Cookies So Easy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "52.9 calories",
            "carbohydrateContent": "6.8 g",
            "cholesterolContent": "6.8 mg",
            "fatContent": "2.6 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "22.9 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-26T02:56:12.893Z",
                "reviewBody": "READ THE REVIEWS! THEY GIVE YOU TIPS!\nI found something out that might help some of you.  I also was having problems while folding it and it breaking. What I learned is: Yes, the texture should be like a pancake (so I did have to add more water to mine because it was thick) BUT in addition, once it's put on the cookie sheet, it should NOT be like a pancake but more like a crepe. You've reeeally gotta thin it out with a spoon. Too thick and it'll break. You know you've got it thin enough when you pick it up and it feels like you're flinging a piece of rubber around. If it feels like a thin cookie---too thick still.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "micheymichey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-04T17:21:40.733Z",
                "reviewBody": "I loved this recipe! My 10 year old was able to make these for her friends. The only thing I did different was to increase the water to 4 T. Making them less pancakey.Using the back of a spoon to spread them out before cooking gives them more of an even consistency. Bake a little longer till about a forth to a third is golden brown. Fold them in half lightly grab the top and use an edge of a glass or bowl to get the horseshoe shape then put them in a muffin pan to cool. We made two on a pan and rotated the pans. It sounds complex but once you get the motion in order they are so easy. Thank you for the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HUEJAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1108750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-30T15:32:48.243Z",
                "reviewBody": "I made these cookies for a project in school and we found it best to use the batter warm (room temp.) and do three at a time. wait until the edges are golden/crisp then w/ two people have one remove cookie and the other fold the cookie then put them in small muffin tins to bake more until golden all over then cool (still in the muffin tin).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Plymouth NH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2386010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-24T18:51:45.75Z",
                "reviewBody": "I hate false advertising- but this recipe is telling the truth! 'So easy-' and so good! They were nice and sweet, even though they didn't have the lemon flavor of your classic restaurant cookie. But they were fun to make, though I strongly remcommend having a lot of elbow room and fast moving fingers. If you are planning on popping fortunes in these, wait a few seconds to insert the paper, otherwise it will stick to the cookie and your fotune will be 'You will eat a piece of paper and choke.'",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxanne R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2288934/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-11T03:07:45.49Z",
                "reviewBody": "Ok everyone these are easy with some tips. Put the oven to 350 not 375. Grease cookie sheets really really well. I added more water to thin the dough and added no vanilla extract all almond and about 1 tsp. I used a old metal cookie sheet not an airbake. Spread dough out THIN bake 4 minutes flip cookies over bake 30 seconds more. Work really quick and these look just like the real things!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/191706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-25T18:40:40.437Z",
                "reviewBody": "my daughter and I just made these. We compared this recipe with another one she found on another site. the only difference was water was increased to 3 tablespoons and butter to 6 tablespoons. I thought these would be so difficult but that was not the case. She wanted to make them for a friend who is leaving town. They turned out so nice!!! We only did 4 at a time to ensure time to fold before they started to crack. We let them get good and brown on the edges folded then placed in a mini-muffin tin to hold the shape. Just wonderful and tasted so much better than store bought. Thanks Babycakes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwen Langham Howell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/725394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-23T01:52:53.543Z",
                "reviewBody": "I really enjoyed these. I found that if you heated the pan before putting the cookies on they spread into circles easier. I only put two cookies in the oven at a time. Also as a preference I doubled the vanilla.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZZIE9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1122440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-28T23:57:18.42Z",
                "reviewBody": "Very yummy! I changed the 1/4 tsp vanilla and almond extract to 1 tsp. of vanilla. The batter tasted very much like flour before I increased the extract. I also added water to make it thinner. It was much easier to spread. Try to get the middle as thin as possible as it tends to be cake-like and breaks apart or cracks pretty easily. I found that I had much more time to shape them then I thought I would and could make four at a time. You might need a towel to shape them as they stay very hot for awhile. I also must have made them larger then intended because the recipe only made 20. I'll be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSICA1467",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/763958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-20T18:50:59.89Z",
                "reviewBody": "I used powdered egg whites and margarine the heated pan really helped but I thinned it with a spoon back on the pan and towards the end of the batch added a tad of water to thin you can only do 4 at a time but it was a blast after making 100 I had hot hands but the partygoers LOVED them!!!(usig the cup lip to make the horseshoe was easier)Would do it again for the next party with the birthday wishes inside THANK YOU!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SASSYMOM97",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-03T22:06:14.58Z",
                "reviewBody": "They tasted good but they took an hour to make. Too much investment for poor payoff.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "lsneed62",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/524895/"
                }
            }
        ]
    }
]