[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/699/world-cuisine/asian/japanese/",
                    "name": "Japanese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/58793/tonkatsu-asian-style-pork-chop/",
        "name": "Tonkatsu - Asian-Style Pork Chop",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6195830.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2020-06-19T03:09:49.000Z",
        "description": "This is using Panko, which is Japanese bread crumbs (really light and airy, more so than crackers), and thinly sliced boneless pork chops.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 eggs",
            "1 teaspoon milk",
            "½ teaspoon minced garlic",
            "salt to taste",
            "½ teaspoon pepper",
            "1 cup vegetable oil for frying",
            "8 thin cut boneless pork chops",
            "1 ½ cups panko crumbs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the eggs, milk, garlic, salt and pepper. Heat oil in a large heavy skillet over medium-high heat. Place the panko crumbs in a shallow bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rinse pork chops with water, then dip in the egg mixture. Coat with panko crumbs, dip in the egg mixture again, then coat with another layer of panko crumbs. Lay coated chops on a plate until the rest are finished. If you have time, let them set for about 10 minutes, and the coating will set very well. If you wish to freeze the chops, now is the time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the oil is very hot, place pork chops into the pan, and fry for about 5 minutes on each side, until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Japanese"
        ],
        "recipeCuisine": [
            "Asian",
            "Japanese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SHIN98"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.411042944785276,
            "ratingCount": 163,
            "itemReviewed": "Tonkatsu - Asian-Style Pork Chop",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "276.1 calories",
            "carbohydrateContent": "14.3 g",
            "cholesterolContent": "108.8 mg",
            "fatContent": "13.1 g",
            "fiberContent": null,
            "proteinContent": "28.4 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "199 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-04T18:56:30.047Z",
                "reviewBody": "The first time I made these chops they were okay, but with a couple of tweaks, these pork chops are terrific! The second time I prepared them, I seasoned the pork chops with garlic powder, salt, and pepper. I also cooked the chops at a lower temperature (medium high) to prevent burning. Finally, I served them with a sweet and slightly spicy sauce found here on allrecipes (1/2 cup orange marmalade, 1/4 cup Dijon mustard, 1/4 cup honey, and 1/4 teaspoon hot sauce). If you're using a thick cut pork chop, I suggest pounding it to make it thinner or placing the thick pork chops in the oven to finish cooking after browning. All in all, this recipe is a keeper. Thanks so much for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CookingCutie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2181146/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-22T09:59:34.867Z",
                "reviewBody": "My family's been making pork katsu as long as I can remember, so here's a tip since the recipe doesn't mention it: pound the meat! It makes all the difference in texture and tenderness. Serving tonkatsu sauce is a must as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFDOG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1286800/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-01T17:12:21.937Z",
                "reviewBody": "Incredible!!! I've been wanting to make this using the Panko crumbs which I've never used!  I finally bought Panko crumbs on line and I will NEVER NEVER EVER go back to using regular breadcrumbs!!!!  I've been expermenting with these crumbs now whenever breadcrumbs are called for and these Panko crumbs ROCK!!!!  Thanks submitter!  Update: Since discovering Panko crumbs I found a recipe for chicken on this site called Ashley's Chicken Katsu with Tonkatsu Sauce - It is also a 5 star+ recipe and the Tonkatsu sauce is also great with these pork chops.  I've actually had these in a Japanese restaurant with the sauce!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aspiring Chef Rita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-08T23:21:57.323Z",
                "reviewBody": "I've been looking for a good katsu recipe and came across this one last year which I have now made close to a dozen times. This is so good that I haven't had to modify it too much. Suggestions to try though: Add a splash of sesame oil to your deep frying oil for a blast of asian flavor. Make sure the meat is thin less then a 1/4\" thick is good. If thick meat lower the temp of the oil to prevent the breading from scorching before the meat is cooked thru. Season your meat before coating and breading. Use powdered garlic and ginger instead of fresh minced since they are easier to incorporate into the egg or into the panko. Use fresh crushed Tien Tsin Chili pepper (little red asian pepper) added to panko for added heat (caution: a little adds a lot of heat). Tonkatsu sauce (or any sauce) is critical for this...I use store bought Bull-Dog Vegetable & Fruit Tonkatsu Sauce (can order online if not at your local asian market) instead of making my own which I can't get to taste as good as this.Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOHNMONIHAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1307584/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-03T13:55:07.83Z",
                "reviewBody": "Very tasty recipe...marinating and tenderizing (pounding) before making it helps. Also the CUT of meat you use is KEY. If it is dry you prob used cheap meat. In Japan we have HIRE (white meat) and ROSU (dark meat) - even good quality white meat will be super juicy. Of course this dish does not stand alone - you NEED sauce! The Japanese do not eat this without sauce...it would be the unthinkable. Please try authentic Tonkatsu sauce or...if in a pinch some A1 steak sauce. Don't try it w/out some dressing otherwise it is pointless to make it.:( Served with thinly sliced lettuce salad mini tomatoes for presentation...great. Lettuce reduces...er compliments the greasiness of the fried meat. Also if you have non-meat lovers the same technique can be used for SHRIMP. Very tasty...but be sure to cut the tail to prevent juices from flying and make incisions along the body to make the shrimp stand straight after frying. Fat-concerned folks: please fry panko in oil...then do like 'shake and bake' - then...bake...similar results...not AS tasty but definitely easier on the waist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BB-chan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/190725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T15:25:43.967Z",
                "reviewBody": "This was fantastic...just like at a Japanese restaurant it was crunchy and tender!! Yum! Now if I could only make nigiri! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHEE73",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822142/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-24T20:03:30.363Z",
                "reviewBody": "This tastes great! As many reviewers mentioned it is important to lightly coat the chops in four egg then the panko so the coating will stick. Do let the coated chops sit for the optional time before frying as it really helps the coating stick! I didn't pound out my chops (forgot) but as they were only slightly thicker than 1/4 inch (maybe about 1/2 inch) I just cooked them at a lower temperature for a little longer. I seasoned the flour with seasoned salt pepper and garlic powder. I also added a little hot sauce (splash or two) to the egg mixture and left the panko plain. Serve this with 'Tonkatsu/Katsu' sauce from this site it's great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-17T14:26:03.313Z",
                "reviewBody": "This recipe was enjoyed by the entire family. Served with a tangy tonkatsu sauce & rice there were no leftovers. Looking fwd to making them again but i'll get more panko next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jaiu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1845088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-23T13:17:19.12Z",
                "reviewBody": "Yum! I just made this for dinner and paired it with katsu sauce recipe that I found on this website too. My family loved it so much. In the process of cooking I added flour with seasoned salt pepper and garlic powder. Egg mixture was not enough for the 8 chops so I doubled it as well as the panko crumbs with red pepper flakes. After dipping the chops I let them rest in the freezer for an hour or two. Then I fried it in hot vegetable oil with a splash of sesame oil. Have my fire set on low then fry each side for about 5 minutes until golden brown. The only thing that I regret about is I forgot to season the chops with garlic powder and ground ginger I'll do that again next time though. Thank you Shin98 =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Just_G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5970198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T17:32:14.597Z",
                "reviewBody": "I'm trying this right NOW! I have 3 chops that I've de-boned and cut down into 9 equal size pieces. Then starting with the smallest pieces lightly pound flat. Working up with the larger pieces pound to same thickness as the smaller one. Marinade with soy sauce hoisin sauce and a little Chinese 5 spice for half an hour. Then follow along with the rest of the directions. Will be served with lemon basmati rice buttered carrot coins and leftover turkey dressing. I will tell you later how it turns out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "freddychef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4025641/"
                }
            }
        ]
    }
]