[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/759/desserts/candy/popcorn-candy/",
                    "name": "Popcorn Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/59854/cinnamon-sugar-popcorn/",
        "name": "Cinnamon-Sugar Popcorn",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3996662.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:09:54.000Z",
        "description": "I first tried this when I was visiting my sister in West Virginia.  After trying it, I loved it, however I neglected to ask her for the recipe.  10 years later, I have it, and I still love it!  The kids can help make it if you use an air popper (which I did to reduce fat and calories...there's enough in the butter!)  I used my deep dish lasagna pan to cook it in the oven.  You can use a roasting pan or any other large, deep dish pan.  It makes a lot, so either invite your friends or store it in an airtight container for later.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "1 gallon",
        "recipeIngredient": [
            "1 cup unpopped popcorn",
            "⅓ cup butter",
            "⅔ cup white sugar",
            "2 teaspoons ground cinnamon",
            "½ teaspoon salt",
            "½ teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 250 degrees F (120 degrees C). Pop the popcorn using an air popper according to manufacturer's directions. Place into a large mixing bowl, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a small saucepan over medium heat. Stir in the sugar, cinnamon, salt, and vanilla, and cook until thick and bubbly. Pour over the popcorn, and stir until the popcorn is evenly coated. Spread the popcorn into a large roasting pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven 10 minutes, then turn the heat off, and allow the popcorn to stay in the oven 20 minutes longer. Remove from oven, and cool completely before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Popcorn Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MACCO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4743589743589745,
            "ratingCount": 156,
            "itemReviewed": "Cinnamon-Sugar Popcorn",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "113.6 calories",
            "carbohydrateContent": "17.8 g",
            "cholesterolContent": "10.2 mg",
            "fatContent": "4.4 g",
            "fiberContent": "2 g",
            "proteinContent": "1.6 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "100.3 mg",
            "sugarContent": "8.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-26T23:15:28.69Z",
                "reviewBody": "This recipe needs better instructions, but it's a great snack!  The first time, I also had a chunky, dumpy topping that didn't coat the popcorn (like other reviews).  I think it's from overcooking.  So take cautiously the instructions to \"cook until thick and bubbly.\"  I guess I misunderstood that exactly.  I think the more fool-proof way is just to do it in the microwave as you are more likely to prevent scorching, overcooking and it'll be easier to pour from a glass measuring cup anyways.  Use a 2-cup measurer, melt butter first (about 40 seconds), then add in other 5 ingredients and mix thoroughly.  Then microwave on high for about 20 sec at a time, stirring inbetween until the topping is a thick sauce.  The stirring is important to get all incorporated and applying enough heat to disolve the sugar is also important.  Should take between a total of 40-60 seconds after you add the 5 ingredients. (I did it twice, total 40 seconds, but I had half a batch, so might make a difference.)  As for baking, the method instructed seems fine.  It does taste pretty good before baking, but like another noted, it will be sticky that way.  It's great after baked as well- a combination between kettle corn and moose munch.  I also mixed in mini marshmallows before pouring the coating.  I liked it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Courtney Van Tress",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4193563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-02T20:18:48.207Z",
                "reviewBody": "De-licious!!! If any of you are familiar with the famous and really expensive \"Dale & Thomas\" popcorn, this stuff comes really close to their cinnamon drizzle flavor but at a fraction of the cost! I followed the recipe exactly and got great results. I basically used 3 bags of microwave popcorn and doubled the sauce. I mixed it all in a really large foil roasting pan that I lined with Reynold's non-stick foil. This was so easy and the results are fabulous! All I needed to do to take it over the top was to drizzle it with melted white chocolate. It was the perfect sweet treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-31T22:50:55.59Z",
                "reviewBody": "I cheated and used two bags of Homestyle microwave popcorn. I took other reviewer's advice and cooked the butter low and with the sugar while wisking it constantly until it thickened, then took it off the heat and added the cinnamon, salt and vanilla. After that step, I drizzled it over the popcorn that I spread on a baking sheet and baked it. GREAT movie snack and using the Homestyle popcorn mixed with the sweet vanilla glaze is just the end all of sweet/salty combinations. We LOVE it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-10T18:47:26.953Z",
                "reviewBody": "THIS RECIPE IS OUTSTANDING. im tired of people giving two star reviews because \" i changed it a bit and it was awful\" ive made this recipe several times following the directions and ive never had a problem. Delicious fall treat for the faimley",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarah saurus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3242329/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-15T19:05:27.07Z",
                "reviewBody": "I had high hopes for this recipe but alas...The taste was great. As others suggested, I cooked everything at a low heat until thick and bubbly. I even doubled the sauce recipe because 1 cup of unpopped kernals is A LOT of popcorn. Anyway, it didn't mix well, never really coated the popcorn evenly and it still wasn't enough sauce. Perhaps the sugar never melted and that was my problem. Not sure. Oh, another thing, make sure you have a BIG bowl because you will make a huge mess trying to mix it.  I will say this though, the taste is pretty darn good. Like Monkey Bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "krjohns",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2190725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-26T15:38:43.263Z",
                "reviewBody": "This popcorn was so delicious!!  My boyfriend and I were craving something sweet and I love cinnamon sugar anything.  I found this recipe and am so glad I did!  For some advise, make sure you keep the heat very low while melting the butter and sugar, and I whisk it frequently, or else the sugar will be clumpy.  We did not have the patience this time to put it in the oven, so we ate it sticky (which was delicious!) but next time I will put it in the oven.  I also would like to try the sauce with pecans or peanuts!  Thank you for this recipe! I will definitely be making it all the time!! YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3483388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-03T23:14:32.803Z",
                "reviewBody": "This is really good and really easy.  After reading some of the reviews I decided to use 1/2 cup unpopped popcorn and followed the rest of the recipe.  Delicious but a tad overly sweet.  I made it again the next day because it was such a hit.  That time I used 3/4 cup popcorn and 1 slightly heaping teaspoon cinnamon.  Perfection.   And FWIW, I never had a problem getting the popcorn and the sugar/butter mixture mixed thoroughly.  This is a great alternative to caramel corn.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly Hobbie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1189296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-10T18:31:57.447Z",
                "reviewBody": "Great. When mixing cinnamon sauce make sure to keep burner at a low temp otherwise the sugar will harden.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Blake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2908327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-21T23:11:04.343Z",
                "reviewBody": "I popped a bag of popcorn in the microwave. Used 6T of butter omitted salt and the vanilla...I think there was plenty of \"sauce\" for the 1 bag of popcorn. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ClemMama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3457138/"
                }
            }
        ]
    }
]