[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/219/salad/vegetable-salads/",
                    "name": "Vegetable Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15106/salad/vegetable-salads/asparagus-salad/",
                    "name": "Asparagus Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/60491/roasted-asparagus-and-yellow-pepper-salad/",
        "name": "Roasted Asparagus and Yellow Pepper Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1979735.jpg",
            "width": 1550,
            "height": 1033
        },
        "datePublished": "2020-06-19T03:09:56.000Z",
        "description": "This delicious cold roasted asparagus recipe is great if you love asparagus, and even if you don't. The tangy dressing and the roasted taste of the asparagus and peppers brings it all together. You can make this a day ahead of serving. You may not need to use all of the dressing. Also, you can make the vegetables the night before and add the dressing a few hours before serving.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ½ pounds fresh asparagus, trimmed and cut into thirds",
            "2 medium yellow bell peppers, seeded and diced",
            "¼ cup olive oil",
            "1 large red onion, cut into strips",
            "¼ cup toasted almond slices",
            "½ cup grated Parmesan cheese",
            "½ cup olive oil",
            "3 tablespoons Dijon mustard",
            "3 cloves garlic, minced",
            "2 teaspoons lime juice",
            "2 teaspoons sugar",
            "1 teaspoon hot sauce",
            "salad seasoning mix to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Arrange the asparagus spears and bell peppers in a single layer on the baking sheet, and drizzle or mist with 1/4 cup of olive oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast 8 to 10 minutes in the preheated oven, or until tender, turning occasionally to prevent burning. Remove from heat, and cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, toss together the asparagus, bell peppers, onion, almond slices, and Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl, mix the 1/2 cup olive oil, Dijon mustard, garlic, lime juice, sugar, hot sauce, and salad seasoning. Pour over the salad, and toss to coat.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Vegetable Salad Recipes",
            "Asparagus Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kim"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.36231884057971,
            "ratingCount": 69,
            "itemReviewed": "Roasted Asparagus and Yellow Pepper Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "276.7 calories",
            "carbohydrateContent": "10.8 g",
            "cholesterolContent": "5.6 mg",
            "fatContent": "24.5 g",
            "fiberContent": "2.9 g",
            "proteinContent": "5.8 g",
            "saturatedFatContent": "4.1 g",
            "servingSize": null,
            "sodiumContent": "267.4 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-06-13T11:07:50.287Z",
                "reviewBody": "The first time I made this my husband said it was way too oily. The second time I put the veggies in a bowl poured just a little olive oil on top & mixed them with my hands to coat them. Then I used only 1/4 cup olive oil & half of the seasonings for the dressing. I substituted pourable Splenda for the sugar & just added some salt & ppper instead of the hot sauce & salad seasoning mix. I used chopped pecans the 2nd time which I preferred to the almonds. Also adding some red peppers to the yellow adds to the presentation. I'd suggest checking the asparagus after 10 minutes to see how al dente or roasted you'd like them. I took another reviewer's suggestion & baked them for 18 minutes (9 minutes a side). Two other suggestions... If you want leftovers I'd suggest doubling this recipe. Also if you refrigerate the dish you should take it it out ahead of time as the olive oil solidifies in the frig.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FBA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/763329/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-20T23:21:38.22Z",
                "reviewBody": "Oh wow! The mustard lime vinaigrette in this salad is wonderful! I was worried that it might be kind of \"weird\" but I loved it! I'm not a big garlic fan so I only used one clove. I also put a bit of the lime zest into the dressing. I cut the bell peppers into strips rather than dice I wanted bigger chunks. I roasted the onions along with the asparagus and peppers to mellow the onion flavor as well. I poured half the dressing on the warm vegetables then set the salad aside while the rest of my meal cooked and then added the rest just before serving along with the almonds and parmesan. I don't know what \"salad seasoning mix\" is but the dish tastes great without it. It came out great and I had plenty of compliments from my guests. I'll make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-29T21:10:19.013Z",
                "reviewBody": "I just made this for the second time and it has gone over fabulously with all of my dinner guests. I love that it can be made ahead of time. My family raved about it at Easter and last night I served it to 14 of my husband's co-workers. It was great! My only change was to hold back a little of the hot sauce in fear that perhaps some of my guests did not like things quite so spicy/hot. It is a fabulous dish to make ahead of time for a party and reserve a few toasted almonds to sprinkle on the top just before serving. I also used both red and yellow peppers to add additional color. If it hadn't been raining I would have grilled the vegetables outside instead of oven roasting for additional flavor. This is definitely a \"keeper\" and even worth paying a little extra for asparagus when not in season.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AJRHODES3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/124085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-17T18:37:22.543Z",
                "reviewBody": "This is fast becoming one of my favorite salads! A few changes I've made are: slivered almonds instead of sliced (more \"substance\" there) shredded parmesan cheese instead of grated (the grated cheese kind of \"clumped up\" when you mixed it in) a longer cooking time (about 18 minutes total) to get the veggies tender AND I cut the dressing recipe in half since it doesn't take much especially since the veggies are already covered with olive oil. This salad takes some great ingredients and combines them in a way that makes them all BETTER!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRICKYR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-05T22:10:52.03Z",
                "reviewBody": "I made this for my family's July 4th dinner. Everyone liked it very much. I personally thought it was delicious although I may try a little less dijon mustard next time as I thought it dominated the flavor of the dressing. Following the advice of some of the other reviews I used both red and yellow peppers and substituted pecans (toasted) for the almonds. It was delicious this way and added more color. I did use a bit less onion because my family doesn't like heavy onion flavor. I didn't know what \"salad seasoning mix\" was either so I used about a teaspoon of Good Seasons Roasted Garlic salad dressing mix. It was good but I didn't think it was really necessary because the dressing tasted really flavorful before adding the seasoning. It was a really good recipe and I will definitely use it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MINDY1315",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1421904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-17T18:36:39.967Z",
                "reviewBody": "Wow there are a lot of flavors going on in this dish! The vegetable mix with the cheese and almonds is great on its own but I thought the dressing was a tad strong--definitely go easy on it. I think the salad dressing mix (does that mean italian?) can be left out totally and the lime juice taste was overpowered by the mustard. I may use red wine vinegar next time. Also a teaspoon is a lot of hot sauce which I like but most people can't handle. The roasting really flavors the veggies nicely. I will be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "boogeley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/756600/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-07T13:40:55.233Z",
                "reviewBody": "I really liked this but my wife thought it was too spicy. She did ask me to make it again without the hot sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IBNSHISHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1216441/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-02T19:37:26.84Z",
                "reviewBody": "I received ratings from everyone at my dinner party. All 9 guests were attempting to tell me what was in this salad that made it so good...few discovered the secret ingredients of the dressing. I used red yellow and green peppers and toasted pecans. In the dressing I used a some fresh chopped cilantro when adding to the salad. Everyone wanted a copy of the recipe. I will use again and again this summer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/397199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-08T02:47:29.06Z",
                "reviewBody": "I've made the dressing part of this (1/2 cup olive oil thru salad seasoning) several times for different salads and it's always a big hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Team HHH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1456721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-28T02:15:48.467Z",
                "reviewBody": "If less than one star was available I would give it! I love every ingredient in this recipe but the Red Onion ruined it. It overwhelmed it. I should have roasted the onion like someone suggested but I was afraid that the salad would be too limp. I would suggest using a Vidalia instead of a Red Onion. I made the salad exactly as written (minus the salad seasoning..I didn't know what that was either). The dressing was great.... This was my first disappointing recipe of all the zillions that I have tried!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanzi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/576901/"
                }
            }
        ]
    }
]