[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/60425/chocolate-macaroon-tunnel-cake/",
        "name": "Chocolate Macaroon Tunnel Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8177322.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:09:56.000Z",
        "description": "This cake recipe is the result of a discontinued, but wonderful box mix. It is a chocolate cake that slices to reveal a beautiful white coconut center. Yummy! The vanilla glaze can easily be made into chocolate by adding 2 tablespoons of cocoa powder.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H5M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "½ cup shortening",
            "1 ¾ cups white sugar",
            "1 egg yolk",
            "2 teaspoons vanilla extract",
            "4 eggs",
            "2 cups sifted all-purpose flour",
            "½ cup unsweetened cocoa powder",
            "1 teaspoon baking soda",
            "1 teaspoon salt",
            "¾ cup cold water",
            "½ cup sour cream",
            "1 egg white",
            "¼ cup white sugar",
            "1 cup flaked coconut",
            "1 tablespoon all-purpose flour",
            "1 teaspoon vanilla extract",
            "2 cups sifted confectioners' sugar",
            "1 tablespoon butter, softened",
            "1 teaspoon vanilla extract",
            "2 tablespoons milk, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, blend together the shortening, 1 3/4 cups white sugar, egg yolk and vanilla until smooth. Beat in eggs one at a time using an electric mixer. Combine 2 cups flour, cocoa, baking soda and salt; stir into the egg mixture alternately with the sour cream and water. Pour batter into the prepared Bundt pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl with clean beaters, whip the egg white until soft peaks form. Gradually sprinkle in 1/4 cup white sugar while continuing to whip to firm peaks. Fold in the coconut, 1 tablespoon of flour and 1 teaspoon of vanilla by hand using a spatula or wooden spoon. Drop this mixture by teaspoonfuls over the chocolate batter in the pan. Be careful not to let the filling touch the sides of the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 55 to 65 minutes in the preheated oven, or until a knife inserted into the cake comes out clean. Cool for 15 minutes in the pan, then invert onto a wire rack to allow the cake to cool completely. Remove cake from pan, and drizzle with vanilla glaze.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make vanilla glaze, mix together the confectioners' sugar, butter and milk in a small bowl, gradually adding milk until the mixture is thick but pourable.  Drizzle over cooled cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Juanita"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.926829268292683,
            "ratingCount": 41,
            "itemReviewed": "Chocolate Macaroon Tunnel Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "345.6 calories",
            "carbohydrateContent": "56.8 g",
            "cholesterolContent": "64.5 mg",
            "fatContent": "12 g",
            "fiberContent": "1.8 g",
            "proteinContent": "4.6 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "269.8 mg",
            "sugarContent": "41.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-19T17:09:07.063Z",
                "reviewBody": "I think I have a better filling for this cake it's like the coconut filling in almond joy and mounds candy bars. It's so easy to make and it tastes great! It has a great texture and bakes up great in a bundt cake. Mix together 3 cups of Bakers sweetened coconut, a can of sweetened condensed milk and a teaspoon of vanilla extract. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dutchess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3565172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-14T01:57:47.593Z",
                "reviewBody": "When I was a teenager my mom made me this cake because I liked coconut. Now I remember making this cake mix a lot growing up until Pillsbury had the nerve to discontinue it. I have just made the cake from the recipe and followed it exactly except I buried my coconut ring of filling under some of the cake batter. Upon tasting the cake I noticed several things... The first was it was heaver than the original. It was also lighter in color. The coconut filling of the original was denser when it was spooned into the cake batter (which is why I believe it would sink while baking) the coconut filling was more finely chopped (almost minced?) and more of it. The coconut filling was more the consistency and texture of a thickish pudding. (sorry best way I can describe it). Does anyone else remember this? I have been looking for a duplicate for that Pillsbury recipe for many many years. Can anyone fine-tune this recipe to make it more like the original?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "FERRIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/52570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-10T22:19:09.763Z",
                "reviewBody": "I was short for time and tried this with a box. I used triple chocolate fudge cake mix. The box stated 1 cup of pudding in the mix. It was the perfect denseness and gooeyness. Will double the filling next time and actually try the cake part too. I was transported back to the early 70's there was just something about that cake. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMELA D. aPROpos of nothing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T20:27:18.147Z",
                "reviewBody": "I used a doctored up cake mix instead of the \"scratch\" cake. Overall it came out good but my cake didn't cover the coconut ring (but I did double the amount of coconut mixture which I think is necessary). Next time (and there will be a next time) I will pour 2/3 cake batter ring of coconut then rest of batter to be sure it is surrounded by cake. I did make the glaze chocolate but will try it plain next time (maybe with some toasted coconut on top!).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMP70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/575740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-26T18:40:31.687Z",
                "reviewBody": "I had been looking for a good recipe for this cake for YEARS and was so excited to make it. I followed the directions EXACTLY and against my better judgment did not alter the directions to put the \"tunnel\" of coconut filling in between layers of chocolate batter. The chocolate cake was good (a big like a pound cake in texture) BUT the coconut layer was never enveloped by the chocolate cake. Result? No \"tunnel\" of coconut filling but a crispy top (actually the bottom) of a crisp coconut egg-white mixture that we chipped off. We enjoyed the chocolate cake nonetheless but I was very disappointed that there was no tunnel of coconut. I'll give it another go -- and next time will put half of the batter in and then the coconut mixture and then the other half of the batter. The other point I'll share with y'all is that I used the new silicone style bundt pan and the cake took 90 minutes to bake (and no it wasn't overcooked at all by some miracle). So give this a go but do alter the directions and do not leave the coconut topping on top of the chocolate batter. I also think that a box mix (gasp!) might be closer to the original cake than this one although this one is very good and is VERY much like the chocolate pound cake at Starbucks! This cake baked as a pound cake with an espresso/cocoa drizzle would be excellent with a great cup of coffee or espresso!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "rloreth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1471691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-05T21:54:12.68Z",
                "reviewBody": "When I was younger we all enjoyed the Pillsbury Bundt cake too. It was my Mom's favorite. Yesterday was her 79th birthday so I made this cake for her party. It was delicious; however we all thought there wasn't enough coconut filling so the next time I make it I will double the recipe for the filling. I poured some of the cake batter in the bundt pan then added the coconut filling then poured the rest of the batter on top. I also used boughten cream cheese icing which I added milk to to make it thinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Newland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2585630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-06T17:53:31.107Z",
                "reviewBody": "This recipe is really good. It turned out just as advetised. I remember the original box cake from years ago and this is a good replacement. This brought back a lot of memories thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANTILOPE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1358950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T07:10:34.42Z",
                "reviewBody": "This recipe was wonderful!!!!! It was a beautiful cake as well. Although it was wonderful I wonder if perhaps using a devils food cake mix instead of the homemade version would create a cake that would be that gooey moist. But I also wonder if it would be strong enough to hold the coconut center. Regardless you cant go wrong with this delicious comforting dessert. Thank you for sharing your recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "luv2bakecookies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/565621/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-14T06:29:29Z",
                "reviewBody": "Thank you! Thank you! When this was available as a box mix it came with a small recipe book which I have saved for years just in case Pillsbury decided to sell the cake mix again. One of my favorite varieties was a Chocolate Mint Macaroon cake which our family loved. Thanks to your wonderful recipe we have created it again. Just add 1/2 tsp peppermint extract and 6 drops green food color to the macaroon filling. Then add 1/8 tsp peppermint extract and 3-4 drops food color to the glaze. It's delicious!!!! Thank you so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATHRYN88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420412/"
                }
            }
        ]
    }
]