[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/60564/strawberry-cake-from-scratch/",
        "name": "Strawberry Cake from Scratch",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3580865.jpg",
            "width": 1259,
            "height": 1910
        },
        "datePublished": "2003-04-26T17:56:46.000Z",
        "description": "It is hard to find scratch strawberry cakes, so this one is worth it weight in gold to me as a caterer.  I made this cake for a child's birthday party.  It was a major hit! Frost with cream cheese or vanilla frosting - or for a treat, use a chocolate glaze!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "2 - 9 inch cake layers",
        "recipeIngredient": [
            "2 cups white sugar",
            "1 (3 ounce) package strawberry flavored Jell-O®",
            "1 cup butter, softened",
            "4 eggs (room temperature)",
            "2 ¾ cups sifted cake flour",
            "2 ½ teaspoons baking powder",
            "1 cup whole milk, room temperature",
            "1 tablespoon vanilla extract",
            "½ cup strawberry puree made from frozen sweetened strawberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch round cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter, sugar and dry strawberry gelatin until light and fluffy. Beat in eggs one at a time, mixing well after each. Combine the flour and baking powder; stir into the batter alternately with the milk. Blend in vanilla and strawberry puree. Divide the batter evenly between the prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 to 30 minutes in the preheated oven, or until a small knife inserted into the center of the cake comes out clean. Allow cakes to cool in their pans over a wire rack for at least 10 minutes, before tapping out to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GothicGirl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.234465617232809,
            "ratingCount": 1207,
            "itemReviewed": "Strawberry Cake from Scratch",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "393.2 calories",
            "carbohydrateContent": "59.3 g",
            "cholesterolContent": "89.7 mg",
            "fatContent": "15.4 g",
            "fiberContent": "0.7 g",
            "proteinContent": "5.4 g",
            "saturatedFatContent": "9.1 g",
            "servingSize": null,
            "sodiumContent": "232.9 mg",
            "sugarContent": "37 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-19T19:25:39.403Z",
                "reviewBody": "I think I know why everyone complained about density. The measurements for the flour are for sifted flour not the amount to be sifted. Sift the cake flour and then measure the amount to be put into the cake. The batter seems to be runny, but bakes up fluffy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MOMMY 2 XO & XY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1936048/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-29T06:51:26.043Z",
                "reviewBody": "I am a caterer as well and have not found a good strawberry cake recipe until now!  My daughter asked for a Strawberry cake I had to find a recipe.  Everyone LOVED it, even my picky eater that does not like strawberries! It is a keeper!  Thank you for sharing. I made the recipe like I do all of my cakes and it came out fluffy and moist.  I seperated the egg whites and yolks. Whipped the whites into soft peaks and folded them in at the end.  I also always line the pans with parchment paper, this keeps them from sticking to the bottom.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BUSYMOMOF6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1336267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-08T20:42:47.437Z",
                "reviewBody": "My sister and I made this cake the day before Easter Sunday and let it sit in the refrigerator until we served it for dessert... it was WONDERFUL!!! We took three recommendations from reviews that really helped the strawberry cake to turn out great! \n1~ We seperated the egg whites and yolks and whipped the egg whites and then added them in to the mixture.     2~ Also we sifted the flour and then after sifting measured it again. \n3~ We spread strawberry puree in between the two cake layers along with icing to make them stick together well. (mmmmm!!!:D)Furthermore we made the strawberry puree by blending clean, cut strawberries together in the blender which made a really fresh puree. As a finishing touch, after icing the entire cake with vanilla icing, we placed extra sliced strawberries on the top of the cake! The cake was BIG hit but make sure to make room in the refrigerator for leftovers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2340726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-07T20:57:21.24Z",
                "reviewBody": "A little sweet for me, but Hubs loved it.  Pretty pink, lots of strawberry flavor.  I creamed the butter, sugar and gelatin well, as directed, adding the eggs one at a time and beating well after each addition. I added the flour in thirds with the milk AND the strawberry puree, beginning and ending with the flour. This differed from the instruction to add the puree at the end.  To give the cake a little extra lift I used a full tablespoon of baking powder.  Also, salt makes flavor come alive, so I added a teaspoon.  The batter was so light, fluffy and voluminous I felt better using three pans rather than two and I'm glad I did.  I filled the cake with my own strawberry buttercream: 2 c.  powdered sugar, 1/2 c. butter, approximately 2 T. of sweetened strawberry puree and a dribble of strawberry extract.  It was awesome good and complemented the cake perfectly.  I frosted the cake with \"Sturdy Whipped Cream Frosting,\" also from this site, which Hubs and I both agree was a major disappointment and, in our opinion, ruined what otherwise would have been a perfect cake.  The strawberry buttercream I made for the filling would have been perfect to frost the cake as well and in hindsight I wish I would have done that. This cake is fluffy, moist and flavorful - pretty too! If I have any criticism at all, it would be that using the gelatin kind of turned me off. I would much rather find a true \"Strawberry Cake from SCRATCH\" that didn't use it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-15T19:05:09.377Z",
                "reviewBody": "I wanted to make a cake from scratch for my wife's birthday when I came across this recipe.  After reading all of the reviews I carefully measured the flour after sifting and I beat the egg-whites separately.  I used slightly less flour and butter hoping to make the cake fluffier.  It still ended up being a fairly dense cake (but still delicious).\n\nI made the strawberry puree from scratch just using strawberries and sugar.\n\nFor the frosting I used a homemade whip cream with more strawberry puree.\n\nI used 3x 9\" pans for a triple layer cake.  In between the layers I placed thinly sliced strawberries on top of a thin layer of icing.  I covered those with splashes of the strawberry puree then added more frosting.\n\nTo top it off I soaked halved strawberries in more puree and placed them on top.\n\nThe only reason I don't give it 5 stars is because it didn't come out as fluffy as I would have liked.  However I'm not much of a baker so it's just as likely my fault as it is the recipe.  But my wife loved it so I'm in her good graces until next year!\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Berenger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2491043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-01T18:14:19.297Z",
                "reviewBody": "I was very pleasantly suprised with this cake. There was so many reviewers claiming that the cake was too dense. I think that the problem maybe that they used 2 pans instead of 3. I went with my instinct and used three 9 inch cake pans and did everything else the same and my cake came out wonderful very light and fluffy. I used the remaining strawberry puree mixed it with some extra chopped strawberries sprinkled it with sugar and a little cornstarch. After mixing it and letting it sit I poured it between the layers and frosted the top and sides with my buttercream frosting. Delish to say the least!! The cake itself was defenitely better than any boxed version a keeper!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Verena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-19T15:38:47.783Z",
                "reviewBody": "I am so glad I read the reviews-this turned out great with some tweaking! Here's what I did different from the original:\n* sifted cake flour, then measured out\n* separated yolk/white and beat whites to soft peaks, then folded in at the end\n* reduced sugar to 1 3/4 c.(will try 1.5 c. next time)\n* baked in three, 9 in. pans\n* frosting=two store bought vanillas and 1/3 c. puree (plus a little red food color)\nCake was dense, moist and great! I liberally coated/greased/floured the pans, put wax paper on bottom, too. I really want to try this with raspberries as a local baker that is now out of business had the best raspberry cake and frosting. This turned out great! Thanks! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NANCYH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/493250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-28T12:18:58.843Z",
                "reviewBody": "I made this cake today and took it to work. What an AWESOME cake! I had some strawberries that I had to use up and am I ever glad I checked here first! I did make it in a 13x9 inch pan instead of the double layer. Baked it for 45 minutes (glass). Then made a \"fluff\" topping made of 1/2 cool whip and 1/2 cream cheese. I whipped these together till smooth and then stirred in about a cup of finely chopped strawberries. Did I ever get the rave reviews. Each person actually took a piece of cake and then spooned the \"fluff\" over that. Thanks for a great recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OODLES_OR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-03T18:50:09.42Z",
                "reviewBody": "For those of you who complained about the cake being too dense, try cutting back on your flour.  A standard cake recipe usually calls for about 2 1/4 cups of flour, not the amount listed.  That amount would work well if your 9\" pans were at least 2\" deep, and most standard ones that we have in our kitchens are not.  Also, decrease sugar down to 1 cup.  The gelatin is going to add a LOT of sweetness...I found this out the hard way making this recipe with a boxed cake mix.  It was way too sweet for me, but everyone else loved it.  I also cut back to only 3 eggs and took everyone's suggestion and whipped the eggs whites, folding them in at the end.  Also I only used 1/2 cup of butter but also added 1/2 cup of oil.  I kept the milk the same and actually blended the strawberries, milk, and oil all together to make a puree, almost milkshake-like in texture and added it to the creamed sugar, butter, and eggs.  Then I mixed in the flour just for a minute and continued to stir by hand, so as not to over-beat the batter.  My cake came out perfectly, very moist (a little delicate, but the boxed version did, too), and just the right amount of sweetness.  My cake is going to get lots of whipped cream and a white-chocolate custard filling between the layers.  :-)  --You can make your own cake flour by taking out 2 Tbsp. of flour from each cup and adding 2 Tbsp. of cornstarch back in.  Sift 4-5 times, THEN scoop out the amount you need.--",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Bakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-24T18:52:00.413Z",
                "reviewBody": "This cake turned out absolutely delicious but the reason I am giving it 3 stars is because it can be a bit tricky to make. Definitely follow the recipe exactly otherwise it can turn out a bit dense. I make mine in a 9x13 cake pan. For a yummy light frosting I blended together 8 oz of cream cheese with a container of cool whip and 1 tsp of vanilla.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "iKat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3283146/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Strawberry Cake from Scratch",
            "description": "This impressive cake is rich with the flavor of real strawberries.",
            "uploadDate": "2012-08-19T20:35:12.186Z",
            "duration": "PT5M15.774000000000001S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6b152c9e-a9a6-4d52-8da9-53571745d534%2F3f3f8297-a5f7-4bdc-96f4-5bb64e83c94c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1793986802001"
        }
    }
]