[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14671/desserts/cakes/cheesecake/chocolate-cheesecake/",
                    "name": "Chocolate Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/61410/guinness-and-chocolate-cheesecake/",
        "name": "Guinness&reg; and Chocolate Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2187266.jpg",
            "width": 5152,
            "height": 3864
        },
        "datePublished": "2020-06-19T03:09:59.000Z",
        "description": "A close friend is a cheesecake and Guinness fanatic. He requested a Guinness cheesecake for his 25th birthday; this is the result. It is quite smooth and very rich.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "1 - 9 inch cheesecake",
        "recipeIngredient": [
            "1 cup crushed chocolate cookies",
            "¼ cup butter, softened",
            "2 tablespoons white sugar",
            "¼ teaspoon unsweetened cocoa powder",
            "3 (8 ounce) packages cream cheese, softened",
            "1 cup white sugar",
            "3 eggs",
            "½ pound semisweet chocolate chips",
            "2 tablespoons heavy cream",
            "1 cup sour cream",
            "1 pinch salt",
            "¾ cup Irish stout beer (e.g. Guinness®)",
            "2 teaspoons vanilla extract",
            "1 (1 ounce) square semisweet chocolate"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 9 inch springform pan with butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the crushed cookies, butter, 2 tablespoons sugar, and cocoa in a small bowl; mix; press into the bottom of the prepared springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the cream cheese in a large bowl and beat with an electric mixer set to low speed until smooth. While beating, slowly add 1 cup sugar and then the eggs, one at a time. Continue beating until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the chocolate chips and heavy cream in a microwave-safe bowl. Heat in the microwave until the chocolate is completely melted, stirring every 30 seconds. Beat the chocolate into the cream cheese mixture. Add the sour cream, salt, beer, and vanilla; blend until smooth. Pour the mixture over the crust. Place the pan into a large, deep baking dish. Fill the dish with water to cover the bottom half of the springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the cheesecake in the water bath in the preheated oven for 45 minutes; turn oven off; leave the cheesecake in the oven with oven door slightly ajar another 45 minutes; remove from oven. Run a knife along the edge of the cheesecake to loosen from pan. Chill in refrigerator at least 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the semisweet chocolate in a small bowl using the microwave. Make chocolate clovers by dropping 3 small drops of melted chocolate close to one another on waxed paper. Drag a toothpick from between two dots outward to make the stem; chill until hardened. Arrange the chocolate clovers on top of the chilled cheesecake for decoration.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "Chocolate Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "M. Wassenaar"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3105590062111805,
            "ratingCount": 161,
            "itemReviewed": "Guinness&reg; and Chocolate Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "520.8 calories",
            "carbohydrateContent": "41.9 g",
            "cholesterolContent": "130.3 mg",
            "fatContent": "37.3 g",
            "fiberContent": "1.6 g",
            "proteinContent": "8.2 g",
            "saturatedFatContent": "22.4 g",
            "servingSize": null,
            "sodiumContent": "291.1 mg",
            "sugarContent": "33.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-16T16:18:44.37Z",
                "reviewBody": "First, let me say how annoying it is to me to read reviews that give a poor rating when the reviewer doesn't follow the recipe! I followed the recipe EXACTLY, and this is without a doubt one of the most heavenly chocolate cheesecakes I've ever made.  Just remember, the crust calls for chocolate cookies crumbs--not OREO cookie crumbs. So the butter to crumb ratio is just fine. I used chocolate graham cookie crumbs.  It is very important to not leave out the heavy cream when melting the chocolate. The cream makes the chocolate into a nice, thick ganache. Eliminating the cream would result in a much thinner batter. My batter before cooking was a bit thinner than some cheesecakes I've made, but not significantly so. I was expecting it to be more runny based upon reviews that I had read.  I did cook it for about 5 minutes longer because my oven runs a little cooler. The recommendation to wrap the pan in foil before submerging it in water was key--if you've never done a submerged waterbath and didn't know to wrap the pan, I can see where that would cause poor results. I took this to a St. Patrick's Day party and everyone went nuts--it was completely devoured! I'll be making this again, for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Z.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1594700/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-25T00:43:14.62Z",
                "reviewBody": "I've been a member for 2 years and this is my first review. Although I've enjoyed many many other recipes I've gotten from Allrecipes the reason I'm reviewing this is to counteract some of the negative reviews! This is absolutely delicious made as the recipe is written! I agree with those who say people shouldn't change the recipe and then complain because it isn't to their liking! Make it as the recipe is written and then make changes IF necessary! Changes are not necessary for this recipe - I made it 2 weeks AS WRITTEN - it was to die for! I'm making it again this weekend AS WRITTEN! I use a spring form pan oreo cookies which I take apart and discard the white stuff Guinness beer and place a pan of water on the shelf under the cheesecake. The only thing I do differently is to make a ganache from Ghirardelli 60% chocolate and heavy cream --and that is not a change it's an addition! Please try this as written! And if you make it with all sorts of changes and don't like the result keep your opinions to yourself! And I also take offense to the reviewer referring to the Holy Mother for a recipe review!! No wonder your recipe didn't turn out! Sorry to be so vocal but to criticize someone who is willing to share a recipe is beyond my comprehension. Life is short - let's be kind to each other!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol Ryan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3078237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-17T08:12:26.897Z",
                "reviewBody": "For the love of God & the Holy Mother drink the Guinness while you're looking for a DIFFERENT recipe. Seriously. This one is horrible. I cook cheesecakes all the time. (DH loves cheesecake almost as much as Guinness.) So I should have trusted my instincts on this one & skipped the beer as the recipe was already too loose. The person even got the crust part wrong: cookie crusts need 2 cups crumbs 2 TB butter (hello the stuff in the middle is already fat & sweet & chocolate); graham cracker crusts need 1-1/2 cups crumbs 1/4 cup butter 1/4 cup sugar. Too much butter leaves cookie crusts tasting like lard & cracker crusts hard. It's not necessary to reinvent the wheel just because you're going to post your recipe. No idea what the 1/4 tsp cocoa was for...I've never seen 1/4 tsp of anything called for in a recipe. Why bother? The eggs sour cream cream cheese is all a normal cheesecake recipe...so it's either the 3/4 cup beer puts the liquidity over the top or its the water bath cooking method. (I didn't immerse my springform by the way a pan of water underneath in an oven would be sufficient in a recipe that NEEDS moisture UNLIKE this one.) Finally 90 minutes on 350 I take it out as the perimeter is starting to pull & crust center looks iffy. (Left in the oven turned off door ajar for another hour.) & oh surprise surprise crust is soggy cake completely raw. I'm so mad at myself because I fell for all the hocus pocus thinking it might be interesting b",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JusCookAlready",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2859644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-04T22:39:25.34Z",
                "reviewBody": "I've made this cheesecake twice both times with stellar results. The first time I didn't make any changes to the ingredients and followed the instructions to the letter. It was exceedingly good. The texture was silky and crack free the flavor was a mature chocolate with subtle stout undertones. (NOTE: When I was pouring the batter into my springform I was nervous because it seemed too thin to set. It wasn't! Actually I think that's why it was so silky smooth.) The second time I made the recipe I added an extra 1/4 tsp unsweetened cocoa powder to the crust and instead of Guinness I subbed Young's Double Chocolate Stout (a heady English Stout in a purple bottle/can that can be found in the Microbrew section of most liquor stores). What a winner! The extra cocoa powder and the Young's achieved the complex bittersweet flavor I had been looking for. This is a Five Star recipe with no changes and (in my opinion)MORE than five with heavier stout.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheInfamousNicoletta",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2968919/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-11T17:20:11.78Z",
                "reviewBody": "Very tasty! With a family of beer drinkers this was a hit. Suggestion to those who had a problem with \"wet\"-always use the best quality sour cream and cream cheese. Off brands can affect your results. Have eggs cream cheese butter and sour cream at room temperature before starting. Always drain excess moisture from your sour cream by placing in a fine sieve or yogurt strainer over a bowl while letting it warm. These little hints can make a huge difference in the end result!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beverly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2268188/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-17T20:44:42.607Z",
                "reviewBody": "This recipe definitely has the POTENTIAL to be a 5 star recipe. I have made it twice just to see if I could make it work. One MAJOR item that was missed in the instructions is to wrap the bottom of your springform pan in foil before allowing the water to touch it. The first time I made this the water seeped into the pan causing the crust to get soggy. In addition to this here are the modifications I made: I didn't add any sugar or cocoa to the crust as I thought it was chocolaty enough with crushed oreos. I used exact measurements for everything else & used approx. a 1/3 semisweet chips and 2/3 giradelli bittersweet chips mixture. I baked about 60 minutes & turned off the oven with the door closed for about 15 minutes then cracked the door for another 45 minutes. Once the cake is chilled in the refrigerator it firms up nicely. So don't be afraid to make it. It's incredibly rich tasting and a great St. Patrick's Day dessert!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-17T23:58:07.97Z",
                "reviewBody": "I came across this recipe while browsing for a fun new cheesecake recipe to make for Valentine's day. My husband loves Guinness so I knew I had to try it. I'm not a huge fan of cheesecake but we both LOVED it!! So delicious and not too difficult to make. I didn't have a springform pan so I used a regular pan and after the cheesecake cooled I flipped it onto a piece of parchment paper and then back to a regular plate. I made chocolate hearts instead of clovers (because of Valentine's day)- so the presentation was almost as wonderful as the taste. I admit at first I thought it'd be weird to try beer in cheesecake but I'm so glad I did!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1793845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-26T16:46:46.24Z",
                "reviewBody": "I used crushed chocolate graham crackers which I increased to 1 1/2 cups and I used 1/4 cup unsweetened cocoa for the crust not 1/4 teaspoon. I used Ghiradelli 60% cocoa chocolate chips. I also cooked at 325 for about 70 min. then let sit in oven with the door cracked for another hour. Instead of a water bath I just put a tray of water underneath the cheesecake. After all that this was the most decadent chocolate cheesecake I have had for some time. It was picture perfect and had such a wonderfully rich dark chocolate flavor I was showered with compliments!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mochinda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1757020/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-11T22:24:16.993Z",
                "reviewBody": "I love Guinness so I was really excited about this recipe. I followed the directions exactly but after waiting forever for the cheesecake to be ready it was completely raw inside. I am really upset that this recipe didn't work because I really wanted to try it but I would have no idea how much longer to bake it for. I think it might have something to do with altitude? Who knows I don't know what else might have went wrong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2851829/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Guinness(R) and Chocolate Cheesecake",
            "description": "Possibly the most rich and decadent way to celebrate St Patrick's Day! ",
            "uploadDate": "2018-05-29T06:54:07.332Z",
            "duration": "PT1M50.417S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F012aecff-504c-4a5d-8e1c-ec17b9fedcf0%2F33c006b5-3032-490c-a51a-9502a2cc486c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5790731169001"
        }
    }
]