[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
                    "name": "Wraps and Rolls",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16366/appetizers-and-snacks/wraps-and-rolls/egg-rolls/",
                    "name": "Egg Roll Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/61913/authentic-chinese-egg-rolls-from-a-chinese-person/",
        "name": "Authentic Chinese Egg Rolls (from a Chinese person)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6406632.jpg",
            "width": null,
            "height": null,
            "caption": "Authentic Chinese Egg Rolls (from a Chinese person)"
        },
        "datePublished": "2020-06-19T03:10:00.000Z",
        "description": "My mom is the best cook ever and I am a picky eater. If I like this, then you will.  This is very authentic because my family is Chinese and I am too. This recipe is at least 300 years old in the Ling family.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "20 egg rolls",
        "recipeIngredient": [
            "4 teaspoons vegetable oil",
            "3 eggs, beaten",
            "1 medium head cabbage, finely shredded",
            "½ carrot, julienned",
            "1 (8 ounce) can shredded bamboo shoots",
            "1 cup dried, shredded wood ear mushroom, rehydrated",
            "1 pound Chinese barbequed or roasted pork, cut into matchsticks",
            "2 green onions, thinly sliced",
            "2 ½ teaspoons soy sauce",
            "1 teaspoon salt",
            "1 teaspoon sugar",
            "½ teaspoon monosodium glutamate (MSG)",
            "1 (14 ounce) package egg roll wrappers",
            "1 egg white, beaten",
            "4 cups oil for frying, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 1 teaspoon vegetable oil in a wok or large skillet over medium heat. Pour in beaten eggs and cook, without stirring, until firmed. Flip the eggs over and cook for an additional 20 seconds to firm the other side. Set egg pancake aside to cool, then slice into thin strips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the remaining vegetable oil in a wok or large skillet over high heat. Stir in cabbage and carrot; cook for 2 minutes to wilt. Add bamboo, mushroom, pork, green onions, soy sauce, salt, sugar, and MSG; continue cooking until the vegetables soften, about 6 minutes. Stir in sliced egg, then spread mixture out onto a pan, and refrigerate until cold, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble the egg rolls, place a wrapper onto your work surface with one corner pointing towards you. Place about 3 tablespoons of cooled filling in a heap onto the bottom third of the wrapper. Brush a little beaten egg white onto the top two edges of the wrapper, then fold the bottom corner over the filling and roll firmly to the halfway point. Fold the left and right sides snugly over the egg roll, then continue rolling until the top corners seal the egg roll with the egg white. Repeat with remaining egg roll wrappers, covering finished egg rolls with plastic wrap to keep from drying out.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat about 6-inches of oil in a wok or deep-fryer to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry egg rolls 3 or 4 at a time until golden brown, 5 to 7 minutes. Drain on paper towels.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Wraps and Rolls",
            "Egg Roll Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mendy L"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.636752136752137,
            "ratingCount": 234,
            "itemReviewed": "Authentic Chinese Egg Rolls (from a Chinese person)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "169 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "46.2 mg",
            "fatContent": "7.4 g",
            "fiberContent": "2.7 g",
            "proteinContent": "9.9 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "315.3 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-17T21:05:19.077Z",
                "reviewBody": "I used this recipe as a base for creating a great tasting egg roll.  I omitted the following: bamboo shoots, pork, MSG.  I used 8oz. fresh white button mushrooms, chopped, in place of the wood ear mushrooms.  I threw some shredded, cooked chicken in half the egg rolls.  I didn't refrigerate the cabbage mixture until cold (didn't leave myself enough time for this step.)  I used an ice cream scoop to put a small pile on each egg roll wrapper and then wrapped and fried as directed.  These had a great flavor - my husband said they were better than he's had in a Chinese restaurant and our 2 1/2 year old son loved them too.  We could have eaten the whole batch (it made about 18 egg rolls,) but we showed some restraint and I froze the rest.  They re-heat great in the oven (still crisp!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mel & the boys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1960681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-18T03:23:21.527Z",
                "reviewBody": "Excellent recipe. It's a snap to make with these simple modifications.  In place of the cabbage and carrot chopping ordeal, I bought a bag of slaw that was already chopped and contained cabbage and carrot.  I also opted out the pork and replaced it with a 1lb bag of cooked and cleaned small shrimp, so I just added it. With everything at hand it only took the few short minutes to stir fry it all up and stick it in the frig. When I was ready to roll them up I was suprised at how quick and easy that was. While they were frying I made won ton soup to go with them  The recipe made 13 perfect egg rolls.  My family loved them And I will definately make them again. It was a quick and easy recipe., Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pinkpetunia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1667429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-16T01:57:07.65Z",
                "reviewBody": "I'd give these 10 stars if I could!  I had to make some changes based on what I had on hand (no time for a trip to the store!) and they were still excellent!  My changes: ground pork for matchstick cut BBQ pork, fresh bean sprouts for cabbage (about 3/4s were added and cooked, the other 1/4 were added at the last minute for more crunch).  I was making potstickers for this meal, too... they had cabbage and pork... and I needed to use the bean sprouts.  These were better than any I have ever purchased!  And I do have a jar of MSG, so added that, as well.  (My only editorial comment is that SOME people need to get over the \"authentic\" part because MSG is not 300 years old!  Family recipes are adapted over time and MSG is a good addition.  We should just be glad that the recipe was shared with us!!)  My husband loves potstickers but these are MUCH quicker and easier to make, so I fill him up with these and make potstickers as a side dish!  Thanks for sharing this great recipe!!  IT IS WONDERFUL!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sourdough girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/453904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-16T22:28:02.53Z",
                "reviewBody": "Wonderful!  I didn't really use oil, just cooking spray.  I omitted the MSG, and I actually \"fried\" the eggrolls in the cooking spray to brown, then put them in the oven at 425 for a few minutes.  They were crispy & yummy.  Didn't look as pretty as fried, but much healthier.  I also only used egg whites & used the Chinese Pork Tenderloin from this site for the pork & sweet & sour sauce from here as well, but they really didn't need the sauce.  A+ & very healthy with slight modifications.  Thank you for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JuleeP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2525402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-07T02:57:41.43Z",
                "reviewBody": "Awesome awesome awesome!! I used the \"Chinese Pork Tenderloin\" recipe also available on this website for the Chinese barbequed pork. I used a whole carrot and eliminated the mushrooms (not a big fan). I will never try another egg roll recipe. These were great! Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chefsazy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2255577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-13T11:31:52.46Z",
                "reviewBody": "These eggrolls are incredible! Because I don't eat pork I used about 1/2 lb. chopped shrimp. I had sliced roast beef from the deli in my fridge I sliced about 1/2 pound thin and put that in also along with 2 big garlic cloves. Lastly I also used about 1 tablespoon of sweet soy sauce. The cool thing was when I first laid it the pan to cool it was full of water from the cabbage. I said \"Oh I can drain that later\" 2 hours later when I wanted to roll them the water had be reabsorbed by the cabbage! Usually I drain that water and drain all the flavor along with it! Great idea! Thank you for your family recipe I will pass it along to my children as well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Noor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1416920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-01T12:34:36.75Z",
                "reviewBody": "These were great! The whole batch just disappeared. I made a few changes to use what was on hand at the time and found them to be more like the rolls that my favorite restaurant in Chicago made. I substituted bean sprouts for bamboo shoots shiitake mushrooms and used hoisin sauce on the pork as it cooked left out the MSG too. OMG!!! I may put the ole deepfryer to use more often now. Thanks a ton!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurie Pearsall",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2379752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-02T19:02:50.867Z",
                "reviewBody": "I love this recipe!!!  I could sit down and eat all of them by myself!  I especially like that this is an authentic recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cortnie7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2443863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-26T20:20:43.82Z",
                "reviewBody": "Fabulous recipe.  No improvements needed.  This is a keeper for the whole family and generations to come.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheSingingCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2299945/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T22:17:20.170Z",
                "reviewBody": "These were pretty good.  The filling was a little bland so before filling them I added a little bit of powdered ginger.  That helped a lot.  We fried half of them and baked half of them sprayed with PAM.  The fried ones were better and had the restaurant-style texture.  The baked ones were good too just a little too crispy.  However, since we are not big fans of frying food next time we will probably bake them all since they were still pretty good.  These freeze well too.  We did freeze some that were uncooked and baked them the other night.  I would recommend seperating them with parchment or wax paper before freezing otherwise they will stick together.  Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Singer6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mattsbelly/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Authentic Chinese Egg Rolls",
            "description": "See how to make shredded pork egg rolls from a 300 year-old family recipe.",
            "uploadDate": "2013-04-16T23:28:50.273Z",
            "duration": "PT5M15.148S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F30d78e27-b27c-4564-878a-d44d46156017%2Fdc62ae20-0d51-487b-86d3-11dc54ec1328%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2305967320001"
        }
    }
]