[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/62151/fruit-leather/",
        "name": "Fruit Leather",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F267660.jpg",
            "width": 2856,
            "height": 2142
        },
        "datePublished": "2020-06-19T03:10:00.000Z",
        "description": "Make your own fruit leather out of apples and pears, and enjoy it as a snack any time.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT5H20M",
        "recipeYield": "1 sheet",
        "recipeIngredient": [
            "1 cup sugar",
            "¼ cup lemon juice",
            "4 cups peeled, cored and chopped apple",
            "4 cups peeled, cored and chopped pears"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 150 degrees F (65 degrees C). Cover a baking sheet with a layer of plastic wrap or parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the container of a blender, combine the sugar, lemon juice, apple and pear. Cover and puree until smooth. Spread evenly on the prepared pan. Place the pan on the top rack of the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 5 to 6 hours, leaving the door to the oven partway open. Fruit is dry when the surface is no longer tacky and you can tear it like leather. Roll up on the plastic wrap and store in an airtight jar.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AURORAROSE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.421052631578948,
            "ratingCount": 38,
            "itemReviewed": "Fruit Leather",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "89.5 calories",
            "carbohydrateContent": "23.5 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "2 g",
            "proteinContent": "0.3 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "0.8 mg",
            "sugarContent": "19.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-10T23:56:30.637Z",
                "reviewBody": "Ok, I was a little unsure of this one, but it is awesome (which is good since there is a lot of cutting and peeling involved). \n\nI did learn a few things along the way, but I will certainly make it again and am excited to experiment with other fruits...I was happy this called for apples and pears as I had a bunch from my in-laws trees.\n\nFirst, I will admit that a blender DOES NOT work.  I don't have a food processor (which I think would be the best to use) so I used the fine grater on my KitchenAid after chopping up the apples and pears. The texture was probably courser therefore the finished product looks different from store bought fruit leather, but the taste is terrific.\n\nI had some very ripe pears so I actually only used 1/4 of the sugar and honestly only did that because I had measured out the whole amount, started to pour and had second thoughts...this could be made without the sugar and you wouldn't miss anything. \n\nOh, one more bit of advice.  I wasn't sure how thick the fruit should be spread out.  I spread it out as thin as I could without leaving holes and when it was finished drying there were areas that ended up looking lacy and turned a bit crispy.  This wasn't bad, but just not the idea that I had for what fruit leather should be.\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MamaMia72",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mamamia72/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-15T20:39:36.573Z",
                "reviewBody": "I make this all the time for my daycare kids.  In order it to work in a blender you must cook the apples first in about 1/4 cup of water until barley tender.  Then puree in blender as directed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "serindee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3107347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T17:54:09.41Z",
                "reviewBody": "Instead of sugar I added a few tbsp of strawberry jam! It was delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alyssa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2555733/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-02T23:01:59.587Z",
                "reviewBody": "At the risk of being repetetive, here is what I did, based on reviews: Cut the recipe in half, using only apples, blanched the apples before pureeing them, used 1/2 sugar called for, spread over parchment paper, 5 hrs at 170(as low as mine will go) w/ door propped open.  PERFECT! Can't wait to do again! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mattswife1123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3759626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-13T16:27:27.297Z",
                "reviewBody": "If you do not have a Vitamix...I HIGHLY suggest it as it is perfect for this, as well as many other recipes. I did not have to peel or core the apples, just remove the stem.  This way you have much less prep time and you get even more nutrition with all the skins, core, and seeds.  No you do not notice or taste any difference because they process well.  This recipe did make a very full blender of mixture.  I suggest possibly cutting it in half.  You could also use this mix as just applesauce as well.  Find the biggest cookie sheet you can fit on a single rack as using 2 racks doesn't work well.  It did take over 8 hours to get it to a peelable consistency.  Try to spread it as thin as possible without getting bare spots.  I think that should cut down on the dry time also.  I do believe the recipe meant to use waxed paper, not plastic.  Another tip, do not let the leather cool before removing from the paper or it will be very hard to peel.  I tore the leather into strips then rolled it up in plastic wrap to keep it from sticking to itself and to keep it fresh and from drying out.  The flavor was wonderful!  I did use organic Blue Agave in place of sugar.  It's a gluten free, low glycemic organic sweetener I found at Costco.  I gave it 4 stars due to the trial and error with the paper and the correct pour thickness but with practice, you'll have it down in no time! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DeeDee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4029278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-18T19:25:04.823Z",
                "reviewBody": "Love this! I made some adjustment like most of the reviewers on here did. I cut the recipe in half and instead of apples and pears we did apples and strawberries. I didn't really cut the lemon juice in half though guess I like it a little more tart. Tip instead of boiling the fruit to soften steam it. I think it's easier that way and it still retains all the vitamins. I also used a food processer and it worked awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs. Ching",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3674353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-05T21:44:01.23Z",
                "reviewBody": "I made this for my diabetic mom and adapted this recipe for my NuWave oven. I pulverized the fruit in the Cuisinart with 1/8 cup of lemon juice 1/4 cup of Splenda 1/4 cup of raw honey and a couple tbls of soy protein powder. Mix it really well then cook it for 4-5 hours at about 160. No added sugar and packed with protein!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bkenn2001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5319366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-25T18:58:09.923Z",
                "reviewBody": "Okay this was fun in terms of trying something completely new. It also reminds me of my mom as she used to dry fruits and make fruit leather when I was little. However I experienced a few difficulties with this recipe. I don't have a blender but I'm inclined to agree that a blender isn't going to puree apples and pears adequately. Before my blender broke I couldn't even make hummus well bc it didn't puree. I used the food processor and it pureed in a minute. I just couldn't put plastic wrap in the oven so I used parchment paper instead which worked just as well. I really wasn't sure how thick to put the puree on the pan and ended up with about 1/2 inch thickness. My oven also does not go to 150 degrees--only to 170 which is what I had it on for hours. Even at 7-8 hours the fruit was just as applesauce-y as when I started. So I turned the oven to 200 degrees and left it on overnight. Woke up this morning and voila! Fruit leather! I only used half the sugar and it's plenty sweet and tastes good. It does however take a very long time. Next time I'll use my dehydrator for this instead as I don't like having the oven on so long. Still it's a fun recipe and with adjustments it would be great. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-09T00:04:54.66Z",
                "reviewBody": "Delicous and healthy recipe! I was so excited when i found this because my nutritionist put me on a strict diet where i cant have cake or chocolate. I was craving somthin sweer so i made this",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hobo on your street",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3859065/"
                }
            }
        ]
    }
]