[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
                    "name": "Custard and Cream Pies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/64596/cantaloupe-cream-pie-ii/",
        "name": "Cantaloupe Cream Pie II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F40003.jpg",
            "width": 2032,
            "height": 1524
        },
        "datePublished": "2020-06-19T03:10:16.000Z",
        "description": "This is my version of a not-often heard of recipe, but it is one of the best pies I have ever eaten. The crust melts in your mouth and the pie is scrumptious. Wonderful for a summertime dessert.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup all-purpose flour",
            "3 tablespoons confectioners' sugar",
            "8 tablespoons margarine",
            "4 cups cantaloupe - peeled, seeded and pureed",
            "1 cup sugar",
            "⅓ cup all-purpose flour",
            "⅓ cup cornstarch",
            "¼ teaspoon salt",
            "3 egg yolks",
            "3 tablespoons water",
            "1 tablespoon margarine",
            "1 (8 ounce) package Neufchatel (light cream) cheese, at room temperature",
            "½ cup sugar",
            "1 tablespoon milk",
            "½ teaspoon vanilla extract",
            "1 (8 ounce) container frozen whipped topping, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place flour and powdered sugar in  large bowl. Cut in margarine until mixture resembles coarse crumbs. Press dough into the bottom and up the sides of a 9 inch deep dish pie plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake crust in the preheated oven for 20 minutes. Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the cantaloupe in a medium saucepan over medium heat. In a 2 or 4 cup measuring cup, whisk together sugar, flour, cornstarch, and salt, and then stir into the cantaloupe.  Cook and stir until mixture comes to a low boil and begins to thicken. Beat egg yolks and water together in a small bowl. Gradually stir in small amounts of cantaloupe mixture to prevent yolks from curdling. Pour yolk mixture back into pan and continue cooking for 2 minutes more. Remove from heat and set aside to cool. Once cooled slightly, pour into pre-baked, cooled pie shell.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, cream together the Neufchatel cheese and sugar. Beat in milk and vanilla until smooth, then fold in thawed frozen whipped topping until well blended. Spread evenly over cantaloupe layer. Cover and refrigerate at least 2 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Custard and Cream Pies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "STARFLOWER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2,
            "ratingCount": 25,
            "itemReviewed": "Cantaloupe Cream Pie II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "572.1 calories",
            "carbohydrateContent": "75.4 g",
            "cholesterolContent": "99.9 mg",
            "fatContent": "27.9 g",
            "fiberContent": "1.3 g",
            "proteinContent": "7.2 g",
            "saturatedFatContent": "13 g",
            "servingSize": null,
            "sodiumContent": "348.3 mg",
            "sugarContent": "53.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-29T01:33:10.6Z",
                "reviewBody": "I took a chance and made a triple batch (in a cookie sheet and made bars)of this for a Fourth of July party where there were a gathering of \"Foodies\". Everyone RAVED about its taste. They had no idea you could make cantaloupe into a pie. I followed the recipe exactly with these exceptions; I also used salted butter. In the instructions it forgets to say when to add the margarine so I added it along with the eggs. I would have used real whipped cream but the party was outside and was afraid it wouldn't hold up under the heat. I did decrease the amount of cool whip so I could taste the cream cheese a little stronger. I tasted the pie after 2 hours of chilling and then again in the morning. Even better in the morning! Very important that you use ripe tasty cantaloupe! Taste is mild and very refreshing! I'm serving this for a catered luncheon next week! Will make this again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawn Aiono",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1329873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-05T03:12:52.827Z",
                "reviewBody": "served this for July 4th and everyone raved! This pie has such a unique flavor just incredible. Bought melon 5 days prior and kept at room temp. was very ripe sweet and juicy. sqeezed some of the juice out and reserved. Pureed then measured added back what was needed for 3cups. Used a wisk to cook and no lumps. Cannot imagine making this with margarine. used real butter(is there any other way w/baking such a special dessert pie?) Recipe didn't state when to add the butter in the filling; added it once I got the flour starch sugar wisked into the puree. didn't bother to temper the yolks just whisked constantly and poured a small steady stream; worked fine. Added 1/2 tsp. orange blossom water to filling.this enhanced the cantaloupe flavor without overpowering and added a nice aspect. Cooked filling is the color of butterscotch and set up perfectly. The crust is fool-proof.looks dry when mixing but even with overworking and patting into the pan it was tender made for a slighly sweet crust similar to a shortbread if made with butter! What everyone loved about this was that it was not sickening sweet. Each component of the pie was perfectly sweetened without being over the top sweet. I cannot wait to make this pie again. The whipped topping makes enough that you can pile it high. Beautiful presentation.Thx for this wonderful recipe that I will be making for years to come. Had multi-cultural guests and they all agreed that this was just incredible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-11T02:36:52.97Z",
                "reviewBody": "No one in my family liked this pie...and we all love cantaloupe (and dessert too!). I thought the crust was very bland the filling too sweet and the topping just too heavy for this pie. I made the recipe as directed no changes on my part.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Wyattdogster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wyattdogster/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-12T10:31:38.797Z",
                "reviewBody": "I give this one a 5 for taste but a 4 for direction. The filling was a bit too sweet to me but no one else seemed to mind. My melon was also rather bland to begin with so I would cut the sugar back next time especially if using a sweet well-ripened melon. The cantaloupe taste came through well and the cream cheese topping complemented it quite nicely. I will admit to sneaking in a few drops of food coloring to compensate for my mediocre melon. It may have been my inexperience with cream pies but the instructions didn't seem clear in a few places. They don't specify the type of sugar to use and for the topping confectioners was the only kind that made sense to me so that is what I used. You will want to make sure the pie has set almost all the way before you try spreading on the topping or you will make a mess. Also I mixed the topping about 15-20min too early and in the time it sat it managed to go from perfectly spreadable to a thick mass. I would definitely mix it up right when you intend to spread it on the pie instead of getting it done early. Other than minor construction mistakes I thought this was a really nice pie. It was very light and refreshing not to mention unique! I will be making this again tweaking only lightly and I will wait until I have a good sweet melon. Oh and my melon made about 4 1/2 cups of puree.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GottaFeedYa!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2142034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-06T16:58:13.47Z",
                "reviewBody": "A few people liked the pie but for the most part people thought it was too sweet. The consistency wasn't that great but it was edible. I wouldn't recommend it unless you know people love cantaloupe. The only one person whom raved about this pie was a pregnant woman.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Megan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2471280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-01T16:29:21.067Z",
                "reviewBody": "Very nice pie. My husband and I aren't real fans of a cream pie but we had to use up several small bland melons from our garden on the verge of going bad.. We both enjoyed a small slice and I brought it to a church function where people finished it none the wiser as to the unusual ingredient. It was commented by one that the topping is a bit heavy and since there is a generous amount anyway perhaps one could halve the cream cheese? No offensive or overtly \"cantaloupe\" flavor. To me it's the kind of thing that's quite delicious in a small dose but not great the second time around. Especially good for gatherings and it served my purpose well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Lawrence",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2437820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-25T22:07:32.097Z",
                "reviewBody": "This recipe was great. It is one of my favorites. I have made it for Thanksgiving on request from family and I have passed this one on to both my sisters FABULOUS RECIPE THANKS",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2404170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-25T19:50:39.72Z",
                "reviewBody": "Wow what a hit this was! I replaced the Cantaloupe with Golden Sweet melons I had grown in my garden. When I first said what it was no one was very enthused but everyone was surprised by how good it was. This recipe is a real winner. To avoid trans fats I used real butter instead of margarine. I will certainly make this again. I want to try it with other types of melon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DannyDaemonic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dannydaemonic/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-08T20:17:59.11Z",
                "reviewBody": "This is a very light pie- it is a great summertime treat. I made no modifications with the exception of using fat free whipped topping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chrisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1559107/"
                }
            }
        ]
    }
]