[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/350/bread/quick-bread/muffins/",
                    "name": "Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69664/delicious-pineapple-muffins/",
        "name": "Delicious Pineapple Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F848317.jpg",
            "width": 2288,
            "height": 1520
        },
        "datePublished": "2020-06-19T03:10:37.000Z",
        "description": "A moist muffin with a brown sugar and cinnamon topping.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "16 muffins",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "½ cup white sugar",
            "1 tablespoon baking powder",
            "½ teaspoon salt",
            "1 (8 ounce) can crushed pineapple",
            "1 egg, beaten",
            "¾ cup milk",
            "¼ cup butter, melted",
            "¼ cup butter, melted",
            "¼ teaspoon ground cinnamon",
            "⅓ cup packed brown sugar",
            "½ cup all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Grease and flour muffin pans, or line with paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together 2 cups flour, white sugar, baking powder and salt. Drain pineapple, reserving 1/4 cup juice. Make a well in the center of the dry ingredients, and pour in the reserved juice, egg, milk, and 1/4 cup melted butter. Mix just until blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl, stir together the cinnamon, brown sugar, 1/2 cup flour, and 1/4 cup melted butter to make the topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon batter into muffin cups, then spoon crushed pineapple over the batter and sprinkle with the cinnamon topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 minutes in the preheated oven, until a toothpick inserted in the crown of the muffin comes out clean.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ACPHIFER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9239130434782608,
            "ratingCount": 184,
            "itemReviewed": "Delicious Pineapple Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "182.6 calories",
            "carbohydrateContent": "28.6 g",
            "cholesterolContent": "27.8 mg",
            "fatContent": "6.5 g",
            "fiberContent": "0.7 g",
            "proteinContent": "2.9 g",
            "saturatedFatContent": "3.9 g",
            "servingSize": null,
            "sodiumContent": "187.4 mg",
            "sugarContent": "13.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-07T15:41:31.827Z",
                "reviewBody": "I love the concept of this muffin!  In fact, I assumed the pineapple was in the batter until I read the reviews.  Making this even better, I had fresh ripe, sweet pineapple.  I put it in my food processor and then squeezed it out using 2 coffee filters and that worked better than the collander.  I used 1 packed cup of pineapple.  I added to the batter:  1 tsp. vanilla, 1/2 tsp. rum extract, and 1/2 tsp. nutmeg.  This made 6 Texas-size muffins baked at 37 minutes.  *careful though, these really poof up, so next time I will use less batter and make 7 giant size muffins.  This would also be great with a few marichino cherries chopped with the pineapple, almost like an upside downcake concept.  The streusel topping is great.  I didn't have enough butter for both topping and batter, so used oil in the batter.  They were not dry at all.  They look oh so gourmet.  I also didn't melt the margarine for the streusel, just cut it in with a pastry blender. These really have a bakery look.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-16T08:30:57.757Z",
                "reviewBody": "I made this a little healthier by using whole wheat white flour and organic ingredients. I did not bother saving the pinapple to spoon over the top, I folded the pineapple in the muffin batter with the rest of the wet ingredients. This recipe turned out a very pretty muffin that was quite moist, though a little on the sweet side for us. The crumb topping was quite good with the pineapple flavor, we just didn't care for the combination of cinnamon and pineapple. That's not the recipe's issue, it's our own personal taste. I'd like to play with this recipe a bit and see if I can't cut back on the sugar, add a little more pineapple and maybe make this a little healthier as we all really liked pineapple in a muffin. It was quite tasty! EDITED: I have made this three times now without the cinnamon the last two times and we really love these muffins. The flavor is almost like an upside down pineapple cake only without all the work!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-02T14:48:42.127Z",
                "reviewBody": "I loved these muffins and my husband hasn't stopped raving about them! They tasted like the came from a bakery. Mine turned out having almost the texture and taste of a cupcake. I didn't change much but after reading the other reviews, I sliced about 2 Tbsp pineapple chunks which I added to the batter and didn't melt the butter for the topping but used room temp instead. Thanks!   **Update - I made these again and without thinking, I melted the butter for the topping like the instructions say. The tops of the muffins came out hard and crunchy but when I used room temp butter the next time, the tops were soft and came out just perfect. So it's the melted butter that makes the difference.**",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2201040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T20:46:36.14Z",
                "reviewBody": "Yes! Finally, a real, no nonsense muffin and not a heavy, sweet cake posing as one! Given some of the reviews that led me to think these muffins might be mediocre, I was unsure of what I'd end up with but I needn't have worried - I was pleased. Also given that some reviewers had a problem with these being dry and/or sticking to the muffin liners, I added a tablespoon of vegetable oil to the batter which apparently took care of the problem because the liners peeled off easily to reveal a light and fluffy muffin that was moist, pleasantly sweet and delicately pineapple flavored. I did add the pineapple to the batter as I didn't like the idea of plopping it on the top, preferring the pineapple flavor to be in the muffin itself.  The topping is a little different, crunchy but not hard. Next time, however, I think I'll skip melting the butter.  A really delightful muffin and quite refreshing for \"I'm Sick of Winter\" malaise.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-25T01:27:40.923Z",
                "reviewBody": "I followed Tunisianwife's suggestion and added pineapple to the batter along with nutmeg and vanilla.  I also did not melt the butter for the topping but used room temperature butter.  Baked the large muffins for 37 minutes, regular size for 30 minutes and they were all gone in minutes.  Delicious! I am so glad that I added the extra pineapple to the batter as it was a light, sweet flavor.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/467578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-15T18:04:14.877Z",
                "reviewBody": "For me they were just okay taste-wise, but I gave them 4 stars because I think if I would have just listened to some other reviews and mixed the fruit right into the batter they would have been very good.  The texture was wonderful but the batter was bland.  DEFINITELY mix the fruit into the batter !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Hayly Amber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2309250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-31T15:38:57.547Z",
                "reviewBody": "These muffins were pretty good, though I did make several changes. I stirred the pineapple into the batter, doubled the amount of juice, and also used room temp butter for the topping, not melted. They came out quite moist with a nice pineapple flavor. My only problem was with them sticking badly to the paper liners.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cat Berner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1177741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-08T19:32:33.953Z",
                "reviewBody": "Something went very wrong with this recipe. I thought the topping was tasty but the body of the muffin was very bland and almost chewy in texture. I thought the amount of baking soda was a bit excessive. A TABLEspoon? Really? Also it didn't seem to cook evenly. The edges were overdone and stuck to the muffin cups big time. A real disappointment! Maybe this recipe could be salvaged by adding applesauce crushed pineapple more butter/oil and/or turning the temperature down to 350. (?):-(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kari",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kari/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-20T02:20:33.267Z",
                "reviewBody": "I made them last week on a whim, didn't drain the crushed pineapple just opened the can right into the batter and mixed it in. There was pineapple right through every single muffin, I also like other reviewers didn't melt my butter for the topping. Absolutely delightful muffin recipe thanks. \n\nI've also used this recipe with canned apricot, peach, pear and apples (added cinnamon to the batter) each one is just as good as the other.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly Heaslip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10332271/"
                }
            }
        ]
    }
]