[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69832/knedliky-czech-dumpling-with-sauerkraut-zeli/",
        "name": "Knedliky - Czech Dumpling with Sauerkraut (Zeli)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F420718.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:10:38.000Z",
        "description": "This was my grandmothers recipe and it has remained a family favorite... It should be served with roast pork, sauerkraut and a nice glass of beer. A very traditional way to eat the leftover dumplings the next day for breakfast or brunch is to chop them up into cubes, pan fry in a little butter; then add eggs and milk, and cook as if you are making scrambled eggs. It's great.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon salt",
            "½ teaspoon sugar",
            "3 eggs, beaten",
            "1 ½ cups milk, or as needed",
            "4 cups dry white bread cubes",
            "4 slices bacon, sliced into small strips",
            "1 (16 ounce) jar sauerkraut - rinsed and drained",
            "salt and pepper to taste",
            "1 teaspoon caraway seeds",
            "2 teaspoons cold water",
            "1 teaspoon cornstarch"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, baking soda, baking powder, salt and sugar. Make a well in the center, and pour in the eggs and 1 cup of milk. Stir to blend, and add enough additional milk to make a moist battery dough, not like pancake batter. Use a sturdy wooden spoon to beat the dough at least 200 strokes, rolling it over and over in the bowl until smooth and an occasional bubble appears on the surface. Add the dry white bread cubes, and stir into the dough until they disappear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil. Place the dough onto a cheesecloth or white cotton cloth, and form into a loaf shape. Wrap the cloth around the loaf, and tie the ends.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the loaf into the boiling water, and cook for 45 minutes, turning the loaf over about half way through. Remove from the water, unwrap, and cover with a tea towel. Let stand for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry bacon in a small skillet over medium-high heat until evenly browned. Set aside. Place the drained sauerkraut into a saucepan, and add enough water to cover the surface. Bring to a simmer over medium heat. Add bacon, and season with salt, pepper and caraway seeds. Stir together the cornstarch and water; mix into the sauerkraut, and simmer for a few minutes before removing from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice the dumpling loaf.  Drizzle dumpling slices with some of the roast drippings from the pan. Serve with sauerkraut.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "none"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.378378378378378,
            "ratingCount": 37,
            "itemReviewed": "Knedliky - Czech Dumpling with Sauerkraut (Zeli)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "345.1 calories",
            "carbohydrateContent": "50.2 g",
            "cholesterolContent": "82.9 mg",
            "fatContent": "10.2 g",
            "fiberContent": "3.3 g",
            "proteinContent": "12.2 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "1004.5 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-17T18:36:54.2Z",
                "reviewBody": "Where is the salted water?  Skip the baking soda, add another tsp or 2 of baking powder.  No need to keep kneading it..just mix it all together until soft/doughy but still holding it's shape.  I roll my smaller (hand sized) football shaped knedlick in a little flour just barely and then throw into boiling SALTED water..I don't cover it, just let it cook for 25 minutes poking with a fork and rolling about 3-4 times while cooking.  Remove and slice with knedlicky cutter from czech, or let cool and cut with bread knife into bread width pieces.  Don't complicate simple recipe...mix-boil and be done!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Eurocook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1807353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-11T22:46:55.61Z",
                "reviewBody": "Well I'm Czech too but never heard of wrapping the dough in a cloth! Basically same ingredients but fold in the bread cubes form into small loaves flouring your hands. Let sit for a few minutes until water boils. Gently lower into water put cover on pot but leave it slightly askew to vent and gently simmer for 20 minutes. Remove slice. Sauerkraut: rinse can of sauerkraut; put into saucepan and add enough water to almost cover sauerkraut. Cook for 20 minutes or so. In small skillet brown butter add flour to make a roux and add that to the saucepan with the sauerkraut. That should do it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOXGLOVE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1325334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-09T15:44:41.033Z",
                "reviewBody": "I can finally make my grandmother's dumplings! I followed another reviewer's advice and left out the baking soda. I also only used 2 eggs. My grandmother always shaped her dumplings using her wet hands so that's what I did and it worked out perfectly. As for the sauerkraut I did my grandmother's. She always made hers with caraway seeds chopped onions and brown sugar so that's what I did. Made a pork roast in the slow cooker with the zeli and I had a childhood dinner I begged for! I don't have a dumpling slicer (but my grandmother is giving me hers) so I used thread to slice them. The leftover dumplings were cubed and I made another childhood favourite....egg dumplings. They were perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KarenTheMiltch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/601393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-05T04:56:28.9Z",
                "reviewBody": "This is a wonderful recipe I am 100% Czechoslovakian and it was only once a year on my birthday that I would get pork roast and dumplings for my b-day dinner. My mom would never take the time to give me the recipe. Once I found this recipe I was in HEAVEN. In my opinion I have perfected this recipe and I can make my dumplings in less than one hour. As far as this recipe goes I use everything up to the breadcrumbs. As for the milk I keep that to a minimum as well as the breadcrumbs. I do stir all of the ingredients as directed however; I use judgment with the milk as to not make it too moist of a batter. The breadcrumbs are added last. I have found that too many breadcrumbs create air pockets for water to enter when boiling. Once my dough is mixed I will use \"Wondra Gravy Flour\" to roll them to their desired shape. Almost as though you would flour a cutting board for bread dough. (I just use the Wondra flour.) The dough yields enough to make two good size rolls about what a muffin size would be. I then boil my water to a strong rolling boil. Drop in my dumplings and then boil for approximately 20 min. constantly rolling and turning.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michele Mertz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3656120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-11T20:44:02.36Z",
                "reviewBody": "What a treat to find this recipe! Both of my grandmothers and my own mother passed away before I became interested in cooking and I have always regretted not learning this traditional meal. Thank you Sonya for the detailed instructions (it brought back so many memories). Unfortunately my dumplings were not quite as light and fluffy as Babicka's (grandmother's) but this does take some practice. I'm sure it had nothing to do with the recipe and instructions. I may have over-kneaded and possibly cooked them just a little too long but they were still very delicious. I would like to add one valuable tip I found on another site (however the instructions and ingredients on that site left alot to be desired)...rather than cutting with a knife which can compress the dumplings use a long piece of dental floss to cut them into slices for serving. It leaves them virtually in their true form and allows the steam to escape so that they don't turn out too hard. This is the only advice I can offer. Sonya dekuji mockrat (many thanks) for this recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CzeckCzick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1914726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T23:08:12.84Z",
                "reviewBody": "Please be sure that the bread cubes have been dried out. They should be hard. Sauteed onions should also be added to the sauerkraut.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "none",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1027759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-22T21:27:51.2Z",
                "reviewBody": "This is almost exactly like my grandmother used to make it with the exception that she dropped individual \"blobs\" of dumpling dough into the water. This is how my family continues to make it. Then we serve it with pork roast and sauerkraut.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kevin Harper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1569241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-15T13:51:04.1Z",
                "reviewBody": "I have been trying to replicate my grandmother's knedlicky recipe for a while now- the cheesecloth is a great suggestion! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3059019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-08T23:14:53.213Z",
                "reviewBody": "This was the best knedlik i have ever made (so far I was consistently failing at it to the point of giving up). I had Czech hruba and polohruba flours at home so I have used these. i only had 2 cups of hruba so used 2 of that and 1 cup of polohruba. I did not have any baking powder at home so i have used an extra tsp of baking soda instead and this worked fine. I have only used 2 eggs which was enough. I have used less bread (only one bread slice cubed (toasted it on the lightest setting and left if air dry for a while whilst cooking other things and kneading the dough). I did not bother beating the eggs beforehand just popped them in. I used smaller amount of milk first about a cup then got stuck in with my hands did not bother with a spoon. I added a little more milk as i worked it just enough for it not to be too dry but not too much so that it holds firm shape. I followed the advices of 200 strokes but instead knead it 200x times by hand until the dough was elastic (sprung back when depressed) and did not stick to my hands anymore. Then I wored the bread cubes in and decided to divide the dough into 2 knedliky which was a good decision as it fit in the pot better. Bear in mind the knedlik will rise as it cooks to 1.5-2 times its raw size. I did not bother cooking it in a cloth just popped them in salty boiling water. I took them out after 20 mintutes cutting them in half with a thread and found the center still raw so popped them in for another 10 minutes",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "torquoise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4545559/"
                }
            }
        ]
    }
]