[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
                    "name": "Custards and Puddings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1559/desserts/custards-and-puddings/chocolate-pudding/",
                    "name": "Chocolate Pudding Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69960/hasty-chocolate-pudding/",
        "name": "Hasty Chocolate Pudding",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3189932.jpg",
            "width": 2688,
            "height": 1520
        },
        "datePublished": "2020-06-19T03:10:39.000Z",
        "description": "This pudding whips up in no time in your microwave... great for when you're craving a quick chocolate fix!  Stir in some chopped bananas before chilling for a nutrition boost.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ cup white sugar",
            "⅓ cup unsweetened cocoa powder",
            "3 tablespoons cornstarch",
            "2 cups milk",
            "2 teaspoons vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a microwave-safe bowl, whisk together the sugar, cocoa and cornstarch. Whisk in milk a little at a time so the mixture does not have any dry lumps.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place in the microwave, and cook for 3 minutes on high. Stir, then cook at 1 minute intervals, stirring between cooking times for 2 to 4 minutes, or until shiny and thick. Stir in vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a piece of plastic wrap directly on the surface of the pudding to prevent a skin from forming, and chill in the refrigerator. Serve cold.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Custards and Puddings",
            "Chocolate Pudding Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Debra"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.529058116232465,
            "ratingCount": 998,
            "itemReviewed": "Hasty Chocolate Pudding",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "203.3 calories",
            "carbohydrateContent": "40.3 g",
            "cholesterolContent": "9.8 mg",
            "fatContent": "3.4 g",
            "fiberContent": "2.4 g",
            "proteinContent": "5.4 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "52.3 mg",
            "sugarContent": "31.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-25T02:35:49.56Z",
                "reviewBody": "We have made a correction to this recipe. It should be 3 tablespoons cornstarch, not 3 teaspoons.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the allrecipes staff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-01T22:03:07.06Z",
                "reviewBody": "Much better than boxed pudding mix and almost as fast. The flavor is wonderful. If you don't have cornstarch on hand, I use an equal amount of flour, either all purpose or whole wheat, with great results. I've also substituted 2 teaspoons of bourbon instead of the vanilla extract for a great kick in flavor. For a lighter, more chocolate mousse type dessert, simple wait until the pudding cools for a few hours in the refrigerator and then gently fold in a carton or thawed cool whip. This was as good or better than the chocolate mousse I've had in nice restaurants!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GinaR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1581927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-17T21:24:28.17Z",
                "reviewBody": "I came across this recipe looking for a quick chocolate dessert (mostly to satisfy my chocolate craving after dinner one night!!!)  This was a pretty good recipe all in all, it was a snap to make.  The texture is so much better if you add a tablespoon or 2 of butter right when it comes out of the microwave.  I have also omitted the cocoa powder and made vanilla pudding out of it, which is pretty good also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ali",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1274392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-21T03:00:31.87Z",
                "reviewBody": "...Ummmm... You might want to pay attention to that part that says \"Stir, then cook at 1 minute intervals, stirring between cooking times for 2 to 4 minutes, or until shiny and thick.\" Mine was thick and shiny, and looked great, but for some strange reason, after 2 one-minute intervals, I just HAD to chance it, and put it in another minute! Not a great idea. It bubbled over the bowl and into the microwave. Oops! Totally my fault! The recipe is AWESOME! Like others, I added a pinch of salt with the dry ingredients and a bit of butter with the vanilla. I'm sure I will be making this one many, many more times!\r\n\r\nUPDATE: So... I've made this recipe again and again... with a larger bowl and a more watchful eye... LOL\r\nThis last time, after the pudding cooked, I spooned a little into dessert bowls, then put a marshmallow into each. Then I topped with more hot pudding. The marshmallow got all gooey & yummy. HUGE hit! Kids loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~S~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2855022/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-06T18:03:07.96Z",
                "reviewBody": "I will never make chocolate pudding from a box again. This is AMAZING and SO EASY!! Followed recipe exactly. Easy to customize for single servings (to keep yourself from eating 4 in one sitting!!). And by the way, this is so yummy warm, you'll have to exercise serious self-restraint to allow it to cool. \nIDEAS: cinnamon and cayenne for Mexi-pudding; cardamom and pistachios for Indian-pudding; peppermint extract (half as much as vanilla - it's stronger) and crushed peppermint for a Christmas pudding; Kahlua instead of vanilla for a grown-up pudding; a tsp peanut butter (after cooking) and crushed peanuts; or even orange zest (after cooking). The possibilities are dazzling. \nNote: DO keep an eye on this as it cooks as it WILL BOIL OVER if you walk away. It's practically inevitable. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mirby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2167139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-05T03:15:30.277Z",
                "reviewBody": "I just made this on the stove instead of the microwave.  It turned out fantastic!  Rich and creamy.  \n\nStove directions.  Mix all dry ingredients in the pan.  Turn to medium heat (not more than that).  Slowly pour in milk while stirring.  Stir constantly until mix begins to boil.  When the first bubbles break the surface, stir one minute more.  Turn off heat.  Cool for 5 mins, stirring twice.  I serve mine hot, but you may cover it with plastic wrap and chill for several hours and serve cold.\n\nThank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gwendolyn028",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2848643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-05T16:32:33.84Z",
                "reviewBody": "I am in my 60's.  My Mom used to make this sort of pudding for us all the time . Brings back memories of warm, happy kitchens and families all eating together around the table at every meal. No need to buy pudding mixes with all their artificial ingredients.  By using brown sugar instead of white and by deleting the cocoa, you get butterscotch pudding.  By the same token, if you scorch white sugar, you get caramel pudding.  Personnally, I used to love the skin on top of the puddings.  Mom would pour the hot puddings into desert bowls to cool, and each of us got our own serving of skin covered pudding.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Riches",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1213296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-05T05:35:39.81Z",
                "reviewBody": "I used fat free milk and Sugar Blend Splenda and it still turned out very rich and delicious -- what a wonderfully easy chocolate fix!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carla Semola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2012970/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-23T02:04:16.263Z",
                "reviewBody": "Typo alert! With 3 TABLESPOONS of cornstarch instead of teaspoons, this recipe is excellent.  It works with rice milk, soy milk, coconut milk, whatever.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DessertFreak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1330301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-14T21:36:21.403Z",
                "reviewBody": "I was disappointed with this recipe after all of the five-star reviews, and I'm a big chocolate lover who was having a craving. I was drawn to this recipe by the \"quick and easy\" comments and by the fact that I had all the ingredients in my cupboard. I followed the directions carefully, yet I was putting the pudding back in the microwave after stirring for more than thirty minutes because it just would not thicken. I expected \"shiny and thick\" to mean a texture like that of your typical pudding, yet it never seemed to get that thick -- it was basically like cake batter. So, finally I decided that it needed to be cooled in the fridge to thicken (but so many others said they liked it warm?!). I got tired of standing by the microwave and stirring and stirring and stirring. Finally, I just stuck it in the fridge while it was still cake batter texture. It has been cooling for about twenty minutes now, and it is a little bit thicker, but it certainly doesn't have the texture of your typical pudding, and I would definitely not call it \"quick.\" The flavor is delicious, but what a hassle!! Maybe after an hour of refrigeration this will be like a pudding. . .",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3561137/"
                }
            }
        ]
    }
]