[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/70329/hamantashen/",
        "name": "Hamantashen",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5180093.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2020-06-19T03:10:41.000Z",
        "description": "These are the easiest hamantashen I've ever made! They are a bit sweet, roll out easily and are consumed quickly! My kids don't want to give them to their friends! Traditional fillings are prune and poppy seed. You can use any canned pie filling, whole fruit jelly, chocolate chips, or any type filling your family likes! Be creative with these- we put mini chocolate chips in the dough!",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "36 cookies",
        "recipeIngredient": [
            "1 ½ cups butter or margarine, softened",
            "1 cup white sugar",
            "2 eggs",
            "6 tablespoons orange juice",
            "1 tablespoon vanilla extract",
            "2 teaspoons baking powder",
            "4 ½ cups all-purpose flour",
            "1 (12 ounce) can poppyseed filling"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the orange juice and vanilla. Mix in the baking powder, then gradually stir in the flour until the dough forms a ball. Cover and refrigerate at least 2 hours. I like to do mine overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into 3 inch circles using a cookie cutter or drinking glass. Place circles on the prepared cookie sheets. Spoon 1 teaspoon of filling onto the center of each circle. (Any more and it will ooze out) Pinch the sides of each circle to form a triangle, covering as much of the filling as possible. The cookies may be frozen on the cookie sheets if desired to help retain their shape while cooking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven, until light golden brown. These are best undercooked slightly. Cool on the baking sheet for a few minutes before removing to wire racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SANDI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.405797101449275,
            "ratingCount": 69,
            "itemReviewed": "Hamantashen",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "183.9 calories",
            "carbohydrateContent": "23.4 g",
            "cholesterolContent": "30.7 mg",
            "fatContent": "8.9 g",
            "fiberContent": "0.4 g",
            "proteinContent": "2.5 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "85.7 mg",
            "sugarContent": "5.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-16T16:14:33.393Z",
                "reviewBody": "The reason these don't taste like a traditional Jewish bakery is the butter: a Kosher baker would use oil so that the hamentashen will be pareve.  \n\nI've made these and the oil recipes; both taste great to me.  However, for those of you needing a non-dairy hamentashen, go with the other hamentashen recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ILLYSA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1300960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-24T16:31:34.027Z",
                "reviewBody": "While the cookie dough is indeed delicious, this is not like the bakery hamantashen here in the Northeast. It is basically a butter cookie with jam filling.  I used only 3/4 cup sugar in the recipe and it was still too sweet.  I also left out some of the butter and it was still too buttery!!  I will alter this recipe or find another one to fit my tastes better.  If you're used to a classic New York style hamantashen from a Jewish bakery, try a different recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "TRANSFORMER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/806897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-11T03:42:56.39Z",
                "reviewBody": "I made the dough the night before. My 10 year old rolled out the dough used a glass to cut circles filled with filling and pinched into triangles. It is important to put them in the freezer for at least 5 minutes before cooking them. The ones with cherry filling in my first batch came apart because I did not freeze them first. It was easy to eat them all at once!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEANNANB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/227430/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T16:09:19.43Z",
                "reviewBody": "Oil is not the only thing you can use in place of butter or margarine to make the Hamantashen pareve (non-dairy). I bake numerous pareve desserts weekly ranging from cakes to cookies to bars & I always use Nucoa margarine in place of traditional dairy butter or margarine. There are other brands of pareve margarine out there; I have found the Nucoa brand to be the best for baking. Everyone that eats my baked pareve items cannot believe that there is no dairy in them. I suggest that anyone who wants to make this recipe non-dairy try the Nucoa brand margarine you won't be disappointed. I did add some fruit fillings & baked the Hamantashen in my convection oven at 350 degrees for 10 minutes (rotating the cookie sheets at 5 minutes) & they turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Loves 2 Cook!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2195928/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-17T03:01:15.687Z",
                "reviewBody": "This recipe resulted in the best hamentashen that I have ever eaten. They are better than any bakery's. I highly recommend this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SG001E",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1249913/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-27T04:08:07.48Z",
                "reviewBody": "Delicious!! The dough was a great pale yellow color and so tasty. I used raspberry jam prune filling and blackberry jam. The pastries are still moist 3 days later. Everyone loved them. Next time I would reduce the sugar a bit though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANASTASIAJANE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-25T15:10:25.653Z",
                "reviewBody": "GREAT RECIPE! More time was required for cooking (about 12 minutes total) as I took the prepared hamentashen out of the freezer only long enough for the oven to preheat. I would be interested to know how long the original submitter leaves them out of the freezer before cooking them. I also think I will cut them a bit bigger next time just so I can fit more filling inside. I used cherry pie filling (our favorite) and they came out terrific. Highly recommended!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOMANDKARA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1301128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T16:15:53.173Z",
                "reviewBody": "   If you are looking for a recipe that make a decent pastry, then I think you may enjoy this version of hamantashen.  However...I was expecting this to taste like the authentic hamantashen that I am used to, and was pretty dissappointed.  I noticed where another person had suggesting using oil instead of butter and tried the recipe with that alteration, but the dough was still a bit too gooey and had trouble retaining the shape.  After being baked, it seemed that the taste was softer or chewier than traditional hamantashen should be..  \nAgain, this is a tasty cookie, but not is you are wanting to make “real” hamanstahen :)       ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jordan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-12T18:06:58.313Z",
                "reviewBody": "I liked the dough and appreciated all the good recommendations and comments that helped make this recipe work. It is a very easy recipe - make sure you use a real filling and not jam/jelly for a substitute. Jam will reduce and even run out the sides leaving thin lining of filling. The time in the freezer is a must even with special attention to pinching the sides into a triangle. You may still have ones that open up in the oven so don't get lazy or be in too much of a hurry. I also recommend brushing them with a beaten egg and then lightly sprinkling them with some ground cinnamon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Estee Fraser (Pinchasin)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2476864/"
                }
            }
        ]
    }
]