[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/70830/chinese-steamed-buns-with-barbecued-pork-filling/",
        "name": "Chinese Steamed Buns with Barbecued Pork Filling",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9045172.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:10:44.000Z",
        "description": "My sister-in law is Chinese and this is one of her most delicious Dim Sum recipes. It's Chinese name is Char Siu Bao, takes a little effort but is extremely worth it. Barbequed pork can be found in Asian markets, or often in the supermarket deli section.",
        "prepTime": "P0DT3H0M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H15M",
        "recipeYield": "24 buns",
        "recipeIngredient": [
            "1 (.25 ounce) envelope active dry yeast",
            "1 cup lukewarm water",
            "4 ½ cups all-purpose flour",
            "¼ cup white sugar",
            "2 tablespoons shortening or vegetable oil",
            "½ cup boiling water",
            "2 tablespoons sesame oil",
            "2 tablespoons vegetable oil",
            "1 green onion, thinly sliced",
            "1 clove garlic, minced",
            "½ pound Asian barbequed pork, cubed",
            "2 tablespoons light soy sauce",
            "2 tablespoons oyster sauce",
            "1 tablespoon white sugar",
            "1 tablespoon cornstarch",
            "2 tablespoons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the warm water in a large bowl, and sprinkle the yeast over the top. Stir in 1 cup of the flour, and mix thoroughly. Cover with a cloth, and let stand until bubbles appear, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve sugar and shortening in boiling water, and allow to cool to lukewarm. Stir into the yeast mixture along with the remaining flour. When the dough becomes too stiff to stir, turn out onto a lightly floured surface, and knead until smooth, about 10 minutes. Coat a large bowl with sesame oil, and place the dough inside. Turn over to coat, and cover the bowl with a damp cloth. Let rise in a warm place until doubled in size.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons of oil in a wok over medium-high heat. Add green onions and garlic, and stir-fry for about 30 seconds. Add pork, and fry for a minute, then stir in the soy sauce, oyster sauce, and sugar. Dissolve cornstarch in 2 tablespoons of water, then stir the mixture into the pork. Cook, stirring constantly until the pork is coated with a thickened glaze. Remove to a bowl, and allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the dough from the bowl, and roll it out into one long log. Slice the log into 1 inch pieces. Flatten each piece into a 3 inch circle using the palm of your hand or a rolling pin. Place 2 tablespoons of the pork filling onto the center of each circle, and gather up the edges around the filling and pinch together to close the bun. Place each bun seam side down onto a square of aluminum foil. Cover with a towel, and let rise for about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a couple inches of water to boil in a wok. Place a few buns at a time in a steamer, such as a bamboo steamer for a wok, or a fitted steam tray. Cover, and steam buns over briskly boiling water for 10 minutes. Repeat with remaining buns.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sneakyteaky"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5675675675675675,
            "ratingCount": 37,
            "itemReviewed": "Chinese Steamed Buns with Barbecued Pork Filling",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "142.2 calories",
            "carbohydrateContent": "21.1 g",
            "cholesterolContent": "6.9 mg",
            "fatContent": "4 g",
            "fiberContent": "0.7 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "0.8 g",
            "servingSize": null,
            "sodiumContent": "90.5 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-04-11T05:38:12.247Z",
                "reviewBody": "This was a good recipe but I think some of the directions were a little bit off: 1) 1/2 lb. of pork was much too little for 24 buns. I bought 1 lb just to be safe and still didn't have enough filling to go around. 2) The directions read 2 tablespoons of filling were to be put in each bun but there were probably only 8 tablespoons of filling total; I think it should have read 1-2 teaspoons - or 1 tablespoon at the maximum if you made extra filling. 3) Coating the bowl with 2 tablespoons of oil seemed excessive to me; I just used 1 and it worked fine. After I made these changes things went smoothly and the char siu bao turned out great; a lot like the ones from back home! I made my own char siu with a packaged marinade mix instead of trying to find it at a store. If you want tasty dim sum try this one out; if I can do it anyone can:) Thank you so much for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LIQUID489",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1212909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-30T05:47:43.037Z",
                "reviewBody": "This is a fantastic dim sum recipe!  To cut down on time I just used my bread machine to knead the dough.  I was unable to purchase the asian barbequed pork, but I just marinaded the pork in hoisin sauce and broiled it.  It turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1084994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-29T17:51:16.457Z",
                "reviewBody": "YUUUUM!!! Wow...I can't believe these turned out sOo good! They took quite a while and a lot of effort (I don't have a bread machine so I had to knead myself). But, it was well worth it!! I could not find any bbq pork either so I just took a pork loin and cooked it all day in the crock pot with lots of chinese bbq sauce & garlic. Very good on it's own by the way! Then, followed the directions exactly. best Pork Buns I have ever had!! My picky boyfriend thought they were excellent as well! ThanXx sOo much for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ErinInVegas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1605391/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-12T17:42:11.687Z",
                "reviewBody": "this recipe is a keeper. Just a note, to make the bun texture softer and smoother, use cake flour (you can buy in asian store), and to make the taste richer, use milk instead of water. These 2 changes make the bun really supple and beautifully shaped.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6867343/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-12T06:29:55.09Z",
                "reviewBody": "A decent dish; I'd be willing to cook it again.  Although the filling was a tad too sweet, I nevertheless got used to it and ended up liking it more than the filling of some buns I've bought in restaurants.  The dough was a little dry, yeasty, and bland, not quite as sweet as most buns, but not really bothersome.\n \n\nLike another reviewer observed, the directions are incorrect.  I cut the dough recipe in half without changing the quantity of meat and even then I ended up with a bit more dough than I needed.\n \n\nIn step one, the yeast-flour-water mixture never bubbled.\n \n\nIn step four, follow the directions and put only two tablespoons of filling in each bun.  (I was tempted to put in more.  I was wrong.)  If you use enough dough in a bun so that you can put in, say, two heaping tablespoons comfortably, the bun will end up uncomfortably large.  And you'll also end up with an imbalance between meat and bread in each bite.\n \n\nI also learned that one should make the dough thinner than one thinks.  (The dough rises a lot.)  But the hardest thing about making buns is getting the dough to be a uniform thickness on all sides.  I guess I just need to practice how to make a bun with a good balance of meat and dough everywhere.\n \n\nFollowing my revised recipe makes two _main course_ servings.\n \n\nIf you freeze the buns before steaming, they freeze well.\n \n\nIncidentally, it took me 2.5 hours to cook from start to finish.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mark P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-24T03:36:33.773Z",
                "reviewBody": "Excellent recipe. Very easy. However I doubled the amount of filling and still ran short. Well worth the time and effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AK_Cabin_Guy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/961391/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-14T00:34:16.607Z",
                "reviewBody": "Oh man so good! I used leftover pulled pork I had in the freezer and drained it. I then added Hoisin sauce and the other sauces stated in the recipe. Hubby brought a bamboo steamer last night so I just had to test it out. DH said they tasted like authentic Dim Sum. Thanks so much Teresa!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-23T18:02:05.507Z",
                "reviewBody": "This was OK... but not like the ones I used to get in Hawaii.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bmgregory",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268042/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-27T20:02:01.607Z",
                "reviewBody": "My bread machine's dough cycle made short work of the dough because it is a little on the sticky side. I couldn't find Chinese barbecue pork so I took a previous reviewer's suggestion of marinating pork tenderloin in hoisin sauce and chinese five spice powder. The glaze took a while to thicken so I ended up adding 1/2 teaspoon of cornstarch to speed up the process.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-10T23:43:56.65Z",
                "reviewBody": "the pork was wonderful but we didnt much care for the buns.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "love2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2418978/"
                }
            }
        ]
    }
]