[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/71067/siopao-filipino-steamed-dumplings/",
        "name": "Siopao (Filipino Steamed Dumplings)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F645035.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:10:45.000Z",
        "description": "Warning - this recipe is not easy, but well worth the effort. This is a Filipino dish with Chinese roots. A steamed, almost sweet, yeasty bun filled with delicious chicken filling can also be made with shredded pork. You will need a bamboo steamer.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "15 pieces",
        "recipeIngredient": [
            "1 tablespoon active dry yeast",
            "1 ½ cups lukewarm water",
            "¼ cup white sugar",
            "4 ½ cups rice flour, divided",
            "½ cup solid vegetable shortening, divided",
            "1 teaspoon vegetable oil",
            "1 large onion, diced",
            "1 clove garlic, chopped, or to taste",
            "1 ½ pounds shredded cooked chicken meat",
            "¼ cup soy sauce",
            "2 teaspoons white sugar",
            "½ cup diced green onion",
            "1 pinch salt and black pepper to taste",
            "1 teaspoon cornstarch, if needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast in the water; stir in the sugar and beat in 2 1/2 cups of rice flour to make a soft sponge. Set aside in a warm place to double in bulk, about 40 minutes. Mix in 2 more cups of rice flour and 1/4 cup of shortening and place the dough on a greased work surface; knead in the remaining 1/4 cup of shortening to make a smooth dough. Cut the dough into 15 equal-sized pieces; form each piece into a ball.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a skillet over medium heat; cook and stir the onion and garlic in the hot oil until translucent, about 5 minutes. Stir in the chicken, soy sauce, 2 teaspoons of sugar, green onion, salt, and pepper. If the mixture is juicy, add cornstarch to thicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working on a lightly greased work surface, flatten a dough ball into a circle about 4 inches in diameter with the heel of your hand. Place about 1 tablespoon of filling into the center of the dough ball, bring the edges of the dough together at the top, and pinch and twist to seal in the filling. Place each filled dumpling onto waxed paper with the pinched seal at the bottom while you finish the rest of the dumplings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spray a multi-layered bamboo steamer with cooking spray, place the steamer on top of a large saucepan, and pour in water to several inches below the steamer. Bring the water to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working in several batches, place 3 or 4 filled buns into each steamer layer without letting the buns touch each other or the edge of the steamer, cover the steamer, and let the buns steam over medium-low heat until puffy and the dough is springy, about 15 minutes per batch. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MCCACJ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.375,
            "ratingCount": 24,
            "itemReviewed": "Siopao (Filipino Steamed Dumplings)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "345.8 calories",
            "carbohydrateContent": "43.9 g",
            "cholesterolContent": "34 mg",
            "fatContent": "11.2 g",
            "fiberContent": "1.6 g",
            "proteinContent": "16 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "270 mg",
            "sugarContent": "4.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-05T16:59:22.277Z",
                "reviewBody": "You're right this is not an easy recipe! However if you have siopao finatics as I do it is well worth the effort. I made this for my Filipino husband for our 28th anniversary. He assures me there will be 28 more!! Thank you for sharing and for such clear instructions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gail Cobile",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/287781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-22T17:38:30.84Z",
                "reviewBody": "I tried this recipe but I did activate the yeast first by using warm water and adding 1 Tbsp of sugar, set it aside until spongy bubbles appears on top of it. Then you can mix it to the flour mixture. I also let the dough with fillings rise for 15 minutes before steaming it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "rowena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3847600/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-16T21:37:16.463Z",
                "reviewBody": "I added chinese sausage some hoisin sauce substituted sugar in meat mixture with splenda and added sliced hard boiled egg.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ivy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2408825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-31T05:54:42.687Z",
                "reviewBody": "I have been looking around for a siopao or steamed buns recipe which uses rice flour and not the usual all purpose flour so I was really happy to find it here at all recipes.\n\nThe texture of siopao made with rice flour is a bit heavier and chewier then that made with all purpose flour. This recipe is  reminiscent of the siopao being sold at a very popular resto in the Philippines as compared to the ultra light and fluffy siopao varieties being sold elsewhere.\n\nIncidentally, I gave this recipe only four stars because I didn't like the filling. The dough I give five stars! \n\nNext time, I will just make my own filling.\n\nThank you MCCACJ for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "natzsm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6283516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-09T23:39:18.677Z",
                "reviewBody": "help me here.... i just made the dough recipe and it's a mess.... the dough is crumbly and would not form.... the procedures in doing it is not very helpful.... the sponge is not really a sponge but watery.... what kind of recipe is this? I just throw away the dough that i made... it's a waste of my time and money. pls tell me what i did wrong?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "julia32",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7162916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-04T02:07:50.147Z",
                "reviewBody": "julia32,\nwhen you activate the yeast make sure the water is warm and not hot...high temperature will kill the yeast and mix in the sugar that is what the yeast eats which causes the dough to rise. Also make sure you are precise with your measurement of the flour.  if it is crumbly then there is too much flour.  when you knead in that last 1/2 cup do it a little at a time you may not need it all.  Hope this helps : )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "David",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8273133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-31T15:19:37.127Z",
                "reviewBody": "I make a similar version of this recipe although much simplified for our busy lifestyles. First of all I make the dough in the breadmaker using all-purpose flour (just a regular white bread recipe). Second I use a combination of ground pork and ground beef and add a dash of Worcestershire sauce to the mixture. I make the meat mixture the night before and refrigerate it because it's much easier to work with when it's cold as well. After assembling the siopao I rise the whole thing one more time (about 45 minutes) before steaming. My siopao turns out just as good as this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "keiko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4897304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-10T17:50:29.407Z",
                "reviewBody": "The filling for this recipe is amazing but although I've followed it exactly twice now I can't get the dough right! I don't know what I'm doing wrong (any input would be appreciated). Every time I try the dough comes out crumbly and unusable. It's not even remotely pliable and falls apart when I try to make the dumplings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Goiy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6055423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-21T10:35:00.137Z",
                "reviewBody": "I don't understand the problems reviewers had with the dough. If your dough is crumbly you add just a bit of water, if it's too sticky you add a bit of flour, it's common sense. Flour is different, humidity is different where you're cooking, this is basic technique. At any rate, while it takes a bit of time I didn't find this recipe difficult in the least. I've been looking for a great rice flour dough recipe to make bao that my celiac husband can have, and this does the trick beautifully. Use the filling listed or go crazy experimenting with your own combos, the possibilities are endless! Imagine sloppy joe filled buns, buffalo chicken buns, BBQ of any variety, chinese veg filled, egg custard, sausage and egg breakfast buns, cheeseburger, pizza flavors, seafood, taco, fruit, chicken pot pie, quiche, spinach dip, the only limit is imagination. This is hands down one of the most versatile recipes you can have in your recipe box, and they freeze well too so make up a few dozen and when you're ready to eat them just steam in a bamboo steamer until they're 165 degrees inside. No more buying buns for crazy prices at the international grocery for us, homemade is WAY better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danielle Heiderich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8803863/"
                }
            }
        ]
    }
]