[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16770/main-dish/sandwiches/gyros/",
                    "name": "Gyro Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/71963/dashs-donair/",
        "name": "Dash's Donair",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F666892.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:10:49.000Z",
        "description": "For the true donair fan. This recipe is tried and tested. If you enjoy Halifax donairs, then you'll love this recipe. When making this recipe, use only the finest spices available; they make a huge difference.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 teaspoon salt",
            "1 teaspoon ground oregano",
            "1 teaspoon all-purpose flour",
            "½ teaspoon ground black pepper",
            "½ teaspoon Italian seasoning",
            "½ teaspoon garlic powder",
            "½ teaspoon onion powder",
            "¼ teaspoon cayenne pepper",
            "1 pound ground beef",
            "1 (12 fluid ounce) can evaporated milk",
            "¾ cup white sugar",
            "2 teaspoons garlic powder",
            "4 teaspoons white vinegar, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). In a cup or small bowl, mix together the salt, oregano, flour, black pepper, Italian seasoning, garlic powder, onion powder, and cayenne pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the ground beef in a large bowl, and use your hands to blend in the spice mixture. If you want the smooth texture of meat that you see in a real donair shop, you must do this in a steel mixing bowl and on a sturdy surface. Pick up the meat, and throw it down with force about 20 times, kneading it after each throw. This also helps the meat hold together better when you slice it.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form the meat into a loaf, and place it on a broiler pan. If you do not have one, a baking sheet will do.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 1 hour and 15 minutes in the preheated oven, turning the loaf over about half way through. This will ensure even cooking. Serve, or allow the meat to chill before slicing and reheating.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the donair sauce, mix together the evaporated milk, sugar and garlic powder in a medium bowl. Gradually whisk in the white vinegar, adding 1 teaspoon at a time, until thickened to your desired consistency.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes",
            "Gyro Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DASHRIPROCK"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.648401826484018,
            "ratingCount": 438,
            "itemReviewed": "Dash's Donair",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "488.8 calories",
            "carbohydrateContent": "49.5 g",
            "cholesterolContent": "98.4 mg",
            "fatContent": "20.9 g",
            "fiberContent": "0.5 g",
            "proteinContent": "26 g",
            "saturatedFatContent": "9.7 g",
            "servingSize": null,
            "sodiumContent": "747.7 mg",
            "sugarContent": "47.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-09-28T14:58:59.083Z",
                "reviewBody": "Thank you Dash!!!! I'm from Nova Scotia and I CRAVE these things. This recipe is a great recipe for donair meat ~ the sauce is bang-on, as well. For the reviewers who may be unsure of what to do with the sauce and meat:\r\n1) Fry a pita in a small amount of oil to soften it (I just put mine in the microwave for a few seconds ~ it's just to make the pita pliable to wrap around the fillings), fry the donair meat in same pan to warm it, and then fold the pita around the donair meat, sauce and chopped tomatoes and onions for toppings. (I've also had them with mozzarella cheese melted in them ~ mmmmmmmmm).\r\n2) Meat and sauce make great oven-baked subs (same topping suggestions).\r\n3) Donair Pizzas ~ sauce, meat and whatever toppings strike your fancy, mozzarella cheese.\r\n4) The famous Donair Plate: fries topped with meat, sauce, chopped tomatoes, chopped onions, mozzarella cheese and baked in the oven. (I  order mine without the fries ~ personal preference).\r\nI can't believe donairs haven't really caught out outside eastern Canada ~ these are big business at the pizza shops here....I order donairs way more often than pizza ~ my 13-year-old has been an addict since he was old enough to pick off my plate. :-) Oh, and pizza corner rocks for donairs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lesha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-24T13:27:24.7Z",
                "reviewBody": "I am from Halifax too. This is the exact recipe used by the restaurant that invented the Donair. The trick to the meat is to ask your butcher to put it through the meat grinder 2 more times to grind it extra fine. Medium beef also works the best. Also, absolutely no substitutes can be made for the sauce. You must used evaporated milk and you must chill the sauce before using. The cold sauce meets warm spicy beef is an important part of the experience. a warm pita is important too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATERS0404",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/475770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-23T19:34:41.2Z",
                "reviewBody": "It seems some people are getting Gyros (Greek) mixed up with Donairs (Lebanese).I used to work in a Donair Shop in New Glasgow, N.S.& have never had anything even close to it here in Ontario.Two tips:1) mix the sauce as little as possible & slowly add the vinegar.2)moisten the pita with water & heat it up in a pan with some drippings from the meat.It should be baked on a rack in a pan.I usually make 5 lbs of meat at a time & freeze half for a donair pizza later.Pizza Delight, Cambridge,Ont. is the only place I've found that makes a decent donair like home!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deb Hughes Cormier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/789670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-25T22:55:50.193Z",
                "reviewBody": "This recipe is amazing! My husband (from Halifax) and I have been using it for the past 8 months and it is both of our favourite meals.  I am vegetarian so I use veggie ground round for mine and just add the spices to it instead (without salt).  my hubby makes the meat version and it's turned out every time.  The sauce is also delicious and anyone who says otherwise is not making it right...it takes some technique...this is how we do it: -must use full fat evaporated milk -mix in sugar and garlic completely until sugar is no longer granular -begin whisking the mixture to get liquid moving and pour in 1/4 c of vinegar AT ONCE -ONLY STIR 3 or 4 more times and let the chemical reaction occur and the mixture thickens (on its own)...this is key!! The sauce turns out perfectly this way...so we recommend following the steps exactly if you want the same great results that we get! ***also make sure to wet the pita under the tap and sear it on a hot pan so that the pita is moist and pliable for adding the donair ingredients!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jillymcnilly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3666650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-17T22:40:49.027Z",
                "reviewBody": "I moved to Regina from Edmonton 4 months ago and back home there are donair shops EVERYWHERE...here there is not a single one. So I desided to make them and home using this recipe and everything turned out wonderful. I now make 10lbs of beef at a time and freeze it in little ziplocks for individual servings and for friends who have moved here and miss the tastes of home. Again the sauce is perfect as long as you remember to blend the ingredient WELL before adding the vinager. We wrap ours in a steamed pita bread and top it with the sliced beef that we fry after it has been frozen or cooled and then add on diced tomatoes onions lettus and mozza cheese. We then wrap it in wax paper and foil and put it in a plastic bag like they do at the donair shops so it isn't that messy when we eat it. I hope that everyone else has as much success with this recipe as I did....enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2253312/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-21T21:30:11.35Z",
                "reviewBody": "This is absolutly fabulous meal. The important thing they left out of the recipe is how to eat it! after looking around the net First we tried it on fried pita breads. which was delicious but was messy and fried. so we then tried it with just dry pitas and opened them like pockets. with the meat and the sauce and tomato and onion. would be good with lettuce or cucumber too. would also be good on a premade pizza crust like boboli and the sauce and tomatos onions and cucumbers. Fabulous meal for something that sounds so gross. I will make this again and again. plus since the meat is so simular to meatloaf recipes... maybe ill try just making the sauce for that leftover night.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAZEDDRAGONS420",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/643677/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-14T15:48:39.427Z",
                "reviewBody": "Thanks for a great recipe! These are awesome! Be sure to add diced tomatoes and onions to your donair. Try what the last reviewer suggested... donair pizza is very good. It's been a year since I had one while visiting family in NB but I'm so happy that now I can make them any time. This deserves more than 5 stars!! About the sauce... mix the sugar and garlic slowly into the milk with a whisk using a non-metal bowl. Add the vinegar one teaspoon at a time and whisk gently only 2 or 3 turns after each. By the 4th tsp it will be thick!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AFOSTERFAMILY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/843580/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-04T13:13:56.363Z",
                "reviewBody": "THANK YOU!!! My husband and I now live in New England but we both grew up in NS. This recipe was SPOT ON. We like spicy foods so I doubled the herbs and spices which suited us perfectly:) We always got garlic fingers with our donairs (great for dipping in the sauce)so I whipped some up using frozen pizza dough. I sauteed 5 cloves of minced garlic in a few tbs olive oil spread it over the dough and sprinked with basil oregano and whatever cheese was on hand. This recipe could NOT have been better for our cravings!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Meghan Wheaton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1897957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-11T16:35:37.68Z",
                "reviewBody": "I am from Atlantic Canada and this is a great recipe for donairs (I love them and have them alot) I can't believe that this delicious treat hasn't gone much past Atlantic Canada yet and I could barely belive it when I found this out. The meat in this recipe is perfectly spiced and the sauce tastes perfect as well. You are a real donair expert!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HeatherC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1000041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-21T23:29:51Z",
                "reviewBody": "I'm from Oklahoma and I had never heard of donair. I tried this in pita bread with sharp cheddar cheese tomato and romaine. I was not blown away by this recipe. I found the meat to be dry first off. I tried to have an open mind about a milk-sugar-garlic-vinegar sauce (Oklahomans like their milk gravy but this mixture is TOTALLY unexpected..) I guess it's culture shock. Not something I'll make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ILENEJONES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1263155/"
                }
            }
        ]
    }
]