[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/255865/slow-cooker-thai-curried-beef/",
        "name": "Slow Cooker Thai Curried Beef",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4084154.jpg",
            "width": 5344,
            "height": 3006
        },
        "datePublished": "2020-03-05T05:15:47.000Z",
        "description": "Awesome and flexible slow cooker Thai dish that is perfect for the busy family, couple or single person. Prep the night before or the morning-of. Cook for 6, 8, or 10 hours. This recipe is as tasty as it is forgiving.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT6H53M",
        "totalTime": "P0DT7H8M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds lean stew beef",
            "⅛ teaspoon salt",
            "2 cups diced onion",
            "4 cloves garlic, minced",
            "1 (13.5 ounce) can coconut milk",
            "¾ cup beef broth",
            "3 tablespoons red curry paste",
            "2 tablespoons lime juice",
            "2 tablespoons peanut oil",
            "2 jalapeno chile peppers, seeded and minced",
            "1 tablespoon brown sugar",
            "2 cups baby spinach",
            "8 water",
            "4 cups jasmine rice",
            "½ cup fresh basil leaves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat a large skillet over medium-high heat. Cook and stir beef until browned, about 2 minutes per side. Drain excess grease. Transfer beef to a 4-quart slow cooker and sprinkle with salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine onion and garlic in the same skillet over medium-high heat; saute until tender, about 5 minutes. Add to beef in the slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir coconut milk, beef broth, red curry paste, lime juice, peanut oil, jalapeno chile peppers, and brown sugar into the slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and cook on Low until flavors combine, 6 to 10 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir spinach into the slow cooker and cook until wilted, about 15 minutes. Serve beef mixture over rice and garnish with basil leaves.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sapper26"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.48,
            "ratingCount": 75,
            "itemReviewed": "Slow Cooker Thai Curried Beef",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "828.5 calories",
            "carbohydrateContent": "85.6 g",
            "cholesterolContent": "98.6 mg",
            "fatContent": "39.3 g",
            "fiberContent": "2.5 g",
            "proteinContent": "40.3 g",
            "saturatedFatContent": "18.7 g",
            "servingSize": null,
            "sodiumContent": "298.5 mg",
            "sugarContent": "3.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-03-30T22:26:57.923Z",
                "reviewBody": "This recipe is the best meal I have cooked in my crockpot. I love Thai flavours and this curry was bursting with them! I like a little heat in my food but my husband does not, so I omitted the chili peppers and I don't use peanut oil so that was left out as well. There was enough heat in the red curry paste to add some zing, but even my husband didn't mind because the taste was so amazing. Other than that, I followed the recipe exactly. To make sure I got all of the browned bits out of my frying pan, I deglazed it using the beef broth and added that to the pot as well. I would also recommend breaking up the beef once it's cooked to a more \"shredded\" consistency. That's easy because it's falling apart anyway! That way you can incorporate more of the sauce as you spoon it over the rice. \nWe liked this so much that I have just finished putting all the ingredients in the pot to serve to dinner guests this evening. \nI was frustrated trying to find a recipe for beef that was not a stew or pot roast. This turned out better than I had expected and will now be my \"go to\" meal when I want to serve something especially good and a little different. Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Always Smilin'",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2870953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-10T22:57:34.463Z",
                "reviewBody": "Hands-down the BEST slow cooker meal I've ever made!  For an even more fragrant dish, I sauteed the onion and garlic in coconut oil and used coconut oil instead of peanut oil in the sauce.  I also thickened it at the end with a little corn starch.  So delightful - so tender!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hdonovan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4509479/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-04-18T14:04:14.747Z",
                "reviewBody": "Really really bland made as written.  It needed lots of jazzing up with more lime juice, sambal oelek, and salt.  I steamed some vegetables and threw them in and that was nice.  Would make again but with above additions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cyd_Delve",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2287653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-01T20:02:00.853Z",
                "reviewBody": "We really really enjoyed this recipe. I did add extra salt from the get go (seasoned the meat) and ended up adding a touch more again after tasting. Also, browned the meat in the oil instead of adding it to the crockpot.  After the changes I think it was definitely a 5 to my taste.  Next time I might flour the meat to help thicken the sauce (did a slurry at the end this time). Some drizzled sriracha over the top for extra heat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Dean Covington",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/koriekiss/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-29T02:19:04.563Z",
                "reviewBody": "I followed this recipe exactly except I left out the jalepenos because I was feeding this to my 18 month old. My husband and I love Thai food and eating out, so this recipe seemed great because it was simple. This is nothing like what you'd get at a Thai restaurant. It was pretty bland and not really flavorful at all (I used Thai Kitchen red curry paste). This is more like something my mother-in-law from the midwest would consider an exotic Thai dish. It tasted fine overall and was edible, but I wouldn't call it Thai. This would require major tweaking for me to make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Lil Liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1890847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-07T06:32:54.757Z",
                "reviewBody": "This was delicious and easy! I will certainly make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Summa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11665804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-06T03:08:49.297Z",
                "reviewBody": "Most fabulous beef teriyaki I've ever had !    I made a number of alterations to the recipe using more simple ingredients I had on hand .    It did not take the full amount of time recommended .   Only about six hours on though he in the crockpot .     I did not add any hot spicy things like jalapeños and I dumped in more brown sugar then was recommended .      I dredged the beef in a combination of flour curry and salt  and five Chinese spice blend before Browning .      My beef teriyaki was plenty thick and super savory .       I ended up watering it down significantly to get the right. Consistency .   Since I don't have coconut milk I used extra beef broth and a half cup of old shredded coconut I found in my baking cupboard.  It seemed the other three reviews mentioned that the flavor was not as strong as they would like and that it was too watery so I added Chinese five spice and a lot of curry powder instead of curry paste because I don't have any curry paste Also I will use lemon juice because I don't have lime.               I should add that I had no peanut oil and just used canola. This was so amazing I doubled the recipe and I'm very happy that I did.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Schans",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9467582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-06-15T04:43:05.99Z",
                "reviewBody": "I made this in our Ninja Foodi rather than the slow cooker. It worked like a charm and took about 1.5 hours. Meat was so tender. Seasoning was delicious. Served with rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M Denise Orndorff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17417246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-17T02:31:52.527Z",
                "reviewBody": "This is so delicious. My household is extremely excited for me to cook this again. I ended up with three pounds of meat so I adjusted the recipe roughly mostly by sight to make sure the meat was covered. I dumped slurry in at the end to thicken it up and we put it over rice. It was amazing. Next time I might try cooking the meat in corn starch as a previous commenter suggested and see if that doesn't thicken it while it cooks so I don't have to add the slurry at the end. I also cooked this on high since I got started late in the morning and didn't have 10 hours to wait for it to be finished on low.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alison Guynes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11043831/"
                }
            }
        ]
    }
]