[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
                    "name": "Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14765/soups-stews-and-chili/chili/turkey-chili/",
                    "name": "Turkey Chili Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228404/slow-cooker-pumpkin-turkey-chili/",
        "name": "Slow Cooker Pumpkin Turkey Chili",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5818600.jpg",
            "width": 1536,
            "height": 1536
        },
        "datePublished": "2020-03-05T05:09:19.000Z",
        "description": "An easy chili that's sure to please. I've made this for a Halloween party and a chili cook-off at work with great results!  It's a great base with lots of options to spice it up depending on the crowd you're cooking for! I usually put everything together in the morning and let it simmer all day; cooking time can be adjusted to fit your needs.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT3H10M",
        "totalTime": "P0DT3H25M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "1 pound ground turkey",
            "1 onion, chopped",
            "1 (28 ounce) can diced tomatoes",
            "2 cups cubed fresh pumpkin",
            "1 (15 ounce) can chili beans",
            "1 (15 ounce) can seasoned black beans",
            "3 tablespoons brown sugar",
            "1 tablespoon pumpkin pie spice",
            "1 tablespoon chili powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large soup pot over medium heat; brown turkey, stirring often, until crumbly and no longer, pink, about 10 minutes. Drain and discard any fat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer turkey to a slow cooker and stir in onions, diced tomatoes, pumpkin, chili beans, black beans, brown sugar, pumpkin pie spice, and chili powder. Set cooker to Low, cover, and cook until pumpkin is tender and has started to break apart, at least 3 hours.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chili Recipes",
            "Turkey Chili Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "coffee_junkee"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5136186770428015,
            "ratingCount": 257,
            "itemReviewed": "Slow Cooker Pumpkin Turkey Chili",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "337.6 calories",
            "carbohydrateContent": "41.9 g",
            "cholesterolContent": "56 mg",
            "fatContent": "9.1 g",
            "fiberContent": "10.6 g",
            "proteinContent": "25.1 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "856.6 mg",
            "sugarContent": "14.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-10-10T20:57:07.347Z",
                "reviewBody": "This recipe was great, with a few personalized tweaks.  I even won the chili cook-off at my job.  Some variations that I tried which were extremely successful:\n\n1. Sautee the (red) onion with olive oil, salt and cracked pepper prior to adding it into the cooker.\n\n2. Season your turkey as it browns with salt, cracked pepper and a little chipotle chile powder.\n\n3. Instead of chili beans, I used Great Northern.  They really complimented the turkey, in my opinion.\n\n4. Split your tomato portion - half regular diced, half fire roasted (as mentioned in other reviews).  \n\n5. Add in a small can of green chiles and diced jalapenos if you're looking for a little more spice with that sweet pumpkin.\n\n6. Canned, pureed pumpkin works just as well if you feel like being lazy (I certainly was).\n\n7. My local store was out of pumpkin pie spice (shame on me for waiting to buy it until October) - so I used varying dashes of Cinnamon, Paprika and Cumin.\n\n8. Use Chipotle chili powder instead of regular.  A couple tablespoons of cayenne pepper will also add some spice!\n\n9. Season! Season! Season!  There is no mention of salt and pepper in the ingredients, so I presume it's understood.  But don't forget to SEASON the mixture!!\n\nFinally, I created a special sour cream mixture by mixing 3 parts sour cream to 1 part pumpkin puree and added a little chipotle chile powder.  This really made the dish!\n\nEnjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ashley White",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11921619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-20T20:15:24.753Z",
                "reviewBody": "My family really loved this chili.  It is very thick and hearty and has a sweet spicy flavor.  I like to prepare healthy meals for my family and am used to substituting ingredients to make them healthier but with this recipe I didn't have to change a thing! The only thing I did do differently was to use a 15 oz. can of pure pumpkin for convenience. I will be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sugarplum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sugarplum9829/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-03T00:01:12.887Z",
                "reviewBody": "I looked at several other pumpkin chili recipes and the ones that got 700 reviews. Every positive review had so many changes and this recipe seemed to reflect them. I made this Halloween night and it was sooo delicious.  We followed the recipe as it was listed except for these changes: canned tomatoes with diced chiles, unseasoned black beans (all I had in the pantry), and no brown sugar (I just forgot).  I had some extra canned pumpkin puree (about a cup) that I threw in (why not?) and an extra can of beans to stretch the recipe further. It was really delicious. The flavor was subtle, it was so hearty and good. We ate it with honey cornbread and sour cream. Utter perfection. We will be adding this to our chili rotation!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LalaLovesCooking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6247622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-24T02:45:35.227Z",
                "reviewBody": "I'm a Texan and we love our chili HOT so when I decided to try this recipe I was skeptical that we would like it. I had leftover turkey and since the weatherman was predicting ice and snow my family wanted chili. So I searched Allrecipes and found this one with the interesting pumpkin addition. I had never heard of putting pumpkin or sweet potatoes in chili. That sounded insane. But wanting to try something new I tried this recipe using my leftover turkey chopped up sweet potatoes instead of pumpkin and added more heat with jalapenos Cajun seasoning and chipotle chili powder. I also added a bag of frozen chopped onions and peppers and fresh cilantro. OMG! It was delicious. I had to stop my boys from eating it after 3 bowls each. I served it with just tortilla chips nothing more on top as some suggested. If you are skeptical try this and add your own flair to it. I even had to give the homemaking teacher at my school the recipe after she tried it. She was amazed at the flavor of the sweet and spicy blend. This will definitely become part of my chili rotation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mammak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7495292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-16T14:51:03.8Z",
                "reviewBody": "Awesome recipe! By far the best ever chili recipe and this will become my staple. I did a little tweaking. Here is what I did modified: 1 Chili seasoning packet 3 pounds of ground turkey cooked in olive oil 4 table spoons of brown sugar 1 teaspoon of cinnamon 1 can of white northern beans to replace the black beans 2 cans of diced tomatoes with zesty mild chilies 1 can of Libby Pumpkin. Other than what I listed above I used everything else such as the chili beans and pumpkin pie spice. Cooked it on high for 1 hour and then low for about 4-5 hours or until hot and bubbly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hugvt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11312331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-18T17:11:38.527Z",
                "reviewBody": "This was so easy and inexpensive. Sweet and spicy this was very good. Definitely will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10042791/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-15T19:45:09.763Z",
                "reviewBody": "Healthy and yummy! The only thing I changed I used sweet potato cut up in place of the pumpkin and doubled it... My husband loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "halftimecook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6659779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-03T00:20:46.24Z",
                "reviewBody": "When I saw this recipe and read the reviews I couldn't wait to try it. I love pumpkin and I love chili but they are not meant to be put together. It tasted like I dumped a pumpkin pie into my chili. Like some other reviewers I used a can of pumpkin instead of fresh. Maybe that makes a difference but I doubt it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5808057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-06T03:18:51.047Z",
                "reviewBody": "We LOVED this chili - the picture doesn't do it justice. Full of flavor and so healthy too. I substituted Rotel for the tomatoes so it was extra hot. I will add half the chili powder next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3396270/"
                }
            }
        ]
    }
]