[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15901/meat-and-poultry/turkey/brine/",
                    "name": "Brine",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/54614/turkey-brine/",
        "name": "Turkey Brine",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F16%2F54641-turkey-brine-mfs071-2x1-1.jpg",
            "width": 2000,
            "height": 1000
        },
        "datePublished": "2020-03-10T02:50:38.000Z",
        "description": "This is a tasty brine for any poultry.  It will make your bird very juicy, and gravy to die for!! This is enough brine for a 10 to 18 pound turkey.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT8H20M",
        "recipeYield": "2 gallons",
        "recipeIngredient": [
            "1 gallon vegetable broth",
            "1 cup sea salt",
            "1 tablespoon crushed dried rosemary",
            "1 tablespoon dried sage",
            "1 tablespoon dried thyme",
            "1 tablespoon dried savory",
            "1 gallon ice water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large stock pot, combine the vegetable broth, sea salt, rosemary, sage, thyme, and savory. Bring to a boil, stirring frequently to be sure salt is dissolved. Remove from heat, and let cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the broth mixture is cool, pour it into a clean 5 gallon bucket. Stir in the ice water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wash and dry your turkey.  Make sure you have removed the innards. Place the turkey, breast down, into the brine. Make sure that the cavity gets filled.  Place the bucket in the refrigerator overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the turkey carefully draining off the excess brine and pat dry.  Discard excess brine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the turkey as desired reserving the drippings for gravy.  Keep in mind that brined turkeys cook 20 to 30 minutes faster so watch the temperature gauge.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Brine"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHERI GAILEY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.831871345029239,
            "ratingCount": 1368,
            "itemReviewed": "Turkey Brine",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "2.8 calories",
            "carbohydrateContent": "0.6 g",
            "cholesterolContent": "0 mg",
            "fatContent": "0.1 g",
            "fiberContent": "0.4 g",
            "proteinContent": "0.1 g",
            "saturatedFatContent": "0 g",
            "servingSize": null,
            "sodiumContent": "5640.3 mg",
            "sugarContent": "0 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-14T16:08:13.95Z",
                "reviewBody": "I love brining but I think it's important to mention when brining in a plastic bag or container, make sure that the plastic is FOOD GRADE!  You should NEVER, NEVER, EVER brine in a garbage bag or ordinary household bucket.  PCB's are not good for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "maggieeleslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2606252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-29T17:12:54.733Z",
                "reviewBody": "A great brine.  I doubled the recipe for a 22 lb. turkey and used 1 gal. apple juice and 1 gal. vegetable broth instead of all broth.  I also used ground spices instead of dried.  I put the turkey in a clean plastic trash bag, then placed it in a large cooler. Next, I poured the brine in the bag and tied it closed.  I placed a gallon of frozen water in the cooler next to the bag to keep the whole thing cool while it marinated overnight.  Watch out for the cooking time on this one as a brined bird cooks much faster - especially if you're using a roasting bag (which I did).  My 22 lber cooked in only 2 1/2 hours!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gladysgreasy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1646557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-17T18:04:20.06Z",
                "reviewBody": "Cannot even describe how amazing this was.  My mom's turkeys have always been just okay, and so I decided to take charge for Easter dinner and make this.  It was my first turkey and no one could believe how incredibly juicy, tender, and moist it was.  I followed the recipe for the brine exactly, including just letting the bucket sit in a cool place overnight.  To cook it, I put an onion, carrot and celery stalk into the cavity.  It started breast side down in a 325 degree oven for 2 hours.  Then I turned it over and it took another 45 minutes or so to be done.  For the last 15 minutes I turned the oven up to 400 to finish browning and basted it with a little butter.  Did not cover it with foil, and otherwise didn't bother basting it.  The meat was literally falling off the bones it was so tender and the flavor went all through the meat.  It was seriously about as foolproof as you could get.  The only change I'll make next time is to either reduce the sea salt or substitute water for some of the vegetable broth.  It was just a touch on the salty side, I think because broth is often high in salt to begin with.  Don't be afraid to try this recipe, it really was that easy.  Cannot recommend it enough.. and ditto the other reviewers' comments on the drippings -- they make amazing gravy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VACookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/608882/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T04:08:39.527Z",
                "reviewBody": "Perfect Brine both times I used this recipe!  The first time I used this recipe was two days before Thanksgiving 2010 and it turned out perfect,  The second time was one week later (turkeys were still on sale) and I used all fresh ingredients (tripled), plus two sliced garlic cloves, a sliced onion, celery with the green leaves/tops and peppercorns.  As my family likes a very slight citrus taste to our \"bird\", I added a quartered orange to the cavity of the bird during the brine.  Subbed 1/2 of the vegetable broth for apple juice and cut back the salt to 3/4 cup as the vegetable broth already had salt in it.....  Didn't see this tip amongst the many reviews, so I'm going to list it.  The vegetable/produce drawer makes a perfect spot to brine the turkey for a consistently cool temperture.  This is a great recipe ~ try it, I guarantee you won't be disappointed with the original recipe or my modifications.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-11T16:15:02.483Z",
                "reviewBody": "After using this recipe for our recent Thanksgiving get-together of three  families, I have been proclaimed the official turkey roaster.  12 out of 12 said it was the best turkey they ever tasted.  (My son said it was the best turkey he had in the past 5 years.  When I asked him whose turkey he had 5 years ago that was better he said that was merely as far back as his memory went!)  The most difficult part of this recipe was finding a bucket large enough to accommodate the turkey.  Then the bucket wouldn't fit into the fridge.  I didn't feel comfortable leaving it out all night, so I found a large cooler, placed the bucket in there and surrounded it with freezer packs.  It worked very well - it was still very cold the next morning.  After checking out several \"brine\" recipes, I didn't read of anyone actually stuffing the turkey so I wasn't certain whether the stuffing would end up too salty. I stuffed it anyway, but rinsed the turkey with cold water first.  It was excellent!  Try this once and you'll never go back to your regular recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANAAMCMILLAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/695516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-26T19:08:10.39Z",
                "reviewBody": "I've used this brine before and it was wonderful!  I'm using it again this year.  For the person who claimed it ruined her 18lb turkey: it must have been user error because brining is a chemical process.  Once the process has finished the salt is left in the brine solution not the bird.  Brining makes cooked meat moister by hydrating the cells of its muscle tissue before cooking, via the process of osmosis, and by allowing the cells to hold on to the water while they are cooked, via the process of denaturation. The brine surrounding the cells has a higher concentration of salt than the fluid within the cells, but the cell fluid has a higher concentration of other solutes. This leads salt ions to enter the cell via diffusion. The increased salinity of the cell fluid causes the cell to absorb water from the brine via osmosis. The salt introduced into the cell also denatures its proteins. The proteins coagulate, forming a matrix which traps water molecules and holds them during cooking. This prevents the meat from drying out, or dehydrating.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CarrieKA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-04T03:09:56.637Z",
                "reviewBody": "I brined my 24 lb turkey last year and it cooked uncovered in three hours. it was so tender and delicious that there were no leftovers.i make my own vegetable broth by cooking carrots,celery onions,parsley,tomatoes. wash and cut up vegeatables but do not peel. cook in enough water to cover for an hour. add salt, peppercorns and i use two cups of brown sugar or maple syrup. cool and strain. half of my kitchen sink is very deep and i put my turkey in the sink, cover with a 20lb bag of ice and pour cooled broth over. i marinate for two days, replenishing ice as needed. then rinse and dry. stuff with lemons and onions",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2396149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-15T14:33:39.53Z",
                "reviewBody": "Made this for Christmas and my mother-in-law stated she wouldn't have deep fried turkey again.  I've cooked turkeys for 20 years and will never cook it any other way.  I baked it uncovered at 500 degrees until brown and then covered and baked at 350 degrees.  This turkey was the most beautiful brown glazed turkey you would ever see!  My husband actually took a picture of it!  I am making it again this weekend!  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RLEW0414",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1355777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-16T02:26:52.11Z",
                "reviewBody": "5 STAR RECIPE!! I use this brine for chicken and it's outstanding! (I omit the Savory seasoning since I never can remember to buy it.) I adjust the recipe to 4 servings for a 5lb. chicken then place it into the largest rubbermaid container I own. Add seasonings mixed with two cans of vegetable broth. Fill to top of container with cold water making sure chicken is thoroughly soaking in brine. Cover and let marinate for 24 hours in fridge. Bake at 325 degrees for about 2-1/2 hours... FANTASTIC!! My very picky 7 year old loves this recipe!! As do the rest of us:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm Not Stupid, I Know Tings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1583526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-08T23:09:33.64Z",
                "reviewBody": "I've brined many turkeys using various solutions but never made gravy with the drippings as I do with a conventional roast turkey. The turkey tasted pretty good and was moist but I thought the gravy tasted weird. Same with the stuffing. I was really looking forward to this based on the great reviews but thought it was just OK.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Acookfromdallas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675188/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Turkey Brine",
            "description": "This brine infuses your bird with flavor and makes it moist.",
            "uploadDate": "2012-10-23T00:39:39.869Z",
            "duration": "PT2M54.383S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ffa2bffa3-6710-4cd4-b968-f20107b331c4%2Ff5515fe8-a229-4000-8f5a-f2209e866787%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1918368076001"
        }
    }
]