[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17805/soups-stews-and-chili/soup/vegetable-soup/cauliflower/",
                    "name": "Cauliflower",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69635/low-carb-cauliflower-leek-soup/",
        "name": "Low Carb Cauliflower Leek Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F429094.jpg",
            "width": 5184,
            "height": 3456
        },
        "datePublished": "2020-03-10T02:50:42.000Z",
        "description": "A simple yet tasty alternative to potato leek soup. Great for those watching their carbs or calories, or just looking for a different vegetarian soup.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "3 tablespoons butter",
            "3 leeks, cut into 1 inch pieces",
            "1 large head cauliflower, chopped",
            "3 cloves garlic, finely chopped",
            "8 cups vegetable broth",
            "salt and freshly ground black pepper to taste",
            "1 cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil and butter in a large pot over medium heat, and saute the leeks, cauliflower, and garlic for about 10 minutes. Stir in the vegetable broth, and bring the mixture to a boil. Reduce heat, cover, and simmer 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the soup from heat. Blend the soup with an immersion blender or hand mixer. Season with salt and pepper. Mix in the heavy cream, and continue blending until smooth.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Cauliflower"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DRUMNWRITE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.647916666666666,
            "ratingCount": 480,
            "itemReviewed": "Low Carb Cauliflower Leek Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "155.5 calories",
            "carbohydrateContent": "8.3 g",
            "cholesterolContent": "34.8 mg",
            "fatContent": "13.1 g",
            "fiberContent": "2.2 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "346 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-14T22:46:03.6Z",
                "reviewBody": "I just made this soup for dinner and loved it! I did make some personal tweeks. I added roasted garlic cloves, used only 1/2 a cauliflower (that all I had) and used less broth as others had suggested. I also added navy beans instead of cream. They gave it a thick rich texture and added protein. It tuned out to be a real stick to your ribs soup. Perfect for a cold night.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "scollege",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2498774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-02T18:17:07.563Z",
                "reviewBody": "I love this soup and have it for lunch nearly every day. The texture is a bit more thin than a Potato and Leek Soup but that is to be expected in a low carb version and the flavor is outstanding. I now make it with 6 cups of broth instead of 8 but it's great either way. I also wanted to mention that if what you want is potato and leek soup then MAKE potato and leek soup and refrain from giving this recipe a low score because it isn't something that it never claimed to be. It's not rocket science people. Really. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLYFAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/934985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T19:43:07.003Z",
                "reviewBody": "This soup is a great light dinner, if it's for 1 or 2 people, there's plenty of leftovers to take to work for lunch! Low-carb, low-calorie, can be low fat depending on your use of heavy cream. I've made this twice, and I've made a few enhancements I think bring more flavor without adding anything unhealthy: -Roast the cauliflower in the oven - set the broiler to 500, break cauliflower into florets and place on baking sheet; spray with cooking spray and place on 2nd rack from the top. Roast until tips have a nice amount of browning (not burning!) and it's soft (doesn't need to be tender - it will finish cooking in the soup). Roasting enhances the final color of the soup as well. -Roast a thickly sliced shallot with the cauliflower, and add to the soup. -Add a yellow (can use sweet) onion to the pot when sauteeing leeks. -Saute some spices with the leeks/onions - I added fresh ground pepper, ground red pepper, and garam masala (an indian spice) for a bit of smokiness. Experiment! This soup BEGS for spices! -Try half&half or lowfat sour cream spooned over each serving. Tastes just as good. -Garnish each bowl with some thinly sliced chives and a thin drizzle of olive oil.  In all, a good soup, and my first time working with leeks - but use it as the foundation of introducing some spices or fresh herbs you particularly like - it's a little under-seasoned as-is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Matthew F",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2907288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-20T00:22:19.097Z",
                "reviewBody": "I only used two ginormous leeks and organic chicken broth because that was what I had on hand. I sauteed two chopped zucchini with the garlic and leeks because I had to use them or lose them. I only pureed the cauliflower and chicken broth which meant I had to cook them seperate in another pot. It didn't take 45 minutes, more like 15. I gave it a taste without the milk and I thought it didn't need it, just a little more spice (onion powder, garlic powder, red pepper flake, rosemary). I threw in about a cup of chopped ham because I had some I needed to use. Really yummy. It totally makes you think you're having potato soup when you aren't. This is going to be a treat for me this week. Thank you for sharing! EDITED: And yes, this soup is even better the next day. It's totally like potato soup. It's fauxtato soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-09T16:12:01.437Z",
                "reviewBody": "This recipe was really easy.  I didn't have any vegetable broth in the house, so I used chicken stock and it came out great.  I also mixed a few teaspoons of cornstarch in with the cream before adding it at the end.  It thickened up nicely and had a great consistancy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RATHERBCOOKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1045982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-23T19:28:32.577Z",
                "reviewBody": "Excellent!  Normally, I avoid anything marked \"low carb\" like the plague, but gave this one a shot.  Every time I make this, I'm honour bound to bring some in to my staff, as they absolutely LOVE it.  If I don't have three leeks, I substitute an onion.  I also increased the garlic (well, doubled it, really) because I love garlic.  It's fantastic!!  Thank you for sharing the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katzen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-30T08:26:22.637Z",
                "reviewBody": "What a wonderful soup!! After reading the reviews, I used only 6 cups of stock and found it to be just right. It wasn't bad without the cream, but I crave that velvety goodness of cream soups. Use a dusting of curry powder or not; delicious both ways.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gail A. Guild",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/973856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-07T20:55:27.07Z",
                "reviewBody": "Fresh, rich and delicious, and I just couldn't get over the velvety smooth texture of this.  I did add the optional cream, but only half the amount called for and it seemed just right.  I used chicken broth rather than the vegetable broth, again, less than what the recipe directed, about six cups rather than eight.  I'm glad I did, as I wouldn't want to \"water down\" the flavor. Very beautiful, elegant soup, perfect as a starter to our steak dinner, but would be equally as appropriate to accompany a sandwich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-12T01:16:28.743Z",
                "reviewBody": "I am on a lowfat/lowcarb diet so I made the following alterations and it was super healthy and DELICIOUS!\n\n-no butter\n-no heavy cream\n-just enough olive oil to coat bottom of the pan before adding in veggies\n-added dried oregano & red pepper flakes & 1 extra clove of garlic\n-used 5  cups (not 8) of low sodium chicken broth instead of veg broth\n-roasted the cauliflower first in the oven (sprayed it with PAM so it didnt stick to baking sheet.\n\nI found that all these changes made the soup thicker, creamier & quite flavorful with a bit of kick. Without the cream, butter & oil it has little to no fat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lizardnyc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8336128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-05T04:48:57.110Z",
                "reviewBody": "I was looking for a low cal, low carb soup.  After cooking, I split the soup into portions so I could blend it in my blender. After  half of the soup was blended, I tried it. It turned out pretty yucky and bland (I did not want to add the heavy cream). But I didn't want waste the giant pot of soup and all of my effort, so I added half a can of coconut milk and some green curry spice and a bit of yogurt to make a curry-like soup.  To the soup I hadn't blended, I added tomatoes, artichokes and 2 Tbs of pesto and ended up with an Italian veggie soup. This recipe might be a base for a healthy soup, but \"doctoring up\" is needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Mc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450490/"
                }
            }
        ]
    }
]