[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17305/soups-stews-and-chili/soup/vegetable-soup/sweet-potato-soup/",
                    "name": "Sweet Potato Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83992/sweet-and-spicy-soup-with-black-eyed-peas-and-sweet-potato/",
        "name": "Sweet and Spicy Soup with Black-Eyed Peas and Sweet Potato",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F935158.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-10T02:50:48.000Z",
        "description": "Contrasting the flavors of sweet (roasted red bell pepper and sweet potato), spicy (cayenne and crushed red pepper) and earthy (black eye peas) was the inspiration for this dish.  Equally tasty whether served hot or cold.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "½ red bell pepper",
            "1 tablespoon olive oil",
            "1 onion, chopped",
            "1 celery stalk, chopped",
            "2 cloves garlic, minced",
            "1 cup water",
            "1 cup vegetable broth",
            "3 plum tomatoes, chopped",
            "1 (15 ounce) can black-eyed peas, drained and rinsed",
            "1 (15 ounce) can sweet potatoes, drained and cut into chunks",
            "1 tablespoon brown sugar",
            "1 ½ teaspoons cinnamon",
            "⅛ teaspoon cayenne pepper",
            "¼ teaspoon crushed red pepper flakes",
            "1 bay leaf",
            "1 pinch dried thyme",
            "1 pinch dried basil",
            "1 pinch dried oregano",
            "1 pinch dried rosemary",
            "1 pinch garlic powder",
            "1 pinch onion powder",
            "1 pinch mustard powder",
            "1 pinch cumin",
            "1 pinch coriander",
            "salt and cracked black pepper to taste",
            "2 tablespoons chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Set oven to broil. Brush red bell pepper lightly with olive oil, and place cut-side down on a baking sheet. Place sheet under broiler, and broil until pepper is blackened and blistered. Remove from broiler, and when cool enough to touch, peel skin. Chop pepper into bite-size pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large skillet over medium heat. Stir in onion, celery, and garlic; cook until onion is soft and translucent.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix in water, vegetable broth, tomatoes, black-eyed peas, sweet potatoes, and chopped bell pepper. Add brown sugar, cinnamon, cayenne, and red pepper flakes. Add bay leaf, thyme, basil, oregano, and rosemary. Mix in garlic, onion, and mustard powders. Stir in cumin and coriander.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring contents to a boil. Reduce heat to medium-low; simmer, covered, until sweet potatoes begin to disintegrate, about 20 minutes. Season with salt and cracked pepper to taste. Stir in fresh parsley, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Sweet Potato Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "amanda1432"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.366666666666666,
            "ratingCount": 60,
            "itemReviewed": "Sweet and Spicy Soup with Black-Eyed Peas and Sweet Potato",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "134 calories",
            "carbohydrateContent": "24.9 g",
            "cholesterolContent": null,
            "fatContent": "2.4 g",
            "fiberContent": "4.2 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "254.5 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-01T04:12:27.64Z",
                "reviewBody": "This is a very flavorful serviceable weeknight soup. For those who think it a bit odd a similar sweet potato-tomato soup is very popular in parts of the Carribean. Relying on that experience I made a few changes in the ingredients and method of preparation. Agreeing with prior reviews I reduced the cinnamon to 1/2 tsp. because it's naturally assertive eliminated the oregano basil and rosemary since it didn't fit the flavor profile and used canned stewed tomatoes. The powdered onion went too since there was plenty of fresh. I used minced seeded habanero chile in place of the cayenne and crushed red pepper because it's flavor works well with the other ingredients. I sauteed the spices with the onion celery and minced garlic which I doubled. To reduce the sweetness and highlight the sweet potato's natural flavor a bit more I made sure not to buy \"candied\" sweet potato. I used bottled roasted pepper since I had some left over from another dish. I also eliminated the water and used two cups of low sodium broth. Everything was partially hand blended at the end before adding leftover shredded roast chicken in the last five minutes of cooking for a protein boost. Tasty in front of the TV!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Big Rey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1831188/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-09T14:39:23.357Z",
                "reviewBody": "My husband has declared this \"the best stew\". I used fresh black eyed peas and a fresh sweet potato. Since I used fresh veggies I had to increase the veg broth to 3 cups and I was also more generous with the sugar and spices. I also increased the cooking time to about 40 minutes. This was very hearty and easy to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MINDCRUSHER1376",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-08T02:51:18.75Z",
                "reviewBody": "This was awesome! I did make a few changes:Instead of roasting red pepper I cut red yellow and green peppers into chunks and sauteed then with the onions I substituted 1 can of stewed tomatoes for the plum tomatoes. I added 1 large minced thai chili pepper instead of cayenne. I added a little bit more cumin than a pinch (probably 1/4- 1/2 tsp). I simmered it for an hour to really bring out the flavors. I blended it with a hand blender for about 5 seconds just to make the broth a little thicker. I also sprinkled it with asiago before serving. Definitely a good recipe! This would probably make a yummy crock pot soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BROOKSIE1920",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/859722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-04T18:18:39.57Z",
                "reviewBody": "Wow so so so good! I followed \"Big Rev\"s suggestions of reducing the cinnamon leaving out some spices sautéing the spices with the onions adding chicken and skipping the water and using all broth. I still think there should be more broth so I'd probably go with 3 cups next time. I did not add the bell pepper (I am allergic) and I did not have Cumin or coriander so I substituted with a pinch of curry powder which has both in it. I also used a fresh sweet potato instead of canned (just simmer it 45 minutes instead of 20). I found in my store's produce section \"reconstituted\" black eyed peas (brand name Melissa s) which basically just saved me having to soak the dried peas overnight (I don t like the canned version). All in all this was a tasty dish and I plan to make it again for a dinner party in a few weeks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1743100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-24T19:03:59.14Z",
                "reviewBody": "Beautiful! Thank you Big Rey for your review as I took your lead and I'm so glad I did. I used vegetable broth instead of water; didn't have any stewed tomatoes on hand so used diced and used roasted red peppers. I can't imagine how it would taste if I used any more than 1/2 tsp of cinnamon. That was enough. Once it was done I pureed half of the soup it looks smells and tastes absolutely wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chari Campbell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/936896/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-15T03:56:28.45Z",
                "reviewBody": "This sounded strange but was absolutely great. I was very pleased with the soup which was easy to prepare and my family liked it. Made for really delicious lunch the next day after the flavors married overnight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ICEMAKERSDAUGHTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1279435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-30T20:48:14.733Z",
                "reviewBody": "This was great. To enjoy this recipe you need to like flavor-intense tastes. I took the advice of other reviewers and cut the cinnamon to about 1/4 teaspoon and it was plenty. I also found more water was needed so added about an extra cup. Thanks for the delightful recipe!I will certainly make it again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mimi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2139317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-12T23:27:32.547Z",
                "reviewBody": "This recipe was absolutely delicious! Even my husband who HATES sweet potatoes liked it! I did make a few changes but nothing major. I just omitted some of the spices and per my dad's suggestion had some Hot Madras curry powder on the table so diners could season their stew to taste - the curry powder really did add just the right flavor. The spices I kept were the bay leaves garlic (fresh) thyme rosemary (fresh) brown sugar cumin salt red pepper cayenne pepper and parsley as garnish. I think next time I may substitute cilantro for parsley. I also just sauteed the red pepper rather than baking it to draw out the sweetness because I just don't have the patience for that. This soup is savory sweet and not overly complex with some spices omitted. Thanks to AMANDA1432 for submitting this recipe! It's brilliant!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie Barnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1358960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-16T22:34:42.87Z",
                "reviewBody": "I completely agree with the other reviewers - what on earth was up with that huge list of spices? I focused only on the sweet and spicy stopping after the red pepper flakes but I did throw in about a teaspoon of freshly ground cumin. Being a cinnamon fanatic the amount didn't bother me but I do see how others would have found it overpowering. Nonetheless the soup was really quite good - I pureed it a bit and served it with some Greek-style yoghurt. Very tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SwissMiss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/327817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-06T16:53:33.577Z",
                "reviewBody": "Sorry I'm not a fan of this one. There's too much going on with all the different spices; I think you need to pick a set of spices that compliment each other rather than using a pinch of everything. Also the cinnamon was a bit overwhelming. Will not be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ESTEPHAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1180947/"
                }
            }
        ]
    }
]