[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
                    "name": "Seafood Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13297/main-dish/seafood/halibut/",
                    "name": "Halibut",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/170582/hazelnut-crusted-halibut-with-garlic-mashed-potatoes/",
        "name": "Hazelnut Crusted Halibut with Garlic Mashed Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2966761.jpg",
            "width": 1052,
            "height": 960
        },
        "datePublished": "2020-03-10T02:51:26.000Z",
        "description": "This is a lovely meal of pan roasted halibut with rich and creamy garlic mashed potatoes.  A true romantic meal for 2!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "1 pound red potatoes, cut into chunks",
            "5 cloves garlic, minced",
            "½ teaspoon salt",
            "3 tablespoons butter",
            "¼ teaspoon ground black pepper",
            "¼ cup hazelnuts",
            "¼ cup seasoned bread crumbs",
            "2 halibut fillets",
            "¼ teaspoon salt",
            "1 tablespoon olive oil",
            "1 tablespoon butter",
            "5 tablespoons butter",
            "3 tablespoons vegetable broth"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the potatoes into a large pot, and cover with water. Bring to a boil over high heat; reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. While the potatoes are boiling, mash the garlic with 1/2 teaspoon of salt into a smooth paste. Drain potatoes, then mash together with the garlic paste, butter, and pepper. Keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 500 degrees F (260 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the potatoes are cooking, Preheat an oven to 500 degrees F (260 degrees C). Pulse the hazelnuts and bread crumbs in a food processor until finely ground, but not ground into a paste. Pour onto a shallow dish. Season the halibut fillets on both sides with 1/4 teaspoon of salt. Gently press one side of the halibut fillets into the nut mixture, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil and 1 tablespoon of butter in an ovenproof skillet over medium-high heat. Place the halibut fillets nut-side-up into the skillet; cook until the halibut begins to brown, 3 to 4 minutes. Turn the fillets over, and place into the preheated oven. Bake, nut-side-down until the fish flakes easily with a fork, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the remaining 5 tablespoons of butter in a small saucepan over medium-high heat until it turns nut brown. Stir in the vegetable broth, and bring to a simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, mound the potatoes onto the center of each dinner plate. Place a halibut fillet on top of the mashed potatoes nut-side-up, then drizzle with the browned butter sauce.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Halibut"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JasLak"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.666666666666667,
            "ratingCount": 21,
            "itemReviewed": "Hazelnut Crusted Halibut with Garlic Mashed Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1038.4 calories",
            "carbohydrateContent": "52.4 g",
            "cholesterolContent": "191.2 mg",
            "fatContent": "73.9 g",
            "fiberContent": "6.6 g",
            "proteinContent": "45 g",
            "saturatedFatContent": "35.4 g",
            "servingSize": null,
            "sodiumContent": "1652.6 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-07-20T20:51:19.07Z",
                "reviewBody": "I have minor criticisms of this recipe and made minor changes - nevertheless it is a wonderful dish Hubs and I both enjoyed. The potatoes are perfect just as written. The recipe doesn't specify, but for color and interest I didn't peel them and added chopped fresh parsley at the end.  Don't be tempted to just boil the garlic along with the potatoes - you'll lose a lot of flavor!  I used the ground hazelnuts on half the filets, ground almonds on the other and Hubs and I agree the almonds were the clear winner. I love hazelnuts but in our view they're too sweet to coat fish with. I made my own fresh bread crumbs, seasoning them lightly with an Italian seasoning blend. I used grouper filets and brushed them with olive oil before coating them on both sides with the nut/bread crumb mixture. Because my filets were thin I didn't bother to finish cooking them in the oven - a few minutes in the skillet on both sides cooked them perfectly.  The browned butter was a nice touch, but we agreed we could have done without it. I don't think it makes that much a difference in taste and all that extra butter just wasn't necessary.  Omitting it would not diminish the dish and would save a lot of calories as well as an extra step in the preparation. I served this with fresh asparagus which was the perfect complement and made for a beautiful presentation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T17:31:02.457Z",
                "reviewBody": "Delicious!! The crust on this halibut is so so good! I loved the mashed potatoes because I love garlic but some of you might want to cut down from 5 cloves but if you love buttery garlicy mashed potatoes with tender halibut you will love this recipe! This is my new favorite and I can't wait to try this out on other fish. Loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Waltrip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-01T21:05:20.003Z",
                "reviewBody": "I never had halibut before and it was delicious with this recipe. I had bought frozen halibut from Costco and defrosted it in the refrigerator over night. I did almost exactly what the recipe says except I used only about 4 tablespoons of butter and for the broth I dissolved a knorr's vegetable bullion cube and used about 4 tablespoons of that. I wish I had used more broth it was very tasty with the browned butter. The recipe calls for 2 halibut steaks I made 3 so I thought I would need to increase the nut/bread crumbs so I made 1/3 cup of each it was way too much the regular recipe is enough for at least 4 steaks. Overall it was an excellent dinner; and it was so easy and quick to make. I will definitely make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3966062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-04T17:53:54.257Z",
                "reviewBody": "This review was based on the fish only as I didn't make the potatoes as directed. I also omitted the browned butter as I felt it wasn't really necessary. That being said this fish recipe was excellent. I made this for hub's birthday after he came home with 30 lbs of halibut from an Alaskan fishing trip. I ended up cooking the fish in the pan completely rather than finishing in the oven - this is partly b/c I don't have an oven-safe skillet but also b/c I didn't feel it necessary. I served with another garlic mash recipe from this site steamed asparagus and the beet salad from this site. We both LOVED it. NOTE: The recipe as written will leave you with a lot of extra bread crumb/nut topping. I kept the leftovers in ziplock bag and made this again a week later with following variations: preheat oven to 450 degrees F. Line a cookie sheet with foil and spray with nonstick cooking spray (easy cleanup). After rinsing filets pat dry and sprinkle w/ salt. Lightly dredge in flour then dip filets in milk then pat into nut mixture. Place nut side up on cookie sheet and place a pat of butter on top of each filet. Bake for 8-15 mins depending on thickness (ours took about 15 mins as they are close to an inch thick). This version turned out excellent too but was a little easier. I still had left over topping and used again for chicken (in the oven) - yum!!! Overall - fantastic recipe that will become a staple in our house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peytonje",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4887869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-27T21:13:18.81Z",
                "reviewBody": "I am only rating the halibut....and it was great! I used panko bread crumbs because I like a nice crisp crust. It turned out perfectly. My 3 yr old kept shoving it in his mouth. I'm always looking for new ways to jazz up fish so this is a keeper! Thanks for sharing this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2795370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-25T02:04:22.577Z",
                "reviewBody": "I made some slight changes both in preparation and in the ingredients. I don't normally like using seasoned bread crumbs only b/c they're rarely seasoned to suit my taste. I switched in some panko bread crumbs (same quantity) and added in 1/2 tsp italian seasoning and 1/2 tsp garlic salt. My fillets were rather large and they wouldn't fit in my saute pan so I lightly greased a casserole dish and then brushed each fillet w/ unsalted butter. I sprinkled the seasoned breadcrumbs on top and baked it for the same time frame w/ the nut side facing up. Since I added garlic salt to the breading I chose not to add garlic to the mashed potatoes. This was a belly busting meal but OH my it was good!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thedailygourmet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thedailygourmet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-31T21:39:47.993Z",
                "reviewBody": "I am rating the mashed potatoes only which I prepared with a different halibut recipe. Overall the potatoes were delicious but I would use slightly less garlic...5 cloves is a lot unless they're all small cloves. I would also add a little bit of milk to make these potatoes creamier. Just add until the consistency is how you like it. Without a bit of milk we found the potatoes too dry. Otherwise I'd rate the potatoes higher.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3908680/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-02T22:16:58.457Z",
                "reviewBody": "Substituted the hazelnuts with slivered almonds and it was fantastic. I also never thought to make a garlic/salt paste to add to mashed potatoes after cooking... it's way better than dropping garlic in while boiling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MATCHBOX825",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/380390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-05T16:05:26.68Z",
                "reviewBody": "Restaurant quality and definately worth trying! Instead of mashing the garlic separetly I boil them along with the potatoes and just mashed them together in my opinion the mashed potatoes are a little dry so I added about 1/3 of a cup of fat free half and half. Used tilapia instead of halibut but I'm sure it's a lot better with halibut next time I'll use that and also didn't have vegetable broth so I used chicken broth. Overall an excellent recipe that we will be having many times in the future.Thanks Jas Bradley for sumitting your recipe. Elvira S.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elvira Silva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3516359/"
                }
            }
        ]
    }
]