[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
                    "name": "Vegetarian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16778/everyday-cooking/vegetarian/protein/",
                    "name": "Protein",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17624/everyday-cooking/vegetarian/protein/seitan/",
                    "name": "Seitan",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/209912/thanksgiving-no-turkey-turkey/",
        "name": "Thanksgiving No-Turkey Turkey",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F275088.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-10T02:51:30.000Z",
        "description": "This vegetarian treat is a beautiful addition to the Thanksgiving holiday table. My family has been making it for years.  You won't even miss the turkey! For a shiny crust, brush pastry lightly with soy milk. To serve, cut straight down through pastry, stuffing, and seitan to make neat 1/2 inch slices. Spoon additional gravy over each serving.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT10H15M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "2 (1 pound) loaves multigrain bread",
            "2 tablespoons margarine",
            "2 carrots, minced",
            "2 large stalks  celery, minced",
            "1 onion, minced",
            "¼ cup chopped fresh parsley",
            "1 teaspoon crumbled dried sage",
            "ground black pepper to taste",
            "5 ½ teaspoons egg replacer (dry)",
            "½ cup water",
            "½ cup vegetable broth",
            "2 (16 ounce) packages chicken-style seitan, cut horizontally into 1 inch thick strips",
            "1 cup garbanzo bean gravy",
            "1 (17.5 ounce) package frozen puff pastry, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Tear bread into 1-inch cubes and place into a large bowl. Let bread dry in the bowl, uncovered, at least 8 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt margarine in a large skillet over medium-high heat. Stir in carrots, celery, and onion. Cook and stir until the onion has softened and turned golden brown, about 10 minutes. Scrape onion mixture into the bowl with the dried bread; season with parsley, sage, and pepper. Whisk egg replacer, water, and vegetable broth in a small bowl until smooth. Pour over bread cubes and gently fold until evenly mixed. Let stand 30 minutes to allow bread to absorb the liquid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil and coat with nonstick cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush seitan with gravy on both sides; arrange overlapping slices on foil in a row, mounding in the center.  Press stuffing mixture around seitan to cover.  Wet hands lightly and press into a neat oval. Roll pastry sheets out to 1/16-inch thickness; arrange, overlapping slightly, to make a large rectangle. Seal edges with dabs of cold water. Drape pastry over mound; trim excess away from bottom.  Use scraps to cut out decorative shapes (leaves, apples, etc).  Attached with dabs of cold water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake until the pastry in deep golden brown, 1 to 1 1/4 hours. Cover the pastry with aluminum foil if it begins to brown too much.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegetarian",
            "Protein",
            "Seitan"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ChristinaW"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.333333333333333,
            "ratingCount": 9,
            "itemReviewed": "Thanksgiving No-Turkey Turkey",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "716.4 calories",
            "carbohydrateContent": "81.7 g",
            "cholesterolContent": null,
            "fatContent": "24.9 g",
            "fiberContent": "12.3 g",
            "proteinContent": "42.6 g",
            "saturatedFatContent": "5.9 g",
            "servingSize": null,
            "sodiumContent": "1124 mg",
            "sugarContent": "8.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-09T17:56:06.01Z",
                "reviewBody": "This recipe from a 1995 Vegetarian Times magazine is a favorite of ours. We now use Quorn Roast instead of the seitan and have played around with the gravy. Gravy is key...make plenty of it for the side too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurie Free",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1594468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T18:05:46.077Z",
                "reviewBody": "That is a wonderful recipe thank you. The seitan gives it a nice consistency unlike the custard like quality of tofu \"turkey\". I usually make the seitan myself from scratch (with plain flour) and cook it in chicken-flavoured vegan broth to give it the required taste. I'm having a dinner party next week and can't wait to surprise my vegan vegetarian and meat eating friends.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gabriella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4211271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-10T03:19:06.793Z",
                "reviewBody": "We aren't vegetarians or vegans but we're looking to expand our palates by eating healthier. This was very delicious and was a healthier bow to the typical Thanksgiving main course. Hints & suggestions - Puff pastry at my local market comes frozen. Plan ahead - place it in the fridge 24 hrs. before you need it (I did not try the \"quick thaw\" method so I cannot tell you if this dries it out. It was just more convenient for me to put in the fridge 24 hrs. before I needed it). I'd also suggest using only 1 maybe 1 1/2 loaves at the most of the multi-grain bread and at least 1 more 16 oz pkg. of seitan. For our taste it was simply too much stuffing and not enough seitan. Plan ahead and use your food processor - place the bread in the processor and lay out on a jelly roll pan overnight. Then place it in a storage bag until you're ready for it. I omitted the margarine and put the carrots celery onion and parsley together in the processor then dumped it in an XL (read: very large) bowl with the bread and omitted cooking the veggies entirely. Also for the egg replacer 5 1/2 tsp. is almost 2 Tbsp (1.8 Tbsp. to be exact). I purchased 2 dried vegan gravy mixes at my local natural foods store (I could not find garbanzo bean gravy mix); next time I'll make sure I'll have 4 envelopes agreeing with a previous reviewer that gravy is the key. Serve with a big bowl veggies and it's a wonderfully healthy and complete meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mesa Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4757764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-21T20:53:37.89Z",
                "reviewBody": "very yummy. shared with strict carnivores and even they complimented the taste wasn't sure of the texture but they loved the taste and tolerated the texture of tofu.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "v~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3765230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-28T01:19:06.277Z",
                "reviewBody": "I made this for Thanksgiving this year and it was a huge hit with vegetarians and meat eaters alike! I purchased shredded seitan by mistake but it worked out well and I will do it the same way next year. I used a 9 X 13 pan with a layer of chicken style shredded seitan chunks with garbanzo bean gravy a layer of stuffing another layer of seitan and gravy then topped it with the puff pastry. When it was done it was easy to cut and serve in pieces (much like a casserole). I think the texture of the shredded seitan is easier to deal with for meat eaters as it is a bit like the texture of actual Turkey. Fantastic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ArethusaRay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8231128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-28T13:19:51.173Z",
                "reviewBody": "Yes!!! This was such a good meal for my Thanksgiving table. My sister and I were the only vegetarians so I halved the recipe- it was so wonderful! I only did a couple minor things differently. Real butter of course. Real eggs. I didn't sit the bread out to dry all night. I just set it in the oven for a bit to dry it out. It worked perfectly and allowed me to prepare everything the-day-of. And I bought an organic roll-out croissant dough as opposed to the puff pastry. This made it sooo good. This meal came out so tasty I was so proud of myself. And I whipped it all together the morning of thanksgiving with no troubles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pret.White",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10094139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-25T14:13:04.28Z",
                "reviewBody": "Dry and tasteless. I really don't know how this this could be better. I read other's reviews but felt like this missed the mark.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "katrinangel2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/katrinangel/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-30T19:51:18.933Z",
                "reviewBody": "The flavor combinations in this recipe are top notch. There was a bit too much bread involved, however. Don't kid yourself, this recipe is a decadent low nutrient/ high carb/high fat dish that is perfect for indulging. I think I will add extra veggies like parsnips, sweet potato and cabbage so I can eat it more often without too much guilt. \nPs, chickpea gravy is a breeze to make, don't even bother with those tiny packets at the store: sautee onion and garlic, add chickpea flour (by it at the Indian store to save a few bucks), add water and a bit of soy sauce for color. I made an entire sauce pan full and just slathered my food in gravy. Mmmm, so good yet so bad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nanka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2998720/"
                }
            }
        ]
    }
]