[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/758/desserts/candy/nut-candy/",
                    "name": "Nut Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228784/brown-sugar-fudge/",
        "name": "Brown Sugar Fudge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4505202.jpg",
            "width": 4128,
            "height": 2322
        },
        "datePublished": "2020-03-05T05:09:26.000Z",
        "description": "I  love this recipe for fudge. Nice and creamy texture. I like to double up on the nuts to take away from the sweetness. This fudge recipe has always worked for me as long as I boil for exactly 10 minutes and beat for exactly 5.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "3 pounds",
        "recipeIngredient": [
            "3 cups brown sugar",
            "¾ cup evaporated milk",
            "1 cup butter",
            "2 cups confectioners' sugar",
            "1 cup chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease an 8x8-inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring brown sugar, evaporated milk, and butter to a boil in a large saucepan; boil mixture for exactly 10 minutes. Remove from heat and add confectioners' sugar. Beat fudge with an electric mixer on medium speed for exactly 5 minutes. Stir in walnuts. Spread fudge into the prepared pan and let cool before cutting into squares.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Nut Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kath"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.30379746835443,
            "ratingCount": 79,
            "itemReviewed": "Brown Sugar Fudge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "82.4 calories",
            "carbohydrateContent": "11.1 g",
            "cholesterolContent": "8.5 mg",
            "fatContent": "4.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.5 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "25.5 mg",
            "sugarContent": "10.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-01-18T23:47:58.133Z",
                "reviewBody": "I would like to say that I love to bake and love fudge. That being said, I was a fudge virgin and had never made it before. The author of he recipe negated to disclose how high do you heat the fudge? I boiled for 5 minutes on high, and my fudge burnt. I am sure, that had I known you do not cook fudge on high on the stove, that this recipe would have turned out. This information should have been disclosed in the cooking instuctions. The rsult: an 8\"x8\" dark brown brick(not kidding, I could not even score the surface with a knife)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Bennett-Lambert",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7252257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-18T15:45:51.06Z",
                "reviewBody": "This recipe has eluded me for years. My mom made it for years and lost it! This is exactly what I was looking for. I agree with the member who boiled it for 10 minutes and stirred for 5 minutes. Turns out perfectly. Just like I remember!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bobkat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4673780/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-29T06:52:59.183Z",
                "reviewBody": "This recipe turns out great every time.  You need to use a timer.  DO NOT just guess.  If you want to be even more precise, you need to use a candy thermometer and boil the mixture to 238 F.  Soft ball stage.  If you use a thermometer, you don't need to time it.  :)  I use less confectioners sugar - more like 1.25 cups.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Drew",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7806101/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-28T06:09:45.38Z",
                "reviewBody": "This turned out perfectly! I used to make a similar fudge a long time ago, but had lost my recipe. This was a little different, as I know I never used confectioner's sugar. The recipe is simple and the timing directions are easier than temperature testing or soft-ball judging. I followed the directions exactly and used the fudge and a gift to my sister, who used to make brown sugar fudge with me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "enkidu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8120865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-23T02:36:25.327Z",
                "reviewBody": "I have been making different types of fudge religiously for 20+ years and swear by the importance of a candy thermometer.  Despite the fact that this fudge came out runny-ish-despite using a candy thermometer  at soft ball stage and freezing for several hours-- the taste was insanely amazing.  Like the most perfect taste ever. I am totally making this again; however, the next time I make it, I will make the following adjustments: A. Don't boil it on high high heat and B. cook it until I hit between soft and hard ball stage on the thermometer- I think because there is so much butter in this, it sets different than any other fudge that I have ever made.  As an additional note, after setting for an hour or so-- it could be the most perfect frosting ever.  Two other modifications that I made to put it over the top, instead of the total amount of conf sugar, I added half a cup of marshmallow and a cup of conf sugar.  This gave it a creamier appearance and less sicky sweet. Lastly, I added a few dashes of sea salt and chopped Heath bar on top- the flavors matched the fudge perfectly.  This is a great recipe, the cooking is tricky as it is with fudge generally.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen Cahill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12499720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-24T01:03:11.463Z",
                "reviewBody": "Excellent tasting and very easy to make.I've made 6 batches in the last 24 hours to give away to co-workers. I did struggle to make the 1 inch cubes retain their shape when putting in gift boxes.     After trying to cut it at room temp, at semi-chilled and totally refridgerated- I concluded that the fudge cubes turned out perfect-shaped when 100% refridgerated. Note: they were very hard to carve at 35 degrees so please be careful with the knife! Just go slow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "silkakc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12655450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-12T06:08:59.74Z",
                "reviewBody": "You have to forget about the time and use a thermometer 238 degrees is what it needs",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alicia Harper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17473281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-11-15T09:24:20.39Z",
                "reviewBody": "\"Penuche!\" Love love love this. \n1. cook on medium or med./low; not high.\n2. boil the mixture to 238 F. Soft ball stage\n3. use parchment paper \n4. delicious with walnuts, pecans, both or neither!\nTHANK YOU for this recipe. My kids make it now ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wrajhm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4681410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-19T10:56:55.057Z",
                "reviewBody": "Mine is not cooled yet but I can tell it will be exactly what I have been looking for (I make other fudge a lot so I can tell it will firm nicely and I tasted it and the flavor is perfect).  \nWhen I used to work in restaurants, the cooks made this fudge quite often. I had not been able to find any like it until now.  I had been looking in Latin stores, etc... I thought it was called Mexican Fudge but the kind I found at Latin stores/markets just hasn't been very good to me.  Trader Joe's sells something similar and they call it English Butter Fudge (it is delicious!!).\nAll I did differently from this recipe was stir some vanilla into it by hand after I mixed it with hand mixer because I am a vanilla fanatic!  I read others' reviews so what I also did was time it and use a thermometer.  After 10 minutes it had not reached the normal soft ball temp per my candy thermometer so I cooked it a tad bit longer to make sure it would not be too soft.  It never reached the desired temp.  Also, I made sure it didn't boil really hard, kept it at a lower to medium-ish  boil and stirred once in a while - don't think it needed the stirs though. I beat it exactly 5 mins. with hand mixer.  I did not use any walnuts because my husband doesn't like them and the cooks never added them either.\nA TIP: \nI always line my pans with foil and then butter the foil - makes it so much easier to get out (I take it out in one whole piece) and cut up. And you also don't scratch your pans by cutting it in them",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BakerBee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11009882/"
                }
            }
        ]
    }
]