[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/230317/hoppin-john-with-greens-slow-cooker-recipe/",
        "name": "Hoppin' John With Greens - Slow Cooker Recipe",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1082712.jpg",
            "width": 3264,
            "height": 2387
        },
        "datePublished": "2020-03-10T02:51:52.000Z",
        "description": "This is a traditional Southern dish for bringing good luck into the New Year, consisting of black-eyed peas and rice. Eating Hoppin' John on New Year's Day is thought to bring a prosperous year filled with luck. The peas are symbolic of pennies or coins, and a coin is sometimes added to the pot or left under the dinner bowls. Greens along with this dish are supposed to also add to the wealth since they are the color of money. Eating this the day after represents frugality and savings. You are supposed to leave 3 peas to assure that the New Year will be filled with Luck, Fortune and Romance. Serve hot with corn bread.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT7H0M",
        "totalTime": "P0DT7H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup dried black-eyed peas, sorted and rinsed",
            "1 cube vegetable bouillon",
            "¼ cup hot water",
            "1 onion, chopped",
            "1 clove garlic, minced",
            "1 smoked ham hock",
            "2 bunches collard greens, chopped",
            "1 tablespoon dried oregano",
            "1 tablespoon red pepper flakes",
            "2 cups vegetable broth",
            "5 cups water, or as needed to cover",
            "1 cup long-grain white rice",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cover black-eyed peas with water in a large soup pot, bring to a boil, and boil for 2 minutes. Reduce heat to low and simmer peas for 1 hour. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve vegetable bouillon cube in 1/4 cup hot water in a small bowl; pour bouillon into slow cooker. Stir black-eyed peas, onion, garlic, ham hock, collard greens, oregano, red pepper flakes, and vegetable broth into the cooker. Add 5 cups of water or as needed to cover. Cook 5 hours on High. Stir rice into stew and cook 1 more hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove meat from ham hock, chop meat, and return to stew. Season with salt and black pepper.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tanya E"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 23,
            "itemReviewed": "Hoppin' John With Greens - Slow Cooker Recipe",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "341.8 calories",
            "carbohydrateContent": "51.1 g",
            "cholesterolContent": "22.7 mg",
            "fatContent": "8.5 g",
            "fiberContent": "10 g",
            "proteinContent": "16.6 g",
            "saturatedFatContent": "2.7 g",
            "servingSize": null,
            "sodiumContent": "204.7 mg",
            "sugarContent": "5.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-01-02T07:11:15.947Z",
                "reviewBody": "This is pretty tasty stuff, but I admit, I had to change it. I don't like to review when I make a change, but this one's special... Tanya, please, if you get the chance, include the crock pot volume in the recipe. I am an amateur at slow-cookers, but I do have one... I think it holds maybe 3-4 quarts. Weeell that was NOT big enough, so the change I made was obvious: I had to dump it all into a big pot and cook it on the stove. I did the usual, bring it to a boil, put on a lid and turn down the heat to low. It took about 2-3 hours roughly because I wasn't in any hurry and I wanted the flavors to blend well. I still just used one ham hock though I added 2 teaspoons of bouillon. Oh, and I used one bag of fresh cut collards to save effort. Nothing real drastic... except that I used brown rice. Since I was taking my time cooking it, the extra cook time for brown was insignificant and might help with that mushy rice problem (seriously? She threw away the whole thing because of the mushy rice?). But it's essentially the same dish, cooked on the stove because I am bad at volume. It beats a review by some culinary troll who never made a recipe but slaps 3 stars on it to tell the internet (at the expense of others) the shocking revelation that it's faster to open cans. Why were you even looking at slow cooker recipes? Next time, put your own recipe up legit and quit being a parasite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLAACKBIRD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/193652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-07T15:41:35.58Z",
                "reviewBody": "Vegetarian version: Used a couple drops of Liquid Smoke to replace the meat flavor. Used kale because that's what I had. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Racedogmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/racedogmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-02T19:21:51.617Z",
                "reviewBody": "This recipe was very good. My husband who is not a fan of beans of any kind really liked it. Very flavorful. My changes were soaking the black eyed peas for 24 hours before. Threw it all in a a 3-4 qt crockpot the greens cook down plenty of room you just stuff it all in there) I would have used 2 ham hock instead of one for more meat. I put in some diced ham leftover from Christmas. I forgot to add the rice so I didn't have the mushy issue. I would just make it on the side to be safe. 1 tablespoon of red pepper flakes is way too much. I only did a half teaspoon and that's plenty. I used chicken broth which gives more flavor than vegetable. It was easy fix it and forget it. Tasted even better the next day. Will make again. I used a sweet cornbread recipe as it contrasted nicely with the spiciness of the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rmf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10051076/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-28T00:34:33.397Z",
                "reviewBody": "This is a good basic Hoppin'John Recipe and isn't hard to make and if it is anything like others I have tried will be even better tomorrow than today! Serve with good Southern cornbread (no sugar in it please) to sop up the juices! Thanks Tanya E!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HYPATIA1219",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/403216/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-02T22:57:24.34Z",
                "reviewBody": "Yes I made this for New Years 2013 and it's the very best Black Eyed Peas recipe that I've ever tried. I didn't even know what collard greens were! This is such a satisfying dish; gives life to the previous recipes that I've tried. My husband loves it and agrees: this is the best recipe ever for black eyed peas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wolverton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3428809/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-01T16:28:38.457Z",
                "reviewBody": "I added 1 C chopped leftover ham... The rice turned to mush and the beans weren't quite done. I would definitely add the rice about halfway thru or cook separately and add at the end. I added bay leaf 1/2 large onion chopped garlic powder and red pepper flakes but it needed a bit more seasoning at the end for me...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "WRKNMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/47180/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-28T17:03:17.34Z",
                "reviewBody": "Haven't got the time. Opened a little can of chunk ham a can of black-eyed peas a can of collard greens and a cup of instant rice. dumped it all in a bowl. Added a tablespoon of butter a little dried onion garlic salt and pepper. Zapped it in the microwave 5 minutes. Slopped it into my little crockpot and ran out the door to the potluck. Time we ate it was just right. I didn't reveal my secret!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherry Shelton Davis-Dodd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2752073/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-17T00:45:23.35Z",
                "reviewBody": "Made it Great New Years meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Don Payne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11727035/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-05T12:59:44.927Z",
                "reviewBody": "I'd rate my first attempt at this as a 4 1/2 stars. I made two changes. 1. I used Kale as opposed to Collard Greens and 2. I used Kielbasa AND ham hocks. Broke my golden rule-Cooked something first time for other people. 20 adults on a Scout camp out. Two suggestions 1. Use spicy Kielbasa and make sure it stews for at LEAST one hour preferably 2 for the ham hocks. Might want to tweak the spices too. It lack some depth of flavor which I think the spicy kielbasa and additional stewing would help greatly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rad954",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13169304/"
                }
            }
        ]
    }
]