[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
                    "name": "Vegetarian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16778/everyday-cooking/vegetarian/protein/",
                    "name": "Protein",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17624/everyday-cooking/vegetarian/protein/seitan/",
                    "name": "Seitan",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/238521/basic-seitan-wheat-meat-vegan-meat-substitute/",
        "name": "Basic Seitan - Wheat Meat (Vegan Meat Substitute)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3975752.jpg",
            "width": 4608,
            "height": 3072
        },
        "datePublished": "2020-03-10T02:52:12.000Z",
        "description": "I've used seitan for many things, from sandwiches to stir fries and this recipe is the best I have ever used.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "3 servings",
        "recipeIngredient": [
            "1 cup vital wheat gluten",
            "3 tablespoons nutritional yeast",
            "½ cup vegetable broth",
            "¼ cup liquid amino acid (such as Bragg®)",
            "1 tablespoon olive oil",
            "1 ½ teaspoons minced garlic",
            "4 cups vegetable broth",
            "4 cups water",
            "¼ cup tamari"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir vital wheat gluten, nutritional yeast, 1/2 cup vegetable broth, liquid amino acid, olive oil, and garlic in a bowl until ingredients come together into a ball. Knead ball until dough has a rubbery texture. Divide dough into 3 equal pieces and shape into 1/2-inch thick patties.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring 4 cups vegetable broth, water, and tamari to a boil in a large pot. Carefully place patties into boiling broth; cover pot and return to a boil. Set lid slightly askew to vent steam and reduce heat to low. Continue simmering patties until firm, turning patties occasionally, about 1 hour. Remove pot from heat and set lid aside. Allow patties to cool in broth for 15 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegetarian",
            "Protein",
            "Seitan"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Deborah Mackenzie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.652777777777778,
            "ratingCount": 72,
            "itemReviewed": "Basic Seitan - Wheat Meat (Vegan Meat Substitute)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "303.7 calories",
            "carbohydrateContent": "27.8 g",
            "cholesterolContent": null,
            "fatContent": "5.6 g",
            "fiberContent": "3.7 g",
            "proteinContent": "35.8 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "2911.8 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-08-09T03:29:07.967Z",
                "reviewBody": "My husband has recently become vegan and I am allergic to soy, so finding a good seitan recipe was a necessity. After looking at many recipes on line and in cook books, I decided to try this one. There was only one ingredient I didn't already have in my cupboard and it looked in line with other recipes I saw. My husband and I loved it. We ate it solo just as a snack (it really tastes that yummy), we made pan fried coconut seitan balls, taco filling, and used the left over bits and broth for a soup...so it is also versatile and able to take on flavors of many types of cuisine. My only complaint is that I should have doubled the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kate Belle James",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6066468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-18T10:06:49.687Z",
                "reviewBody": "I am a young chef and newly appointed vegan chef (can't stand working with meat). A vegan friend of mine has always made great Seitan and have asked him repeatedly to teach me how to make it. Now that I have found this amazing recipe I am going to shock him. I can't believe how simple it is! Thanks. My question is how do you mould it into a shape when cooking?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bongo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13990225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-21T09:05:44.887Z",
                "reviewBody": "Tried making this twice.  Both times, it has turned into spongy, rubbery garbage. No offense to your recipe; obviously you and plenty of other folks have found success with this; I guess I just failed. I've tried 4 seitan recipes in the past 3 months, and I'm at my wit's end; all 6 test batches have turned out horribly. And, not to toot my own horn, but I will: I'm a really good cook. But obviously I really really suck at seitan lol. Can you (recipe writer) or SOMEONE out there send me the secret tip? Is there something I'm missing? Is it in the kneading? Does the water need to remain below/above a certain temperature (I've kept it at a relatively steady simmer, but sometimes it bubbles too much and other times it stalls for a few minutes with no bubbles)? I've tasted restaurant seitan and it's AMAZING. All the recipes I've tried (including this one--no offense) have been absolutely DISASTROUS.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Tod Kimbro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22451256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-11T15:13:21.22Z",
                "reviewBody": "I live over in Europe and I don't have access to nutritional yeast and Bragg's Aminos. I followed the recipe as best as I could substituting a veggie broth powder and soy sauce. I am very happy with the results. When I would make a different recipe back in the states it would crumble into bits. This held together very well. I found the dough easy to work with and reshaped it after it was chilled to get the right log-look. Something I learned from my grandmother: the same spices you put into the broth you put into the gluten steak dough. You can play around with it as much as you like. I remember once my grandma made a mistake and fried the steaks in a chili oil and they were the most delicious! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kem Helenius",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14187527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-12T06:57:56.56Z",
                "reviewBody": "I made the following changes: I used 1/2 tsp Better Than  Bouillon  No Chicken Base in 1/2c water for the vegetable broth.  I also used Coconut Aminos and added 1/2 tsp poultry seasoning. I formed it into a 8-9 inch log, wrapped tightly in aluminum foil, and steamed for an hour. This makes for a more dense seitan, which I prefer. Slices nicely for sandwiches...I can dice and use in a mock chicken salad. I can also bread it a fry it in oil for a 'fried meat' type dish. SO easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Myra Hudson Key",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15653032/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-23T06:24:17.137Z",
                "reviewBody": "Tried this a few times and perfected it a little. Instead of 4 cups of water i added 2 and then 6 cups of vegetable broth, otherwise the broth is tasteless. Then doubled the nutritional yeast to make it tastier. I was also looking for something that was soy free when i found this recipe so replaced the Amino with coconut amino and instead of  the tamari i added a few drops of Worcestershire sauce. Came out sooooo good! I Def recommend to try it this way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara Sommers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21267356/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-11T00:09:15.193Z",
                "reviewBody": "I made the recipe with the ingredients above used my stand mixer to knead it for 5 minutes on lowest setting put the pieces in the broth mixture that had been brought to a boil then taken down to a 2 on my electric stove (as high as I could go without having any bubbles in the liquid) before I put the pieces in. Cooked covered for 70 minutes checking every 20 or so to make sure it didn't stick. Turned out excellent! Other attempts at cooking in a pot had \"blubbery\" results this was perfectly firm. Flavor is a little bland but that can easily be remedied next time. I was so pleased with the texture! More like \"tofurkey\" than the seitan I get a lot of times in thai restaurants. I feel like I have finally perfected the pot cooking technique (as opposed to steaming or baking). Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Spacle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16878998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-12T22:54:44.577Z",
                "reviewBody": "I love using this recipe. Whenever I make Seitan I use this recipe as a base. I always change it up, depending on the flavor I'm going for, and it always works. There are a few tweeks here and there that I do. I also always bake it when I'm finished for about 35 minutes on 375 (depending on how much I make). I flip it at about 25 minutes. This gives it a slightly harder exterior and REALLY lends itself to tasting more like meat. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marissa Bogdansky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21941001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-10-18T08:00:35.593Z",
                "reviewBody": "I didn't have any liquid aminos or tamari so I sub'd low sodium soy sauce for those parts. I also didn't have vegetable broth so I winged it (pun forthcoming) with some better-than-bullion chicken stock. I also didn't want to wait an hour for it to cook so I rocked it full blast in the electronic pressure cooker for 20 minutes with a lot less liquid than called for and then hit the quick release. The broth tasted oddly similar to matzo ball soup. X Passes the litness test Nah",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Matthew Lissner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14656914/"
                }
            }
        ]
    }
]