[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219159/octoberfest-roast/",
        "name": "Octoberfest Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F728108.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-03-05T05:08:23.000Z",
        "description": "This dish provides a very tender roast with a German flavor appeal. Great served with mashed potatoes or spaetzle. Parslied carrots and red cabbage will make this dish very authentic.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT3H30M",
        "totalTime": "P0DT3H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 teaspoon vegetable oil",
            "1 (4 pound) beef pot roast",
            "2 tablespoons Dijon mustard",
            "1 ½ tablespoons brown sugar",
            "2 cloves garlic, minced",
            "¼ teaspoon ground nutmeg",
            "3 onions, sliced",
            "1 cup beer",
            "1 cup beef stock",
            "salt and ground black pepper to taste",
            "1 tablespoon cornstarch",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a Dutch oven over medium heat; brown the pot roast on all sides in the hot Dutch oven, 2 to 3 minutes per side.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the Dijon mustard, brown sugar, garlic, and nutmeg together in a small bowl; spread evenly over the browned pot roast. Layer the onion slices atop the pot roast. Pour the beer and beef stock over the pot roast; season with salt and black pepper. Cover the Dutch oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast in the preheated oven until completely tender, about 3 1/2 hours. Remove the cover from the Dutch oven during the final 20 minutes of cooking time. Transfer the roast to a platter, and cover with aluminum foil; allow to rest for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the meat rests, whisk the cornstarch and water together in a small bowl; stir the cornstarch slurry into the juices left in the Dutch oven. Place the Dutch oven over medium heat; bring the gravy to a low boil, and cook and stir until thickened. Serve on the side as gravy, or slice the beef and pour over the slices on a platter.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "barb"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.40625,
            "ratingCount": 32,
            "itemReviewed": "Octoberfest Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "541.4 calories",
            "carbohydrateContent": "18.6 g",
            "cholesterolContent": "130.8 mg",
            "fatContent": "32.6 g",
            "fiberContent": "2.1 g",
            "proteinContent": "38.4 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "226.5 mg",
            "sugarContent": "8.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-10-23T21:41:29.547Z",
                "reviewBody": "This is an excellent recipe. The onions that were in the bottom of the pan were brown and savory the ones that cooked on top of the meat not as much--so next time I'll put them all in the bottom of the pan. Other than that no changes...and that's saying something because I almost ALWAYS change something.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheMoodyFoodie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3644166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-31T01:43:39.843Z",
                "reviewBody": "This is an excellent pot roast ( and I thought mine was the best) I do NOT get the reference to a sweet not savory roast by another reviewer because this was a tasty & tender AND NOT SWEET roast. I also do not recommend that anyone eat pot roast rare as suggested by a reviewer. Pot roast is a very tough cut and the long braising and fall apart result is what a pot roast is all about. I would recommend that you salt and pepper the roast before browning because I thought it needed a bit more salt. I would also suggest that you use a grainy or country dijon and NOT a sweetened dijon mustard. The only changes that I made was that I used dark brown sugar because that is all I had. I cooked it covered tightly in a 275 degree oven for 4 hours and it turned out perfect. I did have to add more slurry to thicken the gravy because of all the juices that I had left. Next time I might stir a few crumbled ginger snaps into the gravy to give it an even more pronounced german flavor. This is a winner and I will make this again and again. Thanks so much for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-25T05:15:32.14Z",
                "reviewBody": "I was very disappointed with this, in terms of flavor.  I made this with Sam Adams Oktoberfest, one of my favorite beers but I gave 3 stars allowing for different beers giving different flavors.  Mostly I think I didnt like the brown sugar which gives it a sweetened taste whereas I was looking for something more savory.  I cooked the roast in my slow cooker high for 3 hours cooks it perfectly.  remember it keeps cooking after you take it out so maybe take it out a bit sooner if you light it on the rare side.  Meat was tender, I just didnt like the lightly sweet flavor",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Byrne Wade",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-24T02:00:40.07Z",
                "reviewBody": "I used a 2 lb bottom round roast but kept all other ingredients & cooking time the same. Except for some extra beef broth I added about 3 hours in. At that time I also stirred the onions into the gravy turned the roast over and basted it with the gravy. Since the roast was so lean it definately needed the gravy. The gravy is a real flavorful german style gravy. Will definitely be saving this in my recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPUR95",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/629750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-28T08:48:13.713Z",
                "reviewBody": "My Sweetie-Pi was all aglow with this saying over and over again that it was a keeper as he served himself multiple helpings. I cooked this in the slow cooker for about 3.5 hrs and the roast was fork tender. Served with mashed potatoes and honey glazed carrots. Made a beautiful presentation. Personally I thought the gravy lacked flavor except for the sharp flavor of the ale I used (and as someone else pointed out each beer adds its own unique flavor) as well as the strong mustard flavor. I felt it needed another spice or herb to balance out the flavors perhaps rosemary or ginger? I wish I were better with herbs and how to combine them. Anyway I used my old standby Gravy Master to deep the color and flavor and it helped considerably. Perhaps some Better Than Boullion would have been a good addition. As another reviewer mentioned the onions layered on top of the roast did little for them. Those that cooked in the broth flavored the gravy and gave the onions an appealing appetizing color. Also 1 tablespoon cornstarch and water was not enough to thicken the gravy to my taste so I added more. To me this recipe is a 3 my Sweetie-Pi thinks it's a 5 hence the 4 star rating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KATYPI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2074840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-30T20:43:21.003Z",
                "reviewBody": "So delicious! I made this in a slow cooker on low for 7-8 hours. I followed the ingredients exactly except I used 2 cups of beer (a porter) and left out the beef stock. I added some baby carrots the last 2 hours of cook time so they didn't get too mushy. Served with some mashed potatoes and gravy made from the beef juices. The family really liked this one! Will definitely make again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/arich01/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-23T23:18:09.59Z",
                "reviewBody": "This was terrific! The only thing I did differently was put a mixture of onion wedges carrots and celery on the bottom of the pot then laid the seared roast on top of the mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dave W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2014368/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-04T16:20:51.887Z",
                "reviewBody": "This is fantastic! I made this almost exactly as written - just added a little more mustard to avoid too much sweetness and left out the beef stock (put in more beer for more liquid). With a dark ale this tastes rich & hearty with the mustard really lifting the flavour... And the gravy! Pshew! Yum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke Laurel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2460927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-13T15:14:56.97Z",
                "reviewBody": "This is AMAZING! My kids even loved it... I would call this the BEST roast we've ever had. Will be sharing with all friends and family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sj3kids",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5671199/"
                }
            }
        ]
    }
]