[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/174/soups-stews-and-chili/chowders/",
                    "name": "Chowders",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14770/soups-stews-and-chili/chowders/corn-chowder/",
                    "name": "Corn Chowder Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/167163/roasted-sweet-potato-corn-chowder/",
        "name": "Roasted Sweet Potato Corn Chowder",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9398648.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-03-10T06:51:35.000Z",
        "description": "The great thing about this recipe is that anyone can eat it because it has no meat, dairy, or gluten. It tastes FANTASTIC! Vegans love it, gluten, and dairy intolerant folks love it too. It's a people pleaser!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "10 cups",
        "recipeIngredient": [
            "2 sweet potatoes, peeled and cubed",
            "1 tablespoon corn oil",
            "salt and pepper to taste",
            "1 (12 ounce) package frozen corn kernels, thawed",
            "1 cup water",
            "1 tablespoon corn oil",
            "1 ½ cups finely diced celery",
            "1 cup diced red onion",
            "¼ cup shallot, minced",
            "1 tablespoon tomato paste",
            "½ teaspoon dried thyme leaves",
            "3 cups vegetable broth",
            "1 bay leaf",
            "1 teaspoon salt",
            "1 potato, peeled and cubed",
            "2 tablespoons chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 425 degrees F (220 degrees C). Place the sweet potatoes into a 9x13 inch baking dish, drizzle with 1 tablespoon of corn oil, and season with salt and pepper. Stir to coat the sweet potatoes in oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast in the preheated oven until the sweet potatoes are golden and tender, 15 to 20 minutes. Stir occasionally as they cook so the sweet potatoes cook evenly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, measure out 1 cup of corn kernels and set aside. Place the remaining corn into a blender, and puree with the water until smooth; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the remaining 1 tablespoon of corn oil in a large saucepan over medium heat. Stir in the celery, onion, and shallot. Cook and stir until the onion has softened, about 5 minutes. Stir in the tomato paste and dried thyme leaves; cook 1 minute more. Pour in the vegetable broth, corn puree, bay leaf, salt, and cubed potato. Bring to a boil over medium-high heat, then reduce the heat to medium-low, cover, and simmer until the potato is tender, 25 to 35 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the potato is tender, remove and discard the  bay leaf. Stir in the whole corn kernels, sweet potato, and chopped parsley. Return to a simmer and season to taste with salt and pepper before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chowders",
            "Corn Chowder Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mellie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.462809917355372,
            "ratingCount": 121,
            "itemReviewed": "Roasted Sweet Potato Corn Chowder",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "142.8 calories",
            "carbohydrateContent": "26.9 g",
            "cholesterolContent": null,
            "fatContent": "3.3 g",
            "fiberContent": "4 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "433.6 mg",
            "sugarContent": "5.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-21T22:39:47.91Z",
                "reviewBody": "Very tasty!  I had to make some modifications to fit what I had in the pantry, so my version was only gluten free, not vegan or dairy free.  I did not have shallots or red onion, but yellow onion and 2 cloves of garlic tasted fine to me.  No corn oil either, so I used extra virgin olive oil.  I substituted chicken broth for the vegetable broth.  No frozen corn on hand, so I used 2 cans of the green giant super sweet niblets, drained.  I still reserved one cup, but pureed the rest, which was about 6 oz more corn than the recipe called for.  But really, what can more corn hurt?  :)  Right before serving I put in somewhere between 3/4 and 1 cup of heavy cream.  Not exactly sure as it was whatever was left in the container and I didn't think to measure before I dumped it in.  It was good before I did that, it was over the top after the cream!  I was wishing I had some shrimp to throw in there too, but not this time.  Oh, and I just realized I didn't put in the parsley!!!  Oh well!!\n\nDefinitely a keeper and good enough for company.  One suggestion is to roast 3 sweet potatoes, because they were good enough to eat like candy so not all of them made it into the soup.  Oops!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Vahalik",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2577289/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-18T02:41:23.143Z",
                "reviewBody": "this was fairly easy to make, very tasty and relatively healthy. couldn't find corn oil in the store, so just used vegetable oil b/c i couldn't find my olive oil. it was very flavorful and a nice combo for fall. one thing it could have used was a little kick. i put a few splashes of tabasco in my bowl, which was good, but not sure that was exactly what it needed. my husband thought white pepper may have done the trick. definitely a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MEAUXJEAUX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/439246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-21T02:12:01.737Z",
                "reviewBody": "If you like sweet potato you will love this soup. I used about 1.5 sweet potatoes (mine were huge!) and they took about 30 min to roast but next time I will probably chop them into smaller cubes which should reduce the cook time. I added some hot sauce to mine which kicked up the flavour just a bit. I would definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bandgeek29",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3221814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-11T20:49:13.21Z",
                "reviewBody": "This soup was too sweet - with the sweetness of the sweet potatoes and then the corn. There wasn't really any other flavor going on just the overwhelming sweetness. I agree with the other reviewers who said that something was missing... I might try to take what's left and add a lot more stock and maybe some other veg in effort to cut the sweetness down. UPDATE: I made the recipe to a 'T' and wasn't happy with the results so the next night I browned some fresh good-quality chorizo (from pork shoulder) then added two cups chicken stock crushed red chili flakes chopped cilantro and the juice of 1/2 a lime. I simmered that for about 30 minutes. I then added the remainder of the original soup to my new mixture. The result was fabulous we all agreed and I would make the second version again. I understand however that this is nothing close to the original recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana Moutsopoulos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianamoutsopoulos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T23:42:04.697Z",
                "reviewBody": "With a few modifications our version was delicious! I used a can of creamed corn in place of corn puree and a can of whole corn in the end. I ended up using an extra cup of broth to total 4 cups and there was enough liquid. I also doubled the potato to 2. At the end I used dried parsley in place of fresh and a bit of salt and pepper to spice it up. It was a hearty soup that is great for Fall or anytime!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hukolb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2196355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-24T20:40:49.303Z",
                "reviewBody": "I was a little disappointed in this recipe. There was not nearly enough liquid and he end result was nothing like a chowder. It wasn't even like a stew it was more like a hash. It tasted pretty good (I agree w/ the first review that it was missing something couldn't figure out what) but it just tasted like a bowl of potato and corn hash browns to us. I will probably play around with the recipe adding more broth perhaps creamed corn instead of frozen and maybe some half and half. Thanks for the great idea but we didn't love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1804629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-21T17:33:41.99Z",
                "reviewBody": "This is delicious! I boiled the sweet and regular potato together in the vegetable broth and mixed in one can of regular corn undrained and one can of cream style corn. I thinkened it up with some shredded cheese melted in at the end. The family begged me to make more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LilMama84",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3019412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-25T04:27:24.477Z",
                "reviewBody": "I thought the flavour was delicious! The only problem was that there was not nearly enough liquid especially the next day after more was absorbed. Next time I will double everything except for the potatoes and add green beans and carrots.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Leslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2752697/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T17:40:38.03Z",
                "reviewBody": "This was excellent and so easy! I roasted the sweet potatoes whole (make sure to line oven w/ foil) at 450 for about an hour and then added to the other ingredients that I already had simmering for a while. I didn't have celery used regular onion and garlic no tomato paste and chicken broth. I also did not add a potato or parsley. Very nice flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bsp09",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1526302/"
                }
            }
        ]
    }
]