[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
                    "name": "Rice Side Dish Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/279196/sabzi-polo-green-herb-rice/",
        "name": "Sabzi Polo (Green Herb Rice)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7816946.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-03-14T03:14:55.000Z",
        "description": "Sabzi polo is a classic Nowruz (Iranian New Year) dish brimming with fragrant fresh green herbs and the scent of spring. A fragrant, long-grain basmati rice is optimal here. This version is prepared with a crispy, saffron-tinged lavash tahdig that also acts as a barrier so the herbs don't burn at the bottom of the pot. Enjoy sabzi polo with mahi sorkh shodeh (fried fish), and a side of smoked fish.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "2 ½ cups long-grain basmati rice",
            "kosher salt, divided",
            "¼ teaspoon saffron threads",
            "2 tablespoons boiling water",
            "1 large bunch finely chopped fresh parsley",
            "1 large bunch finely chopped fresh cilantro",
            "1 large bunch finely chopped fresh dill",
            "1 large bunch finely chopped fresh chives",
            "¼ cup dried dill, finely chopped",
            "¼ cup grapeseed oil",
            "1 sheet lavash bread, or as needed",
            "2 fresh spring garlic stalks",
            "¼ cup boiling water",
            "3 tablespoons unsalted butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place rice in a medium bowl and cover with tepid water. Gently swish it around with your finger to activate the starches, then tip the bowl to drain water. Repeat this process until water runs clear, about 7 rinses. Cover rice with cold water, add 1 tablespoon salt, stir gently, and soak for 1 hour. Drain rice without rinsing.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Crush saffron threads to a powder in a small mortar and pestle. Transfer to a small bowl with 2 tablespoons boiling water. Stir, cover, and set saffron water aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a 5-quart nonstick pot with 12 cups water and bring to a boil over medium-high heat. Add 4 tablespoons salt and stir until dissolved. Add rice, stir once gently, and watch carefully as it cooks so water does not boil over. Taste water for salt and adjust accordingly. Cook rice until the first piece pops up to the surface. Set a timer for 4 minutes and cook, scooping off any foam from the surface, until the timer goes off. Test rice and continue to cook until tender on the outside but still firm to the bite on the inside, 6 to 8 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain rice in a colander and rinse quickly with lukewarm water and a spray faucet to rinse off extra starch. Taste rice and gently rinse again if too salty. Set aside to drain completely. Wash and dry the pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine chopped fresh parsley, cilantro, dill, and chives with dried dill in a medium bowl. Gently combine herb mixture with rice in the colander, taking care not to break the grains of rice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the clean pot over medium heat. Add oil, 1 tablespoon saffron water, and a pinch of salt; swirl the pot until the bottom and lower sides are coated with the oil mixture. Trim or tear lavash bread and cover the bottom of the pot to create the tahdig layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently scatter rice-herb mixture over the tahdig in a pyramid shape, making sure lavash is completely covered. Place garlic stalks on top at the outer edges of the rice. Gently poke the handle of a wooden spoon into the rice a few times, being careful not to hit the tahdig; this will allow steam to escape while cooking. Cover and cook until you see steam escaping from the sides of the lid and tahdig starts to set, 10 to 13 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, combine 1/4 cup boiling water with melted butter and remaining saffron water. Lay a kitchen towel out on a heatproof surface.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Test the tahdig by quickly tapping the side of the pot with a wooden spoon. When the pot sizzles, remove it from the heat. Remove the lid and place it on the kitchen towel, being careful that none of the condensation drips into the pot. Wrap the towel around the lid and secure the ends at the top by the handle so they will not hang near the heat source. Drizzle the butter mixture over the rice and cover with the towel-wrapped lid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a heat diffuser on a burner over low or medium-low heat and return the pot to the stove. Cook until crispy, rotating the pot a few times, about 45 minutes. Remove from the heat and place on a damp kitchen towel; let sit, uncovered, for 5 minutes so tahdig will release easily.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Serve the rice on a platter, garnish with garlic stalks, and remove the tahdig whole or in pieces and serve on the side. Or, invert carefully but quickly (like a cake) onto a serving platter.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Rice Side Dish Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Naz Deravian"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "Sabzi Polo (Green Herb Rice)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "286.7 calories",
            "carbohydrateContent": "45 g",
            "cholesterolContent": "9.2 mg",
            "fatContent": "10 g",
            "fiberContent": "1.9 g",
            "proteinContent": "5.9 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "2942.6 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": []
    }
]