[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/153/breakfast-and-brunch/eggs/quiche/",
                    "name": "Quiche",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24148/easy-broccoli-quiche/",
        "name": "Easy Broccoli Quiche",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F09%2F01%2F82760.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-03-20T06:46:52.000Z",
        "description": "This easy vegetarian quiche is a snap to make but looks great on the table.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (9 inch) unbaked pie crust",
            "3 tablespoons butter, divided",
            "1 onion, minced",
            "1 teaspoon minced garlic",
            "2 cups chopped fresh broccoli",
            "1 ½ cups shredded mozzarella cheese",
            "4 eggs, well beaten",
            "1 ½ cups milk",
            "1 teaspoon salt",
            "½ teaspoon black pepper",
            "1 tablespoon butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line a 9-inch deep-dish pie pan with crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 2 tablespoons butter in a large saucepan over medium-low heat. Add onion, garlic, and broccoli. Cook slowly, stirring occasionally, until vegetables are soft. Spoon vegetables into crust and sprinkle with cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine eggs and milk. Season with salt and pepper. Stir in remaining 1 tablespoon melted butter. Pour egg mixture over vegetables and cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until center has set, 30 to 50 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs",
            "Quiche"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "sal"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.314614343707713,
            "ratingCount": 1478,
            "itemReviewed": "Easy Broccoli Quiche",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "388.3 calories",
            "carbohydrateContent": "21.5 g",
            "cholesterolContent": "167.3 mg",
            "fatContent": "26.8 g",
            "fiberContent": "2.2 g",
            "proteinContent": "16.1 g",
            "saturatedFatContent": "12 g",
            "servingSize": null,
            "sodiumContent": "898.2 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-10T01:23:08.467Z",
                "reviewBody": "When Bush the First declared he hated broccoli, it was obvious Barbara had never whipped up an Easy Broccoli Quiche for the old boy.  This is a good recipe which turns out just how I like my quiche--fast, cheap and tasty.\n\nAs for the \"wetness\" and \"wateriness\" issue raised by some other reviewers: Ladies, ladies, ladies!  This problem is easily solved.  First, repeat after me:  \"I will not purchase frozen broccoli.  I will not purchase frozen broccoli.  I will not purchase frozen broccoli.\"  Your turn.  Good, thanks. \n Secondly, do not SPRINKLE in the cheese, put it in first and PRESS it to the bottom of the pie crust, forming a sort raincoat for the crust--a cheese raincoat, if you will.  If you feel silly for not thinking of this yourself, do not despair.  I consider myself somewhat of a wetness expert, for two reasons. First, I reside in the Pacific Northwest, where, when it isn't drizzling, sprinkling or spitting, it's most likely raining, pouring or (on rare occasions) hailing.  As for the second reason I consider myself a wetness expert...I live with a two-year-old.  'Nuff said.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALICEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1122012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-18T18:54:04.647Z",
                "reviewBody": "Most people who gave this recipe a high rating did so with significant changes.  The recipe as written has many flaws.  Even though I used fresh broccoli, mine came out soggy.  One onion is too over powering -- 1/2 an onion is plenty.  Plus, 30 minutes was much too short.  I needed to bake it for 50 minutes for the middle to set and for the crust to get flaky.  The \"Quiche\" recipe on this site does not have any of these problems and can be modified to add broccoli.  I will not be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T00:51:54.577Z",
                "reviewBody": "Thank you!!!  This recipe is excellent!  I have made it twice in the 2 weeks I had the recipe.  My husband and I love it!  I changed the recipe to our taste.  I crisped 4 slices of bacon first.  I used 2 1/4 cups of fresh broccoli, 3/4 of a onion minced (whole onion I thought was too much), 1 bell pepper thinly sliced, 3/4 cup of mozzarella cheese, 3/4 cup of cheddar cheese, 1/2 cup of evap milk, 3 eggs (I don't like eggy quiche), 2 tbls of butter, 1 garlic clove minced, 1/4 cup of cheddar cheese to spread at bottom of crust, 1 homemade pie crust (Stephanie's basic flaky crust at allrecipes).  I followed one of the reviews about cutting down the milk and eggs and also adding the bacon, bell pepper and cheddar cheese.  This made it fantastic!  I also followed one of the reviews and mixed all the ingredients together in a bowl and I sprinkled 1/4 cup of cheedar cheese at the bottom of crust, poured in the contents and let sit in the oven until it set.  If you are not using fresh veges or homemade pie crust you are missing out on the best tasting quiche you have ever had.  Next time I am going to try using other things like, spinach, chicken, etc.  Thanks again.  Be Blessed",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JMLATHAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/812131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T23:02:04.06Z",
                "reviewBody": "Excellent! However, I the result was no longer vegetarian for us as I made a few changes. First, in addition to the 2c broccoli, I added 1/2c fresh sliced mushrooms and 1/2c chopped green bell pepper and sauted them with the onions and garlic in a little butter. I also added 1/2c diced ham. I upped the eggs to 5 and reduced the milk WAY down to 1/2c. Once the eggs and milk were mixed, I added all veggies and ham and poured into the pie crust. I had to bake for apprx 45-50min and the quiche was set but I had no sogginess as a few others had previously mentioned. With a side of hashbrowns, this made for one heck-ova breakfast! Until now, I thought the only person who could make the perfect quiche was my mom....well mom, with this recipe experience...I'm gaining on you! :) Thanks Sara!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:34:27.2Z",
                "reviewBody": "I served this at a ladies' luncheon and it was a huge hit!  I subbed in frozen chopped broccoli, thawed and drained, to make the preparation quicker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-23T11:11:05.217Z",
                "reviewBody": "I made this recipe per the direction of previous reviewers, and that's what my rating is for, not the original recipe here.  I used 3 eggs, 3/4 cup milk, 1 cup broccoli, 1/2 of an onion, and sharp white cheddar.  Mixed all ingredients together before putting in pie crust.  Cooked for about 45 minutes, until cheese turned golden brown on top.  This was delicious and easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/377553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-14T16:49:30.81Z",
                "reviewBody": "Ok this recipe as I made it tasted amazing...so many compliments at our bridal party brunch...however the methods of cooking need to be overhauled. This actually makes 2 quiches. I took two packages of chopped frozen broccoli and microwaved until completely thawed. I added almost 1 onion (smallish so not to overpower) chopped and the butter to a skillet and cooked the onion through. Then I added the broccoli and the garlic. I unrolled both pie crusts in a pack and sprinkled a quarter of a package of shredded cheese over the bottom. Then I added half the broccoli to the pan and covered it with another quarter of the cheese. I beat 2 eggs with 3/4 cup milk and a tad more butter and poured that over the mixture. I tried to season everything with salt, peper and any other herbs I felt appropriate when I was cooking the broccoli. I did the same in the second pan with the other half of the ingredients. I baked for about 30 min but check often because all ovens are different. Was not too much for the pan as some suggested nor was it too wet. I used disposable round cake pans that are a little deeper. If you want to pre bake the crust a couple minutes so to avoid a gooeier crust that may be a good idea. I have no idea how someone could make it the other way it would have been too difficult. Will make many many more times.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Perrelli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1512653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-30T22:14:20.767Z",
                "reviewBody": "Absolutely delicious. I actually didn't have a pie pan, but I wanted to try this pretty badly so I used a 9x9 inch (square) pan, made a pie crust recipe on the site (Stephanie's basic flaky crust), rolled it flat and pressed it into the bottom and sides of the pan. After that I followed the review tips and pressed the cheese on top of the crust before adding the veggies, added a diced red pepper and cut the milk to 1 1/4 cups. Since the 9x9 pan is deeper it took about 50 minutes rather than 30, but there was more than enough filling to fill it, and it was without a doubt the best quiche I have ever tasted... and I've tasted many. Will definately keep this recipe and use it often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1418892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-16T22:34:24.78Z",
                "reviewBody": "Very good my husband loved it!! I cut the milk down to 1 cup and used a 9 inch cake pan instead of a pie plate which was perfect. Instead of putting the broccoli in the bottom I added it into the egg mixture along with 2 1/4 inch slices of chopped up Blackforest ham and I substituted 2 small green onions for the 1 regular onion. I sprinkled half of the cheese in the bottom of the pie crust and stirred the rest into the liquids. I did not find it too wet at all in fact I found it was very easy to slice and serve. The baking time had to be extended to 45 minutes in my oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nadia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677194/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Easy Broccoli Quiche",
            "description": "You won’t believe how easy, and delicious, this vegetarian quiche is.",
            "uploadDate": "2012-06-25T18:17:39.621Z",
            "duration": "PT2M46.083S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ffb9d3d25-41d6-4f63-8795-532774cf90d8%2F8300e242-b30e-458d-b5a5-a367531e235d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1706528244001"
        }
    }
]