[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1227/everyday-cooking/vegan/",
                    "name": "Vegan",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1664/everyday-cooking/vegan/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13977/cherry-cheezecake/",
        "name": "Cherry Cheezecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5959545.jpg",
            "width": 2048,
            "height": 1463
        },
        "datePublished": "1999-08-03T13:32:07.000Z",
        "description": "Great tasting cheesecake...fools even the most ardent dairy fans.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "1 9-inch cheesecake",
        "recipeIngredient": [
            "2 cups graham cracker crumbs",
            "¼ cup real maple syrup",
            "1 (8 ounce) package firm silken tofu",
            "1 (8 ounce) container nondairy cream cheese",
            "1 tablespoon lemon zest",
            "1 ½ lemons, juiced",
            "1 cup confectioners' sugar",
            "1 tablespoon cornstarch",
            "2 tablespoons soy milk",
            "1 (21 ounce) can cherry pie filling"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together graham cracker crumbs and 1/4 cup maple syrup. Press into a 9 inch pie tin.  Bake for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a blender, combine tofu, vegan cream cheese, lemon zest and juice, and confectioners' sugar. Dissolve cornstarch in soy milk, and add to the blender.  Blend until smooth.  Pour filling into crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 minutes at 350 degrees F (175 degrees C).  Reduce heat to 325 degrees F (165 degrees C), and continue baking for 15 minutes, or until set.   Cool on a wire rack, and then chill for several hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Invert onto a plate, and then invert again onto a serving platter.  Pour cherry pie filling over the top, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegan",
            "Desserts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Maureen Cram"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.591836734693878,
            "ratingCount": 49,
            "itemReviewed": "Cherry Cheezecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "365.1 calories",
            "carbohydrateContent": "63.6 g",
            "cholesterolContent": null,
            "fatContent": "11 g",
            "fiberContent": "2.1 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "287.6 mg",
            "sugarContent": "27.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-28T05:35:26.327Z",
                "reviewBody": "Excellent recipe!!! With some fine-tuning -- as per the suggestion of 2 earlier reviews I used less lemon juice and lemon zest than suggested here. I also since I thought the number of serving sizes (4) was too small for my purpose and had a 12 point something ounce package of silken tofu made 50% more by multiplying all the cake ingredients besides the crust the topping or the lemon zest and juice by 1.5 times the amount listed. Almost all of it still fit in the 8 inch glass pie pan I used and it made bigger servings. I did NOT increase the amount of lemon zest or lemon juice however. I kept the lemon zest the same (1 Tbsp.) and actually LOWERED the lemon juice to juice of ONE lemon. My 1.5x version made about 8 or 9 servings though so I think the regular recipe really makes about 6. I also added the vegan all-natural Earth Balance margarine substitute to the crust but still had problems with it -- there was two much of it and it held together but could have been more solid. Also it needed more flavor IMO -- I plan to experiment with other pie crusts. Given all the changes I'm making why am I still giving it five stars? Because the texture and basic flavor alone are worth at least five stars -- this recipe came out INCREDIBLY cheesecake-like and was the most authentic tasting and feeling vegan cheesecake I've had. I think AllRecipes should list it in the regular cheescake files too -- most meat eaters would love it. It's a little less heavy th",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "P Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-23T12:23:27.17Z",
                "reviewBody": "This is an exceptional cheesecake recipe...it is SO good!! Quite delectable--the texture is so smooth and creamy and the flavor is divine--pure cheesecake decadence! The only difference I noticed compared to non-vegan cheesecake is that this one is rich but not too rich--it doesn't sit really heavy in your tummy which is a good thing! My friend is vegan and I made it for her birthday party--I got tons of compliments even from the non-vegans. I tripled the recipe and it fit perfectly in my 9-inch springform pan. I used only 1 lemon and added 1.5T vanilla -- baked for 30 min @ 350 deg. reduced heat to 325 and baked for approx. another hour until the internal temperature of the cheesecake was 165 degrees. Turned off the oven and left it in there with the door closed for another hour and then chilled it for 4 hours (1 hr of that was in the freezer since I was short on time). Finished it off with a homemade blueberry topping--it looked beautiful and was eaten in less than 5 minutes!! THANK YOU for this WONDERFUL recipe:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2093540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-22T13:37:45.263Z",
                "reviewBody": "This recipe would surprise even the most die-hard non-vegans. Yummy and light. Recipe calls for too much lemon juice. I used the juice of one lemon and even that was too much. Next time I will use the juice of one half of a lemon. I found it very difficult to get the crust into the pie pan. It was too sticky -- stuck to my hands rather than the pie tin. Eventually I tried greasing my hands with a little vegetable oil and that helped. Next time I may use margarine instead of maple syrup. Otherwise it was a great dessert and I will definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NADROJ451",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/440313/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-26T13:39:26.263Z",
                "reviewBody": "I am an avid cheesecake fan and I found this recipe to be just as good if not better than the real thing! I made this recipe because my mother-in-law is allergic to dairy and I wanted to surprise her with sweet goodness for Christmas. Everyone loved it and didn't even know that it wasn't the real thing. The only thing that I did different was eliminate the lemon all together and added 2 tbsp of Vanilla instead! I am going to make this instead of real cheesecake from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyLor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2222320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-22T13:37:53.25Z",
                "reviewBody": "This was just amazing! I had my doubts at first and thought I would give it a shot. The crust held beautifully together and so did the 'cheese'. My parents loved it and even had seconds swearing that it tasted just like real cheesecake! It's not as heavy and rich as real cheesecake and so you can always have a second slice or third...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THALEIA6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/174263/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-22T13:37:37.45Z",
                "reviewBody": "Thank you sooo much!!! I have finally found a great tasting vegan cheezecake!!! Yeeeaaaahhhh!!! smile Please do try this it is awesome and everyone I served it to loved it. Absolutely yummy! I would make a couple suggestions though (personal pref.)... Cut down on the lemon rind and juice a bit or it will be too tangy (though the flavor does mellow out the next day) instead of the cherry filling I made a blueberry sauce and I also used a traditional graham cracker crust (I used a vegan margarine if anyone is wondering).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GEMMAONE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/139344/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-22T13:37:51.78Z",
                "reviewBody": "This was a fabulous cheesecake and I will be making it again in the near future. It certainly is a healthier version than the typical \"dairy\" cheesecake. However I have to disagree with EMAZURAK--this is not a vegan cheesecake since the recipe uses white confectioners sugar. Make no mistake though this cheesecake was delicious! I also recommend using fresh cherries if they are available. (Serving w/o the canned cherries on top was still very tasty as well.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WhirledPeas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-22T13:37:54.233Z",
                "reviewBody": "Everyone I've served it to has loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTYLOU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/206402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-13T12:11:38.653Z",
                "reviewBody": "Although the flavor was pretty good this didn't really turn out that well. I may try it again although If I do I'll use a muffin pan to make individual portions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "PALLISON14",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/572817/"
                }
            }
        ]
    }
]