[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/445/soups-stews-and-chili/soup/beef-soup/",
                    "name": "Beef Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/45574/beef-burgundy-style/",
        "name": "Beef, Burgundy Style",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F282353.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-03-31T04:50:12.000Z",
        "description": "This is a classic dish of the Burgundy region of France, designed to celebrate the wines for which Burgundy is famous. The Herb Bouquet adds a special flavor to this extremely popular dish.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 cup beef broth",
            "3 tablespoons all-purpose flour",
            "1 tablespoon tomato paste",
            "1 teaspoon beef demi glace",
            "3 tablespoons bacon drippings",
            "2 pounds beef round, cut into 3 inch pieces",
            "3 tablespoons sherry wine",
            "1 ½ cups chopped onions",
            "1 cup Burgundy wine",
            "3 sprigs fresh parsley",
            "3 sprigs fresh rosemary",
            "1 sprig fresh thyme",
            "1 bay leaf",
            "12 fresh mushrooms, sliced",
            "¼ cup butter",
            "1 tablespoon chopped fresh parsley, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together beef broth, flour, tomato paste and demi glace; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat bacon drippings in a large heavy skillet over medium heat. Add beef, and cook until brown on all sides. Remove beef from skillet; set aside. Stir the sherry wine into the skillet. Add the onions, and cook about 5 minutes. Blend in the tomato paste mixture, and bring to a rapid boil, stirring constantly. Stir in Burgundy wine. Make the herb bouquet: Place parsley, rosemary, thyme, and bay leaf in a square of cheesecloth. Place herb bouquet in sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return beef to skillet. Cover, and simmer over low heat for about 3 hours, or until beef is tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a small skillet over medium heat. Saute mushrooms until lightly browned. Add to meat in the skillet, and continue cooking 15 minutes. Discard bouquet garni. Serve in a casserole dish, sprinkled with parsley.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Beef Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ELLIANA23"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.708860759493671,
            "ratingCount": 79,
            "itemReviewed": "Beef, Burgundy Style",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "481.9 calories",
            "carbohydrateContent": "18.1 g",
            "cholesterolContent": "109.7 mg",
            "fatContent": "26.2 g",
            "fiberContent": "2.7 g",
            "proteinContent": "31.8 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "510.7 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-05T13:02:52.91Z",
                "reviewBody": "With this recipe Elliana has come up with a classic and near authentic French beef stew or \"Boeuf a la Bourguignonne\" and has the perfect blend and balance of flavors. Doubling the sauce is not necessary; there is more than enough. The sherry is not critical if you don't have it and beef base or a little reduced beef stock could easily be substituted for the demi glace. I added some fresh minced garlic with the onion and used a French Pinot Noir though any full-bodied red wine would work. I used top round but I think I would have been more pleased with just regular ol' stew meat or a rump roast cut into 2-inch chunks. Probably the most useful suggestion I could offer regards the cooking method itself--rather than simmering on the stovetop for 3 hours I'll at that point in the preparation finish it in a 300-325 degree oven for a few hours. The heat will be more uniform it will free up the stovetop and elimate the need for stirring or peeking. I served this with smashed new potatoes and \"Shaved Brussels Sprouts with Bacon and Almonds\" from this site. Not a fancy dish just comfort food at its finest.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-07T15:03:32.53Z",
                "reviewBody": "This is one of my favorite recipes from this website.  Takes some time, but worth it, and doesn't require you to hover around while it simmers for 3 hours.  It just looks like beef stew, which I'm not a big fan of, but it is so much better than that!  On the advice of other reviewers, I doubled the sauce including the beef broth mixture, the sherry & wine, and am glad I increased the quantity.  The gravy is very good!  The recipe says to cut the beef into 3\" pieces, but I cut it into 1\" pieces.  I also tossed the bacon in from the bacon drippings.  I did not have a clue what beef demi-glace was, but I happened upon it in the grocery store near the bouillion cubes.  Demi-glace is a bit pricey, but it is very worth it; the flavor it brings is wonderful; I froze the part I didn't use for next time. Thank you, Elliana!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-26T17:10:13.687Z",
                "reviewBody": "What a great recipe.  So much better than others I've tried that just seemed too much like stew.  I have a great tip for the herb bouquet that I learned from Tyler Florence on Food Network.  Instead of using cheesecloth to wrap the herbs, take a slice of uncooked bacon and wrap it around a bundle of rosemary and another piece to wrap around some sprigs of thyme.  Cook these in your pan as the first step until you render out some of the bacon fat and the bacon is nicely browned.  Remove the bacon/herb bundles and proceed as directed.  You then can add the bundles back when directed in the recipe to simmer in the sauce.  Since the recipe calls for using bacon drippings this really works well.  I opted to chop my fresh parsley and add it at the end with the mushrooms.  I used good quality beef base to make my broth and as a substitute for the demi glace.  I doubled the sauce ingredients as recommended by other reviewers which is definitely the way to go.  Just make sure you have a good amount of meat so the ratio is correct.  Served with mashed potatoes (to soak up all that gravy) and peas and carrots.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-08T01:47:26.483Z",
                "reviewBody": "This was very good! I had to make a few changes due to my pantry stock. I had no demi glace so I mixed a teaspoon worchestire sauce a teaspoon bacon grease and a beef buillon cube. I also seared the beef in olive oil...my personal preference. Right before serving after removing from the heat I added a cup of sour cream to the mix. Then I poured it over hot buttery egg noodles. My family gobbled it up! Thank you! I will be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Salabras",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1761072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-11T12:57:40.95Z",
                "reviewBody": "This was excellent Elliana! I didn't measure the wine; in fact in the morning I placed my meat into a large plastic container and poured wine over until about half the meat was covered. I also added onions garlic peppercorns and carrots to the mix. I let this marinate for about five hours; flipping the meat every hour or so. By the time I was ready to cook the meat was already incredibly tender. I didn't have any demi-glaze so I used beef base. I probably quadrupled the sauce for this recipe which worked out well because much of it cooked down and thickened anyway. Didn't want to waste the bacon so I added that in too. Gave the dish a nice flavor. I served this over mashed potatoes and my family truly loved it. Thanks for a great submission!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-29T07:14:48.967Z",
                "reviewBody": "This was wonderful! The only thing I did different was to sear the meat in butter after dusting it with a seasoned flour mixture. Everyone who tried it said it was the best!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/845908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-27T15:40:24.53Z",
                "reviewBody": "I sized the recipe for 16 and made it for Christmas dinner. It was fantastic for a big crowd prep work is done early so you can enjoy time with guests and goes very well with roasted garlic mashed potatoes. Thanks for a wonderful and delicious recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYCOVELLO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/955813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-25T22:06:07.36Z",
                "reviewBody": "I used double-strength beef broth which meant I could omit the demi glaze and stew meat instead of beef round. With all the simmering you really couldn't tell I used a cheaper cut of meat. This was SO good. I served this over buttered egg noodles--NO leftovers. We ate every bite of this. Amazing dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-22T22:02:29.67Z",
                "reviewBody": "Thank you Elliana for a great recipe! The only thing I will differntly next time is to double the sauce as my husband and I both like a lot of sauce. After tasting this recipe we both said it is good enough to serve to company...now that is a good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAILINGGAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/589815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-24T11:09:00.897Z",
                "reviewBody": "I thought this was OK. Not bad but not great. I did think the wine flavor was a little over powering even after cooking for 3 hours. I don't know that I'll make this again because I don't think that it's worth the effort but it wasn't horrible. I had a lot of leftovers that I think will probably not get eaten.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "T Roos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1496470/"
                }
            }
        ]
    }
]