[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
                    "name": "Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14763/soups-stews-and-chili/chili/chili-without-beans/",
                    "name": "Chili Without Beans Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/86915/daddys-if-theyda-had-this-at-the-alamo-we-wouldha-won-texas-chili/",
        "name": "Daddy's 'If They'da had This at the Alamo we would'ha WON!' Texas Chili",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F795883.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-03-31T04:50:19.000Z",
        "description": "My Daddy, 'born and bred' in Texas, came up with this recipe and the name for it.  It took some convincing, but I got him to allow me to share the recipe.  We love it and hope you do to. Enjoy!!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "3 tablespoons bacon drippings",
            "2 large onions, chopped",
            "8 pounds beef stew meat, or coarse ground chili beef",
            "5 cloves garlic, finely chopped",
            "4 tablespoons ground red chile pepper",
            "4 tablespoons mild chili powder",
            "1 tablespoon ground cumin",
            "¼ cup sweet Hungarian paprika",
            "1 teaspoon dried Mexican oregano",
            "3 (10 ounce) cans tomato sauce",
            "1 (6 ounce) can tomato paste",
            "3 cups water",
            "2 tablespoons salt",
            "¼ cup dried parsley",
            "1 fresh jalapeno peppers",
            "1 cup masa harina flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt the bacon drippings in a large heavy pot over medium heat. Add the onions and cook until they are translucent.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the beef with the garlic, ground chile, chili powder and cumin. Add this meat-and-spices to the onions in the pot. Break up any meat that sticks together as you cook, stirring occasionally, about 30 minutes, until meat is evenly browned (very browned, not just gray). Sprinkle in Hungarian paprika and oregano.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in the tomato sauce, tomato paste, water, salt, parsley and jalapeno. Bring to a boil, then lower the heat and simmer, uncovered, for 1 hour.  NOTE: True Texans DO NOT add beans to their chili, but my husband loves them, so this is the point where you can add as many cans of drained and rinsed pinto beans as you wish (I add 2 cans, but shhhhhh don't tell my Daddy!!!).\n"
            },
            {
                "@type": "HowToStep",
                "text": "During cooking you may squeeze the jalapeno as it softens against the sides of the pot to release more heat if desired.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix in the masa harina, and cook while stirring for 30 minutes longer, or until desired consistency is achieved.  Taste and adjust seasonings.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chili Recipes",
            "Chili Without Beans Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KIKI810"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.542056074766355,
            "ratingCount": 107,
            "itemReviewed": "Daddy's 'If They'da had This at the Alamo we would'ha WON!' Texas Chili",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "511.7 calories",
            "carbohydrateContent": "11.9 g",
            "cholesterolContent": "121.6 mg",
            "fatContent": "35.8 g",
            "fiberContent": "3.2 g",
            "proteinContent": "35.3 g",
            "saturatedFatContent": "14.3 g",
            "servingSize": null,
            "sodiumContent": "1105.8 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-14T17:29:20.82Z",
                "reviewBody": "I researched chili recipies on this site and found this one that I especially liked. We were having a Chili cook-off at church and I wanted to enter. I made this recipe exactly as it is written and I won 1st place. I was so excited. I was totally honest and told them where I found the recipe and the name of it. I won a little chili pepper cowboy. Thanks for the great recipe: everyone at church wants it. This chili had the most outstanding taste of any chili I had ever eaten.It isn't too hot either; just right. Thanks again!!! I will make it over and over!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "annalee888",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2160096/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-03T06:15:22.96Z",
                "reviewBody": "I've always heard that when having a party never try a new recipe. Well I'm glad I went out on a limb to risk trying this chili for the first time for a New Year's Eve party my husband and I had. I followed it to the letter and thought the beef was going to be too tough to eat when it was done (the cubes were cut by the butcher and were quite large). As it cooked however the meat got very tender and all of the spices and the rest of the ingredients melded together for one of the best chilis I've ever had! Thanks for posting this one--and thank daddy for us! It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NALLARD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/638672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-12T00:34:04.25Z",
                "reviewBody": "This was amazing! It had a wonderful smoky flavor- not too tomatoey. I made it with stew meat (beef chuck cut into small pieces so it wasn't too tough) and no beans. I wasn't sure what type of mild chili powder/ground chile to use so I used some ground New Mexico chiles (rather than the store-brand chili powder that already has the cumin and garlic mixed in) and just a little cayenne (not the full amount of ground red chile pepper that the recipe calls for) and it was plenty spicy with a fantastic flavor. I also did not add the full amount of flour as it was plenty thick but the masa also added a very nice flavor. Goes very well with Amusement Park Cornbread from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Cole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/991577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-19T20:43:32.677Z",
                "reviewBody": "OK folks I've Judged chili contests and have a number of chili recipes that I use for contests and gatherings. I made this recipe for an Engagement Party last night and had numerous compliments. Three adjustments I made double the cumin increased the jalapenos to 1 and 1/2 and finely chopped them and cooked it for 3hrs. The increased cooking time took the meat from OK to melt in your mouth tender and the consistancy required no masa. No one had less than two bowls. Great recipe for those that don't like beans. Thanks \"Daddy\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sxarnold",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2200542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-21T00:04:01.177Z",
                "reviewBody": "Yum! Nice and spicy but not over the top. Great flavor. One of the best chilis I've had. I scaled to use 2 lbs. beef and used lean ground beef. Here are the minor changes I made: I added a bit of liquid smoke used V8 instead of tomato sauce used regular paprika left out the jalapenos and didn't need the flour as I just estimated the water. I added a little ground black pepper forgot the oregano and cooked in a crock pot on low for several hours instead of simmering for convenience's sake. Also--I'm Texan and agree about the \"no beans\" rule but my waistline disagrees so I added one can of ranch beans and one can of kidney beans drained but not rinsed. My husband loved it said he could eat it every week. It was too spicy for the kids. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SB2323",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/447798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-26T06:39:38.693Z",
                "reviewBody": "This is an excelent chili. I didn't do anything different to it but just eat it. I believe if I had of been at the Alamo I would not have participated after eating this chili because I would have found a pillow and went to sleep. That's how great it is. I rate it a \"10\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "helanajean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2595408/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T00:13:31.833Z",
                "reviewBody": "Very good chili!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Todd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/todd/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-10T20:10:28.473Z",
                "reviewBody": "It has been unusually Cold in So Cal. lately and I needed a warm chili to warm up my family. We loved this! I used beer in place of the H2O since there is more flavor in beer. I also cut up skirt steak and Yes I added beans too! My hubby Loves beans so he gets them:) I used a couple different ground chilies for this and the longer it sat the hotter and Better it got! I made some toasted sourdough garlic bread to round out the meal. Thank you KiKi I will for sure make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty Cakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ilovecarlos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-09T21:33:46.337Z",
                "reviewBody": "Excellent! I followed the recipe exactly only I made it for 5 servings instead of 20 (2 lbs beef). Then after a bit of tasting and pondering I added a couple splashes of lime juice a generous pinch of sugar chopped wild onions and some fresh cilantro and upon serving topped with sour cream cheddar cheese a few bits of wild onion a thin half-round slice of lime and a spring of cilantro. Excellent aesthetics combined with great flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "giraffebait",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2595056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-17T12:07:23.66Z",
                "reviewBody": "Something must have went wrong. This is not the Chili others have reviewed. I tried to follow the recipe to a \"T \" but made the following mods. I cooked it in a Roaster over 2 burners. I don't think that made a difference. I added 1 TBSP of Butcher's Pepper (I love pepper). Substituted Beef Broth for Water. Regular Paprika instead of Hungarian. Regular Oregano instead of Mexican. Corn Tortillas (ground) instead of Masa Harina. The Chili is plenty spicy. I like spicy food but this Chili was borderline too hot. The consistency is too thick. Perhaps I should have used less or no Masa. The meat came out too beefy. I used Chuck Steak. Maybe it could have been browned longer. I followed the directions but 8lbs is a lot of meat. It probably would have been better had the meat been cooked longer. The meat is very tender maybe the beef broth was overkill. The Chili was fun to make and everything seemed to go according to the recipe. I can't understand why it tastes...So...Blah. I mean it tastes like hot beef not chili. That is my best attempt at describing the taste. If by reading the other reviews you are inclined to make this Chili consider the following: A) Try half the amount of Ground Red Chili Peppers. You can always add the rest later. B) Make sure the meat is good and brown as stated in the recipe. C) Use half or totally eliminate Masa.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "huntclan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5981954/"
                }
            }
        ]
    }
]