[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
                    "name": "Beans and Peas",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/146088/frijoles-de-olla/",
        "name": "Frijoles de Olla",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2014304.jpg",
            "width": 2424,
            "height": 2424
        },
        "datePublished": "2020-04-17T23:56:34.000Z",
        "description": "Pinto beans are cooked simply in this classic recipe. Make a batch for your next fiesta!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H5M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "10 cups water",
            "2 tablespoons lard",
            "2 cups dry pinto beans, rinsed",
            "2 teaspoons salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Measure water and lard into a large pot. Bring to a boil and add beans. Cook over medium heat for 2 to 2 1/2 hours. Season with salt and continue cooking until tender, about 30 more minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Beans and Peas"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JOEBOB22"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.566666666666666,
            "ratingCount": 30,
            "itemReviewed": "Frijoles de Olla",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "196.3 calories",
            "carbohydrateContent": "30.2 g",
            "cholesterolContent": "3 mg",
            "fatContent": "3.8 g",
            "fiberContent": "7.5 g",
            "proteinContent": "10.3 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "596 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-03T19:27:16.003Z",
                "reviewBody": "This is very similar to how I cook beans which I use for all my \"bean\" recipes; chili, refried beans, burritos, etc. Rather than posting another similar recipe on this site, these are the slight changes I make to this recipe: Bacon fat instead of lard definately enhances the flavour. Reduce the water to 5 cups and dump everything cold into a slowcooker either at night and cook overnight on low or in the morning and cook all day. Definately wait to add the salt til the end for nice tender beans. Also, if you pour the beans into canning jars and seal while still piping hot and let them sit on the counter to cool (you'll hear the lid \"pop\" when they're sealed), they will last for weeks if not longer in your refrigerator. I always cook a lot of beans at once so I have some on hand since I will never use canned beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Taunte Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3456375/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-04T14:59:58.28Z",
                "reviewBody": "This is the only way that pinto beans should be cooked. This recipe appears to be identical to the one my family uses (in their head). In place of lard we usually use cubed pieces of salt pork but have also used bacon in a pinch (or vegetable shortening if cooking for our vegetarian friends). Some brands of dry pinto beans contain bits of dirt and such that you will want to make sure don't end up on your dinner plate. To clean just pour them onto your countertop and make sure that only beans go into your colander. Give them a quick rinse and then pour them into your pot. (My mother also taught me to remove the ones that floated to the top at this point but she never really gave me a good reason for doing so. And so I still do it.) Also be sure to check on them periodically to ensure they aren t running short on water and/or secretly beginning to stick to the bottom of your pan. Leftovers freeze well but they are also excellent in breakfast tacos. Try mixing a bit in with your scrambled eggs. Or make refried beans with chorizo--and don t forget to sprinkle some grated cheddar cheese into your taco!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cameeela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cameeela/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-13T20:09:02.847Z",
                "reviewBody": "Brown beans are a inexpensive, simple meal topped with chopped onion and paired with cornbread.  You can speed up the process by using a pressure cooker at 15lbs for about 30 to 45 minutes.  Also, be sure to follow the recipe and add the salt later; the beans will not become as tender if you add the salt before cooking.    ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OCHUMGACHESH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/371359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-03T16:48:43.01Z",
                "reviewBody": "I haven't tried this, but I wanted to say that it seems much like the recipe that Taco Bell used back in the late 1980's.  We'd put 13 lbs. of Pinto beans, 1 lb. lard, about a cup of salt and 4 gallons water into a large pressure cooker and cook for 2 hr. 25 min.  That's how they made the refried beans, back then.  Now, they reconstitute dehydrated beans.  The beans tasted much better, back when we made them from scratch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Duane Close",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7698281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-19T00:56:03.54Z",
                "reviewBody": "I was always taught to soak the beans first in water overnight. After soaking I cook these in a crockpot with salt pork. I cut the salt pork into 1/3\" strips and fry the salt pork for a bit first. You add the salt pork and the grease to your beans - this just gets more grease out in the water to flavor your beans. As other reviewers have said add the salt later when the beans are about done. You can dress up the beans if you like by adding onion cilantro (my favorite) garlic cumin mexican flavored chopped stewed tomatoes and some beer if you want to make these boracho style. But these are fantastic done simply as well. Serve this with a batch of cornbread some green onions and slices of cheddar cheese and you've found heaven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MELPRES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/542130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-08T14:47:23.323Z",
                "reviewBody": "This same recipe can be cooked in a pressure cooker. If you soak the beans and use natural release the beans can be cooked in 1 to 3 minutes!! If you use the quick release method of steam cooking time goes up to 4-6 minutes. Amazing time saver and fuel saver as well. Once I got over the false fear of it blowing up and buying one (actually got two). I use it all the time and am so impressed with the time I save. This recipe can be done and you'd save yourself literally hours. Best thing I ever bought. I want to share with others so that more recipes appear for pressure cooking adaptions. Think about it: 5 minutes vs. 3 hours. Kind of a no-brainer once you get over any fear. Many safeguards have now been built in so that it is virtually impossible to have them blow up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5254615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-05T18:35:24.017Z",
                "reviewBody": "This was the ONLY way I was taught to make my frijoles de olla.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1526203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-23T19:49:48.02Z",
                "reviewBody": "I made these tonight to have for meals tommorrow Mine looked more like the pic. by Acacandy. The problem I had was I thought they were \"super salty.\" I wish I would have done 1/2 the salt and added more if it was needed. By the time they are done cooking they do absorb every bit of water. I was surprised with a full 10 cups. The only change I made was using vegetable oil instead of lard. I do that a lot with no problem. I also expected them to have a creamier texture to for some reason. Maybe that depends on the bean. I may just use them in bean and cheese burritos. If looking to make beans and rice or refried beans I would look for a recipe specifically for that with the right flavorings. This is just a basic cooked and salted bean kind of like the can but without any liquid in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-19T12:23:43.78Z",
                "reviewBody": "PERFECT! I couldn't remember the quantities. I used bacon grease and skipped the salt. For those seeking \"creamier\" beans simply mash the beans add water and cook for a couple more hours. Keep an eye on them. After beans are cooked I don't actually refry them but I do add lots of extras. I like sauteed onion and garlic cumin and oregano -- mainly for beans I eat on their own with tortillas and chopped fresh tomato and a dollop of crema fresca -- Mexican sour cream which is kind of like loose cream cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stevecruz Denver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13937077/"
                }
            }
        ]
    }
]