[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/348/bread/quick-bread/zucchini-bread/",
                    "name": "Zucchini Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/231643/hearty-breakfast-muffins/",
        "name": "Hearty Breakfast Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1041197.jpg",
            "width": 1516,
            "height": 1563
        },
        "datePublished": "2020-03-05T05:10:20.000Z",
        "description": "Healthy, hearty breakfast muffins. These have a lightly sweet flavor and lots of wholesome ingredients to get your day started. Moist, chewy, and not overly dense. Easily customizable! You can use any flavor of yogurt, but I prefer plain Greek yogurt. Customize with your favorite nuts or seeds, zucchini or squash, cooked sweet potato, raisins or cranberries, etc. Enjoy!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "1 dozen muffins",
        "recipeIngredient": [
            "2 carrots, shredded",
            "2 bananas, mashed",
            "1 zucchini, shredded",
            "¼ cup vegetable oil",
            "¼ cup yogurt",
            "2 eggs",
            "1 cup whole wheat flour",
            "1 ½ teaspoons baking soda",
            "½ cup packed brown sugar",
            "½ cup rolled oats",
            "½ cup shredded coconut",
            "½ cup chopped pecans",
            "½ cup dried cherries",
            "1 teaspoon ground cinnamon",
            "1 teaspoon salt",
            "½ teaspoon ground ginger"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups or line with paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix carrots, banana, zucchini, vegetable oil, yogurt, and eggs together until fully incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk flour and baking soda in a separate bowl. Mix brown sugar, oats, coconut, pecans, cherries, cinnamon, salt, and ginger into flour mixture until all ingredients are coated in flour. Stir wet ingredients into flour mixture until just combined. Scoop batter into the prepared muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean and edges are slightly brown, 17 to 22 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Zucchini Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KatieTries2Cook"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.683673469387755,
            "ratingCount": 294,
            "itemReviewed": "Hearty Breakfast Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "227.3 calories",
            "carbohydrateContent": "31.7 g",
            "cholesterolContent": "31.3 mg",
            "fatContent": "10.1 g",
            "fiberContent": "3.9 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "388.1 mg",
            "sugarContent": "16.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-08-11T20:32:33.51Z",
                "reviewBody": "I have made these twice and have had excellent results both times.  My only pet peeve with this recipe is that it calls for \"one zucchini\" - if you see the massive size of the ones that came out of my parents' garden this year...so I have experimented with 2-3 cups of zucchini and it's been fine.  I love that they freeze well and are great for me to eat at work.  I've also substituted applesauce for the oil and chocolate chips for the cherries.  Both worked well for us!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RYERSAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/698896/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-20T16:26:13.087Z",
                "reviewBody": "I really, really enjoyed these healthy muffins, so did my almost 2 year old daughter and my husband.    They were delicious and moist.  We are striving to reduce processed foods and this was a perfect addition to our meal plans.  I almost exactly followed the recipe.  I substituted coconut oil for the vegetable oil (1/2 cup for 1/2 cup) and didn't add the pecans because I didn't have any on hand and I wasn't sure if my daughter would eat them anyway.  My yogurt was Greek yogurt.  My only regret is not doubling this batch.  I felt great about letting my daughter eat these for dinner because of all the veggies and fruit.  These muffins barely rise, so fill your muffin tins completely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2929976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-08T13:51:31.707Z",
                "reviewBody": "Before using the oats in this recipe, I ran them through the food processor to get a finer consistancy. I also did not have dried cherries, I substituted Craisins. I got twelve biggish muffins out of one recipe. Baked at 350*, they were done at a little over 22 minutes. These were VERY good, perfectly sweet, moist and slightly chewy and packed with all kinds of yummy goodies. The whole family loved them. DELICIOUS.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-27T02:10:48.28Z",
                "reviewBody": "I substituted a shredded apple (with peel) for the zucchini and used honey flavoured Greek yogurt. These were delicious and even got top marks from my picky husband. This recipe excites me because I can have a lot of fun with substitutions and experiment with flavours. I will definitely make this again and again! Thank you for posting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Helen Myers Shields",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5804723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-13T23:53:43.37Z",
                "reviewBody": "If I could give 2.5, I would.  These had a lot of potential.  Unfortunately, they come out super soggy and mushy.  I felt like it needed more flour going in, but I stuck to the recipe (unlike pretty much all the other reviewers for this recipe.) I would say add at least another cup of flour.  I know zucchini and banana breads are moist, but these were so moist that they almost seemed raw.  I would try again, but add more flour, and possibly more spices ginger, cinnamon, and some vanilla extract.  Also, another reviewer said she used 2-3 cups shredded zucchini as one zucchini's worth.  I also have huge garden zucchinis and used 2 cups shredded.  I would stick with that, as long as you increase the flour.  The flavor combination was nice, we just didn't like the mushy middles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CRYSTALSHOE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1437879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-10T12:44:45.18Z",
                "reviewBody": "I used soy milk instead of yogurt, spelt flour instead of whole wheat, and raisins instead of cherries.  I replaced the brown sugar with half the amount of honey, and found that these were VERY sweet muffins.  I love the color, texture and taste of these moist muffins!  When I make them again, I will plan of freezing some, as I'm sure they will freeze well!  Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sueb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2719400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-05T15:03:36.767Z",
                "reviewBody": "I have made these several times, and it's now my favorite muffin recipe! They are great for breakfast, or anytime! The first time I made it as written, but its so easy to make substitutions to suit your taste or what you have on hand.  I have subbed dried cranberries for the cherries, sunflower seeds for the pecans, puréed butternut squash for the zucchini, you get the idea. With all the nutritious ingredients, I feel good about giving them to my two year old, who gobbles them up! She loves to open them and find all the goodies and chunks inside. The recipe makes 12 big muffins, and I fill the cups all the way to the top because they don't rise too much. They freeze very well, but between myself, my husband and daughter, they are usually gone before I get a chance to freeze any for later!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DGM31",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11645017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-12T17:23:01.977Z",
                "reviewBody": "Very adaptable. I make these all the time at the request of my hubby, but I use leftover baked plain sweet potatoes or canned pumpkin in place of the zucchini - no one in my house cared much for these when zucchini was used. You can pretty much use any flavor of yogurt that you happen to have - I've used plain, peach, vanilla, and pumpkin pie flavored yogurt, both light and greek types, all successfully. I use Craisins or dried blueberries in place of the dried cherries. I also add 1/4 cup ground flaxseed meal and sub unsweetened applesauce for the oil. SO good! I sometimes have to increase the oats by 1/4 cup because they can be almost overly moist. Wonderful flavor! Don't leave out the ginger - it really makes these stand out over others.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Rathbun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/172152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-09T15:58:40.547Z",
                "reviewBody": "Since I am not a person who usually likes healthy muffins, I can say these have changed my mind. This recipe is so versatile. I read every review and followed some of the suggestions (using coconut oil) and applied some of my own changes. I made three versions of these muffins, one as is, the other two I replaced the Bananas, one with pumpkin puree the other with mashed sweet potatoes. In all three I did omit the shredded coconut and dried fruit, because our family is not a fan of either. We kept some out, tossed the rest in the freezer and they have been such a big hit in out home. My kids are munching on them all day, I had to hide them. Next time I will make minis so they can grab them and go outside. Thank you for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rsinner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8930354/"
                }
            }
        ]
    }
]