[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16416/desserts/cookies/sandwich-cookies/",
                    "name": "Sandwich Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15722/chocolate-sandwich-cookies-ii/",
        "name": "Chocolate Sandwich Cookies II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5501129.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2000-01-27T02:28:56.000Z",
        "description": "These EASY to make cookies are absolutely fantastic.  Moist and chewy - can't stop at one, or two,..... ...",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "1 (18.25 ounce) package dark chocolate cake mix",
            "1 (18.25 ounce) package low calorie chocolate cake mix",
            "4 eggs",
            "⅔ cup vegetable oil",
            "1 (8 ounce) package cream cheese, softened",
            "2 cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the dark and light chocolate cake mix. Add the eggs and oil, mix until well blended. Roll dough into 2 inch balls, and place them onto the prepared cookie sheet. Flatten the balls slightly with the back of a spoon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 to 12 minutes in the preheated oven, until firm. Let cool on the baking sheet for a few minutes before removing to cool on wire racks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the filling, beat the cream cheese and confectioner' sugar together until smooth. Spread between two cooled cookies.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sandwich Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Anne Paquette"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.564971751412429,
            "ratingCount": 177,
            "itemReviewed": "Chocolate Sandwich Cookies II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "609 calories",
            "carbohydrateContent": "88.6 g",
            "cholesterolContent": "82.5 mg",
            "fatContent": "27.1 g",
            "fiberContent": "2 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "583.1 mg",
            "sugarContent": "63 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-05T19:14:22.087Z",
                "reviewBody": "I wasn't sure what to make of this recipe before I made it (all I could picture is whoopie pies which is two small cakes with filling inside). This is not whoopie pie! The texture of the cookies is not really cookies more like brownies. A few things; 1) The \"cookie batter\" is really hard to stir. I mixed this with my hands like a meatloaf. 2) Make sure you use parchment paper on the pans. I made my first batch on a regular cookie sheet sprayed with non-stick spray and those babies were hard to get off without deforming them. 3) I used a number 40 scoop to make sure I had an even amount of batter so I would get the same sized cookie but you could use a Tbls x 2. I changed up the filling a bit by adding 1/2 stick of butter 1tsp vanilla and a Tbls of milk. Popped it in a zip lock bag cut off the end and \"piped\" the filling on a cookie and topped with the second cookie. These were wonderful! Very tasty and different",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "melissaroth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2538923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-19T00:14:08.84Z",
                "reviewBody": "This recipe was really easy to make. We found we liked it better when the cookies were not cooked as long (maybe 9 min) so they were a little softer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGIESCHULZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/235004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-29T00:25:11.873Z",
                "reviewBody": "I love this recipe! I actually got it from a friend of mine but she uses my absolute favorite cake mix RED VELVET! The Red Velvet cookies are awesome as are Carrot Cake and Butter Pecan. The Butter Pecan are very sweet though...I want to try it with just a yellow or white cake mix and see how they taste...Here are some changes/things I do: first I don't roll them into balls I just use the Pampered Chef small scoop and they turn out the perfect size. Also my icing is a bit different. It won't taste so cream cheesey this way - I use 1 block cream cheese softened 1 stick butter softened 4 cups powdered sugar (which is one box) and 1 teaspoon vanilla....SO YUMMY!!! I keep these in the fridge also! Try the Red Velvet if it is available in your area... YUM-O!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MelissaW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2192612/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-22T11:45:13.373Z",
                "reviewBody": "I used 2 regular cake mixes 'cause that is what I had. Great cookies. I needed to bake full 12 minutes. Simple and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Nelson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/285014/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-02T11:58:33.12Z",
                "reviewBody": "Outstanding! I loved these because they are so unique and taste like little chocolate cheesecakes without the plate and fork to serve to a crowd. I was skeptical about the cake mix but I used two packages of devil's food cake mix and the cookies were extra chocolatey like ice cream sandwich cookies. \nI made the balls to flatten about half the size though so they turned out the size of a normal cookie rather than a giant one. Much more attractive this way. Also, I would cut the icing sugar in half next time. There was so much confectioners sugar that you could barely taste the cream cheese. I'll start with one cup and add to taste if necessary. I'm sure that way, it would have earned a 5-star rating from me. A keeper recipe for sure! I brought them to work and people actually came and found me after having one, usually with an \"OMG\" comment :) Enjoy! dee",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bakergirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/465415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-12T20:04:16.537Z",
                "reviewBody": "Update:2/2011- This has been such a go to recipe for me for a quick dessert. But today I out did myself. I made the cookies with red velvet cake mix and I filled them with cream cheese frosting with mini chocolate chips.Then for Valentines I stenciled a powdered sugar heart on the top cookies. They looked amazing and they tasted so good! WOW!! Great recipe. My husband came in late tonight but wanted a dessert. I threw these together and we had a great tasting snack in time for our favorite program. The only substitution was canned icing and it worked great! Update: I have since made this recipe with butter cake mix adding in a tsp of almond liquer and 1/2 cup finely chopped almonds. I put them togather with orange marmelade and they were fantastic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty Ruth Hand Pirko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/639113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-02T05:26:28.95Z",
                "reviewBody": "I got this recipe long ago from a camp cook and when I found I lost the recipe I went looking...so glad I found it! Although I don't make these often everytime I do I wonder why I don't. Try them frozen - they taste like an amazing ice cream sandwich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin Flory",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16739761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-01T18:17:35.133Z",
                "reviewBody": "I just made these great cookies for our bake sale. They were the first thing to leave. I did use a different cake mix. I used triple fudge cake mix BETTY Cr and I used Devils food Cake mix Pislbury I was concern over the cookies being hard. I felt as though the fudge mix would bring in softness. let me tell you it did and did not have a fudgy softness but just perrrrrfect and it had mini chips in it next time i might add WHITE chips to them. For the cream i followed another person recommendation here and added the 1TBLSP milk teaspoon vanilla and 1/2 stick butter. I made my butter room temp. I then scooped it all up after mix it placed it in a ziplock bag cutt the end and used it as a pastery bag. Be careful not to over fill because the crem is not thick and don't press the cookie down to hard Just fill them and let them sit.This was really great that way. I am keeping this recipe. My kids loved it and the parents raved over them Not to mention SUPER QUICK!!!.. Thank you",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "doublepisces",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2540064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-26T16:07:06.45Z",
                "reviewBody": "I made this and it was soooo easy! Tastes really good too! I used two random chocolate cake mixes that i found sitting in the pantry and one had mini chocolate chips in it which was kind of a nice touch to th cookie...I might have to make more though because I'm taking them to a party tonight and I can't stop eating them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ally",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2775293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-02T22:45:33.74Z",
                "reviewBody": "I only gave this 3 stars because the cream cheese filling kind of ruined it for me. I think it would work better with a peanut butter filling instead. The cookies alone were amazing - I couldn't find low calorie cake mix so I used two boxes of Duncan Hinz Devils Food cake mix instead and it was delicious! I will make it with peanut butter next time and let you all know how it came out!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Dani1229",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5018011/"
                }
            }
        ]
    }
]