[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/824/desserts/pies/tarts/",
                    "name": "Tarts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17645/desserts/pies/tarts/fruit-tarts/",
                    "name": "Fruit Tart Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/93779/rustic-autumn-fruit-tart/",
        "name": "Rustic Autumn Fruit Tart",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1443473.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-05-06T03:42:32.000Z",
        "description": "This delightful, warming dessert is quick to make and a pleasure to eat.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "1 8-inch tart",
        "recipeIngredient": [
            "½ cup butter, chilled",
            "½ cup cream cheese",
            "1 ½ cups all-purpose flour",
            "2 apples - peeled, cored, and thinly sliced",
            "1 pear - peeled, cored and sliced",
            "¼ cup orange juice",
            "⅓ cup brown sugar",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon ground nutmeg",
            "¼ teaspoon ground cardamom",
            "1 ½ tablespoons cornstarch",
            "½ cup apricot jam, warmed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the cold butter and cream cheese into the flour with a knife or pastry blender until the mixture resembles coarse crumbs. (This can also be done in a food processor: pulse the cold butter into the flour until the mixture resembles cornmeal; add the cream cheese and pulse until it's the size of small peas.) When you squeeze a handful of the mixture, it should form a ball. Shape the dough into a round disk, wrap it in plastic, and refrigerate for at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Toss the sliced apples and pear with the orange juice. Whisk together the brown sugar, cinnamon, nutmeg, cardamom, and cornstarch. Toss the fruit with the sugar-spice mixture and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C). Set out an 8-inch tart pan, or, if you'll be making a free-form tart (galette), lightly grease a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll the pastry out on a lightly floured work surface to form a 10-inch circle. Transfer the dough to the tart pan or baking sheet. Arrange the fruit decoratively in the tart pastry. If you're baking the tart on a baking sheet, leave a 2-inch rim of dough and fold it up over the edge of the fruit (the pastry folds will overlap).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the tart in the preheated oven until the crust is browned and the filling is bubbly, about 30 minutes. Remove the tart from the oven and brush it with the apricot jam.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Tarts",
            "Fruit Tart Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CULINARYJEN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.310344827586207,
            "ratingCount": 87,
            "itemReviewed": "Rustic Autumn Fruit Tart",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "361.1 calories",
            "carbohydrateContent": "50.5 g",
            "cholesterolContent": "46.5 mg",
            "fatContent": "17 g",
            "fiberContent": "2.3 g",
            "proteinContent": "4 g",
            "saturatedFatContent": "10.5 g",
            "servingSize": null,
            "sodiumContent": "136.5 mg",
            "sugarContent": "24 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-08T19:40:54.85Z",
                "reviewBody": "Very easy, I made a few changes, used 4 small apples and 3 pears, I let the fruit marinade in the OJ with the spices and then I drained the sauce before putting it in the dough. The first time I made this I did not drain and the liquid seeped thru the crust and burned. Delicious !!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris Grohmann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/202139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-26T17:40:16.387Z",
                "reviewBody": "I loved this recipe! The pastry came out perfect I am surprised at the reviewers who had troubles with getting it right. I am thinking about using this as a pie crust as well - my family and I loved it! It was nice and flaky it came out of the tart pan without any trouble it did not stick at all -- and I did not grease the pan at all or prepared it in any way. The cardamom gave the filling a great subtle taste. Slightly different then allspice worth using it if available. I added one extra pear drained the fruits before tossing with spices and sugar (I upped the corn starch a bit to compensate) and it was perfect. This tart will be on all my festive dinner tables from now on. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kyra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3372597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-23T00:48:53.91Z",
                "reviewBody": "this is absolutely delicious. my main purpose in making this was to try out my new jar of cardamom (i had never tried it before but i am intrigued by this spice). the spices in this recipe blend together so well. nice presentation also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tahoegirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2297575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-15T19:08:35.157Z",
                "reviewBody": "This is the kind of dessert found in quality European patisseries. I used 2 pears and 1 1/2 granny smith apples. It's very important to slice the fruit very thin. Unless you are lucky enough to own a mandolin this step is tricky and takes time. It might be a good idea to slice an extra pear or apple to have a choice of the best shaped pieces. I added slightly more corn starch to make sure that the filling wouldn't be runny. Laying the fruit in a pretty way isn't really difficult and is something that with practice will only get better. Cardamom is a spice I hadn't used before. I found it's addition subtly added an unusual and interesting flavour. Using a tart pan with a removable bottom will best show off all of your hard work and makes it so easy to serve. I may tinker with the pastry to improve it but that could just be me. I'm still toiling away to better any pastry I make. Give yourself time to put this tart together. Your patience will be rewarded. Thanks so much for sharing the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cynjne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1447121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-26T00:03:05.147Z",
                "reviewBody": "This was very good and pretty. I used reduced fat cream cheese 1 1/2 large Fuji apples 1 Bosc pear low-acid orange juice (the only kind we drink) and had to substitute 1/8 tsp cinnamon and 1/8 teaspoon chai spice mix for the cardamom (I could not find it at the base commissary). I used Trader Joe's preserves. I served it with Breyer's Homemade Vanilla ice cream. I would have given the recipe 5 stars but the cook time was off (and my oven is very accurate); I had to cook it 45 minutes. Also I used a tart pan and the crust stuck around the edges. It definitely needed to be lightly greased. I'm not sure if refrigerating the dough was a necessary step. The dough was not sticky and appeared easy to work with but I did refrigerate it for an hour and it was extremely stiff. I found the dessert to be very sweet and rich. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Miller Motley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cook4mycrew/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-25T21:04:02.223Z",
                "reviewBody": "This is a fabulous recipe. I made mine free form. I also added a bit of almond to the filling to give it a little extra punch of flavor. I used one pear one red delicious apple and 1 each of a small granny smith and a macintosh apple. Very yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Thompson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2989431/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-09T17:06:02.457Z",
                "reviewBody": "1/2 cup cream cheese = 4 oz. (or half of an 8 oz. brick) The first time I made this I made the mistake of using 8 oz of cream cheese which makes too much dough. The second time I got it right but the crust isn't as tender as I was hoping for. I added a pinch of salt and also 1-2 T of cold water to the dough to get it to form a ball. The filling has very good flavor. I needed to bake this about 10 min. longer than stated. Also 1/4 cup jam is plenty to thickly coat the top of the tart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKIN4MYFAMILY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874699/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-12T00:05:23.143Z",
                "reviewBody": "My daughter and I are experienced bakers and we found this recipe a challenge. As others have noted the dough was stiff and hard to work with. We did a free form pie on the baking sheet and presentation wise it would win no blue ribbons the juice all ran out. 30 minutes is not enough time for the fruit to bake properly we had to bake it at least an extra 30 minutes or so with butter dotting the fruit and a tent of aluminum foil. The flavors on the fruit were great but the dough was tough and bland. However the saving grace was topping it with Haagen Daaz Vanilla Ice Cream so it wasn't a complete loss. If we made this one again we would use another tried and tested cream cheese dough recipe slice the apples and pears thinner put in a pie pan and bake longer. Oh and the apricot jam? It gave the dough some sweetness but otherwise I wouldn't bother with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Pj McIlvaine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5452723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-04T15:35:21.023Z",
                "reviewBody": "This recipe is so good! The cardamom really makes it and to really get the best taste serve it warm with a little vanilla ice cream and caramel sauce. Also I took the advice of the last reviewer and spread a thin layer of almond filling on the dough before layering on the fruit. It is subtle but it goes very well with all of te flavors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Charlie Green",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2978267/"
                }
            }
        ]
    }
]