[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/151/breakfast-and-brunch/pancakes/",
                    "name": "Pancake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232269/gramma-momos-ww-pancakes/",
        "name": "Gramma Momo's WW Pancakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1034944.jpg",
            "width": 1212,
            "height": 1212
        },
        "datePublished": "2020-03-05T05:10:31.000Z",
        "description": "This is my version of a great recipe that I found in my Mom's recipe book. It actually came from my grandmother Momo around WW2. My only real change was substituting applesauce for the oil. Feel free to try either way.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "2 cups whole wheat flour",
            "1 ½ teaspoons baking powder",
            "1 teaspoon baking soda",
            "½ teaspoon salt",
            "½ cup brown sugar",
            "2 eggs",
            "1 cup milk, or as needed",
            "½ cup applesauce",
            "1 tablespoon vanilla extract",
            "1 teaspoon vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk whole wheat flour, baking powder, baking soda, and salt in a bowl. Mix in brown sugar, breaking it up into pea-sized pieces. Beat eggs in a separate bowl and stir milk, applesauce, and vanilla extract into eggs. Make a well in the dry ingredients and pour in the milk mixture; stir until just combined. If batter is too thick, add more milk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease a skillet or griddle with vegetable oil and place over medium-high heat. Scoop 2 tablespoons of batter onto the hot skillet and cook pancake until browned on the bottom and bubbles appear in the top, 2 to 3 minutes. Flip the pancake and cook until browned, 2 or 3 more minutes. Repeat with remaining batter.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Pancake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "IAgardener55"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.958333333333333,
            "ratingCount": 24,
            "itemReviewed": "Gramma Momo's WW Pancakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "62 calories",
            "carbohydrateContent": "11.5 g",
            "cholesterolContent": "16.3 mg",
            "fatContent": "1 g",
            "fiberContent": "1.3 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "142.9 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-04-12T10:26:29.47Z",
                "reviewBody": "I followed the recipe exact only cutting the brown sugar back by half. The pancakes turned out a little flat but they were delicious. I served them with homemade Maple-Vanilla Syrup on top. I will make these again but double the amount of baking powder. Then I think that would make them perfect. NOTE: This made 12 pancakes using a 1/3 cup dry measuring cup to ladle the batter onto my griddle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-19T13:49:28.007Z",
                "reviewBody": "The serving size must be a typo. It should probably say it serves between 2 and 4 people. I cut the recipe in half and it fed my son & I. It made 10 smallish pancakes. I cut the baking soda & powder by just a tad and my pancakes were very very fluffy. I had to smoosh them down a bit. I did have to add a bit more milk which I hate to do since it makes you mix them more. But the flavor was very very good! I used White Whole Wheat and less vanilla (personal preference I'm not a huge fan of vanilla in pancakes). I used a bit less brown sugar. I just used Pam instead of oil in the pan. Thanks for sharing your family recipe I'll make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scotdog",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thescotdogs/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-11T12:16:59.597Z",
                "reviewBody": "I love vintage recipes and this World War II recipe is one to treasure. Without a doubt it s the best whole wheat pancake recipe I ve tried. I used white whole wheat flour and vegetable oil in place of applesauce. The batter was extremely thick and more consistent with a muffin batter. For me an ideal pancake batter should be thick yet pourable. I added more milk until I got the consistency I wanted. Following the recipe directions I used 2 Tablespoons of batter per pancake. I got 24 cute little medallion sized pancakes. Hardly big enough for a single serving as suggested by the recipe but they say times were hard during WW II. People had to ration back then and maybe that was all you got. I don t know? I just know these little gems were light fluffy and flavorful. The only thing you have to be careful with is not to overcook them or they get dry and crumbly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIZ&#9829;",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/diz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-15T02:55:39.867Z",
                "reviewBody": "This was a great recipe. My dough ended up being a little thick so i had to add 1/4 cup more milk after which it was pourable. The pancakes themselves were pretty filling we ate them for dinner and I could only have two pancakes using a 1/4 cup measuring scoop to pour and my husband had 5. I took Sarah Jo's suggestion of adding more baking powder I added an additional 1/2 tsp of both baking powder and baking soda and they were super thick and fluffy. If you don't like thick I would advise against increasing the raising agents that much. It was a bit on the sweet side and I would probably reduce the sugar to 1/3 or 1/4 cup next time. I put in strawberries but it was too sweet with all the sugar to put in the chocolate chips I normally throw into pancakes or even to serve with syrup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shalvie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3410452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-20T22:23:50.25Z",
                "reviewBody": "Very good! I mixed the wet ingredients first then added in the dry ingredients so I only had one bowl. I also reduced the sugar by half. For whole wheat flour you can increase the airiness by stirring more actually so I whisked the mixture for a minute or two before cooking and then were so fluffy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea Erber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17212195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-21T05:24:39.6Z",
                "reviewBody": "I used banana puree instead of applesauce because I didn't have any and didn't want to use so much oil. I added some cinnamon and allspice. I also tripled the recipe because I have a big family. This turned out really well and a little batter makes a big pancake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYDIALW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lydialw2001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-24T02:05:04.94Z",
                "reviewBody": "I was surprised at how good these tasted! The grainy texture might throw some people off who are used to white flour pancakes but the taste is so yummy! My kids loved them and so did I! I decided to take some reviewers suggestions. I added an additional 1/2 tsp of baking powder and cut the sugar down to 1/4 cup. The pancakes rose well and had a wonderful sweetness to them. If I had had applesauce I would have used it as suggested but I didn't so I added 3 tablespoons plain greek yogurt and 3 tablespoons vegetable oil. I just couldn't stand the thought of pouring 1/2 cup of oil into my pancakes. They turned out wonderful. I think I'll add 2 tsp cinnamon next time when I make these again with the applesauce. Thanks for sharing this fantastic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8998154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-15T17:11:32.843Z",
                "reviewBody": "I made changes based on what I had on hand but nothing that should have changed the outcome of the recipe. I used half whole wheat and half barley flour halved the brown sugar and replaced one egg with 1/3 cup more applesauce and they turned out AMAZING. They were thick and substantial and delicious and I will make them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14648322/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-27T18:39:11.803Z",
                "reviewBody": "I LOVE these pancakes; they're so easy and the best pancakes I have ever had in my life!! Serving size definitely off but so yummmy!! I like eating them with just applesauce on top of the pancakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsDerrickson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4620721/"
                }
            }
        ]
    }
]