[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17527/desserts/fruit-desserts/banana-desserts/",
                    "name": "Banana Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21398/banana-pudding-iv/",
        "name": "Banana Pudding IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9140524.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-10-24T21:35:15.000Z",
        "description": "A quick and easy banana pudding recipe - enjoy!",
        "prepTime": "P0DT0H30M",
        "cookTime": null,
        "totalTime": "P0DT3H30M",
        "recipeYield": "1 - 9x13 inch dish",
        "recipeIngredient": [
            "1 (8 ounce) package cream cheese, at room temperature  ",
            "1 (14 ounce) can sweetened condensed milk",
            "1 (5 ounce) package instant vanilla pudding mix",
            "3 cups cold skim milk",
            "1 teaspoon vanilla extract",
            "1 (8 ounce) container frozen whipped topping, thawed",
            "4 bananas, sliced",
            "½ (12 ounce) package vanilla wafers"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat cream cheese until fluffy. Beat in condensed milk, then pudding mix. Gradually beat in cold milk until smooth, then mix in vanilla.  Fold in 1/2 of the whipped topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line the bottom of a 9x13 inch dish with vanilla wafers. Arrange sliced bananas evenly over wafers. Spread with pudding mixture. Top with remaining whipped topping. Chill.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Banana Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Patty"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.772301098312349,
            "ratingCount": 3733,
            "itemReviewed": "Banana Pudding IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "387.9 calories",
            "carbohydrateContent": "55.3 g",
            "cholesterolContent": "32.9 mg",
            "fatContent": "15.4 g",
            "fiberContent": "1.3 g",
            "proteinContent": "7.1 g",
            "saturatedFatContent": "9.8 g",
            "servingSize": null,
            "sodiumContent": "333.8 mg",
            "sugarContent": "36.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-09T14:53:31.35Z",
                "reviewBody": "This is the same recipe that my mother has made for years, and it is often said that it was this pudding that helped her snag her husband.  I have noticed a few problems people have been having with the recipe, and as usual it is not problems really with the recipe, but with the person/and or technique used while making it. (Don't mean to sound harsh.) First off, we always use skim milk in the recipe, and have never had a any problems. Secondly, NEVER use banana pudding to make this.  Though I'm sure it would taste ok, it just isn't like the old fashioned stuff, and if you use the banana flavored pudding you always will have that fake banana flavoring floating around in it...YUCK.  Third, one 5 oz. package is plenty to make this pudding thick.  Just make sure to use ice cold milk when mixing it.\r\nFourth, when creaming the cream cheese.  It must be at room temperature before you can cream it or add the other ingredients to it, otherwise, you will get a lumpy mess.  It is very important to cream it well with the sweetened condensed milk, because the air incorperated into this adds body and thickness to the overall dish. Finally, the dish that the recipe says to display the pudding in is merely a suggestion.  This isn't a baked recipe, so it won't matter at all what type of dish you use.  I prefer a large decorative glass bowl, and that way it can add a little more style to the whole dinner just by looking at it, and after that first bite, none of your guests/family/friends will",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WOODANGELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/178252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-24T00:17:16.053Z",
                "reviewBody": "I just have one comment. People who give reviews and have changed the recipe are not helpful at all. For once, I would like to see reviews based on exactly how the recipe is written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4255241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-31T13:15:05.263Z",
                "reviewBody": "Instead of the one larger box of instant vanilla pudding, I used one small box of instant vanilla pudding and one small box of instant banana cream pudding.  I also replaced half the milk with heavy cream and used a tub of the extra creamy Cool Whip instead of the regular Cool Whip. Also, instead of the whole can of sweetened condensed milk, I used less than half because I didn't want it to be too sweet. I also crumbled some Nilla wafers on the top for a better presentation.  I also used a smaller pan (I used a deeper, square casserole dish) and layered it in two layers instead of just one. I also put the sliced bananas in some diluted lemon juice to prevent browning.  It is absolutely delicious and looks very appetizing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CESPIRITU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/735445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T13:01:42.513Z",
                "reviewBody": "I took this to a party, and everyone loved it.  I did make a few changes - I used Pepperidge Farm Chessmen cookies in place of the Nilla wafers. I used only 2 cups milk to mix into the instant pudding. I beat the pudding & milk with a mixer, then beat the cream cheese with the condensed milk separately, stirred the cool whip into the cheese mixture, and added that to the instant pudding.  I used 8 bananas to make the 13 x 9 panful.  The pudding set up perfectly and cut like a dream - no running or soupiness.  The bananas did darken after we cut into it, but they tasted just as good the second day. This will serve a TON of people.  This is my new favorite pudding recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CORITA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-14T12:37:01.353Z",
                "reviewBody": "I have been making this recipe for over two years for family and large parties and have NEVER had any leftovers.  People get upset if I don't bring this with me! I use 1-3.4oz. pkg of French Vanilla Instant pudding mix, and 1/2 of a 3.4oz. pkg of Banana Instant pudding mix, only 1/2 of the can of condensed milk to keep it from being overly sweet.  I do also use more bananas, about six cover the bottom of a 9X13 pan.  Everything else is the same.  Yes, the cream cheese definately needs to be room temperature.  EVERYONE who has tried this has loved it, asked for the recipe, and always wants me to bring it to their get-together.  It is not like the original on-the-stove banana pudding which is very rich, this is a much lighter version and for the thousands that I have fed, much more preferred.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DazzlinDarlene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1547331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-28T04:22:17.45Z",
                "reviewBody": "YUM! I too followed the advise to use 3.5 oz size banana cream and a 3.5 oz size vanilla pudding instead of the 5 oz vanilla box. I reduced the condensed milk to 1/2 a can and it was still rich but delicious!! :)~\r\n\r\nI put mine in a round bowl (IE small punch bowl, decorative bowl) and ended up with two layers. I used a whole 12 oz box of vanilla wafers. I sprinkled lemon juice on the bananas to keep them from browning. Next time I would suggest trying Fruit Fresh or something of the like.\r\n\r\nMY suggestion is this....if you aren't making this for a large family/gathering and don't think you will have gobbled it up in about two days, then don't add the sliced bananas to the dessert.\r\n\r\nTry slicing a banana and serving it on top or bottom of the bowl as you serve it. This will keep the bananas from turning brown and the dessert will last longer in your refrigerator.\r\n\r\nGood Dessert!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MELTINGHEART",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/650171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-08T03:32:52.217Z",
                "reviewBody": "My mom and gramma were from the south and this no cook banana pudding is a staple. My granny made her's more like a pie and didn't use the condensed milk. Either way it's SO good and tastes heavenly! And seriously, for those of you who change the recipe by using fat free this or that, and reduced calorie and then leave less than 5 stars because it didnt come out right or tastes funny?! WTH people! You should be banned from allrecipes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thisgurlluvs2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1830033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-07T00:46:28.22Z",
                "reviewBody": "Love this recipe.\nI have used it a total of 5 times.\nI used Jello pudding mix.\n\n1st time turned out perfect\n2nd time turned out perfect\n3rd time - the pudding was runny and just wouldn't set.\n4th time - the pudding was runny and just wouldn't set.\n5th time - I figured out my mistake and it turned out perfect.\n\nOn my 3rd and 4th tries, it turns out I got the Jello \"Cook & Serve\" mix instead of the \"Instant\" mix . It was entirely my mistake, but it was such an easy mistake to make! Both boxes look exactly the same - same colors same font, except on the left bottom  of the front of the box where one says \"Instant\" and the other says \"Cook & Serve\".\n\nMake sure to get the \"Instant\" pudding mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6858537/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-20T22:18:53.983Z",
                "reviewBody": "This was fabulous!  I read through ALL the reviews, made a couple of recommended changes, and now have the best recipe for banana pudding that we've ever had.  I used l 3.4-oz box of instand banana pudding and 1 3.4-oz box of French vanilla pudding.  I cut the milk from 3 cups to 2 cups.  Otherwise, it was the same as the recipe.  Also, I topped it with crushed Nilla Wafers right before I served it.  There were 10 of us at dinner, and it was gobbled up very quickly.  Everyone LOVED it and wanted the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bearsmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/880336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-18T19:32:17.763Z",
                "reviewBody": "My cream cheese was at room temperature.  I followed the recipe.  The only thing I did differently was put in half the condensed milk (which a lot of people suggested in order to make it less sweet)... and it turned into a soup that never thickened.  What did I do wrong?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "theyoungatheart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2656379/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Banana Pudding IV",
            "description": "See how to make a luscious and creamy no-bake dessert!",
            "uploadDate": "2012-09-10T17:34:19.504Z",
            "duration": "PT3M41.077S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F348ec480-e431-4f8a-8bd9-858d490fc8da%2F992e0b78-d701-4fc2-950b-fdef785aa379%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1832668676001"
        }
    }
]