[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/653/main-dish/pasta/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26277/lemon-cream-pasta-with-chicken/",
        "name": "Lemon Cream Pasta with Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4495485.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2020-05-19T06:12:47.000Z",
        "description": "This deliciously different dish incorporates a classic combination of flavors: lemon, chicken, and garlic. A nice change of pace from the usual pasta fare.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "3 skinless, boneless chicken breast halves",
            "1 lemon, quartered",
            "2 teaspoons garlic powder, divided",
            "1 teaspoon ground black pepper, divided",
            "2 (14.5 ounce) cans chicken broth",
            "¼ cup fresh lemon juice",
            "1 (8 ounce) package rotelle pasta",
            "1 cup heavy cream",
            "1 teaspoon grated lemon zest"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Place chicken in a lightly greased baking dish.  Squeeze lemon over both sides of the chicken breasts and season both sides using 1 1/2 teaspoons garlic powder and 3/4 teaspoon pepper.  Bake for 40 minutes, or until juices run clear and chicken is no longer pink inside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a large saucepan, season the chicken broth with the remaining 1/2 teaspoon garlic powder and 1/4 teaspoon pepper.  Bring to a boil and add lemon juice and pasta.  Cook over medium heat, stirring occasionally, until all liquid is absorbed, about 25 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut cooked chicken into bite-sized pieces and stir into cooked pasta, along with the cream and lemon zest.  Cook, stirring, over low heat for 5 minutes.  Remove from heat and let stand 5 minutes.  Stir thoroughly before serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lisa Ramos"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.394072447859495,
            "ratingCount": 911,
            "itemReviewed": "Lemon Cream Pasta with Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "532.3 calories",
            "carbohydrateContent": "49 g",
            "cholesterolContent": "137.4 mg",
            "fatContent": "25 g",
            "fiberContent": "3.6 g",
            "proteinContent": "30.7 g",
            "saturatedFatContent": "14.3 g",
            "servingSize": null,
            "sodiumContent": "954.6 mg",
            "sugarContent": "3.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-11-25T00:35:26.273Z",
                "reviewBody": "Ya know what bugs me? So many people down rate a recipe and post all of the alterations they made and don't even try the recipe as written and the recipe it's self gets a lower grade than it deserves! I made this recipe just as written and it was absolutely wonderful!! Delicious, perfectly balanced flavors and perhaps the idea of baking the chicken is to reduce the fat from pan cooking in oils. The idea of cooking the pasta in the chicken broth with the seasons and lemon juice is brilliant because it really holds in the flavor! Wonderful, We love it!! Not to be petty, but it's really rediculous how so many discredit a recipe they don't even truly try because they make all of the changes, they're only rating their own recipes. Kudos for sharing this recipe, it's great!! Five stars from my family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Dobbs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/racheldobbs/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-21T12:33:11.373Z",
                "reviewBody": "This was incredibly simple and very tasty. The only thing that I did differently was instead of baking the chicken. I cubed it and seasoned it with lemon juice, garlic powder, and pepper in a bowl. Then sautéed the chicken in a little bit of oil. It was much quicker than baking it. After the pasta was ready, I made sure that not ALL of the broth had cooked into the pasta. The little bit of broth mixed nicely into the cream when I added it to the pasta. I made sure to let the pasta mix with the chicken a little while before adding the cream. I didn't want to add the cream when the pasta was too hot for fear of curdling. Otherwise this was a fantastic meal. \r\n\r\nMy boyfriend believes he could eat it EVERYDAY. I have to agree with him. It will be on the menu at least every week.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEYFEY1978",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1466754/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-21T02:21:01.56Z",
                "reviewBody": "this was a great inspiration dish. i made some changes to it. First, i cubed 3 b/s chicken breasts and put them in a bowl and i poured about 1/4 cup of lemon juice over it, about a spoonful of minced garlic, 1 tablespoon of lime juice, and about 1 tablespoon of lemon-pepper seasoning and i browned it in a skillet over med heat. After I finished the chicken, i transferred it to a bowl. In the same skillet, i cooked chopped mushrooms & red bell pepper in it. then put the chicken back in w/ the vegs. I followed directions for the pasta, I used multi colored spiral pasta. After the pasta was done, i threw it in w/ the chicken mixture and poured about 1/2 to 1 cup of the broth in and added 1/3 cup of milk & 1 tablespoon of butter (in subitute for the cream). It was DELICIOUS! Next time, I'll use cream to make it more \"creamy\" but this dish was very light and delicious. the lemony taste was subtle but strong enough. I love it. It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1584804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-25T21:34:16.857Z",
                "reviewBody": "This recipe could be made so much simpler. It was a strange way to cook pasta with broth lemon juice and spices. I sauted the chicken and added fresh broccoli artichoke hearts and sundried tomatoes. It made it taste yummy. I think it would have been boring with just chicken and pasta.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookin' Tammy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1571863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-30T00:42:04.407Z",
                "reviewBody": "I have been making this dish for a few months now and it has become one of my family's favorites! The only things differently that I do is that the pasta is done in about 10-12 minutes and I do add some broccoli in at the end of cooking. Also to simplify even more I use a package of Tyson's fully cooked diced chicken breast (sautee heat and pour it into the pasta). This is such a quick easy and absolutely delicious meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheri Konen Green",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1344293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T18:13:05.45Z",
                "reviewBody": "Amazing!!! Did not change a thing and it was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Jackson Climie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1163278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-27T03:20:02.297Z",
                "reviewBody": "Very yummy though I changed the cooking method a bit. I made a roux with butter and flour and and made this into a thick sauce. Instead of seasoning the breasts I just put all the ingredients into the sauce. I also added some white wine and a little lemon pepper. Oh ya I cut the chicken broth down to only 1 can as I wanted a really creamy sauce. I then put the whole uncooked chicken breasts into a casserole dish and I poured the sauce over them. I cooked them at 350 for about 25 mins and then served it over seasoned linguini. We had Steamed Zucchini (from this site) and Garlic Bread Fantastique (also from this site) with it and it went perfectly. Very tasty will make again. Thanx alot for this great recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsey Wolnowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-08T17:45:46.693Z",
                "reviewBody": "This is absolutely amazing.....I didnt have rotelle pasta so I used angel hair pasta. Instead of baking the chicken, I tossed it in flour and fried it in a little olive oil and butter. My family loved it and will make this again soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AvaGsMommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6691452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-10T22:05:17.75Z",
                "reviewBody": "This was okay. It wasn't exactly what I expected but we altered it a bit and would try it again. Like everyone else we didn't bake the chicken but just did it on the stovetop with some olive oil. We also added a bit of chopped onion and fresh garlic instead of powder. We only cooked the pasta for about 10 minutes and made sure to leave a bit of broth in the pan to mix with the cream. We also lightly sauteed mushrooms and asparagus spears and added those at the end. Served with a salad this is good but required some alteration.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "AnMei",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2152956/"
                }
            }
        ]
    }
]