[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232492/quinoa-cookies/",
        "name": "Quinoa Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3740966.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2020-03-05T05:10:35.000Z",
        "description": "I bake with my three-year-old at least once a week. We have tried a plethora of different cookies with different fruits and bases. This one was a hit! My three-year-old and older child both loved these, and I did too! They are super simple to make and sneak fiber, protein, and other nutrients into dessert! I used one cookie sheet for nine cookies, three rows of three fit well.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "18 cookies",
        "recipeIngredient": [
            "⅔ cup water",
            "⅓ cup quinoa",
            "1 cup shredded coconut",
            "1 cup rolled oats",
            "1 cup all-purpose flour",
            "¾ cup brown sugar",
            "2 ripe bananas, mashed",
            "½ cup applesauce",
            "½ cup peanut butter",
            "1 teaspoon vanilla extract",
            "1 teaspoon salt",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "¾ cup semisweet chocolate chips "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring water and quinoa to a boil in a saucepan. Place a cover on the saucepan, reduce heat to medium-low, and cook at a simmer until the moisture is absorbed completely, 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix cooked quinoa, coconut, oats, flour, brown sugar, mashed bananas, applesauce, peanut butter, vanilla, salt, baking soda, and baking powder together in a large bowl. Fold chocolate chips into the quinoa mixture; drop by spoonful onto prepared baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until browned around the edges, 20 to 25 minutes. Allow cookies to set up a few minutes before transferring to a cooling rack\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Liz"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.701298701298701,
            "ratingCount": 77,
            "itemReviewed": "Quinoa Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "187.9 calories",
            "carbohydrateContent": "27.6 g",
            "cholesterolContent": null,
            "fatContent": "7.6 g",
            "fiberContent": "2.7 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "274.1 mg",
            "sugarContent": "13.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-01-16T17:20:44.203Z",
                "reviewBody": "Quinoa is so healthy! I did a little adjusting to make this an organic recipe. I didn't have apple sauce so i put a Pink Lady un-peeled into my food processor & pulsed then I added the bananas & pulsed some more. I used all organic ingredients & substituted Sucanat for the brown sugar. Sucanat is dried sugar cane juice an organic brown sugar. Pulsed everything in the processor till the dough was throughly mixed & then stirred in the chips by hand. I'm a little anal about the look of my food so i used i scoop. The cookies don't spread when they bake so for the second batch I flatted them out. These cookies are a KEEPER! So good! Thanks...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KathleenB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1606569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-25T20:17:17.233Z",
                "reviewBody": "Super easy to bake! I recommend giving them a bit more texture with some nuts (pecans walnuts hazelnuts cashews or Brazilian) and add some hemp seeds or sunflower seeds. If you want them a wee bit sweeter just add more coconut flakes and use one cup of chocolate chips instead of 3/4 cup. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LisaGunoff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12474499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-29T00:30:14.427Z",
                "reviewBody": "This was a super easy recipe to make! Any chance I can make a healthier version of something I do it! I didn't have any applesauce so I substituted it for vanilla and honey Greek yogurt. Turned out amazing! Will definitely be making these again soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13038682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-09T13:30:33.53Z",
                "reviewBody": "I'm giving this 4 stars not only because I loved the cookie but because the recipe turned out exactly as stated. My only change was to use dried cranberries instead of chocolate and I added some cinnamon - both of which was just a personal preference. I always keep a container of cooked quinoa in the fridge so I used 1-1/3 cups because I didn't have to cook it up first. I made the first batch 9 cookies without the berries to see how they would cook up. They do not spread so you drop as many on your cookie sheet as you want. I preferred them cooked in a little mound makes them crunchy & chewy. I see some reviewers said the batter was too thin. I had no trouble with mine at all and the bananas I used were quite large. By the time everything was together it looked like a thick oatmeal coconut batter. (altho I did mix wet ingredients and dry ingredients separate then mix together) I think the difference may be in the measuring technique between users. If the flour and to some degree the oatmeal is more aerated the batter will be thinner. Liquid measure is always more exact. Personally I always scoop my measure cup into the container and then level off. If you have a problem with consistency then just add a bit more dry ingredients as you might be measuring differently than the person who posted the recipe. An FYI 1/4 cup of apple sauce replaces 1 egg in baking recipes in case you don't have apple sauce; and I always use a rice cooker for my quinoa 2:1 liquid:quinoa",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A. Salata",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5104894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-18T00:31:40.98Z",
                "reviewBody": "I made these cookies following the recipe to a \"T\" with two small exceptions. I added about 1/2 cup of raisins and split the flour 50/50 with AP and organic whole wheat. They aren't the prettiest cookies but they're quite tasty considering they have no eggs or butter. The texture is like a chewy muffin and I wouldn't recommend adding any more chocolate chips or sweeteners- they were plenty sweet for me. Going to freeze them as the recipe made 31 cookies! I will make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "rebemily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5685663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-24T21:15:22.49Z",
                "reviewBody": "Loved this recipe and the results! It was so easy to make (I guess just a bit longer to make since you have to cook the quinoa) but I did as the recipe said and just dumped everything in a bowl and mixed. No sifting not extra bowls then measured and cooked! I thought they tasted really good and my kids (ages 5 and 2) did as well. Warning though they did smell like quinoa when baking but didn't taste like it when cooked. Even the raw dough was delicious! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "angeldeerskin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2052216/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-02T17:37:31.567Z",
                "reviewBody": "Great recipe for healther cookies for kids. It taste like a granola bar. I added 1 cup cornflakes to add some texture and firmness to it because the mix was on the mushy side. I also adjusted the flour to 1/2 cup AP and 1/2 c. Wheat flr. Overall good healthy cookie. unfortunately my 3 year old didnt like it though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jbel22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10920297/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-10T21:42:23.143Z",
                "reviewBody": "I was impressed with how easy these are however I got almost 40 cookies out of one batch. The recipe says a yield of 18.....must be huge cookies as mine were average size of a packaged cookie. At any rate it just gives my family more goodness. They are nice and crunchy on the outside and chewy on the inside. My daughter really liked the raw batter and I am sure she will be pleased with the finished product. Like another reviewer I didn't have any applesauce so I just peeled an apple and pulsed it in the processor with the banana and peanut butter. I also substituted the brown sugar for coconut sugar added in all the remaining ingredients and pulsed until well blended. Yum!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6316009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-15T20:25:54.067Z",
                "reviewBody": "These are great!!!..my two kiddos loved them also. I liked the idea of the apple sauce and banana also this is the first time I have baked with quinoa and I found this recipe very easy...Good healthy cookie for my family. This made 4 dozen 1 Tbsp cookies... Thank you for the share",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Autumn Wilson Garver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13849468/"
                }
            }
        ]
    }
]