[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8733/italian-chicken-with-garlic-and-lemon/",
        "name": "Italian Chicken with Garlic and Lemon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6951.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "1999-05-03T21:31:03.000Z",
        "description": "Baked Italian chicken with lemon and garlic. You can make this dish with any of your favorite chicken parts - breasts, drumsticks, et cetera. Note: the garlic and onion can be put through a food processor.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "15 servings",
        "recipeIngredient": [
            "15 chicken thighs",
            "8 large potatoes, peeled and quartered",
            "1 cup vegetable oil, or as needed",
            "½ cup wine vinegar",
            "5 lemons, juiced",
            "10 cloves crushed garlic",
            "2 tablespoons dried oregano",
            "2 tablespoons dried parsley",
            "1 onion, minced",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the chicken pieces in a 10x15-inch enameled roasting pan. In a large skillet over medium high heat, fry the potatoes in 1/2-inch-deep oil until golden brown, then put them in the pan with the chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the vinegar, lemon juice, garlic, oregano, parsley, onion, salt and pepper with the 1/2 cup reserved frying oil and pour this mixture over the chicken and potatoes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 1 1/4 hours, basting the chicken and potatoes with the sauce mixture. Let rest for 5 minutes and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "PETEIYC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.133333333333334,
            "ratingCount": 180,
            "itemReviewed": "Italian Chicken with Garlic and Lemon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "275.2 calories",
            "carbohydrateContent": "33.3 g",
            "cholesterolContent": "58 mg",
            "fatContent": "8.4 g",
            "fiberContent": "4.1 g",
            "proteinContent": "19.1 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "63.6 mg",
            "sugarContent": "2.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-11T21:39:50.497Z",
                "reviewBody": "I rated this recipe based on how it's written.  This can be a delicious recipe with some tweeking.  Fry the potatoes with salt and italian seasoning and add chopped onions then finish cooking till golden and reserve oil in a bowl then transfer potatoes to a baking pan.  While frying potatoes, fry up chicken pieces of boneless chicken breasts and season with lemon pepper and salt to taste.  While all is cooking up, mix all the other ingredients together in the bowl with the oil.  Top the potatoes with cooked chicken then drizzle oil mixture over the entire meal.  Put in oven for 30 minutes and serve.  Make sure to put enough salt to bring out all the flavors before serving.  Also, limit the oil, it doesn't have to be a greasy mess, use good judgement here.  This turned out great!  Family loved it, no left overs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "chef Anel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1893909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-21T00:24:26.267Z",
                "reviewBody": "This might be my new favorite of all time!!!  What a delicious meal!  I used skinless, boneless breast and baked at 375 for 30 mins. and we had INCREDIBLE results!!!!!!! I want to make it again tomorrow!!  I used plain old Italian seasoning and I used less than the recipe called for (based on another reviewer's suggestion), but next time I'm going to use the full amount, it was a tantalizing tease not to use the full amount!!!!  (I'm a Jersey girl who knows real and GOOD Italian)  YUM!!!!!!!!!!!!  I only used as much oil as the potatoes needed to fry to a nice crispy outside.  Plus, I made sure to get the potatoes on top of the chicken so that they would stay crispy as it all cooked.  This is a delicious dinner!  Thanks so much!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COURTNEYGRIFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1466984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-12T17:03:20.78Z",
                "reviewBody": "This is fabulous - I make it quite often.  The chicken comes out soooo tender...  it's a great comfort food dish.  Make sure to get the potatoes real crispy when you're frying them.  I use approx. 1/4 cup olive oil in the vinegar mixture (step 3) rather than use 1/2 c. frying oil - seemed to make the dish a tad too greasy.  Other than that, I make the recipe as written. Thanks for sharing, Peter!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KITTYMOMMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1047663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-18T17:00:41.733Z",
                "reviewBody": "I cooked this dish for my family and my boyfriend. Everyone thought it was delicious! I followed a few of the suggestions given by other reviewers (substituted some of the parsley and oregano for Italian seasonings put the potatoes on top of the chicken so they wouldn't get soggy etc.). I also marinated the chicken in Italian salad dressing for a couple of hours (all day probably would have been better) and then left some of it on the chicken when I transferred it to the baking pan. My mom thought less lemon juice should have been used and my dad suggested filleting (sp?) the chicken breasts next time so that more of the flavor could be soaked up. Since I used boneless skinless chicken breasts I cooked it for 45 minutes (it was perfect). I served it alongside sauteed green beans and it made for a beautiful dish. (I wish I had taken a picture it looked so much better than the other two pictures with this recipe!) Overall it was easy to prepare...the only time-consuming parts were the potato prep and dicing the garlic and onions...and it was delicious! I will use it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily Johnson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1816129/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-22T11:45:33.957Z",
                "reviewBody": "This was wonderful! Quick and easy tasty and a hit with the whole family. I did follow the advice to season my potatoes while frying them. For appearance sake I will also brown my chicken a little first too so it doesn't have that white color. The coloring has no effect on the flavor though! My husband couldn't wait to take these for leftovers the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs_Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/copperskillet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-01T02:01:39.747Z",
                "reviewBody": "OMG!! This is AWESOME! AWESOME! AWESOME!!! I've been looking for this recipe for soooo long!! My grandmother used to make this all the time when I was a child. I loved it then and I love it even more now!! I had no idea how incredibly quick and easy this is!! Chicken comes out moist and juicy and potatoes are crispy and melt in your mouth all at the same time with incredible flavor bursting from everywhere! And it gets even better...The whole family couldn't stop eating this!! This is a MUST TRY RECIPE!! Thank you Peter for the wonderful recipe and for bringing back wonderful memories!!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GIGI9801",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1153821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-15T17:23:12.53Z",
                "reviewBody": "Thank you for a great and very interesting recipe! I tried this for sinner today and it was a complete success! The potatoes were so yummy with such a wonderful lemony flavour! I did a few changes though I was out of thighs so I used breast but I will definitely tried with thighs next time. I find breast a little too dry! I pre-fried the chicken in olive oil first so it was nice and brown and then deglazed the pan with white wine which I used instead of the vinegar call in the recipe since my husband doesn't care for vinegar at all. I also used fresh oregano thyme and parsley instead of the dry staff since I had it at hand. It took time to get everything ready but it was well worth it! This will be one of our favourite Sunday meals for now on! Once again THANK YOU KINDLY!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYS63RECIPES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/695591/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-01T23:10:10.577Z",
                "reviewBody": "Looking for a good recipe that my PICKEY family would eat using thighs. They all ate and asked for more---and not just for the potatoes. I followed the recipe except I decresed the lemon by half added italian seasoning to the sauce instead of the parsley and fried the potatoes for the first 30 min while the chicken baked. I then added them on top and continued to baste. I did salt them before I added them. Thanks for all of the comments before. They really helped to make this dish my families new favorite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawn Aiono",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1329873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T10:01:38.907Z",
                "reviewBody": "pan fried the potatoes with less oil.excellent flavors.will make again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TRIANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/35896/"
                }
            }
        ]
    }
]