[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/78741/chicken-breasts-in-caper-cream-sauce/",
        "name": "Chicken Breasts in Caper Cream Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8080249.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2004-11-20T17:58:31.000Z",
        "description": "My husband (who is not a cook) developed this recipe when looking through what we had in the fridge.  We love capers and my VERY picky 8-year old always asks for 'Daddy's chickie.'",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 boneless, skinless chicken breast halves",
            "1 teaspoon lemon pepper",
            "1 teaspoon salt",
            "1 teaspoon dried dill weed",
            "1 teaspoon garlic powder",
            "3 tablespoons butter",
            "½ cup whipping cream",
            "2 tablespoons capers, drained and rinsed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season chicken breasts with lemon pepper, salt, dill weed, and garlic powder.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a large skillet over medium heat. Place breasts in skillet, and increase heat to medium-high. Turn chicken frequently, until brown, about 5 minutes. Reduce heat to medium, and cook 5 to 7 minutes, until breasts are cooked through. Remove chicken to a warm serving platter, and cover with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return skillet to stove, and increase heat to high. Whisk in whipping cream, whisking continuously until reduced to sauce consistency, about 3 minutes. Remove from heat. Stir in capers. Pour sauce over chicken, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MOMMYTO2BOYS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.627674750356634,
            "ratingCount": 2103,
            "itemReviewed": "Chicken Breasts in Caper Cream Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "313.3 calories",
            "carbohydrateContent": "1.8 g",
            "cholesterolContent": "132.1 mg",
            "fatContent": "21.2 g",
            "fiberContent": "0.3 g",
            "proteinContent": "28.2 g",
            "saturatedFatContent": "12.7 g",
            "servingSize": null,
            "sodiumContent": "974.3 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-15T16:35:48.533Z",
                "reviewBody": "Four stars as written, as I believe that with just  cream the sauce would lack dimension and would be rather flat. I embellished upon the recipe which made this dish a solid five star recipe.  The chicken, which I seasoned only with salt and freshly ground pepper, developed a much more appealing look and color dredged in flour before sauteeing. Once I turned it over I covered it just briefly to make sure it was cooked through. After removing the chicken to set aside, I deglazed the pan with about 1/4 c. of white wine, then added the cream, a good squeeze of lemon (didn't use the lemon pepper at all), and now the dill.  I used only two chicken breasts but kept the sauce measurements the same (essentially doubled the sauce), and it was just the right amount. If prepared with the amount of sauce as the recipe directs it would be pretty skimpy!   The chicken was moist, tender and flavorful, with a rich, creamy lemon/caper/wine/dill sauce that made an already good chicken something extraordinarily delicious.  I served this with cappellini pasta and \"Spaghetti Squash Saute,\" also from this site. This was an outrageously delicious dish,  a definite \"make again.\"   This cooking method and the sauce, by the way, would also be wonderful with salmon or other types of fish as well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-10T05:51:06.797Z",
                "reviewBody": "Made this for the first time tonight and it was fabulous!  I followed others' advice  and doubled the cream sauce.  I am glad I did that because we had exactly the right amount of sauce.  I would highly recommend trying this WITHOUT putting any flour/cornstarch in the sauce because it was perfect without it.  I usually like to try a recipe exactly as written the first time and then make adjustments (if needed) the next time.  However, without changing any of the ingredients I did them a little differently.  I marinated the chicken breasts in lemon juice for about 15 minutes and then seasoned them with ground pepper, sea salt, and fresh baby dill.  I diced one clove of garlic and added it to the butter that the chicken cooked in.  That was the only variation from the recipe that I made.  My husband, daughter and son-in-law raved about this one and instructed me to give it a top rating.  I will definitely make this many times again, it would be perfect for company.  I served it with steamed broccoli and lightly buttered penne pasta with fresh grated parmesan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "deedee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2228031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-29T21:20:08.61Z",
                "reviewBody": "WOW!!! This had such fantastic flavor! I did make some changes to the recipe. I used chicken tenders instead of breast halves. I didn't have any lemon pepper so I used McCormick's Key West Spice Blend (lemon zest, basil and thyme) and added black pepper in it's place. I also deglazed the pan with a couple splashes of white wine before I sauted some garlic and added the fat free half and half, as suggested by others. It was outstanding! I have also substituted Tilapia for the chicken - YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crcowley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2137677/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-26T22:32:43.62Z",
                "reviewBody": "I'm here to tell you this recipe was elegant and exquisite!!! I made a couple of alterations: used heavy whipping cream, doubled and added 1 tbsp of flour to it for thicker sauce. Used a little Tony Chachere's Creole Seasoning (we put it on everything in Louisiana!!!) in addition to the other seasonings for the chicken and sauteed freshly minced garlic before I added the chicken to the butter. Also cut the breasts into medium sized pieces and placed them back in the skillet with the sauce to mildly simmer for another 10-15 min. Definitely want some bread to dip in the sauce!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bayou Gator",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/753209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-11T03:19:05.72Z",
                "reviewBody": "This recipe is very delicious and easy! My picky 9-year-old nephew even loved it. My husband soaked up every bit of the sauce (that I doubled) with his rice and went back for seconds. I also pounded the chicken breasts thin like other reviewers suggested. The chicken cooks up really quick and tender this way. Or, you can use the thin-sliced chicken breasts at the supermarket if you are in a hurry. I am going to try fat-free half and half next time for some of the cream. Thanks for the great recipe! Update 1/17/06-Made again tonite and used fat-free half & half and less butter- worked great. Also, lightly floured chicken with the seasonings and put some of dill directly in sauce. Uploaded picture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissajean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1503152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-02T14:55:07.487Z",
                "reviewBody": "For such a simple recipe, there was a lot a flavor carried in the sauce from the meat juices and fats in the cream.  I used olive oil instead of butter to add a healthier element to the dish   My husband and children LOVED this recipe, as did I! GREAT for a quick weeknight meal when you want to make it seem like you spent time in the kitchen...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Weslee Parker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-03T17:23:06.547Z",
                "reviewBody": "My girlfriend LOVES when I make this for her, says that I'm going to spoil her! This is a great recipe that I only adjusted a bit after reading other reviews that made sense. Adjustments were: (1)squeezing lemon juice onto chicken breasts and then seasoning with (2) garlic pepper and dried dill weed. Then let sit 15 minutes. (3) NOT turning chicken more than twice. (4) De-glazing the pan with 1/2 cup Pinot Grigio and simmer down by one half before adding doubled recipe amounts of sauce ingredients and then letting that reduce a bit - as per directions. The thin consistency complaints I've read should be adressed by REDUCING, NOT ADDING STARCH OR FLOUR. This is a sauce and not a gravy! I like to serve this with an asparagus amandine and a cooked pasta sautéed with EV olive oil, butter, garlic and parmesan. The sauce just gets all over everything and is INcredible! Thank you mommyto2boys for this great recipe! You should let your husband browse for ingredients some more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stiritup",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7076743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-15T03:32:11.11Z",
                "reviewBody": "Pretty tasty. I used fat free half and half instead of whipping cream. Would double the sauce next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "linc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2179620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-07T01:31:54.887Z",
                "reviewBody": "This is one of my favorite chicken recipes.  It is easy and very flavorful.  I don't think it would be quite as nice if you made it with regular milk and flour or corn starch as other readers have done.  Then it becomes gravy rather than sauce?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TMAYDER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/410507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-13T04:05:59.763Z",
                "reviewBody": "What did I do wrong??? All the reviews were good and it seemed like a simple recipe but my sauce curdled!  I did use fat free half n half (and it was fresh) but other than that I followed the recipe.  The chicken had good flavor but I didn't even try to serve the sauce.  Any ideas on what might have affected the sauce?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Ima Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2421330/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Breasts in Caper Cream Sauce",
            "description": "See how to make Chicken Breasts in Caper Cream Sauce.",
            "uploadDate": "2013-01-03T18:07:10.895Z",
            "duration": "PT2M28.053S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3fec14c0-b80f-4fa4-9815-0e85dca2af77%2Fc5d90354-0b28-4a69-9790-b916e3ff25bd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2071042566001"
        }
    }
]