[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232681/char-siu-chinese-bbq-pork/",
        "name": "Char Siu (Chinese BBQ Pork)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1060446.jpg",
            "width": 2809,
            "height": 2815
        },
        "datePublished": "2020-03-05T05:10:37.000Z",
        "description": "\"Char siu\" literally means \"fork roast\" - \"char\" being \"fork\" (both noun and verb) and \"siu\" being \"roast\" - after the traditional cooking method for the dish: long strips of seasoned boneless pork are skewered with long forks and placed in a covered oven or over a fire. This is best cooked over charcoal, but it's important to cook with indirect heat.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H25M",
        "totalTime": "P0DT3H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 pork tenderloins",
            "½ cup soy sauce",
            "⅓ cup honey",
            "⅓ cup ketchup",
            "⅓ cup brown sugar",
            "¼ cup Chinese rice wine",
            "2 tablespoons hoisin sauce",
            "½ teaspoon red food coloring",
            "1 teaspoon Chinese five-spice powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut pork with the grain into strips 1 1/2- to 2-inches long; put into a large resealable plastic bag.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir soy sauce, honey, ketchup, brown sugar, rice wine, hoisin sauce, red food coloring or red bean curd (see Cook's Note), and Chinese five-spice powder together in a saucepan over medium-low heat. Cook and stir until just combined and slightly warm, 2 to 3 minutes. Pour the marinade into the bag with the pork, squeeze air from the bag, and seal. Turn bag a few times to coat all pork pieces in marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Marinate pork in refrigerator, 2 hours to overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pork from marinade and shake to remove excess liquid. Discard remaining marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook pork on preheated grill for 20 minutes. Put a small container of water onto the grill and continue cooking, turning the pork regularly, until cooked through, about 1 hour. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "David&Andrea"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.463636363636364,
            "ratingCount": 110,
            "itemReviewed": "Char Siu (Chinese BBQ Pork)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "482.9 calories",
            "carbohydrateContent": "53.5 g",
            "cholesterolContent": "126.7 mg",
            "fatContent": "8.9 g",
            "fiberContent": "0.6 g",
            "proteinContent": "43.8 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "2249.8 mg",
            "sugarContent": "48.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-10-29T21:24:13.563Z",
                "reviewBody": "I like this recipe and have made it three times, with modifications the second and third time. Some observations: Chinese use pork butt for Char Siu because we love the fat and it really is part and parcel to the authentic dish. That said, I used tenderloin the first time, pork sirloin roast the second, and pork shoulder the last. The latter/fatter cut was better in flavor and juiciness, but of course, less healthy.\n\nI do like pretty red colored char siu but against my better judgement, I used the full 2 tablespoons of food color which was huge overkill.  I went with 1 tablespoon the second time and it was still way too much and stained my cutting board. Food coloring is terrible for our bodies so cut it way back, or not at all, or as suggested, substitute red bean paste or boil down some beets if you want it red. \n\nI also like five spice, but take care how much you use. It will overpower all other ingredients. I suggest 1/2 teaspoon or less.\nReserve 1/2 cup of the marinade for non-cross contaminated basting before you bag up the meat, and marinate it no less than overnight. It needs to be in the soup that long to penetrate. Don't cook it for an hour or you'll overcook. Use a thermometer and pull it at 145 degrees and let it rest. The water pan is a good suggestion if you are using leaner cuts. A whole butt roast makes a lot, so I portion it up and freeze pieces for later use. I just made \nChar Siu, doufu, fan (BBQ pork tofu over rice) using bean paste as the main seasoning f",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dan Chan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16635535/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-01T16:55:29.28Z",
                "reviewBody": "My husband mostly made this recipe since he is the grill man. He followed the recipe ingredients including some good shakes of the Chinese five spice, garlic powder, and onion powder. We marinated our tenderloins for 8 hours (cutting the two into four 2-inch thick loins). He cooked this on the charcoal grill over indirect heat as directed, but He kept the water pan in the whole time. The loins being only 2 inches thick reached 145° in 40 minutes, so watch your time. I cooked the remaining marinade on the stove-top, adding in some cornstarch to thicken it and he basted the meat. Next time I'll make a batch and half of the sauce, it really was great tasting, but we really had to stretch it. We served over white rice with broccoli, all a great combination. Just a note, if you have a green egg cooker, there is a YouTube video on how you can cook this like the Cantonese do by hanging it in your grill.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-12T20:44:33.583Z",
                "reviewBody": "Delicious!  And prepared in the oven...  \n\nI used a pork shoulder roast (which was on sale), trimmed of fat and cut into 2\"x5\" pieces.  I also substituted cooking sherry for the rice wine, and I didn't use food coloring.  Cooked it in the oven at 350° on a wire rack set above a pan with about 1/2\" of water in it for about 45 minutes.  Half-way through the cooking process, I brushed the meat with the marinade and then finished in the oven.  Tastes just like my favorite restaurant but much less expensive!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Randy Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3496610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-05T23:17:27.903Z",
                "reviewBody": "My grill is under a snow bank so I made this as close as I could on a pan on the stove. I did cook with some of the extra marinade so I probably got a little extra flavor from that. Very nice. I will probably make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "duboo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/duboo/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-25T17:23:34.717Z",
                "reviewBody": "I'm a new cook learning from my mom. This is my 2nd time making this recipe and it's great. I used rice wine vinegar and baked it in the oven at 350 for 45 mins over a baking dish filled with water, brush them 1/2 way thru process with marinade. At the end put them in the boiler for about 2-4 mins to crisp the skin,  used tenderloin and served with white rice. Very good and close to Sam Woo BBQ a local and classic Chinese restaurant",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hamburger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15426677/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-04T00:07:51.297Z",
                "reviewBody": "I loved everything about this marinade yum! Only addition a slug of rice wine vinegar with all of the sweet going on felt it needed a little acid balance. Hubs grilled to perfection. A keeper! Thanks for the recipe D & A.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Saveur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-07T21:21:51.79Z",
                "reviewBody": "This marinade tastes really good! those of you that used gin or sherry, the only thing I have to say is yuck! Next time get all the ingredients correctly if you really want to have good tasting meat. Something's you just don't substitute.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Irene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3349578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-25T18:53:00.94Z",
                "reviewBody": "Not sure what went wrong.  I followed the recipe exactly except I substituted cooking sherry for rice wine do to no availability and cooked in the oven as it's winter in Ak and grilling was not an option.  I marinated two pork tenderloins and cooked the first one after two hours in the marinade.  It wasn't very good and the flavor tasted way off.  So I let the second tenderloin marinate over night thinking maybe that would help.  It was even worse.  I usually like homemade asian recipes and I love bbq pork so not sure where this recipe went wrong as others seemed to really like it.  We will not make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "willow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5033144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-09T07:30:58.61Z",
                "reviewBody": "the only thing I did differently was to cook it in a smoker I worked 5 years in a Chinese restaurant and they cooked all their bbq ribs and loin in a smoker they even smoked duck that had been marinated in soy and spices",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wilmbear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15116749/"
                }
            }
        ]
    }
]