[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/135367/chinese-lions-head-soup/",
        "name": "Chinese Lion's Head Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F666788.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2020-06-02T23:58:35.000Z",
        "description": "This is my family's version of lion's head soup and for me it is the best type of comfort food!  It is best served with white sticky rice, and wonderful enjoyed on a cold winter day.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound ground pork",
            "1 egg",
            "1 tablespoon cornstarch",
            "2 teaspoons sesame oil",
            "1 tablespoon minced fresh ginger root",
            "¼ teaspoon monosodium glutamate (MSG)",
            "1 teaspoon salt",
            "2 green onions, chopped and divided",
            "1 tablespoon vegetable oil",
            "1 head napa cabbage, cored and cut into chunks",
            "2 cups low-sodium chicken broth",
            "2 cups water, or as needed",
            "1 tablespoon soy sauce",
            "2 teaspoons sesame oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix the ground pork, egg, cornstarch, 2 teaspoons of sesame oil, ginger, monosodium glutamate, salt, and half of the chopped green onions together in a bowl. Use your hands to mix until the ingredients are evenly distributed. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a wok or large skillet over high heat. When the oil is hot, fry the napa cabbage, stirring constantly, until cabbage begins to wilt, 2 to 3 minutes. Pour in the chicken broth, water, and soy sauce. Bring to a boil, then lower the heat to medium.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use a spoon to form the meat mixture into 1 inch balls. Drop them into the boiling soup. When the last ball has been added, cover with a lid and simmer for 10 minutes. Taste, and adjust salt before serving. Garnish with remaining green onions and a drizzle of sesame oil.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lei Lei Wyatt"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.625899280575539,
            "ratingCount": 139,
            "itemReviewed": "Chinese Lion's Head Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "431.1 calories",
            "carbohydrateContent": "7.1 g",
            "cholesterolContent": "130.2 mg",
            "fatContent": "34 g",
            "fiberContent": "1.6 g",
            "proteinContent": "24.1 g",
            "saturatedFatContent": "10.8 g",
            "servingSize": null,
            "sodiumContent": "990.6 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-09T15:33:42.903Z",
                "reviewBody": "I grew up in an Asian household and we sure do love our soup! This was great once I made a few adjustments.  We really like a lot of broth (as we have it with noodles), so I increased the liquid to 5 cups chicken stock and 3 cups of water.  Even with that much liquid there was MORE then enough meat!  I mixed in 2 green onions into the meat mixture and a dash of black pepper. I skipped sauting the cabbage and added it into the simmering soup the last few minutes of cooking, we don't like it mushy.  As for the soup itself, if you add the meatballs in before it comes to a simmer, they will not fall apart.  The last couple minutes of simmering I added in 3 thinly sliced green onions, a large handful of sliced cilantro, and a bit more soy sauce to taste.  and DON'T SKIP THE SESAME OIL, this is key to the flavor.  The meat filling and broth would also be good for wonton soup!  Try adding in some sliced carrots or broccoli towards the end with the cabbage, very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "roweena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1912117/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-09T16:45:24.78Z",
                "reviewBody": "This brings back childhood memories! For the meatballs an easier way to make them is using a rounded \"tablespoon\" to make the shape easily as I dumped it one by one into the all chicken broth i a pot that had browned minced garlic. At the end of cooking everything I added Lee Kum Kee brand of oyster sauce as needed at the end of cooking to add another dimension to the broth. The reason I cooked the meat in the broth first prior to boiling is to allow the meat to have more total time cooking in the broth (total 15 mins). After the meat has been in the simmering broth I added the stem parts of the napa cabbage into the broth/meat since they take longer to cook compared to the leaves cooked this for 5 mins. Then I added the napa cabbage leaves cooked this for 5 mins. This way parts of the cabbage wasn't overcooked in the one pot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bony Kari",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/966504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-24T16:34:39.5Z",
                "reviewBody": "I make this often in the winter..but I do something just a little different..I bake it..I layer some cabbage leaves in the bottom of my ceramic cook pot then put in the raw meat balls and then I pour over the liquid that I have heated to just boiling. Then I layer the rest of the cabbage with some fresh ginger and garlic slices. I simmer it for about 2-3 hours in a covered pot on 300'...Or you can make it in the morning and put it in the slow cooker all day..Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy LaRocque Westgate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3013659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-08T03:41:42.24Z",
                "reviewBody": "I made this tonite for the first time and it won't be the last! The only change I made was to use 3 cups of broth and 1 cup of water. I was a worried the broth would be a little 'thin' for our taste if made as written. Kids and adults loved this soup equally. This was immediately deemed a 'keeper' here. Thank you so much for the wonderful recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2313668/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-22T00:09:21.9Z",
                "reviewBody": "I just made some soup inspired by this recipe and a pork dumpling recipe. It's very good as a base although just by looking at the proportions compared to what I just made it will be meat and cabbage heavy - as another reviewer mentioned you might want to add more broth/water to taste as you're going. I only had 1/2 a napa cabbage and 1/2 lb of pork. Mine could have used more broth as well (and that's with about 3 cups for this I'd say total 6 cups broth/water). All in all very similar to this. Of all my changes I'd recommend adding the garlic powder and chinese five spice browning the meatballs and adding some vinegar to the broth. For the meatballs I used 1/2 beaten egg then whisked in 1 tbsp corn starch 1 tbsp soy sauce 2 tsp sherry wine 1 tsp grated fresh ginger 1/2 tsp sesame oil 1 tsp garlic powder and 1 tsp chinese five spice. I mixed 1/2 lb pork 1/4 cup bread crumbs 1 minced green onion in by hand. That made about 22 meatballs I ended up only using 15 or so and froze the rest. To get a nice brown color I placed them on lightly greased baking pan and left them be in the oven for 15 minutes at 400F. My soup base was almost identical; I sauteed onion in one to one ratio with the cabbage (1/2 onion with 1/2 head of cabbage) then added a few sliced shittake mushrooms and sauteed until the liquid had simmered off. I added another tsp of ginger to the broth as well as 1/2 tbsp rice vinegar 1 tbsp brown sugar and a dash of allspice. Quite excellent! A das",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fujiq/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-30T14:31:28.67Z",
                "reviewBody": "The base of soup is very simple.. I added more broth.. I did not care for the meatballs.. I love ginger but it was out of balance for me way too much.. Will make again with adjustments to meatballs.. thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Wiser1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wiser1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-04T15:19:20.427Z",
                "reviewBody": "This recipe is a keeper. I followed it exactly and it was great. The only thing I did different was use lean ground turkey instead of pork to cut fat. Usually things I make with the lean ground turkey are a bit firm and tough but these dumplings were soft and pillowy. Really delicious. Thanks Lei Lei! Talk about easy cheap Chinese flavors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2724905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-22T03:30:10.24Z",
                "reviewBody": "I had to try this out tonight! Lions beat the Packers and just the Name alone was to add insult to injury to the hubby, who's a Packer fan in the family:( \nWe LOVED! I used 8 cups of chicken broth instead of the 2 C. each of broth and water.\nI also baked my pork balls. Just what we prefer.\nAdded more green onions and soy to our taste and some white ground pepper.\nI also just chopped the Napa cabbage and put in the broth until done. Added the pork balls and simmered about 10 minutes.\nEverything was so delicious! Loved all the flavors! We went back for seconds! \nThank You So Much Lei Lei for sharing! Will be making again Very Soon! \nOh! First time I ever bought Sesame Oil! I was shocked at the price! Wow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "balboud",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6580636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-06T16:47:16.77Z",
                "reviewBody": "A really simple dish to prepare. The only thing I did differently was boil it a bit longer being somewhat paranoid about the doneness of my slightly oversized meatballs. The results were outstanding. Everyone who tried it declared it \"a keeper\" and went back for a second bowl.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vixer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2714786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-30T15:17:08.113Z",
                "reviewBody": "The taste was wonderful and homey but the proportions for the broth to other ingredients must be off. I would cut the amount of cabbage to half a head as long as the head of cabbage is small. That will make this a soup rather than a dish of meatballs in boiled cabbage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "tagore1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3453248/"
                }
            }
        ]
    }
]