[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11327/ice-cream-kolacky/",
        "name": "Ice Cream Kolacky",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F267342.jpg",
            "width": 1000,
            "height": 667
        },
        "datePublished": "1999-03-30T22:18:51.000Z",
        "description": "This dough is made rich by adding ice cream. It is made even quicker and easier by using a canned filling.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT8H40M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "2 cups butter",
            "1 pint vanilla ice cream",
            "½ cup fruit preserves, any flavor"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Add flour to butter and crumble in pastry blender. Add ice cream to crumbled mixture and, using dough hooks, work into dough. When dough is smooth, shape into ball and refrigerate  overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough to about 1/8-inch thickness on a floured surface. Using the rim of a glass dipped in flour, cut out  circles. Place on a cookie sheet and make a thumbprint in center of each. Fill thumbprints with 1/2 teaspoon fruit preserves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 20 minutes. Sprinkle with confectioners' sugar when cool.\n"
            }
        ],
        "recipeCategory": [
            "Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.6476190476190475,
            "ratingCount": 105,
            "itemReviewed": "Ice Cream Kolacky",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "252 calories",
            "carbohydrateContent": "23.1 g",
            "cholesterolContent": "45.5 mg",
            "fatContent": "16.8 g",
            "fiberContent": "0.7 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "10.5 g",
            "servingSize": null,
            "sodiumContent": "120.3 mg",
            "sugarContent": "5.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-02T00:36:55.983Z",
                "reviewBody": "This recipe has been in our family for over 50 years. We use it every Christmas season. There is a slight difference in rolling out the dough. We roll it out paper thin then add Solo Brand Poppy Seed Almond or any type of preserves you like. When we cut out the dough with a glass we fill it then we fold the corners to make a small popover then we pierce it with a fork to keep it together. We cook them for 12- 14 minutes. Everything else is pretty much the same. If you would like more info contact me via email. This is a wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BMAK5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/758959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-02T00:37:35.983Z",
                "reviewBody": "I made several batches of these over the holidays and received many compliments! I used apricot raspberry and sour cherry preserves. Also I used large cookie cutters to make them look especially festive!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori Kochanek Splavec",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/245735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-12T21:16:28.36Z",
                "reviewBody": "These were beautiful! I didn't need to add anything extra to them. I used Haagan Daaz(sp?) Vanilla and added it with my hands because I don't have dough hooks and I had to defrost myself several times with warm water. I realize now I could have worn gloves but it doesn't matter. I rolled the cookies to about 1/4 inch thickness and made the holes with my thumb. I filled the holes with strawberry preserves. The cookies were perfect good flavor texture and appeararance. Also easy to make. MAke this recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aloloo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2405756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T16:33:47.423Z",
                "reviewBody": "I made a couple of batches before getting this right. I did need to add more flour (about 2/3c) to get the dough just right. Making the 1/8 inch circles did not work for me. After baking for 20 minutes the center was not done..I baked and baked the center never cooked and the edges were getting dark...I threw that batch away. I saw another reviewer had mentioned rolling them paper thin and folding them over with the filling inside. I did this and they came out perfectly (I reduced heat to 325 and checked them frequently) Thanks for sharing I will definately make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lov2eeet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2645523/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-25T02:37:56.17Z",
                "reviewBody": "This is a wonderful recipie and got rave reviews from my mother who made kolackys for years. I did find the dough a bit wet and adding an extra 2/3c. of four helped greatly.When rolling out the cookies we use powdered sugar instead of flour. It gives the cookies an added sweetness. The only other variant is the way way we cut out the cookies. We cut squares aproxamently 2x2 and add a small dollop of lekvar apricot or nut filling then roll tightly pressing the open ends to seal. Thank you so much for posting this recipie and giving me a wonderful holiday cookie from my childhood.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Zervos Holbrook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1290116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-10T16:53:04.937Z",
                "reviewBody": "I hope this is helpful to those trying this for the first time. This is a pastry and should be made with butter-not margerine-or spreads. Butter is from cream margerine is from soybean or corn oil and a spread contains up to 50% water. There is a huge difference in using butter vs. margerine and an even bigger difference if you use a spread. The success of this recipe depends on using butter. Those reviews that recommend adding more flour are likely not using butter and are also likely to have a tougher pastry as a result of adding more flour. This recipe is perfect as written and these pastries will melt in your mouth if you make them as directed. Refrigeration will firm up the dough so you can cut out your pastries. We make these at Christmas and special occasions and use holiday cookie cutters. You can roll the dough out using powdered sugar (don't use flour-it will make them tough) but I roll out dough on wax paper on my cookie sheets adding no powdered sugar if possible. I return it to the fridge to firm before cutting out the shapes with cookie cutters and place them on the baking sheet. Do this quickly as the butter will return to room temp and be difficult to cut. If this happens return to the fridge till firm and continue cutting out cookies. After baking then sprinkle with powdered sugar or drizzle with a glaze. I've never used a jelly or jam as they are thinner than the solo brands of fruit fillings. This will be a 10 star pastry for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Gunkel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-04T22:13:21.86Z",
                "reviewBody": "The cookies are great! I did both the popover and the regular cutouts. A little messy for my cookie sheets. They puff up alot more than I expected which gave me trouble with figuring out when they were completely cooked. I also had to add flour to get them to a point where I could roll them out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2091581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-10T17:28:12.253Z",
                "reviewBody": "These were awesome! It needs a little extra flour though. I used fresh raspberries from my raspberry bush mashed them put them in a saucepan added some corn starch plus a little water then I cooked it for a couple of minutes until it thickened. I suggest using fresh fruit and cook it like I did...it is really delicious! They turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2088286/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-16T19:14:09.023Z",
                "reviewBody": "I've used this recipe for nearly 40 years. My grandmother had a SOLO pie filling cookbook that we made many recipes from and this was one of them. I usually make 3 or 4 batches every Christmas and my boys can't get enough! And sooo easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carolyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4190611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-21T00:20:30.2Z",
                "reviewBody": "complicated and I did not find them worth the time it takes to make them",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3812242/"
                }
            }
        ]
    }
]