[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/650/meat-and-poultry/chicken/fried-chicken/",
                    "name": "Fried Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8802/tanyas-louisiana-southern-fried-chicken/",
        "name": "Tanya's Louisiana Southern Fried Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9367559.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-05-26T22:39:43.000Z",
        "description": "This recipe is from my grandmother and great grandmother's family.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (3 pound) whole chicken, cut into 6 pieces",
            "2 eggs, beaten",
            "1 (12 fluid ounce) can evaporated milk",
            "2 teaspoons salt",
            "2 teaspoons ground black pepper",
            "2 teaspoons garlic powder",
            "2 teaspoons onion powder",
            "2 ½ cups all-purpose flour",
            "1 ½ cups vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium size bowl mix together the eggs and milk. Add ALMOST all of the salt, pepper, garlic powder, and onion powder (reserve a dash of each for seasoning the chicken pieces). Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle a dash of the remaining salt, pepper, garlic powder and onion powder onto both sides of the chicken pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat the oil over medium heat. Put the flour in a plastic bag. One piece at a time, dip the chicken into the egg/milk mixture then add to the plastic bag. Shake the bag so that the flour is covering each piece of chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "You can check to see if the oil is hot enough by sprinkling a little flour in the skillet. If it fries, it's hot enough! Place the chicken pieces in the skillet. After about 5 minutes, turn the chicken over. Let chicken fry for about 15 minutes or until the meat is cooked through and the juices run clear. Enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Fried Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tanya Lewis"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.525862068965517,
            "ratingCount": 116,
            "itemReviewed": "Tanya's Louisiana Southern Fried Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "638.4 calories",
            "carbohydrateContent": "47.9 g",
            "cholesterolContent": "177.3 mg",
            "fatContent": "29.6 g",
            "fiberContent": "1.7 g",
            "proteinContent": "42.7 g",
            "saturatedFatContent": "9 g",
            "servingSize": null,
            "sodiumContent": "960.4 mg",
            "sugarContent": "7.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-06-23T14:49:52.21Z",
                "reviewBody": "I thought this turned out a good piece of southern fried chicken.  Here are some additional tips for getting a tasty bird.  Rinse chicken pieces and place in large pot or bowl and add a couple of tsp. of baking soda (this takes the blood out of the bird)and fill with water until covered for 15-20 min.  Drain and rinse and refill with water again.  This time place several teaspoons of iodized salt and add chicken back to water.  Refridgerate for 3-4 hours or overnight if desired.  This seasons the meat so that you will have a flavorful and juicy bite each time.  Good Luck",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAIDANDDUNN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/594222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T16:42:49.713Z",
                "reviewBody": "This reminds me of the fried chicken I enjoyed growing up in south Ga.  I give the recipe 5 stars as written, but I have a few suggestions, which come from my Nana.  1.  Use peanut oil.  It heats at a temp higher than other veggie oils before it burns. This creates fried chicken that isn't greasy, has a crispy outside and a moist inside.     2.  Some reviews mention trouble in getting the coating to stick.  Instead of soaking the chicken in evaporated milk, soak it in a combo of buttermilk and a few beaten eggs.  Something about this causes the coating to stick well.  3.  If you want a thick coating, do the following, and have patience because it takes a little bit of practice.  Take a piece of chicken out of the buttermilk and let the excess drain back into the bowl.  Place it on a plate and dust with the flour mix.  Using a spoon or fork, gently press the flour onto the chicken. Turn the chicken over and repeat.  Using tongs or a fork, very quickly dunk the chicken back in the buttermilk and coat again.  It's important to not use your fingers because they will remove more of the coating you'd just put on.  4.  Even if you don't want a thick crust, consider making a lot more of the flour mix. Until you get the hang of coating, it's easy to go through a whole lot of flour.   5.  Place in the oil skin side down, preferably spaced so that the pieces don't touch. 6.  Fry on medium high heat for at least 20 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlliePeacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alliepeacock/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-20T00:05:19.45Z",
                "reviewBody": "This recipe had excellent flavor!  The only changes I made were to use crisco for frying and to double-dip the chicken pieces in both the egg/milk mixture and the breading. I also soaked my chicken overnight beforehand in buttermilk, which gives it a wonderful, juicy tenderness, and like other reviewers I added extra of all the spices.  I then used the extra flour mixture to make gravy from some of the drippings...it was great!  I browned the chicken on both sides, then put it in a 380 degree oven for 1/2 hour, and this helped to eliminate the over-browning some other reviewers commented on.  It was wonderfully crispy and delicious, and even better cold the next day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RANCHGIRL_59714",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ranchgirl_59714/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-08T07:02:19.123Z",
                "reviewBody": "This is the best homemade fried chicken recipe ever! It's crunchy on the outside and juicy on the inside with the perfect amount of seasoning. I served this with homemade garlic mashed potatoes sweet tea and wheat pita bread. DELICIOUS!!! The only changes I made was to use 8oz. whipping cream and approx. 1/2 tsp. baking powder. I think the thickness of the cream made a big difference in the crunchiness of the skin. Next time I make this I'm going to try double dipping the chicken in the milk mixture and flour to get extra crispy skin. You've gotta try this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKINBETTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1044231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-12T20:23:47.597Z",
                "reviewBody": "This is by far the best recipe for fried chicken I have tried. After a couple times making it I made a few small changes. One I added more seasoning to the chicken before flouring instead of evaporated milk I used about a quarter cup of peppercorn ranch dressing and thinned it with about same amount of 2% milk then fried it in the deep fryer.The chicken was golden brown crispy and scrumptious even the leftovers were crispy the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2313450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-17T20:20:23.49Z",
                "reviewBody": "This was great and to help the others with the frying problems please read on. My fried chicken always come out and I guess it's because mom teaching me how. Heat 3/4 inch oil in a heavy frying pan (preferably cast-iron) over medium-high heat until it gets to 350 degrees F. Use a 2-inch-deep pan if possible to reduce spatters. When oil is hot shake any excess flour off the chicken and add the pieces to the pan a few at a time. Don't allow the pieces to touch in the pan. Fry the chicken in batches if your pan won't hold them all with space to spare. Cook the chicken pieces for about 10 minutes per side. Regulate the heat as the chicken cooks keeping the oil temperature below 375 degrees - use a deep-frying thermometer to the check the temperature.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shutter bug 1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shutterbug1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-10T16:31:02.653Z",
                "reviewBody": "This is a perfect fried chicken!  I host a girl's club and had them make these.  We used chicken strips in place of the whole chicken and it made alot, but there was absolutely nothing left after lunch!  The one thing I changed though, is that I followed another review suggestion, using heavy whipping cream instead of evaporated milk.  They came out so light and crisp!  This one is definately a keeper for my book!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NIANBEBI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/776757/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-13T12:33:36.043Z",
                "reviewBody": "I was disappointed again. I did like the batter and thought it was very good. I still could not get the chicken to cook through without burning the batter. I have never been able to master that. Maybe someone with more fried chicken experience would have better luck.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1183795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-24T18:54:44.51Z",
                "reviewBody": "Winner winner.....chicken dinner! I think I found my new fried chicken recipe. The egg wash was perfect. I liked that it was not too thin and not too thick. I did add just a couple drops of Frank's Hot Sauce just because that's something I've always done. I did use Johnny's seasoning salt instead of regular salt(I'm loyal if anything)and I did add 1/4 cup of cornstarch to the flour mixture just because that's what I was always taught to do when making fried chicken. I just cut back on the flour by a 1/4 cup. I baked my chicken just about a half hour AFTER THE FRYING STEP only because I like to be sure my chicken's done. But otherwise this chicken recipe is killer! Even my husband loved it and thought it was better than his mom's! Next time I'm doubling the recipe and making sure I have leftovers. Make this for yourself and see!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            }
        ]
    }
]