[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/71111/down-home-chitterlings/",
        "name": "Down Home Chitterlings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F924533.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-06T06:37:23.000Z",
        "description": "Chitterlings or pork intestines are a favorite among Southern families. Traditionally, they are prepared during the holiday season, but deep freezing makes them available year round.  Be sure to wash any surface and your hands thoroughly with a bleach solution to avoid contamination while handling raw chitterlings. Chitterlings are very good and are allowed, in moderation, under some popular Low Carb Diets. Be certain to pass the vinegar and hot sauce. Enjoy!",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT8H0M",
        "recipeYield": "12 Servings",
        "recipeIngredient": [
            "10 pounds frozen cleaned chitterlings, thawed",
            "1 onion, roughly chopped",
            "2 teaspoons salt",
            "1 teaspoon crushed red pepper flakes",
            "1 teaspoon minced garlic"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the chitterlings in cold water throughout the cleaning stage.  Each chitterling should be examined and run under cold water, all foreign materials should  be removed and discarded.  Chitterlings should retain some fat, so be careful to leave some on.  After each chitterling has been cleaned, soak in two cold water baths for a few minutes.  The second water should be clearer. If not, soak in one more bath.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the chitterlings in a 6 quart pot, and fill with cold water. Bring to a boil, then add the onion and season with salt, garlic and red pepper flakes. Be sure the water is at a full boil before adding seasonings, or the chitterlings could become tough. Continue to simmer for 3 to 4 hours, depending on how tender you like them. Serve with spaghetti or turnip greens. Be certain to pass the vinegar and hot sauce.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KERYNE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.509803921568627,
            "ratingCount": 51,
            "itemReviewed": "Down Home Chitterlings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "312.2 calories",
            "carbohydrateContent": "1.1 g",
            "cholesterolContent": "365.4 mg",
            "fatContent": "26.9 g",
            "fiberContent": "0.2 g",
            "proteinContent": "16.6 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "411.8 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-31T13:39:39.03Z",
                "reviewBody": "There are some things in life that demand attention from the point of tradition, chitterlings a.k.a. “chittlins” is one of them. \n\nThis dish is not for the lazy kitchen cook, (and you know who you are) it can take more than a full day to clean, prepare and cook chitterlings correctly especially if they are fresh. There are two rules that must be adhered to up front:\n1.\tIf your chitterlings stink before and during the cleaning process they are fresh!\n2.\tIf your chitterlings continue to stink while cooking, they are not clean enough!\n\nTwo soakings in cold water does not cut it, for chitterlings to be clean they should be almost as transparent as a wet paper towel when held up to the light. Use vinegar and plenty of it during the entire process of cooking chitterlings, remember these are the intestines of an animal as to minimize the potential of contamination of your chitterlings all caution must be observed. Keep your hands clean during the process, (recommend you cut your fingernails short as well). \n\nChitterlings like greens; make water…..do not fill the pot up to the brink with water less you will have a pot that will overflow on the stove for sure. Depending on the number of pounds you’re preparing, the pot need not be more than a quarter ways filled with water. Remember also that chitterlings cook down, so the weight before cooking will dramatically be reduced after they cook. (15lbs of chitterlings cooks down to about 7lbs).\n\nNow comes the seasoning of the water:\n\n1 Onio",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "sam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3106189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-02T01:21:39.89Z",
                "reviewBody": "This recipe is fine, but I would bring to a boil, drain, add water again, and then add your onions, red pepper, and garlic.  If you don't do this, you will have fat on top to deal with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GEERACE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-15T16:22:11.373Z",
                "reviewBody": "I like this recipe. I do similiar but for 20 lbs, I parboil twice, draining after each boil. Then in a large pot, cover chitlins with water, add 2 chicken bouillion cubes, 1/2 cup white vinegar, crushed red pepper flakes to taste, and Adobo All-Purpose Seasoning With Pepper to taste. I've never added onions but will try it next time. Mother added a potato to her chitlins to cut grease.  Also, the Sylvia Robinson recipe says to soak overnight in salt water to cut grease.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nubiangrits",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2608783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-23T23:40:44.233Z",
                "reviewBody": "I am very surprised to see a recipe for chitterlings..it is true this is like a southern delicacy..lol..this recipe is good however I also add bellpeppers seasoned salt preferable Lawry's and chopped jalapenos..and if you ever cook chitterlings you'll know they're not the most pleasant thing to smell..My remedy for that is to also add potatoes as it cuts down on the smell..Very good you must have it with hot sauce or you're just not eating it right..Thanks for submitting this recipe..it's good to know that someone else appreciates a good southern cuisine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MRSPRINGLE2U",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1159972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-04T20:20:36.653Z",
                "reviewBody": "This is the perfect recipe. Don't forget the hot sauce. I clean and cook at least 30 lbs. Just make sure you cook them until they are tender. If you clean them correctly, there's no need to par boil, you take away the flavor. Another tip, you can purchase cleaned chitterlins, 5 lb. bags each. They may need to be split open. I still check to make sure they are fully cleaned. Saves a lot of time, but oh so delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MS ROCK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/803844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-10T17:15:54.097Z",
                "reviewBody": "Now you're talking! Finally a recipe that a lot of people in the South truly love. This recipe is great! When I cook mine I cleaned them multiple times and then I cut them in small pieces before I boil them. Then for a more robust flavor after about an hour of cooking I add beer potatoes onions and hot sauce or red pepper sauce to it. After they cook down they will be very tasty and tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1513219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-03T03:58:08.403Z",
                "reviewBody": "To feed 12 people you need closer to 20 pound of chitterlings! You may want to add salt AFTER your chitterlings have cooked down a bit. They may become too salty otherwise. I use Creole seasoning instead of salt and pepper along with extra garlic and red pepper flakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KitchenDiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1709586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-09T22:01:07.34Z",
                "reviewBody": "Great recipe...just like mom use to make...The recipe is great the way it is written..no need to add potatoes they take away from the taste of the chitterlings. I prepared it over the holidays and had meatless spaghetti cole slaw and cornbread..Yummy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hernando Brownie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316784/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-06T20:34:04.8Z",
                "reviewBody": "chitlins themselves are wonderful i cleaned some last night and am cooking them NOW!but 10 pounds of chitlins is not enough for 10 people because the shrink really bad when you cook them so to feed 10 people you will need 20 lbs cleaned chitlins.and in GA after we boil them we put them in spider(skillet)with a little grease and fry them and that believe it our not draws some of the grease out of them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "junebug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2739171/"
                }
            }
        ]
    }
]