[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/347/bread/quick-bread/pumpkin-bread/",
                    "name": "Pumpkin Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/234646/pumpkin-pie-muffins/",
        "name": "Pumpkin Pie Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1054898.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2020-06-19T03:56:18.000Z",
        "description": "I made this recipe this fall when I was craving something seasonal. After trying other recipes that just lacked that homey pumpkin-pie taste, I decided to make my own. It makes about 24 large muffins or 6 muffins and a loaf. Even though they last well in the refrigerator, you may want to halve the recipe for individuals or small families. Add some cream cheese frosting and they'd make great cupcakes.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "2 dozen muffins",
        "recipeIngredient": [
            "1 ½ cups whole wheat flour",
            "1 ½ cups all-purpose flour",
            "5 teaspoons pumpkin pie spice",
            "2 teaspoons baking soda",
            "1 ½ teaspoons salt",
            "1 (30 ounce) can pumpkin pie filling (such as Libby's®)",
            "3 cups white sugar, or more to taste",
            "½ cup vegetable oil",
            "½ cup water",
            "4 large eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 330 degrees F (166 degrees C). Grease 24 muffin cups or line with paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix whole wheat flour, all-purpose flour, pumpkin pie spice, baking soda, and salt together in a large bowl. Whisk pumpkin pie filling, sugar, oil, water, and eggs together in a separate bowl until just mixed. Stir flour mixture, about 1/4 cup at a time, into pumpkin mixture until batter is just combined. Fill muffin cups with batter just below the brims.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 30 minutes. Cool muffins on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Pumpkin Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PChicki"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.688118811881188,
            "ratingCount": 202,
            "itemReviewed": "Pumpkin Pie Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "241.1 calories",
            "carbohydrateContent": "46.1 g",
            "cholesterolContent": "31 mg",
            "fatContent": "5.7 g",
            "fiberContent": "4.1 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "336.4 mg",
            "sugarContent": "25.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-10-16T17:06:26.8Z",
                "reviewBody": "Due to the fact I was a confessed pumpkin hoarder during The Great Pumpkin Shortage a couple of years back, I find myself making more “pumpkin things” than I would prefer (because I still have a hoard of pumpkin left).  I make a lot of pumpkin breads and muffins and chose this recipe because it was a little different, as it calls for twice the amount of pumpkin to flour as other, similar, recipes.  Plus, it called for half whole wheat flour, which I don’t often use.  I’d call them the ideal breakfast muffin as they are light, fluffy, and only lightly sweet and spiced.   In addition to great, breakfast-y taste they were beautifully risen and nicely domed.   I prepared the recipe just as written – and it needs no changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-15T19:16:06.87Z",
                "reviewBody": "Great muffins with all the fabulous flavors of Fall that taste just like pumpkin pie without all the fuss! I cut the recipe in half and got six Texas sized-muffins. I cut the sugar back to one cup and used half white and half brown sugar. I also opted for milk vs. water and added a generous tsp. of vanilla along with a handful of raisins I had on hand. This is a great base for add-in's such as dried cranberries, raisins, nuts, or chocolate chips. Before popping them into the oven I topped them off with some turbinado sugar for a little extra crunch. These baked up beautifully and were perfect with a piping hot cup of tea!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-19T23:17:44.967Z",
                "reviewBody": "I cut this recipe in half. I only made one change--instead of water, I used evaporated milk. I got twelve big muffins out of one recipe. Baked at 350*, they were done in 22 minutes. Excellent pumpkin muffin. Very moist and full of flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-13T07:14:31.76Z",
                "reviewBody": "I have tried pretty much every single pumpkin muffin/bread recipe on this site, and they can all quit: THESE ARE THE MOST PERFECTLY AMAZING MUFFINS EVER!!! Hands down, just wonderful. Followed the recipe almost to the letter, but i used all whole wheat flour and all brown sugar (all i had on hand), added about a tsp. of cloves (because I am a clove addict ), and I added a bunch of pecans - 'cause you can't  go wrong with pecans - and they were amazing! Moist and flavorful and perfectly  sweet. I had cream cheese icing on hand but I decided I prefer them without - they are so sweet and moist they need no further accoutrements. \nAlso found it this batter makes a fabulous cake with no changes needed - it was late and I was tired and so after getting 17 hefty muffins out of the recipe I threw the rest of the batter in a small, greased cake pan and baked it until a toothpick  came out clean (I didn't  time it - maybe 40 minutes?), and the result was an amazing cake that I took to work for my girls. It was gone in minutes, with rave reviews.\nSeriously,  there is a pumpkin bread recipe on this site that has like, 2,000 positive reviews and is in the hall of fame - it cannot hold a candle to this, not even close. Thank you, PChicki  - I will never, ever waste my time on any other pumpkin  muffin/cake recipe again - let all other chefs be on notice to throw in the towel;  this is THE ONE!\nA thousand  stars sister, well done!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GabelGRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14443549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-14T15:38:45.013Z",
                "reviewBody": "I intended to make this exactly as written but discovered that I had only canned pumpkin not pumpkin pic filling. Google to the rescue the difference between the two is simply some added spices and sugar to the pie filling. I used the canned pumpkin did not add extra sugar but did add some extra pumpkin pie spice. I didn't measure but it was about 1 1/2 or 2 teaspoons. They were absolutely sumptuous! I got 21 large muffins baked for 34 minutes at 350 degrees. You will not be disappointed with this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keallie Wozny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13842452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-03T03:05:06.583Z",
                "reviewBody": "This is an outstanding recipe! I took them to church this morning and everyone loved them! I did make one substitution. I didn't have wheat flour on hand, so I substitued white flour (conversion for wheat to white is 3/4 c. Wheat to 1 c. White). These were the moistest pumpkin muffins I have ever had, and they were good with or without cream cheese icing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Netsirk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3973185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-29T01:03:15.143Z",
                "reviewBody": "Great recipe! I only used 1 c sugar and added 1 cup apple sauce in place of the oil. I also added some raisins and walnuts and these muffins were delicious. I thought they would be too strong with 5 tsp of pumpkin pie spice but it was just perfect for my family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALEXISGOLDEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1252360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-01T03:47:59.957Z",
                "reviewBody": "These are so good! I try not to rate recipes that I make changes to but these are to wonderful not to shower it with as many stars as possible. Because I was low on white sugar I used 1/2 white and 1/2 brown and used all purpose flour instead of 1/2 wheat (I didn't have any wheat). Then last I added some vanilla. I saw where some put icing and added nuts and raisins. I had decided to drizzle some icing over them but after tasting them I decided to leave perfection alone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kj/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-12T18:49:33.05Z",
                "reviewBody": "These turned out FANTASTIC! Definitely some of the best I've ever had. From what I've read from the other reviews you don't need to make any changes but based on personal preferences and circumstance I made the following adjustments: I only had all purpose flour so that's what I used. I used half brown sugar half white as a personal preference. I added in raisins to half my batch (I love raisins but my boyfriend isn't a fan). I had intended to use pumpkin pie filling but it turns out that I only had pumpkin pie puree. I made up for the difference by adding an extra 2 tsp of pumpkin pie spice. I got 27 large muffins out of this recipe which I turned into 27 kickass cupcakes with the Cream Cheese Frosting II recipe from this site. I dusted them with a little cinnamon sugar that I had fine ground with my coffee grinder. LOVE THESE! They are so moist so tasty so darned good! I got rave reviews. They taste even better the next day. They were SUPER simple to make and 30 minutes at 350 degrees gave perfectly risen pumpkin flavored bites of heaven. I would post pictures but they're all gone:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RachelW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4068067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-08T23:09:19.227Z",
                "reviewBody": "All I could taste was wheat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish-the-Dish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4310897/"
                }
            }
        ]
    }
]