[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/700/world-cuisine/asian/korean/",
                    "name": "Korean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/88344/korean-spicy-chicken-and-potato-tak-toritang/",
        "name": "Korean Spicy Chicken and Potato (Tak Toritang)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8145425.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:12:28.000Z",
        "description": "A very easy meal to make! Chicken drumettes, potato, carrots, and onion simmer in a spicy sauce that goes best with white rice. You can find Korean hot pepper paste in a Korean/Asian market. I haven't tried looking in a grocery store. Its Korean name is 'gochujang'. Serve with hot cooked rice.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 ½ pounds chicken drumettes",
            "2 large potatoes, cut into large chunks",
            "2 carrots, cut into 2 inch pieces",
            "1 large onion, cut into 8 pieces",
            "4 cloves garlic, crushed",
            "¼ cup water",
            "½ cup soy sauce",
            "2 tablespoons white sugar",
            "3 tablespoons gochujang (Korean hot pepper paste)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large pot over medium heat, mix the chicken, potatoes, carrots, onion, sugar, and garlic. Pour in water and soy sauce, and stir in sugar and hot pepper paste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring to a boil, reduce heat to low, and simmer 45 minutes, until chicken juices run clear, vegetables are tender, and liquid has thickened.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Korean"
        ],
        "recipeCuisine": [
            "Asian",
            "Korean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "sarakyong"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.615658362989324,
            "ratingCount": 281,
            "itemReviewed": "Korean Spicy Chicken and Potato (Tak Toritang)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "446.6 calories",
            "carbohydrateContent": "54.7 g",
            "cholesterolContent": "59.4 mg",
            "fatContent": "14.1 g",
            "fiberContent": "5.9 g",
            "proteinContent": "25.6 g",
            "saturatedFatContent": "3.9 g",
            "servingSize": null,
            "sodiumContent": "1993.9 mg",
            "sugarContent": "13.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-12-30T03:59:30.623Z",
                "reviewBody": "I just wanted to add some information to my mom's recipe. When the recipe says 3 tbs, that's 3 heaping tbs (but adjust to your liking). You may reduce the soy sauce down to 1/3 cup - the recipe won't allow me to correct this but I do find 1/2 cup to be a bit salty. You can throw the chicken in the pot still frozen, it still gets well-cooked all the same. It's important to use bone-in chicken as it makes the meat more tender while cooking, that's why I prefer drummettes. I like to toss in baby carrots instead of chopping large ones. If you're using Red potatoes, add them at the same time as the chicken since they need more time to soak the sauce in. I liked someone's suggestion of bell peppers, I'm using it now myself. Once everything is in the pot, reduce the heat to med-low. The sauce won't cover all the ingredients, so you'll need to stir occasionally. It's ready when you can half a carrot & potato piece and see the sauce has soaked inside (won't soak very far into Red potatoes). The liquid will thicken more as it cools. And if you make this recipe with anything other than Korean hot pepper paste \"gochujang,\" such as sriracha, then you did not make this authentically as this is the primary ingredient for this recipe - please don't knock down the review if you don't like your substituted version. Always serve this over a plate of rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarakyong",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1448981/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-09T16:54:39.563Z",
                "reviewBody": "This is dish is very delicious and very authentic.  I remember my mom making it when I was younger.  Here are some of my changes:  I added 1 tablespoon of fresh chopped ginger and instead of the red hot bean paste, I used Korean red pepper.  The commercial red hot bean paste has a lot of extra stuff you might not want.  The red pepper will give it the same flavor without the extra stuff.  Yummy!  Would make it again!\n\nOne recommendation I would make is although, you might want the dish to be healthier by using boneless chicken breast, you will loose a lot of flavor by doing so.  Use the the drumettes or chicken thighs with bones.  Something about cooking meat with the bone in makes it so much better!  I usually trim as much of a the fat as possible off most of it and leave one piece of chicken with the fat.  It's part of the whole flavoring thing.  Growing up the only way we ate this dish was served with white rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A Korean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1843304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-10T01:52:36.14Z",
                "reviewBody": "Great recipe! I am not Korean, but I love Korean food.  I actually came to love Korean food from watching Korean Dramas (sounds weird, but makes total sense to a Korean drama addict!).  \n\nI loved this recipe, but it took me two tries to get it right.  Here is what I have learned:\n1. It is a good idea to use drumettes--because the bones and small size help to thicken the sauce.  Using a breast or other chicken parts won't thicken it as well.\n2. I stir fry my drumettes in a tablespoon of vegetable oil to brown the skin while I make the sauce and finish chopping the vegetables.  This makes the drumettes so delicious! I stir fry them until they are slightly browned (about 10 minutes), and then pour the sauce on top and stir in the vegetables.  I cover it and lower the heat and let it simmer for about 20 minutes more until the vegetables are softened.  Browning the drumettes helps to make the sauce much richer, too--because as they brown I stir them and the little bits get scraped up, so by the time I add my sauce--the chicken flavors have been released and enhanced.\n3. I don't use the red pepper sauce--instead I add a teaspoon of ginger and some red pepper dry spice (not too much, because I have children). This works fine.  \n4. You have to eat this with the potatoes and rice (from a rice cooker, please!)--to skip the rice because the potatoes are already a \"starch\" is just sad.  Korean food--you need the rice!\nThank SARAKYONG\nfor posting it! Bashya--you will be blessed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LisainCalifornia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2112477/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-27T17:28:56.373Z",
                "reviewBody": "I'm korean and this recipe is definitely authentic. It is meant to be spicy so if you dont like spicy this is not the recipe for you. I used a combination of boneless skinless breasts and legs. Definitely use a combination. Something about the bone-in makes it juicy. I used about 1 cup of water because I like a little more sauce and plus the potatoes tend to soak it a good bit of it. I used 1/3 cup of low sodium soy sauce and only 1 Tbs of sugar as someone had recommended. I also added a good 1/2 cup of green onions in the last 10 mins of cooking. My aunt used to add this. I also added extra garlic- minced! and red pepper flakes because I love spicy!! Also about the hot pepper paste: this is a key ingredient. Must use the korean hot pepper paste otherwise you are making a totally different recipe and definitely use 3 huge heapings of it. One last thing....it definitely has to be served over rice. Not serving this with rice would be like serving meat sauce without the spagetti pasta! Thanks for the recipe! My husband raved about it!! The meat just fell off the bones and was very juicy. I can see myself making this very often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JudesM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3092299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-16T21:25:05.763Z",
                "reviewBody": "My boyfriend and I eat Korean food quite often and this particular dish has always been a favorite of his. This was my first time cooking it for him. Overall he really enjoyed it. The only part that neither one of us cared for was that the recipe was too sweet. I would definitely cut back on the sugar next time and add bell peppers as we have had before. Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ESSIEPOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1411892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-15T19:00:33.78Z",
                "reviewBody": "My wife is part korean and had the paste already on hand to make this. She told me the Korean name for this meal is \"tak toritang.\" \"Gochujang\" is the Korean name for the paste. It was her first time and it came out soooo good! I'd say it was a mild spicy. It's a good hardy meal and I can't wait to have it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "liquidswar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1491001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-30T05:14:02.263Z",
                "reviewBody": "We have a Korean exchange student living with us. He said this taste like what his mom makes. Ya!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WANTTOKNOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wanttoknow/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-23T02:59:08.03Z",
                "reviewBody": "Food was great!!!! I used chicken breast instead but turned out delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M. Haro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1738929/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-23T05:43:48.733Z",
                "reviewBody": "Delicious and easy! Just a few modifications: I used drumsticks and wings (started them frozen with the soy sauce and water while I prepped the veggies) reduced the sugar to 1 tablespoon and substituted 1 1/2 tablespoons of Grandma's Volcanic Hot Sauce (something I picked up in Barbadoes) for the hot pepper paste. Will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KatyAngel42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1851849/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-11T17:53:37.027Z",
                "reviewBody": "The meat, potatoes, onions and carrots all tasted the same.  It all had the same flavor. I grew tired of the taste after a couple of bites.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Murphy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2464075/"
                }
            }
        ]
    }
]