[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17614/appetizers-and-snacks/pickled-eggs/",
                    "name": "Pickled Egg Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235174/popas-pickled-eggs/",
        "name": "Popa's Pickled Eggs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1288238.jpg",
            "width": 2560,
            "height": 1440
        },
        "datePublished": "2020-06-19T03:56:56.000Z",
        "description": "These simple to make pickled eggs are a great snack along with pretzels. For hotter eggs pierce the yellow chili peppers with a sharp knife and/or add other hot peppers.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P2DT0H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (12 ounce) jar hot yellow peppers with brine",
            "1 ½ cups water",
            "1 cup white wine vinegar",
            "2 tablespoons pickling spice (such as McCormick®)",
            "1 tablespoon white sugar",
            "2 teaspoons salt",
            "1 teaspoon ground turmeric",
            "8 hard-boiled eggs, peeled"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir peppers and brine, water, vinegar, pickling spice, sugar, salt, and turmeric together in a 1/2 gallon mason jar or container. Add eggs to pepper mixture and seal container. Refrigerate for at least 2 days.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Pickled Egg Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "bd.weld"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.730769230769231,
            "ratingCount": 52,
            "itemReviewed": "Popa's Pickled Eggs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "98.7 calories",
            "carbohydrateContent": "4.8 g",
            "cholesterolContent": "212 mg",
            "fatContent": "5.7 g",
            "fiberContent": "1.2 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "1358.6 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-10-26T19:04:47.387Z",
                "reviewBody": "Delicious eggs. I ended up using jarred jalapenos since I couldn't find the specified jarred chili peppers. The turmeric really is what flavors these eggs and surprisingly the jalapenos didn't add too much heat. I also made a potato salad with the eggs and it stepped the salad up two notches. It took about a week until I could really taste the flavoring in my eggs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-26T13:14:54.417Z",
                "reviewBody": "Woah, these are DELICIOUS, so simple to make and we LOVE the color of them! I've tried another pickled egg recipe before, and I didn't care for them, so I was definitely skeptical of these...To my surprise and delight, these were yummy! Loved the spicy kick and the flavor that the eggs had. I could totally see using these in a salad (though they are great eaten on their own). I made a jar for my dad too, so I'm curious to see what he thinks of them, and I can't wait for hubby to get home to try these... I know he's gonna love them! Thanks for sharing another GREAT recipe, Brian! :) UPDATE: My dad raved over these and hubby and the little guy absolutely LOVED them! Hubby wants me to make more and an extra batch for him to take to work for the guys...This recipe is a winner, Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-01T23:46:46.26Z",
                "reviewBody": "My husband has been asking me for years to find the \"just right\" pickled egg recipe. I've tried with miserable luck that is until I tried bd's eggs at the Las Vegas Round Up! Hey I carted the leftovers home (surprised that were any left!) to California and presented them to my husband Randy. Bonanza! These were it! I've since made them many time one dozen at a time. Great for my midafternoon snack or hubbie's cocktail hour appy. I like Marianne's idea for salads sammies and deviled eggs. Well done my friend!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Myers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2079610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-16T14:58:17.603Z",
                "reviewBody": "There should be a Pickled Eggs Anonymous chapter named after these eggs. I've never eaten a pickled egg in my life; never knew people actually ate them. Then I saw all the fuss about this recipe and it buzzed around my head for a while. Boy am I glad I listened to all the hype. I made these with a homemade pickling spice using 36 quail eggs and 1 hen egg. My picture isn't as pretty as the other but it shows you how many quail eggs will fit in the liquid. \"Refrigerate for at least two days\" it says...try making them last that long. I suggest making these and then immediately abandon the house for 48 hours only then will you let them rest as long as required. They are THAT good. Thanks to bd weld for the recipe and thanks to the other reviewers who convinced me to try these. Sometimes peer pressure is a good thing. UPDATE: 12.Dec.15- I made these to give as Christmas gifts using all organic ingredients and homemade pickled peppers. Comparing the outcome to when I made this using industrial produced peppers vinegars and herbs/spices is like comparing night and day. Amazing is all I can say. Try these using your homemade peppers and you will see I'm right!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Buckwheat Queen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/melaniegiovenzana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-31T23:42:40.55Z",
                "reviewBody": "Thank you everyone for the great reviews. Just wanted to let everyone know that the brine in this recipe will work with a dozen eggs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bd.weld",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bdweld/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-25T23:56:13.84Z",
                "reviewBody": "This is a perfect pickled egg recipe! Just follow the directions! Don't change a thing! I used Mezzetta's Hot Chili Peppers. The longer they sit the better they get! I first tasted these eggs at a party hosted for AR members at mauigirl's home in Las Vegas and I kept telling my husband that he'd like them a lot! I wasn't wrong! We ate them plain on salads as deviled eggs and in sandwiches. Thanks bd.weld!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-26T18:03:59.11Z",
                "reviewBody": "I not only got to try these at the PNW AR Round-Up but I graciously got to meet the man himself that submitted these. OH man where they good. I couldn't wait to get home and make these for my hubby. So after I talked to bd_weld about his recipe and telling me I could easily do a dozen I did a dozen and a half. I'm finding it hysterical on my part when making the recipe I used the really hot yellow peppers with brine and a pickling mix offered from my store because it was way cheaper then buying the Morton's. Should have gone with that because little did I realize how loaded with dried whole red Serranos and thought ohh what the heck HA!! on my hubby because he said they were fantastic but...WOOO!! what a kick. I ate the yoke out of several and hmm good so I didn't get the intense heat from the egg whites themselves... he sure did. What a great addition to my household. Will look for the milder hot peppers with brine for the next time for my children. But they seemed to like them as well. TY Brian!! we love it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-30T22:52:36.127Z",
                "reviewBody": "While my husband thought these pickled eggs were ok I on the other hand did not like them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindi M Bauer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2008352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-29T19:31:07.497Z",
                "reviewBody": "Made for the PNW Round Up these eggs were a hit! I didn't think I'd like them as I don't generally like hot foods. However there is just something about these pickled eggs that I can't stay away from. I ate 3 in row. Yum! They're easy to make and really has a gourmet payoff! My two sons devoured the remainder of them (5 out of 24) after the Get-Together. I'll be making these again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candice100/"
                }
            }
        ]
    }
]