[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1116/fruits-and-vegetables/",
                    "name": "Fruits and Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1059/fruits-and-vegetables/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1881/fruits-and-vegetables/vegetables/squash/",
                    "name": "Squash",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235271/easy-pumpkin-pie-bars/",
        "name": "Easy Pumpkin Pie Bars",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4566646.jpg",
            "width": 3024,
            "height": 2588
        },
        "datePublished": "2020-06-19T03:57:02.000Z",
        "description": "These pumpkin pie bars taste like pumpkin pie, but are so much easier because you don't need to bother with the pie crust. The yellow cake mix does all the work.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "4 large eggs",
            "1 ½ cups white sugar",
            "2 teaspoons ground cinnamon",
            "1 teaspoon salt",
            "1 teaspoon ground ginger",
            "½ teaspoon ground cloves",
            "1 (29 ounce) can pumpkin puree",
            "2 (12 ounce) cans evaporated milk",
            "1 (15.25 ounce) package yellow cake mix, divided",
            "½ cup butter, melted",
            "1 (8 ounce) container frozen whipped topping, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat eggs in a large bowl. Whisk sugar, cinnamon, salt, ginger, and cloves together in a separate bowl. Stir sugar mixture and pumpkin into eggs until completely incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gradually stir evaporated milk into pumpkin mixture. Add 1 cup yellow cake mix to the pumpkin mixture and stir to remove any lumps. Pour mixture into a 9x13-inch baking dish. Sprinkle remaining yellow cake mix over the top and drizzle butter over the cake mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until set, about 1 hour. Cool to room temperature and cut into bars. Top with whipped topping.\n"
            }
        ],
        "recipeCategory": [
            "Fruits and Vegetables",
            "Vegetables",
            "Squash"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rose Marie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.653061224489796,
            "ratingCount": 49,
            "itemReviewed": "Easy Pumpkin Pie Bars",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "504 calories",
            "carbohydrateContent": "69.2 g",
            "cholesterolContent": "99.5 mg",
            "fatContent": "22.7 g",
            "fiberContent": "2.6 g",
            "proteinContent": "8.6 g",
            "saturatedFatContent": "12.8 g",
            "servingSize": null,
            "sodiumContent": "736.3 mg",
            "sugarContent": "53 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-11-28T03:45:29.81Z",
                "reviewBody": "This recipe was delicious and easy to make. Took it to a pre Thanksgiving family dinner. It was a hit..Everyone wanted seconds. I used a gluten free spice cake mix in place of the regular yellow cake mix due to gluten intolerance in our family. The spice really complemented the flavor of the pumpkin. Other than that I followed the recipe as written. Cooking time was a little longer than an hour. This will be a family favorite for years to come. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Verdene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3951110/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-25T03:30:20.867Z",
                "reviewBody": "Oh my goodness!! I would give this more stars if that were possible! Rose Marie I want to thank you for submitting this recipe for the rest of us to enjoy! This is definitely a keeper & one I will be baking several times throughout the year. I prepared this recipe substituting Splenda for the sugar (hubby is a diabetic) and used a butter recipe cake mix (didn't have a yellow cake mix in the pantry) but all other ingredients were as the recipe called for. I used the toothpick method to test for doneness, and yes it took longer than the 60 minutes the recipe states to bake, but seriously people. I baked mine an additional 6 minutes and it tastes wonderful! Every baked recipe needs to be adapted for your particular oven right? Long story short, this is an exceptional recipe! Next time I bake it I will use a yellow cake mix and still be just as pleased with the outcome! My family happens to love pumpkin pie but some do not care for crust so this is a win win in my book! Thank you!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sunsetparkn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4363803/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-14T14:57:55.333Z",
                "reviewBody": "When the recipe submitter says this tastes like pumpkin pie believe her. It definitely does! Now that's not the greatest thing for me since I'm not the biggest fan of pumpkin pie but I know a lot of people are so we can discount my opinion. I think it's the texture since I like the taste of pumpkin. At any rate this used up a lot of stuff in my pantry. I had two 15 oz cans of pumpkin so had a bit more pumpkin than called for and didn't have yellow cake mix so I used vanilla. Still this worked really well and tastes like a basic pumpkin pie. It makes a ton and I'm hoping my sister in law and nieces like pumpkin pie since I plan to bring a lot of this to their house when we go over to give them our presents. This is incredibly easy to make; just be prepared to leave it in the oven longer than stated. Mine took an hour and 20 minutes. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-25T00:01:10.237Z",
                "reviewBody": "This recipe is easy and tastes great! I substituted 1 cup gluten free cake mix and left off the topping so it was even more like pumpkin pie AND gluten free. Yay!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8049242/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-22T12:22:07.25Z",
                "reviewBody": "My family has been using this favorite recipe for years. We call it Peter Pumkin Eater LOL I think the term bars is a little misleading because it is not something you can pick up and eat. It's moist and better than pumpkin pie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "teenybopper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2675015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-13T16:36:08.32Z",
                "reviewBody": "I JUST took these out and have been letting them cool. Holy smokes are they good. I couldn't wait to cool them completely to take a taste. It really is JUST like pumpkin pie!! I was skeptical about this one as I was mixing it and as it was baking.. it puffed up like a cake and I was thinking.. oh no.. something went wrong.. but after cooling.. it settles and ends up the consistency of pumpkin pie. Like pie with the crust on top! My son who loves pumpkin pie and always leaves the crust will LOVE this. I just put them in the fridge to cool all the way I am taking them to a party later.. going to bring whipped cream to put on top. Thanks Rose.. this is really great. I may make this at thanksgiving instead of a pie! For one thing it serves more people!! It's a HUGE pan! I will say mine took 1 hour and 25 min to cook like the others and it still \"jigged\" some when I took it out but was set. As it cools it comes together. Awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alexsmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1820530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-14T08:02:28.15Z",
                "reviewBody": "Delish! I didn't have any evaporated milk so instead used 1/2 c heavy cream and 1 cup whole milk. I also used spice cake mix. It is really good tastes like pumpkin pie but the cake mix makes it a bit firmer. A keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachelle Johnston",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10240916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-14T00:48:23.703Z",
                "reviewBody": "I don't bake very often and I don't make pies. I don't even really enjoy pumpkin pie....but honestly theses were amazing I made them just as the recipe suggests and they were a huge hit. Only one thing is that they took at least an hour and a half to bake in my oven but i will definitely be adding them to my Thanksgivng menu! Thank-you for sharing - so easy and so good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetpeamom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5380129/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-18T21:58:53.47Z",
                "reviewBody": "This is indeed a recipe that keeps you coming back for more! Why not 5 stars? I think the cake mix on the top is a bit too much because not all of it browns up nicely and there are chunks of it that fall off when slicing into bars. Next time I will either swirl some of it down into the mixture or just use less of the cake mix on top. Oh and I'm definitely going to add some chopped candied pecans on the top. Then it'll be 5 stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Clearview",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/466610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-07-05T05:35:24.113Z",
                "reviewBody": "The picture is deceiving. What are those little things that look like seeds on top? The instructions were confusing and there should have been a warning not to use foil store-bought pans. I was taking it to a BBQ so I used a throw-away cake pan which could not hold the heavy batter. As I put it in the oven the cake pan buckled. I don't have to tell you what I did for the next hour! It was an expensive recipe and a total disaster that could have been avoided with a caution to use glass or metal cake pan due to weight. I cleaned my oven called it a day and went back to bed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Gig",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7767870/"
                }
            }
        ]
    }
]