[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1315/breakfast-and-brunch/cereals/oatmeal/",
                    "name": "Oatmeal Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236182/beckys-baked-oatmeal/",
        "name": "Becky's Baked Oatmeal",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1606626.jpg",
            "width": 6016,
            "height": 4000
        },
        "datePublished": "2020-06-19T03:58:03.000Z",
        "description": "I had this recipe for baked oatmeal while in the Dominican Republic on a mission trip. Everyone loved it and asked for it often. With less sugar it is a healthy breakfast. You can add raisins, cranberries, nuts, cinnamon, chopped apples, flaxseed, wheat germ, etc. You can't mess up this recipe. Kids love it with the cup of sugar, but by adding less sugar and other ingredients you can make it healthy and also delicious by serving it with blueberries, strawberries, or peaches.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "9 servings",
        "recipeIngredient": [
            "3 cups oatmeal",
            "2 eggs, beaten",
            "2 ripe bananas, mashed",
            "1 cup milk",
            "¾ cup white sugar",
            "¼ cup flaxseed oil",
            "¼ cup applesauce",
            "¼ cup brown sugar",
            "2 ¼ teaspoons baking powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir oatmeal, eggs, bananas, milk, white sugar, flaxseed oil, applesauce, brown sugar, and baking powder together in a bowl using a spoon; pour into a square baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until the edges begin to brown, about 40 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals",
            "Oatmeal Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mara"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.538461538461538,
            "ratingCount": 26,
            "itemReviewed": "Becky's Baked Oatmeal",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "297.6 calories",
            "carbohydrateContent": "49.4 g",
            "cholesterolContent": "38.5 mg",
            "fatContent": "9.4 g",
            "fiberContent": "3.5 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "150.4 mg",
            "sugarContent": "28.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2016-12-10T12:39:37.957Z",
                "reviewBody": "I submitted this recipe and the original recipe used 1/2 cup oil, vegetable or canola.  To make it more healthy I used the flaxseed and applesauce, combined to make 1/2 cup, to substitute for the 1/2 cup oil.  Sugar was one cup.  This was much too sweet.  I changed it to 1/4 cup brown sugar with no white sugar.  The baking powder was 3/4 Tbsp. baking powder.  I always add the cinnamon to the batter as we like cinnamon.  Changing the ingredients made it heavier than the original, but this way it is full of healthy ingredients. Hope this clears up some of the ingredients written.  I never have trouble getting it out of the pan.  Just wondering why several did.  Adding chopped apple, raisins, nuts cranberries etc.  make it extra special.  So glad so many have enjoyed it.  If you make it in a 9x13 pan, freeze some and you can have a quick breakfast using your microwave.\n\n\n\nYou definitely need cinnamon.  Sorry I forgot to add it. \nOn my review I mentioned that I did not use any white sugar , only 1/4 cup brown sugar.   That should help as the fruit makes it sweet enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2278986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-25T19:25:52.783Z",
                "reviewBody": "Baked oatmeal is a \"thing\" where I live, but I never really understood why. They serve it at restaurants here, and it is always a dry block of flavorless oats that you have to put milk on. This recipe is moist - revelation! Baked oatmeal can be moist?! It tastes like banana bread, and while I did prefer it hot with milk, I ate it right out of the oven without milk and cold out of the fridge, too. It is delicious every way. I did use grape seed oil rather than flax seed as it is what I had on hand. I recommend cutting the brown sugar and baking powder together first so the powder isn't clumpy in the batter, but that's it! Excellent recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ilkaisha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ilkaisha/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-27T05:39:36.26Z",
                "reviewBody": "This was very tasty. It is so much better than the store bought product that tastes more like a hard iced cookie. This was like banana bread meets dense, soft, moist sweetened oatmeal. It is really sweet, I will not deny that. As such, I would probably save this as a breakfast treat to make in the fall. I would at least try the recipe just as is, though, before altering it to ones diet. I tried it because it was recommended by an Allrecipes member. I did use safflower oil instead of flax oil and rolled oats as it did not say what type. Both worked well. For easy clean up I lined an 8x8 pan with 2 layers of foil sprayed with pan spray. When done, and almost cooled, I cut it in half and each half into 4 2\" pieces. I have no idea how this makes 9 servings. The pieces are very filling, served warm in a bowl, with milk. ty",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-15T09:01:39.437Z",
                "reviewBody": "Very yummy and moist. I substituted the flax seed oil for coconut oil. I liked the hint of coconut. I also omitted the bananas and opted for more applesauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "steller2600",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8728092/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-24T20:58:51.333Z",
                "reviewBody": "This is a terrific recipe for a quick breakfast - and very easy to modify. I added chopped apples dried cranberries walnuts chia seeds and substituted almond milk and turbinado sugar for my own version. I also butter the baking pan prior to pouring in the mix seems to help it come out better. With a little milk poured over it and heated up it's super easy to make a hearty morning dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jackie1789",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12314961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-10-08T13:34:25.677Z",
                "reviewBody": "Fantastic! Like banana bread but more hearty. I whipped this up in about 10 minutes when I first woke up. It baked away while we got ready for work and school. I served the kids theirs with milk since it was hot out of the oven but I packed some for work and it was fantastic on its own at room temperature. I imagine I'll be making this often. The changes I made were using I/4 cup less white sugar and coconut oil instead of flaxseed oil. I added a dash of cinnamon and a splash of vanilla. And I took the advise of other reviewers and greased the pan. I will keep decreasing the amount of white sugar I use until I find the least amount I can get by with and still get the kids to eat it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2512572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-26T03:11:33.857Z",
                "reviewBody": "We enjoyed this recipe. The first time I made it I cut the recipe in half and used all applesauce as I didn't have any bananas. I also omitted the flaxseed oil and used 1/2 cup of brown sugar and omitted the white sugar. I used cooking oil spray. The second time I used 2 mashed bananas. Both versions were good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cookin' granny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7591779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-27T17:26:54.687Z",
                "reviewBody": "A keeper! I've made this twice and I will undoubtedly make it again! I can't eat bananas so I substituted canned pineapple (drained). Next time I want to try canned pears or peaches (which I will blend before adding) but you can probably experiment with this. I didn't have flaxseed oil so I used canola. The second time I made it I left out the white sugar just added the brown thinking that if I wanted to I could sprinkle some sugar on it before eating. The addition of the 3/4 cup of white sugar makes it more cake-like IMO. One thing I would stress is spraying the pan before adding your mixture. I didn't do that the first time and it stuck to my non-stick pan. I don't get 9 servings out of it though I get 6 using an 8 x 8 pan. I also sprinkled some cinnamon on top before baking. When done I cut it into 6 portions and refrigerated it. I like it in the morning - just nuke it for a minute on 3/4 power. P.S. You can probably top it with some vanilla yogurt. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Glaeser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1159739/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-11T02:40:01.757Z",
                "reviewBody": "I love this recipe! I bake it all the time and freeze it into individual portions for the next week or so. I omit the white sugar replace milk with almond milk replace flaxseed oil with coconut oil and add a 1/2 teaspoon of cinnamon and a couple tablespoons of flaxseed. Each morning I heat a frozen piece in the microwave pour some almond milk over it and enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LiveToEat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7879066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-10-06T02:25:43.293Z",
                "reviewBody": "Good but too sweet. I will cut the sugar next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "k",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3621720/"
                }
            }
        ]
    }
]