[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236325/new-york-style-pizza-dough/",
        "name": "New York-Style Pizza Dough",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1933584.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2020-06-19T03:58:07.000Z",
        "description": "A simple and basic recipe that gives anyone longing for New York's famous pizza something to truly enjoy! Add some flavor to your dough by incorporating seasonings such as oregano or garlic powder (1/2 teaspoon of each is more than enough). The dough can also be frozen for longer storage.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT10H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup warm water",
            "½ cup bread flour",
            "1 (.25 ounce) package active dry yeast",
            "1 ½ teaspoons white sugar",
            "2 cups bread flour, or more as needed",
            "3 tablespoons olive oil, divided",
            "1 ½ teaspoons salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine water, 1/2 cup flour, yeast, and sugar in a bowl; stir well and let sit until mixture is foamy and bubbling, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir 2 cups flour, 2 tablespoons olive oil, and salt into yeast mixture using a wooden spoon until dough holds together; turn onto a lightly floured work surface.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Coat the inside of a large bowl with 2 1/2 teaspoons olive oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Knead dough, adding small amounts of flour as needed, until soft and slightly sticky, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form dough into a ball and place in the prepared bowl; drizzle about 1/2 teaspoon olive oil over dough and spread to coat entire ball. Cover bowl with a clean kitchen towel and place in a warm area of the kitchen until dough is doubled in size, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch dough down and place in a large resealable plastic bag; refrigerate 8 hours to overnight. When ready to use, remove dough from refrigerator and bring to room temperature before using.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Amanda-Rae"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.538461538461538,
            "ratingCount": 39,
            "itemReviewed": "New York-Style Pizza Dough",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "67.1 calories",
            "carbohydrateContent": "1.5 g",
            "cholesterolContent": null,
            "fatContent": "6.8 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.4 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "583.3 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2016-07-25T11:43:22.783Z",
                "reviewBody": "Everything is right except one major thing. Pizza dough is a single rise dough. I have been making pizza for 30 years now and was taught that on day one working dough. After you do the final combining work the dough into a loose ball. Cover and let sit for 10 to 15 min before working the dough further. Need lightly and form dough into a ball then divide into 2 to make 2 smaller crusts. Lightly cover with oil and place either in zip lock bag or bowl that is covered in plastic. All NY style is left to cold rise in the fridge over night. Ball of dough will not  fully double in size. Take you dough out of fridge and let warm to near room temp before working to form your crust. The overnight rise is what gives the crust it's taste. To get the crispy crust, after you form your crust basic shape  do gravity stretches with your fists inside the dough letting it hang as you slide side to side inside the dough. This stretch is what forms the skin that bakes super crispy. I use a stone inside my oven. I bake my pizza at 450 for 10 min. Then add time if crust is not as brown as you like. Make sure stone is bre heated inside the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Brian B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20059728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-15T22:59:43.973Z",
                "reviewBody": "This crust has great flavor and texture and was super simple to make.  I used my stand mixer with the dough hook in place of kneading and it was ready to rise in less than 10 minutes, start to finish. I did not need to add any additional flour.  My only issue is this recipe doesn't indicate yield, so I assumed it was a one pizza recipe.  As I was stretching the dough on my greased and cornmealed pizza pan, I quickly discovered it is at least 1 1/2 pizza's worth, if not two.  I par baked for about 10 minutes as the oven preheated (put it in at 350) and then topped and baked at 550 for 8 minutes on bottom rack and 6 on top.  Great recipe; I'll try it again splitting the dough in half for two pizzas and I'd imagine that thickness will be just right.  THANKS for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-06T23:43:18.907Z",
                "reviewBody": "Left the recipe the same and couldn't be happier. It really taste like a good new York crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scout662",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12468810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-17T20:38:27.473Z",
                "reviewBody": "I was making a very hearty pizza and needed a crust that could hold it all and not get soggy. This crust fit the bill - perfectly. The amount of dough made a VERY large pizza. I could have made 2 normal size pizzas from one recipe. I did prebake the crust at 425 for 8 minutes with olive oil and 'Pixie Dust' from AR. Once prebaked I topped with: pizza sauce w/meat pesto ham turkey red and green peppers onion thin tomato slices fresh pineapple jalapeños mild pepper rings cheddar cheese swiss cheese and cottage cheese. I then proceeded to bake at 425 for 20-25 minutes. I let the pizza rest for about 7 minutes before taking a pizza cutter to it. That amount of time lets the cheeses set up just a little. It was a ton of toppings but the crust held up great. The leftovers reheated nicely in the toaster oven the next day. I wouldn't hesitate to use this crust again and again. Thanks Amanda-Rae for sharing your recipe. It's a winner in our house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-05T04:07:48.3Z",
                "reviewBody": "yum very good",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lommen's",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/recipehackers/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-01T19:17:27.413Z",
                "reviewBody": "Good pizza dough recipe. It's not all that flavorful but pizza dough doesn't necessarily need to be especially if you are topping it with a lot of yummy toppings. I wasn't sure of the yield either but I prefer thicker crusts so I doubled this (had to add an extra 1/2 c of flour to compensate) and ended up with three pizzas--two large and one medium sized pizza. However if I'd done thinner crusts I'm confident I could've gotten 5 possibly 6 pies out of this. I allowed the first two pies to rise for 20 minutes on the pan at 200 degrees and left the other pie to rise on the board since I didn't have room in the oven for 3 of them. In transferring the third crust to the pan it deflated so I let it rise again in the oven for 20 minutes. This one was much flatter though so I guess that's a technique if you like thin crusts but still like extra rising time. I made 2 Margherita pizzas and a 3rd pizza with whatever we had leftover: basil pizza sauce boursin cheese bacon and green olives. I like this crust; rises well and adjusts well basic and very simple to punch it up in flavor. Hubs really liked the crust on this; it turns out really soft and he used it to dip in spaghetti sauce. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-19T23:52:13.777Z",
                "reviewBody": "Amanda-Rae is truly a genius. Just a fantastic pizza crust. dough is real easy to stretch and makes a chewy yet crispy crust. All I can say is thank you Amanda Rae.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jmallaber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12052044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-24T01:26:00.427Z",
                "reviewBody": "Great pizza dough recipe. Loved the texture of the crust. Added garlic powder and only used 1 tablespoon of olive oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michele Jenkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8751965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-18T21:30:37.127Z",
                "reviewBody": "As long as you do a short prebake before adding the toppings. this crust will turn out well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Schwartzkopf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7481800/"
                }
            }
        ]
    }
]