[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
                    "name": "Apple Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/89853/apple-dumplings-with-rich-cinnamon-sauce/",
        "name": "Apple Dumplings with Rich Cinnamon Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F745673.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2020-06-19T03:12:34.000Z",
        "description": "This dessert stands on its own, but a scoop of vanilla ice cream certainly wouldn't hurt.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "5 tablespoons softened butter",
            "1 cup packed dark brown sugar",
            "2 teaspoons ground cinnamon",
            "¼ cup chopped toasted pecans or walnuts",
            "4 apples (any variety but Red Delicious) peeled, halved, and cored, a thin sliver cut off bottoms so apples sit flat",
            "1 (15 ounce) container 9-inch pie crusts",
            "1 egg white",
            "2 tablespoons sugar",
            "2 teaspoons cornstarch"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Adjust oven rack to lower-middle position and heat oven to 425 degrees.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix 3 Tbs. of butter, 1/2 cup of brown sugar, 1 tsp. cinnamon and  all the nuts in a small bowl. Spoon a portion of the mixture into each hollowed-out apple core.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For boxed pie crusts, unroll one of the dough sheets onto a floured work surface.  Pulling on sides of dough to straighten rounded edges, roll it into an approximate 12-inch square, then cut the dough into four 6-inch squares; brush the perimeter of each square with egg white. Set an apple half on each square. Bring up the 4 corners of dough around the apple and pinch edges to seal. Place on a large (at least 18- by 12-inch) parchment-covered baking dish. Brush dumpling tops and sides with egg white; sprinkle with sugar.  Repeat process with remaining apples and dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake dumplings until pastry sets and starts to turn golden brown, about 10 minutes. Reduce heat to 375  and bake until golden brown, about 20 minutes longer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While apples bake, bring 1 cup water, the remaining 2 Tbs. butter, 1/2 cup brown sugar and 1 tsp. cinnamon to boil in asmall saucepan over medium heat. Dissolve cornstarch in 2 tsps. water; whisk into hot syrup for a smooth sauce. Cover, keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For each serving, spoon a portion of sauce on a dessert plate. Set apple dumpling over warm sauce; serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Apple Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ben S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.743589743589744,
            "ratingCount": 117,
            "itemReviewed": "Apple Dumplings with Rich Cinnamon Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "480.6 calories",
            "carbohydrateContent": "62.5 g",
            "cholesterolContent": "19.1 mg",
            "fatContent": "25.3 g",
            "fiberContent": "2.4 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "7.1 g",
            "servingSize": null,
            "sodiumContent": "373.1 mg",
            "sugarContent": "37.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-08T02:26:04.32Z",
                "reviewBody": "Oh yes!! I have found THE best apple dumplin' recipe ever!! So worth the wait but it is not hard to make! Only thing I did different was I didn't have the packaged pie crusts I used instead the recipe for 'The Best Pie Crust' (and it is!) and put it in a freezer bag in the freezer for only half an hour. Rolled out great! You MUST try this recipe it IS a must!! Thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leanna Brown Snyder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-17T18:19:42.607Z",
                "reviewBody": "Easy delicious and better than apple pie. The cinnamon sauce was perfect and by the taste and appearance it looks like you speny hours making it! I followed the recipe exactly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cupatee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/976793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-27T13:43:14.68Z",
                "reviewBody": "These were so yummy! I made them last night for my small group and one of my friends who is a health-obsessed dr. actually ate one and was licking his plate by the time he was done lol! I did make a few changes: Okay-here are the things I changed for the recipe-I doubled it to make 16 servings (8 apples) I used the big ones you buy in bulk but if you bought the smaller ones I think you could probably use a whole apple for this-I used granny smith. Also I cut them in half horizontally then cored then and stuffed the filling inside that way-it was really easy and I didn't have to cut anything off the bottom because I just laid them on their flat sides. I put them on the crust and then I stuffed them so as not to make a huge mess trying to get them onto the crust. I doubled the filling and it used every bit so you could even do more and just pile it in the crust for more of that part-which was the best part I thought! I made my own crust-way better in my opinion. Also we used 350-I had taken them to my friends house and wanted them to be hot so I baked them there but left the recipe at home so I wasn't sure on the temperature-I did the 425 for 10 minutes and then 350 for 20 minutes- but I thought they were done enough-I had eight of them on a pampered chef stone and 8 on a metal air bake cookie sheet. The ones on the stone turned out even better so I would probably use that again or if you used a metal dish or baking sheet maybe reduce the cooking time. The ones on the met",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Brady Epsteen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3089037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-09T17:04:48.347Z",
                "reviewBody": "Great recipe. Definitely use small apples though wrapping them was a bit difficult. Not impossible just difficult. I sliced mine in half horizontally instead of vertically which made them stand up nice and straight with no problem. Also gave me a nice well to put filling in without any fuss. I used pecans instead of walnuts then toasted some peacans to add to my sauce - just because I like them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "queenvalerie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2963397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-02T01:53:06.16Z",
                "reviewBody": "Mmmm-mm! Yummy recipe. My husband even really liked these and he's usually a chocolate only kinda guy. I do want to note since I was stumped on this for awhile that the apples need to be sliced horizontally for it all to make sense. You're essentially stuffing the core of the halved apple with yumminess. I also cut the water to 1/2 cup on hearing the sauce was a bit watery. Excellent dumpings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ginny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1951961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-10T09:39:31.23Z",
                "reviewBody": "These were absolutely delicious and the sauce was so fast and easy to prepare. I made half with Gala and half with Granny Smith and the tartness of the Granny's was far better. It balanced the sweetness of the rest of the ingredients. I served with a scoop of vanilla ice cream--pure bliss!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KEGNOSAK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1248787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T21:10:45.717Z",
                "reviewBody": "I used the method for making the dumplings of enclosing the apple 1/4's in crescent rolls with this sauce. This will definately be my 'go to' sauce for dumplings in the future",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5347257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-13T14:44:02.94Z",
                "reviewBody": "Very good. Omitted the nuts (due to allergy). Poured syrup over the dumpling in a bowl and made homemade pie crust recipe. Will definately make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAZ49",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1364799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-22T17:35:23.417Z",
                "reviewBody": "I love Pam Anderson's recipes and this one does not disappoint! I don't even like apples and this is one of my new favorite desserts. Certainly I would like about 1/3 more pie crust. I used a 15 ounce (2 sheets) pie crust and it was stretched thin in some places thin enough that when I tried to move the dumplings to a serving dish some of them \"ripped\" and fell apart. Of course homemade crust is always going to be better if you have the time. Also I used buttered foil and my dumplings still stuck to the bottom of the dish so you might want to cook them in the serving dish or use the parchment. If you want a richer caramel cinnamon sauce omit 1/2 cup of the water and replace with heavy cream. It takes the sauce from great to unbelievable.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Islander",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1493223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-26T13:19:01.727Z",
                "reviewBody": "I generally like Pam Anderson's recipes (I have one of her cookbooks and have liked every dish I've tried from it) but this was just so-so for me. Luckily my mom and dad LOVED this so I at least feel good about that.:) If given the choice I'd much rather have apple pie - simple basic apple pie just tastes better (and is MUCH easier to assemble) IMHO. The second turnoff for me was the addition of nuts in this. I did not care for them at all. They kinda seemed out of place (but that's just my.02). The biggest letdown for me was the sauce. It simply lacked oomph. The sauce tasted bland and was oddly thick but not in a sticky or syrupy sort of way (if that makes any sense). Don't get me wrong. This wasn't terrible. It just wasn't for me. Better luck for everyone else I guess. Thanks anyways Pam!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            }
        ]
    }
]