[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/90044/sesame-noodles/",
        "name": "Sesame Noodles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4536514.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2020-06-19T03:12:36.000Z",
        "description": "This homemade sauce makes a sweet and spicy foil for linguine. The best sesame noodles I have every had!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (16 ounce) package linguine pasta",
            "6 cloves garlic, minced",
            "6 tablespoons sugar",
            "6 tablespoons safflower oil",
            "6 tablespoons rice vinegar",
            "6 tablespoons soy sauce",
            "2 tablespoons sesame oil",
            "2 teaspoons chili sauce",
            "6 green onions, sliced",
            "1 teaspoon sesame seeds, toasted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a pot of lightly salted water to boil. Add pasta, and cook until al dente, about 8 to 10 minutes. Drain, and transfer to a serving bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, place a saucepan over medium-high heat. Stir in garlic, sugar, oil, vinegar, soy sauce, sesame oil, and chili sauce. Bring to a boil, stirring constantly, until sugar dissolves. Pour sauce over linguine, and toss to coat. Garnish with green onions and sesame seeds.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "scoopnana"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5508905852417305,
            "ratingCount": 786,
            "itemReviewed": "Sesame Noodles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "370.9 calories",
            "carbohydrateContent": "52 g",
            "cholesterolContent": null,
            "fatContent": "14.8 g",
            "fiberContent": "2.9 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "699.2 mg",
            "sugarContent": "10 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-09T07:29:38.077Z",
                "reviewBody": "Oh, how I LOVE this recipe! Following other reviews, I add minced fresh ginger & chopped cilantro, and I reduce the oil to 4 T. and sugar to 3 T. I use only 1 1/2 t. chili sauce because I'm wimpy that way! Thicken the sauce with 1 t. cornstarch mixed into 1 c. chicken broth, and stir in 1 T. toasted sesame oil at the end, off heat. Optional add-ins make it even better: shredded napa cabbage, red bell pepper strips, blanched & sliced snowpeas, and/or cooked & cubed chicken. Absolutely delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUTGERCAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/975672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-13T12:08:16.98Z",
                "reviewBody": "I made this today to go with Michelle's Roast Chicken. I needed something in the same taste-vein. I subbed vegetable oil for the safflower oil, because I didn't have it. I also didn't use chili sauce because my kids have to be able to eat it. They don't like spicy food. Very tasty. I served it as a cold side, as it's pretty warm here lately. Refreshing and light. My husband fell in love with it, and he can be a little picky. I had to restrain him from eating the whole bowl. I will make this again for sure. EDITED: Now that I'm cooking to reflect a low-sodium/low-fat/low-sugar lifestyle, I now make it like this.... I'll cut the noodles in half and used a little over 1/2 bag of shredded coleslaw mix in place of the missing noodles. I now use EVOO instead of safflower oil, honey or Splenda brown sugar blend instead of sugar, low sodium soy sauce and after I toss the sauce with the noodles and coleslaw, I chill it. Right before serving, I sprinkle the servings with a little chopped, roasted unsalted peanuts or cashews. I've made this for four years now and I've got to say that this is one of our most favorite recipes from AllRecipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-27T11:45:29.617Z",
                "reviewBody": "Since the temperature is already hitting triple digits here in Las Vegas, I decided to serve this cold as a salad.  I made the sauce as written except I added a little crushed ginger from a jar from Trader Joe's.  I had 2 different kinds of chile garlic sauce; 1 Chinese and 1 Vietnamese, so I said what the heck and put in a tsp of each.  I used Chinese Yung Chung noodles instead of linguine; and to make it more like a salad, I added a chopped, seeded cucumber, some edamame and some cilantro.  This came out delicious!......Since I wrote this original review back in 2007, I've become more health conscious and now when I make this, I omit the vegetable oil completely, use Splenda instead of sugar, and not so much of it, bump up the dark sesame oil by a couple teaspoons, increase the chili garlic sauce and use whole wheat noodles.  The dish is still delicious, but as DH said, it tastes fresher and lighter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-10T16:16:53.157Z",
                "reviewBody": "This recipe is so good it should come with a warning: may be addictive!  It's sweet and spicy and what's great about it is you can adjust the amount of sweet or spice depending on your tastes. It can be a main dish or side dish depending on what you do with it.  You can add veggies, shrimp, beef, chicken; the possibilites are endless.  Like others, I cut the amount of oil in half and fresh pasta is best.  If you don't like things too hot, use hoisin sauce instead of chili sauce.  This recipe is a definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-21T01:54:22Z",
                "reviewBody": "This recipe is extremely good. To make this taste authentic use FRESH pasta (I use \"Basic Pasta\" from this site), if you don't care to make noodles, just buy a package of the fresh linguine if you can, that alone made this dish 50 times better.. I cut the oil in half (sometimes I use canola depending what I have on hand, but safflower has more health benefits) I also sometimes use Agave rather than sugar. I also replace 2 tablespoons of vinegar with mirin, and add some garlic chili sauce.  I served this dish tossed with fresh stir fried veggies and egg rolls on the side.. my family and friends said they would rather have me cook Asian any day, rather than eat at a greasy takeout.   To be honest it tastes very similar to PF Changs lo mien. Add all your favorite stir fry veggies to this!  This is going into the recipe collection for sure. thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/gia/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-20T18:53:38.77Z",
                "reviewBody": "This was really good.  Instead of just tossing the noodles with the sauce, I let it all simmer/fry on fairly high heat so the noodles could really absorb the flavor and have more of a pan-fried noodle. I also replaced the safflower oil with peanut oil. They were delicious!  Next time I think I will lighten up on the amount of oil and use fresh noodles.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "stylistmama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/858598/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-23T12:58:57.31Z",
                "reviewBody": "With adjustments this was very nice! I used canola instead of safflower oil & cut it back to 3 tbp., I used a bit more than a tsp. of chile paste instead of chile sauce, cut back on the vinegar & sugar a little & I used rice noodles instead of linguine. I thought it had just the right ratio of flavors going on...not too spicy, not too sweet, not too vinegary & not too oily. This worked perfectly w/ some leftover Mahogany Chicken Wings (I used legs though & for this meal, I removed the meat from the leg, chunked it up some & served it on top of these noodles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-26T16:53:29.357Z",
                "reviewBody": "These noodles were so good and so easy to make! Thank you so much for sharing the recipe; I'll definitely be making these again. I followed the suggestions of earlier reviewers and cut the sugar by about 1/3 and used fresh noodles. They turned out fantastic. I halved the recipe because I was only cooking for two but next time I'm making the whole batch so I have some yummy leftovers!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly Bennett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1107394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-19T16:28:53.733Z",
                "reviewBody": "I have tried many sesame noodle recipes, but after I made this recipe, I ripped up all the old ones!  The chili is a great addition. I used Hoboken Eddie's spicy thai chili sauce (it has extra garlic, hot peppers and herbs).  I make this every week now. Thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avigayil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1325427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-12T17:14:42.7Z",
                "reviewBody": "This was okay but not one of my favourites of this type of dish I've tried. It was very vinegary and the sesame flavour wasn't very noticeable to me. I added bean sprouts to the garnish as I had some to use up. I may use this recipe again to play with the ingredients/amounts but I wouldn't make again as is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3513546/"
                }
            }
        ]
    }
]