[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/237736/gluten-free-moist-chocolate-cake/",
        "name": "Gluten-Free Moist Chocolate Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2184347.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2020-06-19T03:59:11.000Z",
        "description": "This deliciously moist and fudgy chocolate cake is made with a gluten-free twist that nobody ever suspects: quinoa! I've also made a vegan option of this by using egg substitute and replacing the milk with almond milk. The taste and texture was identical to my non-vegan original! Either version stores well in a sealed container in the refrigerator for up to 1 week or in the freezer for up to 1 month. My favorite frosting for this cake is coconut cream cheese.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "1 cake",
        "recipeIngredient": [
            "1 ⅓ cups water",
            "⅔ cup quinoa",
            "¾ cup butter, melted and cooled",
            "⅓ cup milk",
            "4 large eggs",
            "1 teaspoon vanilla extract",
            "1 ½ cups white sugar",
            "1 cup unsweetened cocoa powder",
            "1 ½ teaspoons baking powder",
            "½ teaspoon baking soda",
            "½ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer for 10 minutes. Turn off the heat and let sit until quinoa is tender and water is absorbed, about 10 minutes more. Fluff with a fork and cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 8-inch cake pans and line the bottoms of the pans with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend butter, milk, eggs, and vanilla extract in a blender until combined. Add 2 cups cooked quinoa and blend until smooth, scraping down the sides of the blender with a rubber spatula as necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk sugar, cocoa powder, baking powder, baking soda, and salt together in a bowl. Add quinoa mixture into sugar mixture and whisk until batter is smooth. Pour batter into prepared cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a knife inserted into the center of the cakes comes out clean, 40 to 45 minutes. Cool completely in the pans before removing to a plate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ADeSouza"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.769230769230769,
            "ratingCount": 91,
            "itemReviewed": "Gluten-Free Moist Chocolate Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "333.9 calories",
            "carbohydrateContent": "42.7 g",
            "cholesterolContent": "111.7 mg",
            "fatContent": "17.8 g",
            "fiberContent": "3.6 g",
            "proteinContent": "6.2 g",
            "saturatedFatContent": "10.2 g",
            "servingSize": null,
            "sodiumContent": "385.1 mg",
            "sugarContent": "30.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-12-10T02:59:50.927Z",
                "reviewBody": "I was afraid to try this recipe, because 1) I have never made anything GF and 2) I hate quinoa. This cake is SO moist and chocolatey, without the slightest hint of quinoa flavor. It rises a lot in the oven, but then falls. It ends up being about an inch thick, with the texture like a cakey brownie. Make sure to blend up the quinoa very well, so that you don't end up with a chunky cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSelvidio",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1370869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-23T21:46:48.14Z",
                "reviewBody": "AMAZING CHOCOLATE CAKE, best ever, even for those who are not required to eat gluten free. In order to make the layer cake a nice height, I adjusted the servings to 15 from 10 and used 3x8 inch round cake pans. This worked out absolutely perfectly!! I then frosted the cake with the Allrecipes Coconut Cream Cheese frosting, just frosting in between the layers and on top, leaving the chocolate cake exposed on the sides. It was the most beautiful and delicious cake I have ever made. I lightly toasted some shredded coconut and sprinkled it on the top of the cake. My husband, who is extremely gluten sensitive, is already looking forward to the next special event.  ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MindyB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2126349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-02T11:57:35.033Z",
                "reviewBody": "Thank you for sharing your success. I have baked this few times and I have shared it with many friends. I double the ratio of quinoa to the water and it makes it more moist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12334206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-05T00:15:30.92Z",
                "reviewBody": "This cake is wonderful. It's very flavorful moist and rich but not too rich. Based on another reviewer's suggestion I was careful to make sure I blended the quinoa thoroughly until I could no longer see any little quinoa pearls through the side of my blender. I don't have a lot of experience using different cocoa powders but for this recipe I used \"Ghiradelli\". The result was a particularly delicious (IMO) chocolate flavor. I opted to go with the chocolate/raspberry combination that is shown in one of the photos. So I used Raspberry Polamer All Fruit between the layers and fresh Raspberries on top. It was so pretty and delicious. I served this to eight people and everyone enjoyed it. I will make this again. Thank you so much for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MikeKelly Radzicki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3458419/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-11T03:10:58.13Z",
                "reviewBody": "Love. Love. Loved this recipe! Made it for my mother in laws birthday. My sister in law is gluten free and I didn't want to make two desserts. You would never know there wasn't flour by the taste. It's incredibly moist! My mother in law kept saying how great it was and wanted slices to take home! My only complaint is it makes two layers but they aren't high. That I think is just a gluten free issue over all. I just made another batch of cakes and made the cake 3 layers. I now have a left over layer to freeze. I made a basic white frosting and tinted it yellow, had a brain freeze and added lemon extract to match the yellow color. It turned out wonderful. I would have never paired the two together, but this cake goes extremely well with lemon. This will be my go to gluten free chocolate cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rena Wilkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/848545/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-13T06:12:06.6Z",
                "reviewBody": "This is SOOOOOOO good!!!! I cooked it in a 9 x 13\" glass pan at 350 F for 40 minutes and it was perfect. I didn't even bother icing it. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2225650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-02T11:17:05.497Z",
                "reviewBody": "With tweaks I'd give this 5 stars (4 as written)! My sister and I tested this out a couple of times and found that subbing all the water with strong brewed coffee and all the white sugar with packed brown sugar gives this a perfect amount of chocolate richness :) As written it wasn't chocolaty enough for us.\nWhether you use these tweaks or follow the recipe as written, the level of moisture for this recipe is perfect.\n\nA few other tips:\nMake sure to line your cake pans with wax paper on the bottom for easy removal.\nIf you want the best chocolate experience, bake this recipe in 2 9\" rounds and use some whipped chcolate ganache as a filling and crumb coat, and frost with buttercream. Amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "221b",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/221b/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-15T07:34:07.407Z",
                "reviewBody": "Excellent recipe! I did not make any changes at all. One trick to getting a smooth batter is to make sure the quinoa is cooked well even adding a little extra water just to make sure it is more on the moist side rather than on the dry side when it is done cooking. I mixed the first few ingredients in my food processor and let it blend well then poured the wet ingredients into the dry ingredients. Baked as directed. Make sure to not over cook since it will dry out the cake and will give a crumbly texture as some people mentioned. The cake looked great and smelled wonderful! It was also very moist and held together nicely. When I served it no one knew it was gluten free!! Thanks for sharing. I am looking forward to trying it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tootiemoonie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4013067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-18T22:51:49.67Z",
                "reviewBody": "After making this once for a work potluck numerous friends asked for the recipe and I have continually had requests to make it everytime I do get togethers with friends from work my sports teams and my family! I'm not on a gluten-free diet but its nice to know its edible for people who may be when I take it to potlucks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADeSouza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3095069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-16T23:14:18.883Z",
                "reviewBody": "This was my first time making a gluten-free cake so I'm not sure if this applies to this specific recipe or all gluten-free cake recipes. This cake was sticky! Getting it off the pan was a pain and it fell apart. I did it get it back together with frosting but it was huge pain trying to get it back together. It was more like a brownie consistency. You really need to grease the pan hard. I used oil and gluten-free flour to grease the pan and that was not the route to go. It tasted good but like I said it was more like a brownie than a cake. I don't know if I'd make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol Brown",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20737259/"
                }
            }
        ]
    }
]