[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/200/meat-and-poultry/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
                    "name": "Steaks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/90314/my-country-style-steak/",
        "name": "My Country Style Steak",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F200174.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:12:38.000Z",
        "description": "A simple and easy recipe for cube steak that can easily be stretched to feed as many as you like. Serve over rice or potatoes.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "1 pound cube steak, cut into bite-sized pieces",
            "½ cup all-purpose flour for coating",
            "1 tablespoon all-purpose flour",
            "1 (1 ounce) envelope dry onion soup mix",
            "2 cups water, or as needed",
            "salt and pepper to taste",
            "garlic salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium-high heat. Coat cube steak pieces with flour, and shake off the excess. Fry steak pieces in the hot oil just until browned on each side and there are some juices in the pan. Remove with a slotted spoon and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir together the onion soup mix and 1 tablespoon of flour; sprinkle into the skillet. Cook and stir over medium heat until it starts to brown. Gradually mix in the water to make a gravy. Return the cube steak to the pan, and season with salt, pepper, and garlic salt. Cover, and simmer over low heat for about 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Beef",
            "Steaks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SUZANNER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.484649122807017,
            "ratingCount": 456,
            "itemReviewed": "My Country Style Steak",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "253.6 calories",
            "carbohydrateContent": "17.8 g",
            "cholesterolContent": "27.3 mg",
            "fatContent": "12.9 g",
            "fiberContent": "0.9 g",
            "proteinContent": "15.9 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "732 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-16T22:46:40.31Z",
                "reviewBody": "I loved this recipe. To start with I much prefer brownish gravy to the white milk gravies for most country-fried steak. Secondly I don’t know where others get their cube steak but the cube steak I get is slashed up with the mechanical tenderizer but NEVER seems to be that tender. Recipes that call only for breading it, browning it, then pour gravy over it, always leave me with nothing but a tough, breaded piece of meat with gravy on top. (Our cube steak isn’t that cheap to waste on poor cooking either.) I live in the South where people make Country Fried Steak all the time. The best, most tender, (homemade) versions of the dish that I’ve had are ALWAYS simmered in the gravy like this recipe. I’ve simmered before too but still it was not “melt in your mouth” tender and kind of bland. I was intrigued to try this recipe with the smaller pieces of steak trick to see if it helped. It does immensely! I pretty much went by the recipe. I cut my steak into strips. Also the onion soup is a nice rich starter flavor instead of just plain meat gravy from drippings only. The smaller pieces tend to soak up more of the gravy flavor than the big steak size pieces too. I sautéed some fresh onions and some canned mushrooms to add to the gravy and give it a little more home cookin’ restaurant quality depth. I simmered this for closer to two hours on very low heat, stirring and adding water as needed. Very tasty and tender. From now on this is MY Country Style Steak too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JUSTCYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/36207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-30T22:05:11.557Z",
                "reviewBody": "I had some cube steaks that had spent way too long in my freezer.  I hate to tell how long they have been in there.  This recipe did an excellent job of rendering my elderly cube steaks palatable.  I just chopped off the freezer burned part and gave it to the neighbor's dog. (He's still alive so far.) The only thing I did different was to deglaze the pan with a little two-buck chuck Cabernet Savignon before adding the onion soup mix.  And I threw in a blob of minced garlic.  I followed the advise of another reviewer and substituted one cup of milk (I only had fat-free) for one cup of the water.  This was absolutely delicious served with garlic mashed potatoes and Smothered Green Beans from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-07T14:59:22.107Z",
                "reviewBody": "Excellent.  My boyfriend had asked that I make cube steak ... but I was up against his recollections of how his now-departed mom had made it! Apparently I came close.  One caution, though: I have a low tolerance for saltiness, and the salt in the soup mix was enough; I substituted garlic powder for the garlic salt (because that's what I had), and it was still plenty salty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hugh Silcox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/757249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-18T03:05:15.863Z",
                "reviewBody": "Best use of cubed steak I've found. Comes out fork tender.  I used garlic powder not garlic salt, and made the gravey with 1-1/2 tblsp flour, 2 cups water and one cup milk. It was not at all salty to me made this way, and I liked the extra gravy. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYSLEW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ladyslew/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-27T03:23:16.64Z",
                "reviewBody": "This was great. Thanks Mandy Sue for the recommendation. I left the steaks whole and seasoned the flour that I coated them in with some Mrs. Dash Mesquite Grill Seasoning. And the only onion soup mix I had was with mushrooms so I used that. If I had fresh or canned I would have addede those in too. Oh well there's always next time. Thanks SUZANNER. I am sure I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookinme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1741728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-07T21:52:26.373Z",
                "reviewBody": "This interesting variation on cube steak was good served with mashed potatoes.  To control the saltiness, mentioned by another reviewer, I only used 1/2 envelope of dry onion soup mix, and omitted the garlic salt as well as salt and pepper.  I didn't feel that it needed to cook 1 hour because cube steak is tenderized and cooks so quickly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SELEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-21T18:37:32.06Z",
                "reviewBody": "We thought this was just great!  I was surprised at how good it was thinking that a poor little cube steak would be cooked to death for an hour.  I cut the steaks into thirds and used the garlic powder instead of salt.  Also took the meat out at the end and thickened the gravy a little more with another TBS of flour and 1/4 C water.  Was wonderful with mashed potatoes and green beans on the side.  We'll have it often I'm sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUDITH411",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1048723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-04T23:52:09.92Z",
                "reviewBody": "This is one of my husbands favorite comfort foods. It reminds him of a dish his mother made when he was little.  The gravy is wonderful served over mashed potatoes and we liked it with sauteed mushrooms and green beans. Go easy on the salt though...We actually  omitted the salt b/c the sodium from the onion soup mix was all our family needed. I sliced up onions and baked it instead of cooking it stovetop. Either way...great meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hsoltys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1927246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-14T13:58:57.023Z",
                "reviewBody": "This was an easy recipe to put together and very tasty!  I added some garlic powder and pepper to the flour before coating the meat.  I also left the cube steaks whole since I had some extra time to let them simmer longer.  After reading other's reviewers comments I decided to make a little extra gravy for the potatoes, so, I used 1-1/2 tbs of flour and 1-1/2 packs of onion soup mix.   After browning I used just a little red wine to deglaze the pan and add a little richness.  We like our gravy a little creamier - so I used about 1-1/2 cups of water and 1 cup of 2% milk (what we had). If you like a brown gravy - stick with the water.   I did not add any additional salt or garlic salt since I knew the onion soup mix was very salty on its own.  After whisking together to make the gravy I added the steaks back, covered them and let them simmer for about 1-1/2 hours.  I then took the lid off and let them simmer for another 1/2 hour to help thicken the sauce.  If the gravy is too thin you can remove the steaks, turn the heat up and add a little cornstarch dissolved in cold water to thicken.  Mine was a good consistancy though so I didn't need it this time.  The meat was fork tender and had good flavor. The gravy was still a little salty to me, but, my husband really liked it.  I served it with garlic mashed potatoes and baby peas.  It was good comfort food on a chilly night and different way to make cube steak other than country fried steak with white gravy that has a lot more fat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Happyschmoopies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/happyschmoopies/"
                }
            }
        ]
    }
]