[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/238202/quick-and-easy-summer-limoncello-cake/",
        "name": "Quick and Easy Summer Limoncello Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1270682.jpg",
            "width": 2150,
            "height": 2150
        },
        "datePublished": "2020-06-19T03:59:39.000Z",
        "description": "Limoncello cake is refreshing cake great for a summer picnic or dinner. Quick and easy to make. A scratch cake that will impress your guests. My mom taught me how to make this cake.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 cake",
        "recipeIngredient": [
            "cooking spray",
            "1 cup sour cream",
            "1 cup white sugar",
            "⅓ cup canola oil",
            "2 eggs, beaten",
            "3 tablespoons limoncello liqueur",
            "1 lemon, zested",
            "2 cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "½ teaspoon baking soda",
            "1 pinch salt",
            "½ cup confectioners' sugar",
            "2 tablespoons limoncello liqueur"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Spray an 8-inch square cake pan with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk sour cream, white sugar, canola oil, eggs, 3 tablespoons limoncello, and lemon zest together in a large bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift flour, baking powder, baking soda, and salt together in another bowl. Add flour mixture to sour cream mixture; stir with a wooden spoon until batter is just combined. Pour batter into prepared cake pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 33 to 35 minutes. Cool cake in the pan for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk confectioners' sugar and 2 tablespoons limoncello liqueur together in a bowl until glaze is thin and smooth. Spread glaze over the top of the cake. Cool cake completely before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AllieGeekPi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.451612903225806,
            "ratingCount": 31,
            "itemReviewed": "Quick and Easy Summer Limoncello Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "277.1 calories",
            "carbohydrateContent": "39.9 g",
            "cholesterolContent": "39.4 mg",
            "fatContent": "11.3 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3.8 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "135.9 mg",
            "sugarContent": "22.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-07-19T11:36:43.257Z",
                "reviewBody": "This recipe is much like \"Refreshing Limoncello Cake \" from this site. I loved that one so it's no wonder I loved this one as well. It is indeed a cake appropriate for summer as it is not overly sweet or rich but it would be equally appropriate any time of year particularly after a heavy meal. The cake is moist and soft not exactly fluffy but certainly lighter than a pound cake. The lemon flavor is subtle so in my mind it really does need the Limoncello glaze to embolden it. I loved it as is but if I were to make it again I would add a little more lemon zest to really enhance the lemon flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-06T15:09:37.367Z",
                "reviewBody": "I doubled this recipe and baked it in a bundt pan. The amount was perfect for a big, rounded cake. I'm thinking of adding the lemon juice to it next time because the lemon flavor is so delicate, despite the zest of two lemons. The ingredients say \"one lemon, zested\", so I only used the zest. Did anyone take this to mean other than the zest? Could be that I misread the intention. Anyway, my husband does not love lemon, or cake, but he has raved about this cake and eaten it alone, with a glass of limoncello (see my photo), with ice cream, and drizzled with chocolate syrup. It's going into my permanent favorite recipe book I'm making to take along when we move to Italy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan Thatcher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9686100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-18T02:24:23.603Z",
                "reviewBody": "Too bad I can only give this cake 5 stars, it deserves 10!!  First of all, I got to buy my first bottle of Limoncello, YEAH! Second, this cake is LIGHT as a feather and oh SOOO YUMMY!! Third, this makes a Perfect dessert after even the heaviest of dinners. This would be a Lovely cake for an afternoon tea. The crumb is Very tender and moist. The title is missing one word and that word is,  FABULOUS!!  I added a few teaspoons of limoncello after it came out of the oven and added some yellow food color to the glaze. LOVE LOVE this new summer time treat:::))) THANK YOU ALLIGREEKPI,  THIS ROCKSSSSS!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty Cakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ilovecarlos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-03T12:36:31.187Z",
                "reviewBody": "I doubled the recipe as suggested by another reviewer. It worked perfectly for the bunt cake pan I was using. I also use more limoncello and peel then the recipe called for because I prefer a stronger lemon flavor. The limoncello used was my homemade version with a hint of lavender. As the cake cooled I had poked holes on the bottom using a wooden skewer & poured additional limoncello. Once it soaked through I had removed the cake from the pan & pour the icing onto the bottom of the bunt cake pan and poked additional holes on the top using the same method as I had on the bottom. Gently replaced cake back to the bunt pan lining the design of the pan with the cake until completely cooled. This was the best limoncello cake I've ever had!! Thank you for sharing your recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PamC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12822016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-11T15:35:25Z",
                "reviewBody": "This is a very nice cake. I did add a tsp. of lemon extract after reading reviews and I will do that when I make the cake again. That's the only reason I didn't give it 5 stars (because I made an addition). The cake reminded us of a pound cake and I served it with blueberry sauce as another reviewer did. I must say I thought this was a bundt cake because of the picture and didn't discover it was an 8\" cake until the day of my event. I made it in the bundt pan anyways and it was small of course because there wasn't enough batter but it was still pretty and good. Next time I will increase the ingredients by 50% and I'm hoping it will be a normal-sized bundt cake with that change.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MissPegs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/misspegs/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-09T04:38:39.81Z",
                "reviewBody": "No company to impress with these wonderful little cakes but I did impress my family! Allie - these are wonderful. I didn't have Limoncello but I did have Orangecello so that is what I used. I also used 1 zested orange in place of the lemon. I used my mini Bundt pans and the recipe made 22 delicious treats. We ate some gave some to friends and family and I froze 6 of them. They thawed beautifully and were delicious months after they were made. I plan on making them again using the Limoncello but the Orangecello worked great also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-11T21:20:01.473Z",
                "reviewBody": "Love this cake - quick, easy, delicious.  I had a bottle of limoncello I purchased in Portofino, Italy and used that which made it extra special.  Also, I did as another reviewer stated; I made the recipe just as is and put it in a bundt pan.  It made a prettier little cake than an 8\" pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4251773/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-20T19:11:05.523Z",
                "reviewBody": "What a lovely summer cake! It's not too sweet and the perfect canvas for a summer berry topping. I made a fresh blueberry sauce to serve with ours. I also used cream of limoncello instead of regular as that is what I had in my freezer. I baked mine in a tube pan and decorated around the edges with fresh blueberries and lemon slices. So pretty! Thanks for sharing your recipe Allie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim's Cooking Now",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kimscookingnow/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-19T02:03:24.703Z",
                "reviewBody": "I was really happy with this recipe! I doubled the recipe and made cupcakes too. It was light and lemony (I added some lemon juice along with the zest just to be sure!) a nice texture and the glaze was a perfect compliment. I got lots of compliments on it. Frosting would have made it prettier so I might try that some time as well but I think the glaze was just the right amount of sweetness for me. I saw someone mentioned making it with orange and I may give that a try as well. I'll definitely make this one again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13659059/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-03-31T02:29:03.640Z",
                "reviewBody": "This was a very moist cake but not as lemony as I thought it might be. It says to use the zest of one lemon but didn't say anything about adding lemon juice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Marlene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5600208/"
                }
            }
        ]
    }
]