[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17532/desserts/fruit-desserts/blueberry-desserts/",
                    "name": "Blueberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/238374/warm-blueberry-cobbler/",
        "name": "Warm Blueberry Cobbler",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2355840.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2020-06-19T03:59:46.000Z",
        "description": "Delicious blueberry cobbler with only 6 simple ingredients. Turns out well with fresh or frozen blueberries. Serve warm with whipped cream or vanilla ice cream.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "3 cups blueberries",
            "1 tablespoon lemon juice",
            "1 cup all-purpose flour",
            "1 cup white sugar",
            "1 egg, beaten",
            "6 tablespoons melted butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place blueberries in a 6x10-inch baking dish. Sprinkle lemon juice over blueberries.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk flour, sugar, and egg together in a bowl until mixture resembles coarse crumbs; spread over blueberries. Drizzle butter over flour mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until cobbler is bubbling, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Blueberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dawn"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.638888888888889,
            "ratingCount": 144,
            "itemReviewed": "Warm Blueberry Cobbler",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "180.3 calories",
            "carbohydrateContent": "30 g",
            "cholesterolContent": "30.8 mg",
            "fatContent": "6.4 g",
            "fiberContent": "1.2 g",
            "proteinContent": "1.9 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "47.3 mg",
            "sugarContent": "20.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-06-26T20:12:40.233Z",
                "reviewBody": "After reading a couple of reviewers' remarks that this was too liquidy, too juicy,  I took that as a heads up.  Because of previous experience with blueberry cobblers, however, I knew this needed  no flour or cornstarch and was just fine without.  But given the experience of some others,  I took heed and baked it a little longer (than I should have) to make sure I would not have that problem.  Yes, others' experiences can give us insight into how a recipe performs, but in addition to that we must not forget to use and trust our own judgment.  The recipe, as I see it now, is perfect as written.  Just right sweet with a rich and buttery crackly topping unlike a true cobbler, but just delicious no matter what you want to call it.  I have no doubt it was because of that decadent drizzle of melted butter before baking.  Seriously,  I tried a little dish so as to review this recipe beyond what  I already knew about it from preparing it - and I had to stop myself from eating my fill.  My attempts to correct a problem that proved to be non-existent caused more of the juices to evaporate than should have been.  So aside from,  in this case anyway, using the tips provided by others, this would have been a 5-star recipe.   My suggestion?  Prepare this recipe just as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-06T20:15:28.013Z",
                "reviewBody": "5 stars for ease and the taste is fine but it is way too juicy. I made this with frozen blueberries and was surprised that the recipe didn't call for cornstarch or tapioca with the berries to thicken the juice. (2 tablespoons of cornstarch tossed with the berries would do the trick)  Next time I would mix the melted butter in with the flour, sugar, egg mixture rather than pouring it over the top.  The butter tended to run to the edges and it was hard to coat the entire top. The recipe states this will serve 12, in reality it would actually serve 5 - 6 tops.   With a few minor changes this would be a super easy 5 star recipe.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-04T04:43:42.673Z",
                "reviewBody": "I really enjoyed baking this recipe.  I followed the recipe exactly as written.  I used frozen blueberries.  The blueberry recipe came out great.  It was light and I added a scoop of frozen yogurt.  Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anita L Thompson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/beginningcook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-03T17:29:32.373Z",
                "reviewBody": "I had an abundance of blueberries so I decided to try this.  I followed the suggestion of the previous reviewer and added cornstarch to the blueberries.  It was very good, but next time I make this, I won't add the cornstarch. The topping is light and a little crunchy and the berries weren't too sweet. Since I had several berries, I used a few extra and used a larger pan. I will make this again!  It was so easy to do and was delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susanmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/873963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-02-20T20:19:08.937Z",
                "reviewBody": "This is amazing! It was super easy to make, considering I'm a 12yr old. A lot of the comments I read before making this got me kind of nervous, saying things like how it was too sweet or too juicy. It wasn't at all. I suggest to just follow the steps exactly, no halving the sugar or anything like that. The only thing that I did differently was the fact that my blueberries were frozen, but I don't think it changed anything. I will definitely be using this recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maddie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23352424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-01-20T10:44:17.777Z",
                "reviewBody": "Made as written and deserving in my opinion of at least 10 stars.  I used fresh blueberries  and made the topping as directed, even though the method of mixing egg into the dry ingredients of flour and sugar was unfamiliar to me.  Before baking, I used a turkey baster to drizzle the melted butter over the topping to ensure that all the flour mixture was covered.  We topped our individual servings with vanilla ice cream, but served with ice cream, whipped cream or just as is, this was pure deliciousness!  I do agree that there's no way this will serve 12.  I would say the number is closer to 6 to 8.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2547735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-06T00:44:43.727Z",
                "reviewBody": "Made this for Mother's Day and all enjoyed it! I did add about a tsp or so of tapioca to the berries and a few pinches each of nutmeg and cinnamon to the crust. Could have used more of each of those add-ins but still quite tasty! I'm not great at making crumbly toppings and I really like this version which held together more like a cookie. Oh and I reduced the flour about 2 tbsp and added in oatmeal for more texture. UPDATE: Just made this for a second time. I did increase a bit more cinnamon and nutmeg and perfection! And I'll use this crumb topping for several recipes! UPDATE#2: I have now made this recipe several times with varying fruit fillings. Seems the best combo for me is to add about 2Tbsp of tapioca (depending on the juiciness of the fruit). Tonight was fresh rhubarb from the garden; just over 2Tbsp of tapioca and it was perfect texture; definitely add in the nutmeg and some cinnamon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stevie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4389094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-18T01:31:03.2Z",
                "reviewBody": "So easy and delish! I've made this 3 times this week! Didn't change a thing until the 3rd time and all I did was add raspberries and blackberries. (All blueberries is the best BTW.) It has kind of a sugar cookie texture but it's super yummy and again...EASY! My lazy kids could even make this! Hopefully they will - it's about time for Round 4. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MelG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1588437/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-05T03:52:07.247Z",
                "reviewBody": "I followed this recipe exactly as it was written and it came out wonderful. This is my third time making this. My husband loves it. My picky mother-in-law also loves it. I like to eat it for breakfast. We like to serve it with vanilla ice cream and a little sprinkle of cinnamon on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CDD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4586992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-07-18T04:22:23.86Z",
                "reviewBody": "Too much crumble topping and the texture was a bit sandy. The taste was good and the fresh blueberries perfection.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michele Seigerman Bennett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21528138/"
                }
            }
        ]
    }
]