[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/93285/cherry-enchiladas/",
        "name": "Cherry Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F636149.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2020-06-19T03:13:08.000Z",
        "description": "Cherry Pie like you've never had it before! Cherry pie filling wrapped in flour tortillas, soaked overnight in a sweet liquid, then baked.  I used to work at a bed and breakfast, and we would make this sometimes for catered luncheons. I added my own touch with the almonds.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT9H0M",
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "½ cup water",
            "½ cup butter",
            "½ cup white sugar",
            "5 (10 inch) flour tortillas",
            "1 (21 ounce) can cherry pie filling",
            "2 tablespoons white sugar",
            "½ teaspoon ground cinnamon",
            "1 tablespoon crushed sliced almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease a 9x13 inch baking dish. Combine the water, butter and 1/2 cup of sugar in a small saucepan and bring to a boil. Place a few spoonfuls of cherry pie filling just slightly off center of each tortilla. Roll up and place seam side down in the baking dish. Pour the hot liquid over the 'enchiladas' making sure to coat the tops completely. The mixture will be watery. Cover and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Combine 2 tablespoons sugar, cinnamon and almonds in a small bowl or cup; sprinkle over the top of the enchiladas.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 35 to 40 minutes in the preheated oven, or until outside edges of the tortillas are golden brown. Let cool slightly before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Brigantine"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.413223140495868,
            "ratingCount": 121,
            "itemReviewed": "Cherry Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "622.4 calories",
            "carbohydrateContent": "94.7 g",
            "cholesterolContent": "48.8 mg",
            "fatContent": "24.5 g",
            "fiberContent": "3.1 g",
            "proteinContent": "6.7 g",
            "saturatedFatContent": "13.1 g",
            "servingSize": null,
            "sodiumContent": "597.4 mg",
            "sugarContent": "26.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-17T19:10:34.093Z",
                "reviewBody": "I must say this was exceptional. I took another reviewer's advice and am so glad I did. I spread a mixture of 8 oz cream cheese and 1/3 c powdered sugar, whipped together, on each tortilla, then doubled the cherry filliing (2 cans) and doubled the tortilla count to 10. I also added 1 t almond ex. to both the cherries and the syrup. Let sit in fridge for 5 hrs, covered with much more cinnamon/sugar and omitted the almonds. Baked for 40 mins. It was crispy and lovely on the outside and perfect on the inside. Top with real whipped cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hisdrinkoffering",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1524852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-09T03:52:22.06Z",
                "reviewBody": "I made this recipe using apple pie filling instead of the cherry. It was quite yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "C. Gray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1495741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-04T22:53:44.92Z",
                "reviewBody": "This recipe is awesome!!!  Totally better than cherry cobbler or a traditional cherry pie.  I doubled the cinnamon sugar mixture and baked for 40 minutes.  The tortillas were brown and crispy.  When I took it out of the oven I poured a thin cream cheese icing glaze on top.  We devoured it.  I will definitely make again.  I can hardly wait to try it with different fruit fillings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MADPAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/480685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-26T19:02:13.1Z",
                "reviewBody": "Made these for a friend for his birthday - he likes cherry pie. This was a great recipe to use for 10 people 6 of them kids! It was way easier than making pie. As past reviews have said they were soggy - mine were not AT ALL! I made them not overnight but 5 hours before baking. That may be the difference. They were crispy/chewy like a real pie could be and tasted just like it. I did a couple adjustments one of which I'm very surprised no one else has tried in their reviews that I think is a MUST! I had doubled this recipe for the crowd and I mixed 8 0z of cream cheese with a little (maybe 1/3 cup) powdered sugar. I then spread this on the tortilla before I put the filling on. THIS WAS DElICIOUS! For the filling I followed recommendations and added a little almond extract to the cherry pie filling and I also added one bag of frozen cherries to make them more like real pie and it was a good add-in. I put a little cinnamon (pumpkin pie mix) in too. I had some whole wheat tortillas that I used in half of the batch and they were great as well. I used fresh whipped cream on top and everyone gave rave reviews. I'm not a HUGE cherry pie fan but I will make these again and will try with different fillings. The Wilderness/Comstock brand of filling is preferred - more real tasting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1607923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-08T07:06:17.533Z",
                "reviewBody": "There are too many people with too many modifications for this to be a 4.5 star recipe. But it has great potential and that's what people seem to like. Leaving the recipe to soak in hot sugar water overnight is gross - the tortillas are soggy and there is no recovery from that. 5 tortillas in a 13x9\" pan makes no sense but 10\" tortillas won't fit in an 8\" square brownie pan. You also have no need for a whole stick of butter - half is more than enough. If this recipe had been for fajita-sized tortillas in a 8\" pan and the liquid has been less watery and half as much butter it would be a 4 star recipe for me. I had to change way too much to make this recipe worthy of the stars it has and that's disappointing. But I still recommend people try this - just follow the advise of others who have reviewed and learned through trial and error. I'll likely make this again with numerous modifications because it really is easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "moxie & mirth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3148162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-24T21:09:34.077Z",
                "reviewBody": "This recipe is awesome! I found that if you don't coat the entire enchilada with the sugar mixture they do tend to be soggy and chewy. Definitely have to soak them for a long time. I soaked the enchiladas for two days because life gets in the way. Thanks for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nora Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1404227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-06T17:31:50.733Z",
                "reviewBody": "I had made Shrimp and Crab Enchiladas the other night and had leftover flour tortillas. I was trying to figure out what to do with them when I came across this recipe. I did not have cherry filling but I had apple. I refrigerated for about 6 hours as I made them in the afternoon and wanted them for dessert. These were wonderful. My kids and husband raved and they could not be easier to put together. I did leave out the nuts because my kids don't like but kept everything else as written. This is such a versatile recipe that any pie filling can be used and the taste will be great. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lesley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/992643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-01T03:46:09.23Z",
                "reviewBody": "I've made this twice now and each it gets good reviews. I do make a few changes though: (1) double the pie filling, (2) add 1 tsp. of almond extract to the syrup, (3) add 1 tsp. almond extract to the pie filling, (4) refrigerate for only about 6 hours. It turns out great and its so easy to put together. i think it would be good with other pie filling/nut combinations. Thanks for posting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1633989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-06T19:28:42.983Z",
                "reviewBody": "Once I saw the recipe I just had to make it and they are easy to make. The only thing that I changed was that instead of cinnamon I used All-Spice with the sugar/almond topping. I also sprinkled a little in with the cherries before rolling the tortilla. All-Spice gives it a more flavorable topping with the cinnamon clove and nutmeg combined.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COLEE3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1063754/"
                }
            }
        ]
    }
]