[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/859/desserts/cookies/sugar-cookies/",
                    "name": "Sugar Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/241891/lofthouse-sugar-cookie-rip-off/",
        "name": "Lofthouse&reg; Sugar Cookie Rip-Off",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Lofthouse&reg; Sugar Cookie Rip-Off"
        },
        "datePublished": "2020-06-19T04:02:39.000Z",
        "description": "This recipe is similar to the sugar cookies purchased at bakeries.  Roll them no more than 1/4 inch for true lofthouse, thicker if you like a more cake-like cookie. These do not brown on the edges, but when cooled, you will notice the light golden brown underneath. This is a delicate flavor cookie, not sugary sweet. The sweetness will come from the icing that you choose to use; confectioners' sugar mixed with milk is your best bet.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H8M",
        "totalTime": "P0DT8H33M",
        "recipeYield": "3 dozen cookies",
        "recipeIngredient": [
            "2 cups white sugar",
            "1 cup butter, softened",
            "3 eggs",
            "1 ½ cups sour cream",
            "1 ½ teaspoons vanilla extract",
            "5 cups all-purpose flour, or more as needed",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat sugar and butter together with an electric mixer in a large bowl until smooth. Add eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat sour cream and vanilla extract with the last egg.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix 5 cups flour, baking soda, and baking powder together in a separate bowl; beat with the creamy mixture until just incorporated into a dough. Cover the bowl with plastic wrap and refrigerate 8 hours to overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C). Line baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough out onto a floured sheet of waxed paper on a flat work surface. Sprinkle flour on top of dough and put another sheet of waxed paper atop the dough. Roll dough out to 1/4- to 3/8-inch thick, using additional flour to keep dough from sticking and to get the best consistency for rolling. Cut rolled dough with cookie cutters into desired shapes and arrange onto prepared baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until set along the edges, about 8 minutes. Cool cookies on baking sheet for 10 minutes before moving to a wire rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sugar Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "COOKIELOVER2"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.5,
            "ratingCount": 2,
            "itemReviewed": "Lofthouse&reg; Sugar Cookie Rip-Off",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "178.5 calories",
            "carbohydrateContent": "24.9 g",
            "cholesterolContent": "33.3 mg",
            "fatContent": "7.7 g",
            "fiberContent": "0.5 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "4.6 g",
            "servingSize": null,
            "sodiumContent": "96.1 mg",
            "sugarContent": "11.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-04-05T03:24:52.19Z",
                "reviewBody": "I am really not sure how to rate this one. I have never had a Lofthouse cookie thus anything to compare it to. These turned out like slightly sweet biscuits. I read the intro to the recipe that said the sweetness comes from the icing or topping made for these. I am not big on frosting so I made a lemon whipped cream topping. If it wasn't for that topping I am not sure how well these would have went over. I made 1/3 of the recipe and got 30 cookies with a cookie scoop. I was looking for a simple dessert recipe for Easter without a lot of fuss. That worked fine for this. I just flattened the balls to make roundish shapes. I may have to try a Lofthouse cookie at the store to see if this really is supposed to be like little mini sweet like biscuits. I would love to see how others fare with this recipe or what they use as a topping or sweetener.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-06T19:43:20.03Z",
                "reviewBody": "The cookies are delicious and look fantastic. All you need is a good frosting recipe. It's very difficult to work with the dough. You definitely have to chill it overnight. I placed a few cups of the dough on Saran Wrap and rolled it so that it looked like the refrigerator cookie dough tubes you buy at the store. I thought that would make it easier to work with the dough the next day. I won't bother with that next time. The dough was still very sticky and wet. I placed the cookie dough on a well floured surface and then made sure that I had flour on my rolling pin and hands. Just lightly roll it out and dip your cookie cutter in flour and place on the pan. These rise a lot but they don't spread much if cut with a cookie cutter. I rolled them 1/4 inch and they fluffed up like the store cookies. If these cookies did not taste fantastic and look amazing I would never make this sticky gloppy annoying dough recipe again! The key is patience flour to dust the surface lightly roll the dough & just work with a little bit at a time; keep the extra dough in the fridge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Winnie Caskey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12222976/"
                }
            }
        ]
    }
]