[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15057/desserts/cookies/butter-cookies/",
                    "name": "Butter Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/855/desserts/cookies/butter-cookies/shortbread-cookies/",
                    "name": "Shortbread Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/95697/lavender-shortbread-cookies/",
        "name": "Lavender Shortbread Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4473151.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:13:15.000Z",
        "description": "A buttery lavender-flavored dough that can be made into round shapes using a biscuit cutter, or various shapes using cookie cutters. You can also roll the dough into a log, chill, and then slice and bake.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "2 dozen cookies",
        "recipeIngredient": [
            "1 ½ cups butter, softened",
            "⅔ cup white sugar",
            "¼ cup sifted confectioners' sugar",
            "2 tablespoons finely chopped fresh lavender",
            "1 tablespoon chopped fresh mint leaves",
            "1 teaspoon grated lemon zest",
            "2 ½ cups all-purpose flour",
            "½ cup cornstarch",
            "¼ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the butter, white sugar and confectioners' sugar until light and fluffy. Mix in the lavender, mint and lemon zest. Combine the flour, cornstarch and salt; mix into the batter until well blended. Divide dough into two balls, wrap in plastic wrap and flatten to about 1inch thick. Refrigerate until firm, about 1hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). On a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into shapes with cookie cutters. Cookie stamps will work well on these too. Place on cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 18 to 20 minutes in the preheated oven, just until cookies begin to brown at the edges. Cool for a few minutes on the baking sheets then transfer to wire racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Butter Cookie Recipes",
            "Shortbread Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Maryeileen Corcoran"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 106,
            "itemReviewed": "Lavender Shortbread Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "186.1 calories",
            "carbohydrateContent": "19.3 g",
            "cholesterolContent": "30.5 mg",
            "fatContent": "11.6 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "7.3 g",
            "servingSize": null,
            "sodiumContent": "106.6 mg",
            "sugarContent": "6.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-20T16:22:51.843Z",
                "reviewBody": "Sure, fresh lavender is better, but sometimes dried is all you have. If so, and if you also have a food processor, run the dried lavender blossoms around in the processor, using a normal blade. Pause every few seconds and see how it's doing.  What you're trying to do with this is separate the dried outer purple flowers from the tough seedy structures inside them. If it looks like that's happening, turn out the lavender into a wire mesh strainer and shake and toss it over a bowl. Most of the tough inner seedy bits should fall through, leaving the more desirable purple flowers.  Naturally, you'll have to re-measure your separated lavender blossoms to get the right quantity for your cookies.  The deprecated interior bits of the flowers still smell wonderfully of lavender. Keep those plus the leftover snipped mint and grated lemon rind -- I like to spread it on a plate to dry. When you feel like having a luxurious soak, put the leftover flavorings in a big tea ball and run your bathwater hot at first to get it steeping.  As for the cookies? They're very good.   I think I may try softening the butter, beating in aromatic herbs, and leaving the mixture to sit for a while in a sealed container in the refrigerator. I suspect the flavor of the herbs would migrate into the butter. After letting this happen, I'd soften the butter again and press it through a strainer, then just use the flavored butter. It would be interesting to have herb-flavored cookies with no visible herbs in them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "TNH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3479837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-14T06:07:06.2Z",
                "reviewBody": "Interesting flavor!  I used \"culinary lavender\" (dried lavender flowers) from an area lavender farm.  I wanted more of a subtle, evenly distributed mint flavor, so instead of chopping up mint leaves I used a few drops of mint extract.  I used the tip from a previous reviewer and rolled the dough into two logs in wax paper, refrigerated, and then simply sliced 1/4\" thick rounds to put onto the cookie sheet.  I found this yielded 50 cookies, and they are plenty rich! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "doestreich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1187720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-15T19:45:08.943Z",
                "reviewBody": "This was a quick, easy, and delicious shortbread recipe!  I did change a few things in the recipe; I didn't add any mint, I substituted dried lavender for fresh, and I added about a teaspoon of extra lemon zest.  I rolled the dough into a log, wrapped it in wax paper, and let it cool in the fridge for about an hour before using dental floss to cut each cookie.  The finished product was rich and lemony with just a little hint of lavender every now and then.  I will definitely make these again, next time I'll probably add even more lemon zest and try another type of flower or herb (maybe violet).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDYHELLO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1301661/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-06T21:51:31.793Z",
                "reviewBody": "Nice flavor. Nice texture. I did not put in the mint because I wanted a true lavender flavor to the cookie. I formed into logs, chilled overnight, and then sliced into 1/4 inch thick rounds. Cooked for 18 minutes. Not as pretty but alot faster and easier. These spread out quite a bit, not sure if they would hold the desired shape of a cookie cutter. I tried to roll mine in purple sugar like the picture. Mine came out an ugly brown because the edges started to brown.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CRAZY4SUSHI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1183678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-14T16:50:04.243Z",
                "reviewBody": "Cookies are crisp, but melt in your mouth.  Probably all that butter....  I didn't have fresh mint or lavender, so I used 1/2 T. dried lavender and 1 teaspoon dried peppermint.  Otherwise, I followed the recipe as written.  DELICIOUS with a strong British tea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WILLOWRUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1311483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-15T19:02:19.843Z",
                "reviewBody": "These are very interesting/different cookie. A nice change from the ordinary and what a really unique taste. I didn't have access to any fresh mint or lavender so i used dry. These would be awesome with some Earl Grey tea but i enjoyed them with my coke zero nontheless. I think these would be really nice for a baby shower...i brought them to work and got some mixed respnses but personally i thought they were really good. the only thing i'd do differently next time is to add more lemon zest ( i love lemon) and scale back on the mint. I followed the suggestion of another poster who said to roll them into 2 separat logs and then cut with a knife that made prep time really quick and nice uniform cookies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lulu4014",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1742465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-07T20:23:00.693Z",
                "reviewBody": "Loved this recipe!  Made this for a get together and they were a huge hit!  Only had 3 fresh flowers in my garden so I used those and 1 T of dried blossoms. Followed the recipe as is - no spreading of cookies.  Chilled dough in 2 logs for an hour + and sliced them.  MMMMMMMM! House smelled SO yummy!  Will definitely make again - may even enter them in the county fair since they are so different.  Not a dense shortbread, but one that almost melts in your mouth, very light and crisp!  THANK YOU for the recipe!  Oh, I did keep an eye on them and they were ready within about 12 - 15 minutes.  I may have sliced them thinner.  Just make sure you pull them out when the edges begin to color and they'll be perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "clovis country",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5322858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-31T19:16:37.41Z",
                "reviewBody": "Initially I was a little weary of trying these cookies-lavender and mint sounded more like a soap than a cookie. However I love shortbread and and decided to give it a try. I used fresh lavender and mint from my garden. Instead of rolling the dough with a pin and then cutting I rolled these into two seperate logs wrapped and refridgerated and then using a knife cut them 1/4 thick (this cut way down on prep time). My boyfriend thought that I should rate them a 3 but I liked them and will compromise and give them a 4.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2341837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-22T17:29:40.96Z",
                "reviewBody": "Oh my goodness where do I start with these cookies they really are so delicious. Firstly it was my first time to ever cook with Lavender (I have looked at several recipes for months but only today finally plucked up the courage to try it). I used Dried French Lavender that I brought from Penzey s. I didn t have fresh mint so substituted for teaspoon of dried mint that I crushed down and teaspoon of mint extract. I followed the recipe exactly and baked on a silpat mat. I cut the cookies and then placed the baking sheet back in to the fridge for a further 10 minutes. I topped with Silver sugar and baked in the oven for 16 minutes. The key to good Shortbread is not to roll the dough too thin and also do not overcook once cooled they will become crisp on their own. I had no problem at all with the cookies spreading. They came out of the oven perfect and the fragrance in the house was heavenly",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheBritishBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/apple-strudel/"
                }
            }
        ]
    }
]