[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/213/salad/green-salads/",
                    "name": "Green Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/97389/eat-michigan-salad/",
        "name": "Eat Michigan Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4435349.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-06-19T03:13:17.000Z",
        "description": "I live in Buckeye country, that's the land of Ohio State University football to the rest of you. We love to tailgate and watch the Bowl games, and are always trying to come up with clever things to do to our biggest rivals up north, the Michigan Wolverines. The cherries and maple in this wonderful salad inspired the name. Enjoy!",
        "prepTime": "P0DT0H30M",
        "cookTime": null,
        "totalTime": "P0DT0H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "½ cup mayonnaise",
            "⅓ cup pure maple syrup",
            "¼ cup white wine vinegar",
            "1 teaspoon white sugar",
            "½ cup vegetable oil",
            "salt and pepper to taste",
            "3 heads butter lettuce - rinsed, and torn",
            "½ cup  dried cherries",
            "2 Granny Smith apples, cored and cut into matchsticks",
            "4 ounces goat cheese, crumbled",
            "3 ounces chopped candied pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In the container of a blender, combine the mayonnaise, maple syrup, vinegar, and sugar. Cover and blend on low speed. Gradually pour in the vegetable oil while mixing until fully incorporated. Taste and season accordingly with salt and pepper. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large serving bowl, combine the lettuce, cherries, apples, goat cheese and candied pecans. Toss with just enough of the dressing to coat, then serve with the remaining dressing on the side.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Green Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Saveur"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.888888888888889,
            "ratingCount": 81,
            "itemReviewed": "Eat Michigan Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "275.5 calories",
            "carbohydrateContent": "17.3 g",
            "cholesterolContent": "10.9 mg",
            "fatContent": "21.1 g",
            "fiberContent": "2.1 g",
            "proteinContent": "5.6 g",
            "saturatedFatContent": "4.8 g",
            "servingSize": null,
            "sodiumContent": "140.5 mg",
            "sugarContent": "12.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2016-10-15T19:44:22.37Z",
                "reviewBody": "Hi everyone! Wow am I surprised to see this! Sent in 2005. Anyway hope you enjoy. I use 3 bags of butter lettuce the prepared prewashed type. Make the dressing the night before if you can. I have subbed swiss cheese sliced into matchsticks for a friend who doesn't like goat cheese and it is delicious too. And this is a great salad for the holidays too! Go Buckeyes! Beat (and eat) Michigan!! Saveur",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Saveur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-23T19:01:43.01Z",
                "reviewBody": "I LOVE this salad!!! I've made it many times and always forget to review it... I ususally use feta and slivered almonds. I've subbed craisins for the dried cherries and it's still good, but the dried cherries are sooo much better- they add a nice tartness that's very complimentary to the dressing. Fresh strawberries might be good too. Sometimes I've also added a bit of yellow mustard and onion powder to the dressing and that's quite good as well. I've found the dressing is better when run through the food processor a minute- it really gives it a much smoother consistency- I've tried to cheat and skip this step, but it's kinda clumpy even if you whisk it good... still tastes good though! And like the submitter says in their review, it is better if made the night before, or even that morning. I use whatever salad veg I have on hand at the time. Make sure you use a good crisp apple like a honeycrisp, braeburn or fiji, cause that is really the star of this salad.  I've also added chunked up chicken breast to make this a main dish salad and that is wondewrful as well. To sum it up, this recipe is filed in my recipe book under 'Best Salad Ever'!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Starlet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3055025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-18T21:11:07.64Z",
                "reviewBody": "I've never written a review before but have used hundreds of allrecipes recipes.  I feel I have to review this one.  I was looking for something OTHER than a salad with strawberries (only because I'm tired of them.)  I tried this last night and it was a HUGE hit!  Believe me, the ladies that I served it to have eaten and prepared every type of salad and they raved about this one.  So much so that I had to get on the computer and print out 20 copies!  The only changes I made was to mix the butter lettuce with romaine (all butter tends to get too soggy) and I had cheese on the side.  I love all cheeses but some people are too picky so I had 3 bowls sitting by the salad bowl (buffet-style) one with goat cheese, one feta and one blue cheese.  It worked perfectly.  Also, I bought the pecans already candied (Emeralds \"Pecan Pie\" pecans - to die for).  So, for my first review I got too wordy... bottome line is WONDERFUL salad!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catglo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1259404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-07T21:59:12.537Z",
                "reviewBody": "I made this salad for the MI vs MI State Game 11/07. It was a huge hit! I tweaked it due to time constaints and used olive oil and wine vinegar..threw everything in and bought a sm. bag of already sliced apples and wa-la.. Dressing was made quickly the nite before. Now I have to pass it on. And make it for thanksgiving!..It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cppasta",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2590740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-27T19:11:03.467Z",
                "reviewBody": "I made this salad as one of the dished for my best friends baby shower....it was a hit! Since then I have made it for two other dinner parties and have gotten rave reviews. I use the \"sugar coated pecans\" recipe from this site and they are outstanding! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "addictedtoallrecipies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2566498/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-18T13:57:32.367Z",
                "reviewBody": "The only thing I did differently was to use a bag of 1/2 spinach 1/2 field greens. Made for a shower and everyone loved it. I rarely follow the recipes on this site 100% and rarely give 5 stars but this deserves it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1597004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-26T22:51:25.803Z",
                "reviewBody": "Easy tasted great as long as you don't mind a bit of sweetness. I used romaine as well as butter and it lasted longer with dressing on it. I only needed 1/2 recipe of dressing to serve a big salad for 10.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2232144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-29T02:50:43.517Z",
                "reviewBody": "So I used to live in MI and now am back in WA. My family ALWAYS asks me to bring the salad for the holiday meals so I always look at Allrecipes.com to find something different and yummy. This was it this year! As a matter of fact my large family pronounced this the permanent Christmas salad. They all loved it! Thanks for being rivals with the Wolverines Saveur631 or I probably wouldn't have looked twice at a \"Buckeye Salad\"!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly Boone-Jones",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1892003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-28T17:53:58.923Z",
                "reviewBody": "Perfect fall salad. Makes lots more dressing than you need for the salad. I left out the teaspoon of sugar and it was still plenty sweet. Go Michigan State-beat Ohio State and Michigan! Made this as a salad in a mason jar for a friend recovering from surgery. Put the dressing in the bottom then added the apples cherries pecans and goat cheese. Filled to the top with romaine lettuce. Screw on the lid. It kept very well in the fridge for about 5 days. I did put lemon juice over the apples before putting them in the jar. When you are ready to eat it just shake it up and eat out of the jar or pour onto a plate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PEACHYCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1432986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-15T18:50:37.327Z",
                "reviewBody": "Tried this salad because it looked wonderfully delicious and different. Couldn't even imagine the taste of the blend. Tried it and liked everything except the maple syrup. I was disappointed that I had tossed it into the whole salad. Other than that the fruit nut cheese combo blend was yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanya Forest",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5522100/"
                }
            }
        ]
    }
]