[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/235/world-cuisine/middle-eastern/",
                    "name": "Middle Eastern",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15937/world-cuisine/middle-eastern/persian/",
                    "name": "Persian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/103170/the-rebbetzin-chefs-persian-walnut-cookies/",
        "name": "The Rebbetzin Chef's Persian Walnut Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F106163.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:13:28.000Z",
        "description": "These delicately-spiced, rose-scented cookies are the perfect treat for Passover since they contain no flour. They are nutty and rich, slightly chewy with a crunchy exterior. Pistachios or almonds can be substituted for the walnuts.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "36 cookies",
        "recipeIngredient": [
            "1 ½ cups finely ground walnuts",
            "3 egg yolks",
            "¾ cup white sugar",
            "1 tablespoon ground cardamom",
            "1 teaspoon baking soda",
            "1 tablespoon rose water",
            "1 egg yolk",
            "1 teaspoon water",
            "½ cup walnut pieces for decoration"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the ground walnuts, 3 egg yolks, sugar, cardamom, baking soda and rose water until well blended. Roll teaspoon sized pieces of dough into balls and place onto parchment-lined baking sheets. Cookies should be spaced 2 inches apart. Whisk together the remaining egg yolk and water using a fork. Press a walnut piece into each cookie, then brush with the egg yolk glaze.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven, or until golden. The cookies will appear soft and undercooked but take heart, they will harden considerably when cooled. Allow them to cool on the baking sheets for at least 10 minutes before transferring to a wire rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Middle Eastern",
            "Persian"
        ],
        "recipeCuisine": [
            "Middle Eastern",
            "Persian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "The Rebbetzin Chef"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.225806451612903,
            "ratingCount": 31,
            "itemReviewed": "The Rebbetzin Chef's Persian Walnut Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "66.1 calories",
            "carbohydrateContent": "5.3 g",
            "cholesterolContent": "22.8 mg",
            "fatContent": "4.8 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.3 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "36 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-06T02:29:19.2Z",
                "reviewBody": "Yummy! And SUPER easy to slap together - I mixed it all up in under a minute. Wear latex gloves while rolling the balls as the mixture can be a tad sticky. I tried them with both walnuts and almonds... the walnut ones were richer and chewier while the almond ones turned out crunchier and a bit lighter. I prefer the walnut version. They were baking in the oven when my husband came home and he commented that they made the house smell heavenly. This will definitely be a staple for when I have guests - they're so fancy and gourmet-tasting with so little effort on my part!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JuneCleaver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1846936/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T19:13:08.58Z",
                "reviewBody": "Delicious and easy! I don't get why people complain/give a bad review when they don't follow directions. Perhaps the \"metallic\" taste wannabaker complained about was due to using foil on the sheets instead of parchment as instructed. Easy cookies very rich flavour and they looked pretty. This was the first time I was asked for a cookie recipe. Thank you for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sarahxbee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2188473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-30T19:56:03.573Z",
                "reviewBody": "I made a colassal mess of my kitchen. This recipe looked so simple and good. Cookie bakers heed my experience... I ground too many walnuts so I added extra liquids - I must have added too much because when I took my cookies out of the oven there was one big cookie burnt on to my pan. So after playing with it a bit I found: heat the oven to 300 degrees; add extra nuts at least 1/2 a cup and no extra liquids. You MUST line the pan with partchment or at least tin-foil! - I thought I could get away with just greasing the pan as with so many other recipies. And finaly cook for only 15 to 18 minutes. Whew! Pretty good cookie after I cleaned up the mess and corrected my mistakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETNOTHINGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-01T18:46:07.56Z",
                "reviewBody": "These cookies were a huge hit with my Persian family. They were gone in a matter of minutes! A few tips: My first batched burned very quickly. Start checking on them after 10 minutes. The cookies flattened out a lot. They were very thin so the two inch spacing between cookies is very important. Also I only used 1 tsp cardamom and it was perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sage75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5806689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-28T03:31:30.447Z",
                "reviewBody": "This is a excellent recipe and I disagree with the others who complained that the egg mixture is too runny or that there is not enough egg for walnut mixture. The trick is to beat the egg yolks on medium/high for 5 minutes until it is light and yellow and gradually add sugar. Then you have a nice white/sugar paste. Then I mix in the almonds. I use a kitchenaid mixture for all this mixing. I didn't have any problem rolling them into small little teaspoon size balls using my hand. A standard cookie sheet will fit 18 little dough balls. My mom is persian and she said these reminded her of the same cookies she had when she was a child. I used only 2 tsp of cardamom and omitted the rose water. Despite many persian recipes using rose water the authentic recipe does not call for it. I added 1 tsp of vanilla instead and the taste was perfect. I also think the baking time is too high and this will burn your cookies. I baked mine at 300 degrees for 20 minutes middle rack. Perfect to dip in tasty persian black tea!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "averymd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9838957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-21T18:26:22.617Z",
                "reviewBody": "I've made this recipe on several occasions. When the cookies turn out well they are scrumptious and are easily gone in two days. We refer to them as walnut lace cookies because they are light have a little crunch and are flavorful. But as other reviewers have mentioned I've have had my share of problems with this recipe. Three egg yolks usually aren't enough to make the batter stick (it hardly clumps together!) So I either add another egg yolk (making 4 in total) or 2 egg yolks and one whole egg. I also have major issues with the term \"finely ground walnuts.\" One time I pulsed whole walnuts in a food processor to create finely ground nuts; I ended up with one big runny cookie. Another time I lightly pounded whole walnuts in a plastic bag with a skillet; the end result was a slightly less runny cookie. So I now used chopped walnut pieces. My cookies aren't as smooth as the ones shown in the photograph but at least they are individual cookies. Also I think using a silpat pad works better than the parchment paper. As the recipe suggests do leave space between cookies because they spread and 20 minutes is indeed sufficient cooking time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "m0wlp42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2794751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-06T02:19:24.593Z",
                "reviewBody": "These were incredible. I made a double batch - one for a hostess gift and one to stash in my freezer. The family I gave them to LOVED them and requested the recipe. I ended up raiding my own freezer for them the next day - my husband and I ate the whole batch in one sitting! I'll definitely be making them this year for Passover. Thanks for the awesome recipe!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jellybelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1846927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-26T21:44:17.157Z",
                "reviewBody": "These were quite tasty. I really can't say anything on the authenticity of them but they were light and slightly crisp. Good flavor and they grow a good amount while baking (don't put these on the bottom rack though!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2285243/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T19:15:03.277Z",
                "reviewBody": "These cookies were very tasty and delicious. Very easy to make. I also made them with almonds & almond poweder using the same recipe. I will make theses again. Next time I will try pistachio. Everyone loved these cookies.Thank you for sharing a lovely recipe. 5 stars for easy 5 stars for delicious",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bellagatta",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4030027/"
                }
            }
        ]
    }
]