[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/254217/impossible-cake/",
        "name": "Impossible Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4614499.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T04:16:16.000Z",
        "description": "This cake has a reputation! A sweet and tempting caramel is drizzled into a greased Bundt&reg; pan, followed by a gorgeous smooth mixture for a moist and rich chocolate cake and a layer of flan. Serve topped with more melted cajeta if you wish.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H1M",
        "totalTime": "P0DT2H26M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "¼ cup cajeta, sweetened caramelized goat's milk syrup",
            "1 ½ cups all-purpose flour",
            "6 tablespoons unsweetened cocoa powder",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "½ cup butter, softened",
            "2 ½ tablespoons butter, softened",
            "1 cup white sugar",
            "1 egg",
            "2 tablespoons strong brewed coffee",
            "1 cup whole milk",
            "2 ½ cups evaporated milk",
            "1 (14 ounce) can sweetened condensed milk",
            "4 eggs",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease the base and sides of a 10-inch fluted tube pan. Dust lightly with flour; tap to remove excess.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a shallow baking pan with enough water to come 1/3 of the way up the sides of the tube pan. Place water bath in the oven to warm up while it is preheating.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour caramel sauce into a microwave-safe bowl. Microwave until warm and pourable, about 1 minute. Pour into the prepared tube pan, covering the base completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix flour, cocoa powder, baking soda, and baking powder together in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat 1/2 cup plus 2 1/2 tablespoons butter in a bowl with an electric mixer until smooth. Add sugar; beat until light and fluffy. Beat in 1 egg and coffee. Alternate adding flour mixture and milk, mixing well between additions. Pour cake batter evenly over caramel in the tube pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine evaporated milk, condensed milk, 4 eggs, and vanilla extract in the bowl of a food processor; blend until smooth. Pour over cake batter through a fine sieve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the water bath in the preheated oven until a toothpick inserted into the chocolate cake comes out clean, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let cake cool, about 1 hour. Carefully run a thin knife around the edges to loosen the cake, cover with a serving plate, and flip onto the plate.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "gem"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.472222222222222,
            "ratingCount": 108,
            "itemReviewed": "Impossible Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "458.8 calories",
            "carbohydrateContent": "59.4 g",
            "cholesterolContent": "132.6 mg",
            "fatContent": "20.3 g",
            "fiberContent": "1.3 g",
            "proteinContent": "12.1 g",
            "saturatedFatContent": "12 g",
            "servingSize": null,
            "sodiumContent": "364.3 mg",
            "sugarContent": "40.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2017-02-24T12:14:05.063Z",
                "reviewBody": "This recipe was so simple.  I made my own caramel sauce and made it in a very decorative bundt pan.  It came out easily and beautifully.  I've even made it in a hurry using a cake mix and it was wonderful. The cake was moist but dense.  A keeper!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10203127/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-15T12:23:00.247Z",
                "reviewBody": "This is a Mexican ChocoFlan .  I make it all the time...so very delicious.  The chocolate cake soaks up the milky creaminess and makes it heavenly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nantli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20869691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-05-03T22:48:15.753Z",
                "reviewBody": "This is a delicious cake. I  made it yesterday and the recipe was fantastic.  The measurement of the  ingredients and cooking times were spot on.  I used  Ghirardelli caramel sauce that didn't need to be microwaved.  This is quite possibly be my favorite cake recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Penny Breland de Vries",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1081916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-26T17:04:29.817Z",
                "reviewBody": "I tried this recipe partly out of curiosity and partly because I wanted a Mexican-inspired dessert to go with Chef John's recipe for Pork Chili Verde.\n\nThe taste of the chocolate cake batter is very smooth and pleasant.  I would enjoy itself.\n\nI've never been a fan of flan, although a friend from the Philippines cooked some homemade flan that I enjoyed.  I'm amazed at how the flan batter sinks to the bottom of the pan and sets.  The flan layer possessed a nice, creamy sweetness that worked well with the chocolate layer.\n\nI could not find cajeta.  I attempted to make dry caramel, but it ended up being more of a Chernobyl experience.  I then made the wet caramel, but could not get enough out of the sauce pan before it hardened.  As a result, I felt like my cake needed twice the caramel I ended up with to equal what the recipe asked for.  A stronger caramel taste would have added a nice complexity to the taste.  A darker, amber caramel with a slight bitter flavor would balance the sweetness of the other two layers.\n\nThose who tasted the cake raved about it.  The response was more enthusiastic than anticipated.  \n\nOverall, it's a delicious cake that's easy to make, although people will assume it's much more difficult because of the flan layer.  Let them believe what they wish and take the compliments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jefblocker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12214158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-05-15T02:47:18.947Z",
                "reviewBody": "This looks & sounds delicious from watching the video. I won't rate it until I actually make it. BUT, my comment is about the breaking of eggs directly into your batter & the blender... Obviously you have never had the unfortunate experience to break a rotten egg, or worse, one with a partially developed baby chicken, into your work in progress! Both of these have happened to me from eggs purchased from well known grocery stores & aside from nearly barfing over it, also ruined the ingredients that I had already started preparing. Even if the least reason for breaking into another container first, just to prevent shells from possibly ending up in your mixture, it is worth using a measuring cup or other container for your eggs. Also, if you use a narrow edge of a bowl or skillet for cracking your eggs, you are more likely to cause bits of shell to end up in with your egg. Instead, crack them on a flat surface, then break them open with your thumbs. Learned these tips many years ago in my home economics class but it took those 2 awful experiences to drill into me about using a separate container for the egg before adding to the mix! Can't wait to try this cake!!! Well, dang it, I can't post without a rating so I'm giving it 5...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gusmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15291016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-28T00:56:50.283Z",
                "reviewBody": "Yum! I was  so happy to find and try this recipe.  I had made this before once in Mexico,  with a boxed cake mix, and it came out great, but I've since become sort of a baking purist and I like to make things from scratch.  So I tried making it with the Hershey's cocoa cake recipe, and  perhaps because that is such a runny batter, the pastel imposible didn't  come out right at all - the cake and the flan just mixed up and baked that way.  But now  this! I tried this recipe yesterday and it turned out perfectly!  I  followed it almost exactly -  the only change being  that  I used my own flan recipe, which has  6 eggs instead of 4, and a little  bit less evaporated milk.  It worked wonderfully.  Thank you! Such an impressive cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PattiVerde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/408119/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-06T14:50:51.363Z",
                "reviewBody": "I've made this twice now, the first time I made it like the recipe except I used salted caramel it was great . The second time I switched up I made it coconut. I used salted caramel and white cake with coconut extract , for the cream mixture I used coconut milk instead of evaporated milk and added more coconut extract for flavor and sprinkled toasted coconut on top",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzyblue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13227278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-25T21:09:13.783Z",
                "reviewBody": "My bundt pan is obviously not the same as the recipe's submitter. It is a 9\" pan but it curves in at the bottom so it must hold less... The recipe as written made way too much to fit my pan. My cans of condensed milk were not 14-oz so it took 1.5 cans. I could tell after I put the cake batter in that it would overflow if I added all the flan mixture, SO, I spread some caramel in a 9\" loaf pan and scooped out some of the chocolate cake mix into there, then divided the flan mix between the 2 pans. I used the loaf pan as my \"tester\" this afternoon before I served the real deal to my dinner guests tonight. Baked at 325 in a convection oven in water bath. Loaf pan was done at 40-min; Bundt took 55-min. I put this in the fridge all day so it solidified. It tasted best cold. This was a very tasty, unique dessert. I used Smucker's non-microwavable caramel syrup, and drizzled individual pieces with extra syrup when I served them. My son didn't care for this, but everyone else did. Yum!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danielle Harshenin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/canadianmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-07-21T10:10:44.513Z",
                "reviewBody": "D-licious!  This was a really intriguing cake to make.  took a little step-by-step planning and turned out FANTASTIC!  I highly recommended it.  All guests loved it.  I will make it again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adnil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5450815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-05-23T01:40:06.443Z",
                "reviewBody": "Sorry but this did not turn out as I hoped. I'm a fairly experienced cook and baker. It seems the bundt pan I used may have been too deep making the cake thicker to the point it was not cooked long enough ( though it was an hour and the toothpick came out clean.) After taking the cake out of the pan (cooled for 45 minutes - too soon??) it began to fall into the center. So it looked bad and the flavor just wasn't great. Overall not worth all the time it took - thus the name - 'impossible'! Sorry I love to find great new recipes and give people good feedback - but not this time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "KJinOC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4737384/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Impossible Cake",
            "description": "Impossible? No—impossibly delicious!",
            "uploadDate": "2016-10-14T19:19:01.605Z",
            "duration": "PT2M28.607S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0dbd570f-b3d3-4c0f-a273-c4d6fb132eec%2Feeb522ab-02a9-4092-bb23-67e7e7bd1f03%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5170673697001"
        }
    }
]