[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/345/bread/yeast-bread/flat-bread/",
                    "name": "Flat Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/105053/garlic-cheese-flatbread/",
        "name": "Garlic Cheese Flatbread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565546.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:13:35.000Z",
        "description": "Golden brown, chewy and cheesy, this recipe is a hit with Italian dishes.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 (.25 ounce) envelope active dry yeast",
            "1 cup lukewarm water",
            "2 cups bread flour",
            "1 teaspoon salt",
            "2 teaspoons white sugar",
            "2 tablespoons olive oil",
            "⅓ cup butter or margarine, softened",
            "2 tablespoons garlic powder",
            "¼ cup grated Parmesan cheese",
            "⅓ cup shredded mozzarella cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a cup or small bowl, sprinkle yeast over the surface of the lukewarm water. Let stand for 5 to 10 minutes to dissolve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, salt and sugar. Pour in the yeast mixture along with the olive oil. Beat with a sturdy spoon until  dough is stiff enough to pull away from the sides of the bowl. Cover, and set aside until doubled in size, about 35 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the dough from the bowl and knead briefly on a floured surface. Roll the dough out to 1/4 to 1/2 inch thickness or to the size of your baking sheet. Place on a greased baking sheet and spread butter over the top. Sprinkle with garlic powder, Parmesan cheese and mozzarella cheese. Let rest while you preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven, until golden brown and cheese is bubbly. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Flat Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Gina Izzy Shores"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5963302752293576,
            "ratingCount": 109,
            "itemReviewed": "Garlic Cheese Flatbread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "107.1 calories",
            "carbohydrateContent": "2.5 g",
            "cholesterolContent": "20.4 mg",
            "fatContent": "10.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "2.3 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "330.9 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-05T15:04:12.597Z",
                "reviewBody": "For me this recipe is a very good starting point and has proved to be very versatile. It has become almost a show stealer from the main course. Took the advice of several other reviewers and added about a tsp of garlic powder to the dough. Dough was a little sticky and I did add about an additional 1/2 of flour overall to keep it manageable. Also greased pan with olive oil and then sprinkled some cornmeal to keep it from sticking and poked holes in dough. Changed butter spread to 1/2 olive oil 1/2 butter 1/2 tsp oregano and a clove of garlic and spread on the dough. Then from BATMAN BEYOND's review of Parmesian Foccacia Bread (a bread machine recipe) which suggested chopping a fresh tomato - I used two small ones and some fresh basil as well - and saute in just a little olive oil with some fresh garlic salt. Then sprinkled the tomato mixture over the butter/olive oil spread on the dough. Lastly sprinkle on the parmesian cheese and bake. I used the same temp but it took about 10 minutes longer to bake and set up in the middle. So good! This was gone in absolutely no time and my kids beg me everyday to make it...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Toasty Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2223426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-21T23:36:13.683Z",
                "reviewBody": "Bread came out great the first time. My husband loved it too. I combined steps 1 and 2 by mixing the yeast flour salt and sugar with HOT tap water then mixing in the olive oil. I covered it and let stand until doubled in size. The final product was very nice with a nice texture. I will make this again. My husband thinks this will make a great pizza dough too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2126350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-28T08:45:05.663Z",
                "reviewBody": "4 stars for a great flat bread but I felt this recipe needed more flavor.  I made it twice.  Both times the dough came out perfect.  Someone mentioned that this dough should be a \"wet\" dough and sticky and not to add more flour.  That advice was perfect.  I just made sure I had enough flour to roll with and on my hands so it wasn't to hard to work with.  \nThe first time I made it I put in 2 cloves of crushed garlic in the dough while kneeding it instead of using the powder and it wasn't enough. It was still a nice flat bread.  The 2nd time I added 4 cloves and used about 1tbs of garlic powder and it was more flavorful  I also left the cheese off until it was about a minute from being done and I brushed it with butter and then put on the cheese and cooked one minute and took it out of oven and let it melt while it rested.  I liked it much better that way, then what the original recipe calls for.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "love2eat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2447070/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-07T21:01:37.827Z",
                "reviewBody": "Love this stuff! We enjoy great pizza with it. I add freshly minced garlic (2 cloves) and 1/2 teaspoon of Italian seasoning to it when I am mixing it up.  Once it has risen, I roll it out, place it on a large pizza pan and bake it for 5 minutes at 350 degrees.  Then I top it with pizza sauce, cheese, and toppings.  Back in the oven for 25 or 30 minutes or until lightly browned.  Some of the BEST pizza we have had.  YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda B. II",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2294527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-09T14:07:11.077Z",
                "reviewBody": "Very good! I started the dough in my bread machine and while it came together perfectly once it was removed it was extremely sticky and difficult to work with. I had to knead in a TON more flour to be able to work with it. While I was kneading in the flour I also added some minced garlic and italian seasoning to the dough. Other than that I followed the recipe. These were very good! I cut them into strips to serve like breadsticks and had marinara for dipping. We'll have these again for sure!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "caliboo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/384956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-04T00:27:29.73Z",
                "reviewBody": "I've made this twice, once with the recipe as written (great), and once substituting the garlic powder for 3 tbsp. or so of minced garlic (even better).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2233783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-26T04:46:56.45Z",
                "reviewBody": "(Originally reviewed 25 March 2008 -edited for spelling) I did not have any bread flour, so I simply used 2 cups plain flour and added in 4tsp of vital wheat gluten.  In reading the reviews, alot of people noted that the dough was sticky and that they added in extra flour, perhaps they are not aware, but this type of dough is considered a \"Batter yeast dough\" - this means it will be sticky, and you should NOT add any extra flour, except for perhaps a small sprinkling of flour for the area in which you end up kneading the dough. I don't even bother to knead it. I let mine proof in a glass bowl, once it has risen I invert the bowl onto a parchment lined baking sheet and lift the bowl away. \nInstead of plain butter, I used a butter that already had garlic & herbs mixed into it, and then I used fresh grated parmesan, and a 6 italian cheese blend plus additional mozzarella cheese.  I also added some garlic powder and italian seasoning into the yeast dough.  This is\ncomparable to a focaccia I normally buy at a local delicatessen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thedailygourmet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thedailygourmet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-26T02:14:14.193Z",
                "reviewBody": "Really liked the texture of this flatbread! I didn't use all the butter the recipe called for on top- made a garlic/butter sauce for dipping instead. I think next time I will add a little more cheese and some Italian herbs and go for a cheesy bread. Also will try this as a pizza dough. Thanks for a good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cyndy C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2142759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-19T20:31:01.363Z",
                "reviewBody": "I've been wanting to try this recipe just because it sounded good but I was afraid to try making bread by hand. Well last weekend my 13-year old breadmaker walked off the counter last weekend and broke so today I tried it this recipe. My kitchen smells so good. Followed the recipe exactly and was surprised at how easy it was to put together. I now have a double batch rising to make pizza for supper (I plan to divide it into thirds since the dough was thick). Thanks for the post. I will be making this regularly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "southernhopsing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2237369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-31T17:01:23.17Z",
                "reviewBody": "I'm rating this recipe on taste and workability. The finished product's taste and texture was wonderful! I added minced garlic to the dough at the very end and dried oregano after putting on the cheeses. My daughter is gobbling it up. The workability of this recipe however!!!! I threw the ingredients into the bread machine on the pizza dough cycle and when it was done I had a bowl of soup. I needed to add a good cup of flour to make it even remotely workable and it was still sticky. I also had to scrape the thick layer of residue off my kitchen table. Also there was way too much butter. Maybe 1/3 cup is necessary if you work with some spreadable ingredient like margarine but with melted butter I ended throwing out half of it. While the finished product is soft and delicious I greatly did not appreciate the inaccurate list of measurements.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2847175/"
                }
            }
        ]
    }
]