[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
                    "name": "Canning and Preserving Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/105179/spicy-cabbage-kimchi/",
        "name": "Spicy Cabbage Kimchi",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4436654.jpg",
            "width": 1476,
            "height": 1476
        },
        "datePublished": "2020-06-19T03:13:36.000Z",
        "description": "Kimchi, a popular Korean dish, is best described as a spicy, slightly sweet, pickled or fermented cabbage.  I spent a year in South Korea and fell in LOVE with Kimchi! My friend Myong was kind enough to share her recipe and technique with me.  Some ingredients may not be readily available in your local supermarket.  Look for Kimchi (Fish) Sauce and Korean chili powder in Asian markets or online. Use kimchi in stir fries or your favorite Korean dishes.",
        "prepTime": "P0DT1H0M",
        "cookTime": null,
        "totalTime": "P4DT7H0M",
        "recipeYield": "14 cups",
        "recipeIngredient": [
            "2 heads napa cabbage",
            "1 ¼ cups sea salt",
            "1 tablespoon fish sauce",
            "5 green onions, chopped",
            "½ small white onion, minced",
            "2 cloves garlic, pressed",
            "2 tablespoons white sugar",
            "1 teaspoon ground ginger",
            "5 tablespoons Korean chile powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the cabbages in half lengthwise and trim the ends. Rinse and cut into pieces about 2 inch square. Place the cabbage into large resealable bags and sprinkle salt on the leaves so they are evenly coated. Use your hands to rub the salt in to the leaves. Seal the bags and leave at room temperature for 6 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rinse the salt from the cabbage leaves and then drain and squeeze out any excess liquid. Place the cabbage in a large container with a tight fitting lid. Stir in the fish sauce, green onions, white onion, garlic, sugar and ginger. Sprinkle the Korean chile powder over the mixture. Wear plastic gloves to protect your hands and rub the chile powder into the cabbage leaves until evenly coated. Seal the container and set in a cool dry place. Leave undisturbed for 4 days. Refrigerate before serving, and store in the refrigerator for up to 1 month (if it lasts that long!).\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Canning and Preserving Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GochisosamaDeshita"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0625,
            "ratingCount": 96,
            "itemReviewed": "Spicy Cabbage Kimchi",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "11.7 calories",
            "carbohydrateContent": "2.4 g",
            "cholesterolContent": null,
            "fatContent": "0.2 g",
            "fiberContent": "0.8 g",
            "proteinContent": "0.6 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "1916.5 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-28T22:17:00.73Z",
                "reviewBody": "Made 2 batches, the first exactly as the recipe instructed except that I used regular crushed hot peppers as I could not find the Korean sort. Most grocery stores with an asian section now carry fish sauce, though it is generallt labled \"Thai\" fish sauce. Even after much rinsing of the cabbage this recipe was so salty that if any fermentation took place the tingle was lost in the brine. So then... I took the advice of another reviewer and cut the salt in half. This still drew out the water beautifully. I also like a bit more ginger in my Kimchi, so I omitted the ground ginger and added 2 (1\") pieces of sliced dried ginger and 2 Tbsp of diced crystalized (candied/ sugared) ginger. Also added a Tbsp of whole black peppercorns. After 4 days in the closet and a day in the 'fridge the Kimchee was bubbly and yummy! This was very easy to make, and the ingredients are inexpensive. I won't be going back to the jar stuff from the grocery store! I understand every Korean Kimchi maker has his/her secret recipe, so just keep adjusting yours until you find what you like!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Fern",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/crazycatpastor/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-22T14:28:52.247Z",
                "reviewBody": "This is one of the easier kimchi recipes I've come across.  Some people may find it a little to salty or spicy.  There are milder recipes out there, some with low sodium.  \"Fish sauce\" is a rather non-specific ingredient.  Since I'm allergic to shrimp, I usually try to find the kind which doesn't contain shrimp, even though it is usually a primary ingredient in kimchi.  Kimchi is an acquired taste for some people.  I hated it at first, but even so, I kept craving it.  I now eat it every day.  It is super-healthy and low calorie.  Korean food in general is great if you are trying to lose weight!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Masters",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2316123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-26T00:13:48.367Z",
                "reviewBody": "I love, love, love kimchi. This came out a little salty for me so I cut the salt in half. It still drew the water out of the cabbage leaves and it all reduced well. I thought that I would get a little creative and added sesame oil for an additional flavor. My Korean friends told me to eat the kimchi quickly as oil will cause it to spoil. How do you spoil fermented (spoiled) cabbage? Anyway, it tasted great, but I didn't feel like eating two quarts of kimchee that quickly. My friends were happy with that. If you have ever heard the term \"kimchi breath\" you'll know what I mean. As a previous reviewer stated, I hated kimchee at first, particularly the smell of it. But now I crave it. I'll eat it with breakfast, lunch, and dinner. By the way, a serving is like a quarter cup. Small, but loaded with flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brian Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1624226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-17T21:27:59.383Z",
                "reviewBody": "As I pulled up the recipe to make this for the 2nd time, I was reminded to help others by rating the recipe.  It is so delicious and so authentic, we can't get enough of it.  First introduced to Kimchi in the early 70's, this is probably the recipe that has the most authentic taste, just like we had in Seoul.  I add slices of Asian radish as well...they make for great additional texture with their crispness.  Soooo good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lshoffner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3925671/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-18T07:18:24.05Z",
                "reviewBody": "I can fix the saltiness issue.  I've made kimchi a few times and this recipe is very similar to the one I use and love.  After you rub the salt into the cabbage and let it sit for only about 30 minutes, you should then immerse the cabbage in a large bowl of water for 2 hours.  Put a dinner plate on the top to make sure all the cabbage is submerged.  The salt's role is to kill the bad bacteria and only add a teeny bit of flavor.  After it's done soaking rinse the cabbage very thoroughly.  I usually put it in a colander, rinse it well by hand and then rinse it in a water bath 2 or 3 times.  Changing the water each time.\n\nKimchi is one of those foods that takes a loooong time to make.  I usually put everything that this recipe has and some diakon matchsticks into a mason jar with a rubber seal in a cabinet for 3-5 days (pushing the contents below the surface of the brine everyday) and then refridgerate for a week.  Then, boom, it's kimche eating time!\n\nAdded a photo of mine just for the heck of it.  That's an 8 cup mason jar.  Larger than most.  Bud Ice is not part of the recipe, but when you complete everything at 2am, like I did that time, it might find its way into the photo.   :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ryan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12411643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-26T18:36:54.55Z",
                "reviewBody": "Whoo hoo! I don't have to dole out five bucks a pop for a container of kimchi anymore! (It's very easy to go through that in a week or less, so this is great.)  I couldn't find Korean chile powder, but I did find hot pepper paste in the refrigerated section.  The label said it's from South Korea, so I thought that might do the trick and it has.  I used the amount of salt the recipe called for, and after rinsing it very well and squeezing out the extra water, it wasn't too salty.  Next time, I'm going to try adding salted shrimp and slices of jicama or asian radish, like other reviewers suggested.  I might also try subbing bok choy for the napa cabbage since it's a bit easier to come by, but very similar.  Anyway, I'm DEFINITELY going to make this again. Thank you for sharing!\n\nEdited to say BEWARE: The second time I made this, it sprayed all over the place when I opened it after waiting the four days the recipe calls for.  (It was like when you open a 2 liter of soda that's been shaken.) So, yes, beware! (It still tasted great, though.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "snarky_harpy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-22T03:40:25.057Z",
                "reviewBody": "THIS IS WAY TOO SALTY!!! Our cabbage was wasted! Please next time check your ingredients... next trial i will make the salt tbps instead. OMG, it was so disappointing! wasted all time and efforts, cabbage and all the ingredients. PLEASE CHECK YOUR INGREDIENTS FOR OTHERS NOT TO HAPPEN THIS AGAIN!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "mamaM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7376039/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-14T21:13:42.483Z",
                "reviewBody": "wow i really love this recipe except i used chinese chile paste instead of the powder. I also reduced the salt to 1/3c but all in all the best recipe i've found online",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tinamarie44",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4451436/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-02T00:33:13.017Z",
                "reviewBody": "This is AWESOME!! My husband was just stationed in Korea so i thought i would give it a try hoping to get close to that very addicting korean dish....Blew it out of the park!! said it was better than the kimchi he had in korea:) I also cut the salt to 1/3 C and didnt put as many onions. thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "texan81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5085618/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Spicy Cabbage Kimchi",
            "description": "See how to make spicy, slightly sweet fermented cabbage.",
            "uploadDate": "2013-05-02T22:14:20.947Z",
            "duration": "PT2M25.562S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc7c7d36a-9d2c-4408-9d2d-afec3b09f981%2F70fc220d-fc94-4d3f-82b7-beeeee481a08%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2347223811001"
        }
    }
]