[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/219/salad/vegetable-salads/",
                    "name": "Vegetable Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15103/salad/vegetable-salads/broccoli-salad/",
                    "name": "Broccoli Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/106381/asian-pasta-salad-with-beef-broccoli-and-bean-sprouts/",
        "name": "Asian Pasta Salad with Beef, Broccoli and Bean Sprouts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1263361.jpg",
            "width": 2272,
            "height": 2272
        },
        "datePublished": "2020-06-19T03:13:40.000Z",
        "description": "A creamy soy-ginger dressing nicely complements this pasta salad with broccoli, red pepper, bean sprouts, and peanuts.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 medium garlic cloves, minced",
            "6 tablespoons soy sauce",
            "1 tablespoon rice wine vinegar",
            "1 tablespoon sugar",
            "1 tablespoon sesame oil",
            "1 teaspoon ground ginger",
            "¾ teaspoon hot red pepper flakes",
            "2 tablespoons mayonnaise",
            "¼ cup vegetable oil",
            "2 tablespoons salt",
            "1 pound penne pasta",
            "8 ounces broccoli florets",
            "1 pound rare deli roast beef, sliced 1/8 inch thick and cut into bite-size strips",
            "3 medium carrots, peeled and coarsely grated",
            "1 medium red bell pepper, cut into bite-size strips",
            "2 cups bean sprouts",
            "3 green onions, thinly sliced",
            "½ cup chopped roasted (or honey-roasted) peanuts",
            "¼ cup chopped fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix garlic, soy sauce, vinegar, sugar, sesame oil, ginger, and pepper flakes in a 2-cup Pyrex measuring cup. Whisk in mayonnaise until smooth, then in a slow steady stream, whisk in  oil to make an emulsified dressing; keep chilled until ready to toss with salad. Store in a clean jar with lid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring 1 gallon of water and 2 tablespoons of salt to boil in a large soup kettle. Add pasta and, using package times as a guide, boil, stirring frequently and adding broccoli the last 1 minute, until just tender. Drain thoroughly (do not rinse) and dump onto a large, lipped cookie sheet. Set aside while preparing remaining salad ingredients.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place all salad ingredients (except soy-ginger dressing) in a large bowl or transfer to a gallon-size zipper bag. (Can be covered and refrigerated several hours at this point). When ready to serve, add dressing; toss to coat and serve.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Vegetable Salad Recipes",
            "Broccoli Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ben S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.623376623376624,
            "ratingCount": 77,
            "itemReviewed": "Asian Pasta Salad with Beef, Broccoli and Bean Sprouts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "467.6 calories",
            "carbohydrateContent": "53.7 g",
            "cholesterolContent": "28.6 mg",
            "fatContent": "19.2 g",
            "fiberContent": "5 g",
            "proteinContent": "23.9 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "3119.8 mg",
            "sugarContent": "7.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-28T13:56:59.747Z",
                "reviewBody": "I give this a 5 but not for the reasons you might think! Please read on. The salad turned out nice. Since my diet really limited the content it wasnt much more than a basic pasta salad with green onions cilantro and I added some cubed cheddar. I made the dressing with reduced sodium soy and held the pepper flakes and mayo however after tasting it I decided to add the mayo thankfully it made a great difference for me and I enjoyed it a lot. So here's the kicker and I cant believe the results: I used the basic dressing sans mayo and increased to C reduced sodium soya (I even took a walk on the wild side and used the pepper flakes!) as a marinade for the pork! Fabulous! I loved it I loved it I loved it! I will try this again with chicken in the salad or as a marinade! Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kathleen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1239530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-29T00:47:33.827Z",
                "reviewBody": "We absolutely loved this dish. As with everything in life you make changes to suit your own personal tastes but this one is a basic 5 star recipe. To the dressing I added an extra clove of garlic a bit of Orange Zest Sesame Seeds and dried Celery Flakes. I also used 1/2 tsp. cayenne as opposed to the 3/4 tsp. chili pepper flakes and omitted the mayo. For the salad I used 8 oz. pasta with more of the veggies 1/2 lb. roast beef and all of the dressing. I thought it was perfect that way and actually would have been lacking in the dressing dept. otherwise. It was delicious at dinnertime and it was even better at 2am when I pulled a refrigerator raid. I think next time I make this I will actually mix it up ahead of time and give the flavors a chance to blend. Delicious dressing... a keeper in my book! Oh we also used a blend of Honey Roasted Peanuts and Cashews which was kind of nice. Thank you Pam Anderson!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~TAYLOR~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-28T13:34:47.187Z",
                "reviewBody": "I have to agree with Tuni. I thought that this was a great change from usual pasta salad. I added extra vinegar to the dressing used honey instead of sugar I didn't have crushed red pepper flake so I added some Asian Essence. I put the dressing in a shaker to mix it. For the salad I used rotini and probably only half a box. I didn't have peanuts so I used some sunflower seeds and I cooked the broccoli a bit with the pasta and added some fresh peas that I had in the fridge. Next time I will take Tuni's suggestion and use some Oj in the dressing and maybe even add some mandarins to the salad. Can't wait to have the leftovers for lunch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookinme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1741728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-31T12:20:49.17Z",
                "reviewBody": "While I agree with the other reviewers on the fact that it is a very good salad it still needs a few adjustments to make it to my 5 book. First of all I used rice noodles. I hate it when an Asian-inspired recipe calls for Italian pasta! I reduced the pasta to 1/2 lb but I kept the same amount of everything else. Next time I'll probably omit the peanuts because i couldn't taste them anyway. I'll skip the carrots too just because I don't care for them. All in all however it made a very enjoyable dinner. Thanks for posting Pam!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SunFlower",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1144581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-28T11:52:16.45Z",
                "reviewBody": "I halved this recipe and it still made quite alot. This is a really great salad. Next time I'll omit the deli beef because the flavor got lost anyway in the process and just use this as a side dish. I love sesame oil but although it was not too overpowering next time will decrease it by 1/2 tsp. Added toasted sesame seeds blanched the broccoli used flat fettucine noodles so it appeared more 'Asian' and added a bit of wasabi mustard and orange juice/zest to the dressing. Emulsified dressing in the food processor. I loved the textures in here. Next time will cut down on the carbs and up the bean sprouts. Beautiful colors and textures as well as great asian flavors make this a great salad to serve along side a grilled steak. This is a meal in itself and a nice summer meal at that. I am a garlic lover so upped the garlic. Will also use more green onion next time just out of personal preference. Very nice recipe and a nice change of pace from the regular pasta salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-14T01:42:54.9Z",
                "reviewBody": "My husband and I LOVED this one. The spices are the perfect mix. The dressing is what makes it - you can really throw in any vegetables and make it work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "suede",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1707746/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-18T16:58:27.74Z",
                "reviewBody": "Delicious dressing without the mayo! The only change I made: I chopped some chicken breast and marinated it in some soy sauce sesame oil and some garlic and then sauteed it. I used this instead of the beef. I also used ramen noodles- way more delicious than just penne pasta! Delicious recipe- thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LeeBt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2830257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-09T19:25:01.843Z",
                "reviewBody": "This salad is nice if you're looking for a different taste from the usual. I followed the recipe except used medium sized rice noodles from the international aisle of the grocery store and blanched the broccoli in the boiling water at the last minute (both as recommended below). YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIREKBERG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-02T14:25:23.75Z",
                "reviewBody": "I added additional garlic used rice noodles & only used 8 oz. used fresh ginger & I added a couple of pea-sized dollops of wasabi paste. I had some leftover honey & garlic pork tenderloin so I sliced it very thin & then cut it into bite sized pieces...I subbed that for the roast beef. I also added a couple of tbps. of mirin but I'm not so sure that was a good move...I think the OJ would be a much better compliment. I served this w/ a side of Ginger-Spiced Cucumbers (from allrecipes) & we followed the meal w/ Vietnamese Iced Coffee...was a refreshing dinner for a hot summer night...thanks again Pam!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            }
        ]
    }
]