[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/257895/nicoles-vegetarian-marshmallows/",
        "name": "Nicole's Vegetarian Marshmallows",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9233601.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T04:21:02.000Z",
        "description": "Finally a vegetarian marshmallow recipe that works! These marshmallows are great for s'mores, hot cocoa, dipping in chocolate... anything you can dream up!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT8H50M",
        "recipeYield": "1 9-inch square pan",
        "recipeIngredient": [
            "cooking spray",
            "1 cup confectioners' sugar, divided",
            "1 ¼ cups water, divided",
            "2 tablespoons agar agar powder",
            "2 egg whites",
            "2 cups white sugar",
            "1 tablespoon light corn syrup",
            "1 ½ teaspoons vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Lightly oil a 9-inch square baking dish with cooking spray. Dust generously with 1/2 cup confectioners' sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring 1/2 cup water to a boil in a small saucepan. Remove from heat and stir in agar agar; let soak until dissolved, 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg whites in a stand mixer fitted with the whisk attachment until soft peaks form.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine remaining 3/4 cup water, white sugar, and corn syrup in a small saucepan. Cook over medium-high heat until mixture registers 250 to 265 degrees F (121 to 129 degrees C) on a candy thermometer or until a small amount of syrup dropped into cold water forms a rigid ball. Remove from heat; stir agar agar mixture into the hot syrup.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn stand mixer on to continue beating egg whites. Pour hot syrup in a thin stream down the side of the bowl, beating until egg whites are very stiff. Stir in vanilla extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread marshmallow mixture evenly in the prepared pan. Dust with remaining 1/2 cup confectioner's sugar. Let stand until set, 8 hours to overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip a sharp knife in very hot water and wipe off; slice marshmallow mixture into 2-inch pieces.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Nicole"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 2.3333333333333335,
            "ratingCount": 3,
            "itemReviewed": "Nicole's Vegetarian Marshmallows",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "108.2 calories",
            "carbohydrateContent": "27.3 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": null,
            "proteinContent": "0.4 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "7 mg",
            "sugarContent": "26.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-04-17T04:31:56.277Z",
                "reviewBody": "The next time I make these I'm going to make the following changes and review again with the results. Reasons are elaborated on below. Reduce the agar agar to two teaspoons. Make the agar agar mixture as the sugar mixture starts to reach temperature rather than before making the syrup. I was surprised to see this recipe called for two TABLESPOONS of agar agar whereas most recipes call for a couple teaspoons. I always make a recipe as written the first time even when something about it is obviously going to go wrong. And it did. The agar agar in that amount of water didn't dissolve. It quickly absorbed the water some of it still partly dry and formed semi-dry clumps instead of dissolving. I had to add more than twice the amount of water called for to get two tablespoons of agar agar to dissolve. This threw off the final texture a bit but I wonder if most of those who are new to agar agar would know that the agar agar-to-water ratio needed to be adjusted or how to adjust it. The fact that it is already clumped meant that though I did my best to get any remaining clumps out some little ones made their way into the final product so you occasionally have this little rubbery piece in your mouth. The fact that this recipe calls for the agar agar mixture to be made before the sugar mixture also contributed to the clumps. It takes some time for syrup to reach soft ball stage and agar agar begins to set very quickly. While this recipe has a helpful note on how to kn",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7130588/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-06-03T22:00:41.16Z",
                "reviewBody": "This recipe worked for me overall.  I will probably halve the recipe next time - it says it makes 20, but they would be huge! I cut them smaller and ended up with nearly 40 good sized marshmallows.  I saw a review that said the agar agar absorbed all the liquid before fully dissolving.  I may reduce the agar agar amount by a little, but I didn’t  end up with any lumps because when I added the agar agar mix to the hot sugar mix, I just made sure I whisked it until the agar agar mix had melted into the sugar mixture completely.  I made pineapple marshmallows, so substituted a pineapple juice reduction for the water with the agar agar, and also used straight pineapple juice instead of water in the sugar mixture.  This did cause the sugar mixture to froth a lot when I was heating it so I had to cook it at a lower temp and stir a lot, but the pineapple flavor was worth it.  After setting overnight, the marshmallows cut just fine with a warm knife and tasted great.  One last note - I didn’t need any where near 1 1/2 cups of confectionery sugar for dusting the marshmallows.  Less than the 1/2 cup on the pan bottom and sides and much less than the remaining cup on top.  The photo shows pineapple marshmallows - regular vanilla ones would look whiter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mbar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6300535/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-08-11T21:28:59.297Z",
                "reviewBody": "I spent $18.50 on agar agar and wasted it all. The agar agar sucked up all the water. I am not going out and getting more agar agar. I am just a vegetarian wanting some vegetarian marshmallows on the lounge crying. I just wanted something that tasted like a marshmello.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Vegetarian Kid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25972841/"
                }
            }
        ]
    }
]