[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/718/world-cuisine/european/austrian/",
                    "name": "Austrian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/110312/sacher-torte/",
        "name": "Sacher Torte",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F678519.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:13:51.000Z",
        "description": "This is pretty darn close to the original classic dessert produced by the Sacher Hotel in Vienna, Austria. It is a dense, not-too-sweet, apricot and chocolate concoction. It is a lot of work but WELL worth the effort!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT5H0M",
        "recipeYield": "1 9-inch cake",
        "recipeIngredient": [
            "4 ounces semi sweet chocolate (chopped)",
            "½ cup butter, softened",
            "¼ cup confectioners' sugar",
            "2 teaspoons confectioners' sugar",
            "6 eggs, separated",
            "½ cup white sugar",
            "2 tablespoons white sugar",
            "1 cup cake flour",
            "¼ cup water",
            "¼ cup white sugar",
            "3 tablespoons dark rum, divided",
            "1 (12 ounce) jar apricot preserves",
            "1 tablespoon water",
            "9 ounces semisweet chocolate, chopped",
            "3 ounces heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly butter a 9-inch springform pan; place a circle of parchment paper inside, and butter that as well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 4 ounces of chocolate in a metal bowl placed over gently simmering water. Stir frequently until melted, then remove from the heat and let cool slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the butter together with confectioners' sugar until creamy. Mix in the melted chocolate, then beat in the egg yolks, one at a time. In a clean bowl, beat egg whites with white sugar until stiff and glossy. Fold into chocolate mixture, then fold in cake flour, until incorporated. Pour into prepared springform pan, and smooth the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the edges begin to pull away from the sides of the pan, and a toothpick inserted into the center comes out dry, about 45 minutes. Cool pan on a wire rack for 15 minutes, then run a small knife around the edge and remove the sides of the pan. Allow cake to cool completely on the base of the pan. When cool, remove from pan, and remove parchment paper; slice cake in half horizontally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring 1/4 cup water and sugar to a boil in a small saucepan. When the sugar has dissolved and the syrup is clear, remove from heat and stir in 2 tablespoons rum. Brush 1/3 of the syrup onto the cut side of the cake bottom.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Puree the apricot preserves with 1 tablespoon of water until smooth. Bring to a simmer over medium heat in a small saucepan, and cook until thickened, about 2 minutes. Stir in remaining rum, then spread 1/3 of the jam mixture onto the cut side of the cake bottom. Place the top of the cake onto the bottom. Brush the outside of the cake with the remaining syrup, then spread remaining apricot preserves over the top and sides; refrigerate until the icing is ready.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the icing, melt 9 ounces of chocolate over a double boiler or in the microwave until smooth. Bring the cream to a simmer in a small saucepan, then stir into melted chocolate. Cool slightly, stirring often, until the chocolate reaches a spreadable consistency.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Set the cake on a cooling rack set over a cookie sheet or waxed paper to catch any drips. Pour the icing on top of the cake, and spread around the edges; allow excess icing to drip through the rack. Cool cake to room temperature, then carefully remove from the cooling rack using a spatula. Transfer to a dessert plate and store in the refrigerator. Allow cake to come to room temperature before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Austrian"
        ],
        "recipeCuisine": [
            "European",
            "Austrian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Amy A"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.133333333333334,
            "ratingCount": 15,
            "itemReviewed": "Sacher Torte",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "469.7 calories",
            "carbohydrateContent": "62.8 g",
            "cholesterolContent": "123.1 mg",
            "fatContent": "22.6 g",
            "fiberContent": "2.4 g",
            "proteinContent": "6.5 g",
            "saturatedFatContent": "12.7 g",
            "servingSize": null,
            "sodiumContent": "92.7 mg",
            "sugarContent": "49.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-24T00:40:08.75Z",
                "reviewBody": "This turned out to be a LOT like the Sacher Torte I had at the Sacher Hotel in Vienna. The only thing I would say is that you absolutely MUST use a high-fat chocolate for this like a coverture. If the chocolate isn't high in butterfat the whole thing will turn out too dry. If you want to try with semi-sweet chocolate chips increase the fat content when you're melting the chocolate. This made me miss Vienna!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2354682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-24T22:23:53.563Z",
                "reviewBody": "I agree! This is a lot like the real thing. I ued semi-sweet chocolate bits which worked well. When making this please understand it is NOT a sweet cake. With the apricot filling and chocolate that is what makes it Sacher Torte. Would also suggest serving it with whip cream (mit schlag). I too have fond memories of the Hotel Sacher. This is a keeper for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "loiskayaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1917883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-30T17:41:27.593Z",
                "reviewBody": "This turned out great. I sliced it into three layers instead of two. I used Czech Orion bitter and cooking chocolate half dark rum and half Grand Marnier. The cake is not too sweet and is balanced with the ganache. Now I need to try the original.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sonya M. Shafer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2499821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-18T06:32:55.12Z",
                "reviewBody": "This recipe has a lot of potential. Overall my results were pretty good but the cake came out a little on the dry side. Another commenter mentions that she believes this can happen when the chocolate doesn't have enough fat in it but I added quite a bit of butter. Next time I will try adding some yogurt instead and some extra sugar to compensate (yogurt in cakes eats up sweetness). I also wish I had let the apricot/rum mixture cool a little more after thickening. I tried to apply it while it was still quite warm and runny. Lastly I wish I had known how quickly the chocolate icing would set up; within seconds of taking it off of the heat it was like mud. In hindsight I should have been a bit quicker in pouring it on the cake -- do it all in one go get it as even as you can manage quickly and don't try to go back and fix the thin areas by pouring more on because the result will be ugly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Chase McIntyre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10276754/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-12T19:03:41.667Z",
                "reviewBody": "Weird, dry. The chocolate mix did not incorperate into the egg whites.  Some of my guests claimed to like it.  It has potential.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebekah001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2797605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-14T19:49:51.657Z",
                "reviewBody": "I have just made it! Have never used a spring form pan before so I opted for the small ceramic dishes that I could control better; anyway I have cooked \"out of the box mixes\" with chocolate and I suggest to put a large mixing bowl over a pot of water (no overheating/burning of choc) to melt it. It is well...worth the effort if people enjoy a truly \"homemade desert\". If you don't have a \"La Madeleine\" restaurant then fly to Vienna by all means. Trying to make the syrup soak in was difficult because the cake is not soft enough. A second thing was the icing to which I had to add quite a bit more cream or it does NOT spread (too chunky). I kept it in the double boiler so it definitely needed more cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "marina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10369676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-19T23:02:12.257Z",
                "reviewBody": "Super tasty and authentic! It took a LOT of work and time but it was well worth the effort. I served it with fresh whipped cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHIRLEDPEAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whirledpeas/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-23T16:14:07.323Z",
                "reviewBody": "I loved everything about this Sacher Torte. (However I would much rather fly to Vienna for the real thing!) I am going to make it for my annual \"Celebrate Mozart's Birthday\" dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NADINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3417335/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-16T04:48:16.987Z",
                "reviewBody": "For Valentines Day I purchased a set of aluminum foil pans (2) and divided the batter between the two (thus eliminating the step of cutting the single cake into top and bottom halves). I reduced the baking time accordingly (about 30-minutes). I also lined the pans (bottoms and sides) with non-stick aluminum foil. The cakes came out great no sticking to the foil at all! I used Hershey Special Dark chocolate chips (my favorite) and the results...DELICIOUS!!! Reminiscent of the Sachertorte my Mom & I so enjoyed at Hansel & Gretel's in Vail once upon a time.....??",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lingwallicious",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15282129/"
                }
            }
        ]
    }
]