[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/112239/caramel-macchiato-cheesecake/",
        "name": "Caramel Macchiato Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F622321.jpg",
            "width": 2304,
            "height": 3456
        },
        "datePublished": "2020-06-19T03:13:55.000Z",
        "description": "I work at a coffee shop and my favorite coffee drink is a caramel macchiato so I created a caramel macchiato cheesecake that has become my favorite cheesecake.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT1H28M",
        "totalTime": "P0DT10H3M",
        "recipeYield": "1 9-inch cheesecake",
        "recipeIngredient": [
            "2 cups graham cracker crumbs",
            "½ cup butter, melted",
            "2 tablespoons white sugar",
            "3 (8 ounce) packages cream cheese, softened",
            "1 cup white sugar",
            "3 eggs",
            "1 (8 ounce) container sour cream",
            "¼ cup brewed espresso or strong coffee",
            "2 teaspoons vanilla extract",
            "pressurized whipped cream",
            "caramel ice cream topping"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Lightly coat a 9-inch springform pan with nonstick cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together the graham cracker crumbs, melted butter, and 2 tablespoons of sugar until well combined.  Press into the bottom of the prepared springform pan, and 1 inch up the sides.  Bake in preheated oven for 8 minutes, then remove to cool on a wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce oven temperature to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the softened cream cheese in a large bowl with an electric mixer until fluffy.  Gradually add 1 cup of sugar, beating until blended.   Add eggs one at a time, beating well after each addition.  Stir in sour cream, espresso and vanilla.  Pour batter into the baked and cooled crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cheesecake in the preheated oven for 1 hour and 5 minutes; then turn the oven off, partially open the door and allow the cheesecake to rest for 15 minutes more. Remove from the oven, and run a knife around the edges. Cool cheesecake on a wire rack to room temperature, then cover the springform pan with plastic wrap, and chill in the refrigerator for 8 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, cut the cheesecake into wedges and garnish each slice with whipped cream and caramel sauce.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dawn Logterman"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8144712430426715,
            "ratingCount": 539,
            "itemReviewed": "Caramel Macchiato Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "485.5 calories",
            "carbohydrateContent": "37.1 g",
            "cholesterolContent": "140.6 mg",
            "fatContent": "35 g",
            "fiberContent": "0.5 g",
            "proteinContent": "7.7 g",
            "saturatedFatContent": "20.9 g",
            "servingSize": null,
            "sodiumContent": "363.4 mg",
            "sugarContent": "23.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-27T22:24:51.08Z",
                "reviewBody": "I'm Dawn's husband, Kevin.  For over 20 years, I've been the winner.  Dawn puts so much into her cooking and loves putting new dishes in front of us all the time.  The Carmel Macchiato Cheesecake is another in a long line of great recipes Dawn has come up with.  It's the best desert I've had and, thanks to Dawn, I've had a lot of great deserts!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kkl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2092947/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-13T07:16:09.69Z",
                "reviewBody": "The first time I made this recipe, I overbeat it and didn't use a waterbath. The cheesecake rose while baking, then fell and cracked. It was the ugliest thing I'd ever made! I ended up cutting off the high edges to make it level, then covered the top with a chocolate ganache. Everyone loved it! I've made it two times since and it has turned out beautifully each time. Don't overbeat your cheesecake, and bake it in a water bath (see instructions on baking a cheesecake). The ganache is still a nice complement--scald a cup of heavy cream, then pour it over 1 1/2 cups of chopped chocolate. Let it sit for 5 mins, then stir until melted. Add 1 tsp. of vanilla, stir, and pour /spread on top of cheesecake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jiahhui",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1595358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-24T01:45:56.07Z",
                "reviewBody": "This cheesecake was absolutely incredible! I went to Starbucks and asked for a quadruple shot of espresso, used 1/4 cup for the recipe, then froze the rest in an ice cube tray to use for iced mochas.  I baked it in a water bath, and when the hour was up, I turned off the oven and left the cheescake in the oven to cool for a few hours.  Absolutely no cracks!  I made it a couple of days ahead so the flavors had time to mature, and served it with drizzled caramel and whipped cream, just like in the picture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Blonde Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2271526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-19T21:02:04.483Z",
                "reviewBody": "If you love chocolate, make a mocha cheesecake with the addition 8 ounces of melted semisweet chocolate stirred into the cheesecake mixture! Heavenly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-11T21:10:49.86Z",
                "reviewBody": "This was wonderful... I made homemade caramel sauce- used approximately 1/4 cup in the batter by fillign the crust half way with the batter then dropping in large drops of the caramel sauce. i then took a butter knife and swirled the drop throughout the batter. I repeated this again after adding the remainder of the batter to the shell. I love Starbucks Caramel macchiatos and this sure did take care of my Starbucks fix for the day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-21T00:42:52.047Z",
                "reviewBody": "Creamy and smooth, and absolutely decadent with homemade caramel. Make sure to bake the cheesecake in a water bath for that perfect texture. If you can manage not to eat it all at once, the individual slices freeze and defrost really nicely -- just make sure they're wrapped really well in plastic wrap and aluminum foil before freezing. 30-60 minutes out of the freezer, and a divine treat without all the prep!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1468554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-29T18:39:29.717Z",
                "reviewBody": "Wow! If you love cheesecake and you love caramel and coffee flavors then this cheesecake is for you! I mean this is one fabulous dessert! It just doesn't get much better than this.  There's just enough coffee flavor in here so it's not overpowering and just subtle enough to really come through and compliment the caramel topping.  The richness and creaminess of the cheesecake is well...as one of my guests put it \"to die for\".  I always bring my ingredients to room temperature before mixing and don't overbeat - plus do a waterbath to avoid cracks.  I topped it with homemade whipped cream and it was beyond delicious! Thanks for a great recipe Dawn!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-31T15:52:44.15Z",
                "reviewBody": "This. Was. Amazing.  After reading some reviews, I opted for crushing chocolate teddy grahams for the crust and added 1 tsp instant espresso granules to the crust. I also doubled the espresso in the filling, and added 2 Tbsp caramel.  I took the suggestion of placing the springform pan on a muffin tin pan filled with water, and I left it in the oven a few hours after turning it off. It turned out perfectly!  So smooth and cream, no cracks, and a wonderful blend of flavors!  \n\nI topped with homemade caramel - melt 1 stick butter and 1 C brown sugar, boiling about 5 minutes until smooth.  Turn off heat and add 1 tsp salt, 1 tsp vanilla and enough evaporated milk until it reaches desired consistency - about 1/2 cup (will thicken as it cools).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MeatsNSweets",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/927897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-26T17:20:43.517Z",
                "reviewBody": "Made this for Christmas Eve and it was delicious!!! Everyone loved it and thought it was sore bought! I did put a tsp. of cinnamon in the crust. I also wrapped the bottom of the springform pan with aluminium foil and baked it in a water bath to prevent cracking and to cook more evenly. It turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "citymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1842196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-27T21:17:20.967Z",
                "reviewBody": "I have a few problems with this recipe.  First, if you have it without the caramel, you can taste the coffee.  It's a delicate flavor but definitely there.  To achieve this flavor I bought some decaf french roast and double brewed it on the strong setting.  (I am sensitive to caffeine but love the flavor of coffee.)  But once you add the caramel, it overpowers the flavor and it's much harder to taste.  Second, the baking time is wrong.  I've made cheesecakes a few times and usually I bake at 350 for 40-50 minutes.  But given that the ingredients in this one had added liquid from coffee and a full cup of sour cream, I thought I should do as the author instructed and did it at 325 for 1hr and 5 mins.  My cheesecake was overcooked.  A cheesecake should not appear browned anywhere and the top of mine was getting browned after an hour.  I did bake it in a water bath, even with that I had this odd experience of it not sinking in the middle but rather it was high along the edge with a dip just inside that then rose to the center. I also did everything I could not to over beat. The cheesecake was also not smooth and creamy - perhaps this was in part due to being over baked.  For my preference, the crust is also double what I needed.  What saved this for me was the caramel sauce, but mine was not store bought.  With the addition of a nice caramel sauce, I would give it 3 stars.  As written it is a 2 star recipe.  It sounds nice, but falls short of what it promises.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "catwhispererPhD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4198931/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "What's Cooking in Janesville, WI?",
            "description": "What’s cooking in Janesville? Creamy cheesecake with a splash of coffee.",
            "uploadDate": "2011-08-04T01:14:53.161Z",
            "duration": "PT4M52.592S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0714c194-b5f6-4f03-ae5d-9c7a86abaf73%2F394facd8-7760-4a97-958e-76eb37d122ee%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1092928750001"
        }
    }
]