[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/260062/instant-pot-cheesecake/",
        "name": "Instant Pot&reg; Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4557178.jpg",
            "width": 2500,
            "height": 1667
        },
        "datePublished": "2020-06-19T04:24:24.000Z",
        "description": "Cheesecake? In a pressure cooker? You bet. A creamy cheesecake relies on beating lots of air into the batter before cooking it. It also requires steaming. When you bake a cheesecake in the oven, you also need to put a pot of hot water underneath the springform pan to ensure the top of the cheesecake does not crack. In an Instant Pot&reg;, all you need is a little water and the trivet. The result is a decadent cheesecake with no fuss. Serve with fruit on top, such as ripe blackberries.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT3H48M",
        "recipeYield": "1 6-inch cheesecake",
        "recipeIngredient": [
            "¾ cup crushed graham crackers",
            "2 teaspoons white sugar",
            "1 teaspoon ground cinnamon",
            "3 tablespoons melted butter",
            "2 (8 ounce) packages cream cheese, at room temperature  ",
            "⅔ cup white sugar",
            "¼ teaspoon kosher salt",
            "1 teaspoon vanilla extract",
            "1 lemon, zested",
            "2 eggs, at room temperature",
            "⅔ cup sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pulse graham crackers, 2 teaspoons white sugar, and cinnamon in a food processor. Pour in melted butter; pulse until fine crumbs form. Pat the crust into the bottom and 1 inch up the sides of a 6-inch springform pan. Put the pan in the freezer for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix cream cheese in the bowl of a stand mixer on medium-low speed until aerated and creamy, about 4 minutes. Add 2/3 cup sugar and salt; mix for 4 minutes more. Add vanilla extract and lemon zest; mix batter for 1 minute more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Crack 1 egg into the batter; mix for 1 minute. Add remaining egg; mix for 1 minute more. Stir in the sour cream; mix until it has disappeared into the batter, about 1 minute. Pour into the crust-lined pan. Make a loose tent over the pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1 1/2 cups of water into the bottom of the Instant Pot&reg;; add the trivet. Lower the filled springform pan carefully into the Instant Pot&reg;. Lock the lid into place.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Choose the \"Manual\" setting; select high pressure. Set cook time for 40 minutes. When the timer goes off, allow pressure to naturally release for 18 minutes. Remove the lid. Check for doneness; edges should be set and the center should jiggle slightly when shaken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the cheesecake to the refrigerator. Chill for at least 2 hours, preferably overnight.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Shauna James Ahern"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.283018867924528,
            "ratingCount": 53,
            "itemReviewed": "Instant Pot&reg; Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "396.8 calories",
            "carbohydrateContent": "26.5 g",
            "cholesterolContent": "128 mg",
            "fatContent": "29.9 g",
            "fiberContent": "0.4 g",
            "proteinContent": "7 g",
            "saturatedFatContent": "18 g",
            "servingSize": null,
            "sodiumContent": "331.8 mg",
            "sugarContent": "20.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2017-12-09T12:31:38.747Z",
                "reviewBody": "This is a phenomenal cheesecake that is light, fluffy, and super tasty.  Since I have never made a cheesecake before, I followed the recipe exactly as written. I left the cream cheese, eggs, and sour cream out on the counter for a good while before I made the batter, as I have read that it's important everything be room temperature to get a consistent cake texture with no cracks.  I used a pretty large lemon, so there was a lot of zest, and I'm glad because the hint of lemon flavor is so so good.  I used a 6\"x 3\" aluminum cake pan, not a springform pan, and it turned out just fine (simply run a thin knife around the edge to release it).  I also let the cake cool to room temperature before putting in the fridge.  Since I love cherries, I got a can of cherry pie filling and serve a small bit warmed on the side with it.  I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SKaustin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6162381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-16T02:44:10.31Z",
                "reviewBody": "So I made this cheesecake and it was just delicious-- perhaps one of the best I ever tasted... HOWEVER, I only gave it 4 stars because I almost threw it away! Why? When I opened up the InstantPot to see the finished product, it was puffed up like a souffle and residual cheesecake batter was in the bottom of the pot. Before I threw it away, I decided to leave it out on the counter for a while to see what might happen. And after about 15-20\", the  puff went down and it looked like a cheesecake again. Not sure exactly why this happened except the directions have you beat the mix a LOT so there's so much air in the batter that I'm not surprised it puffed so much. And after the puff receeded, it really was one of the best cheesecakes I have tasted. And my dinner guests agreed. I will definitely make this again but will probably back off on the kitechaide time...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Thecard14",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14762371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-04-23T04:08:51.423Z",
                "reviewBody": "made this recipe in my Instant Pot 3 qt (mini). I made sure that the cream cheese and eggs were at room temperature. I used a 6x3 cheesecake pan where the bottom is removable and parchment paper for the bottom and the sides to help to keep the cheesecake from sticking. I also added a paper towel with the foil to help with the steam/water from pooling on the top. With my IP I used the Meat button and selected Normal for 35 minutes and 18 minutes for natural release. After taking the cheesecake out of the IP it is important that the cheesecake is able to set out on a rack for 1 hr in order for it to complete its \"cooking\". I also added a sour cream/sugar topping to the cheesecake while it was cooling. After the 1 hr I placed in the refrigerator for 24 hrs. It came out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "calindbaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6194653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-02-15T05:32:36.207Z",
                "reviewBody": "Followed recipe exactly -except I used orange zest instead of lemon as that was what I had on hand. I made sure to fold in the eggs and sour cream rather than mix them with my food processor as I did with earlier ingredients. This kept the cheesecake from puffing up and resembling more like a souffle than a cheesecake. I also followed a tip I read elsewhere and covered the cheesecake with a papertowel and then the tin foil lightly pressed along the side- not tightly wrapped- to keep water off the top of the cheesecake. The result was incredible!! So yummy- not too sweet and the crust is the best I've had by far! So easy to do with my new instapot...I will definitely be making this again....my family said \"it's a keeper\"!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danielle Bobzien",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3988245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-03T05:35:28.547Z",
                "reviewBody": "Excellent. Followed the recipe completely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rita Gayle Ott Strain",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17387040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-06-04T02:08:26.123Z",
                "reviewBody": "Decided to try this out, even though I have a FABULOUS cheesecake recipe for the oven.  Followed the directions EXACTLY.  When I opened the pot, the cheesecake was puffed up and some had blooped into the water in the pot.  It’s now in the refrigerator ‘chilling’.  We’ll see what it’s like when I actually try to serve it later.  Not hopeful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23790022/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-04-03T01:44:19.25Z",
                "reviewBody": "I lined the pan with parchment paper for easier removal and baked the crust in 350 oven for 15 min. for a firmer crust. I mixed 1/2 cup of sour cream with a teaspoon of sugar to coat cheesecake while it was still warm. Otherwise I followed the recipe. This came out beautifully was delicious and my guests all loved it. I will make it again and again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20204756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-01-15T12:06:53.94Z",
                "reviewBody": "This was decent. I made this one, first. Then I tried another recipe from an online InstantPot community. I prefer the other over this one. While both came out very good- I just prefer the taste of the latter recipe I found elsewhere. \n\nThe crust on this one is better as far as volume. The amount is on par. But, I prefer the ‘2nd’ recipe as far as taste- that one included nutmeg, almond extract & crushed walnuts to the crust. The flavor was phenomenal on that one! So while I found the volume of this crust to work very well, it totally lacked in flavor when comparing. \n\nFor the actual cake- pretty much the same except for one ingredient. And this is what I think either makes or breaks it in some way... sour cream? No. I enjoyed the ‘2nd’ recipe quite a bit more as far as taste & texture using 1 cup of heavy cream. Not sour cream. Because it needs to be room temperature, too, like the eggs & cream cheese. Sour cream has 0 flavor & turns to a more “watery” consistency. Heavy cream at room temperature will easily bind with whatever it is added to & has the RICH, creamy taste. So I think that is why there are complaints about the form of the cake, too. Try using 1 cup of heavy cream at room temperature instead of the sour cream. \n\nCooking time is spot on. The ‘2nd’ recipe I tried had only a 30 minute cook time. It was still ‘runny’ in the center when I checked it. So at least 40 minutes with a natural release is perfect! But, I agree with the ‘2nd’ recipe of letting it sit at room",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "angelinamarie3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/angelinamarie3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-08-20T02:37:51.813Z",
                "reviewBody": "It was a fair amount of work - it kinda caught me off-guard once I got started. I have been cooking for a long time but never got into dessert-making until recently. Now there were no surprises..... I followed the recipe to the letter. It DOES come out all \" puffed up \" kinda like a souffle \" - but it deflates when it cools off. The final result was creamy buttery AND delicious. More dense than airy - like a classic NY bakery made cake. The lemon the lemon zest - was a special touch. I might have used wax or parchment paper on the bottom of the spring pan mine was textured ( little bumps ) and wouldn't lift off / release. No biggie the cake was for us here at home. I'll make it again when the right occasion comes along",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gerry Rotondo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24098459/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Instant Pot Cheesecake",
            "description": "An irresistible, smooth, and creamy cheesecake!",
            "uploadDate": "2018-03-08T22:40:02.123Z",
            "duration": "PT1M39.866S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F349f8e8c-b45f-4fbd-9c6b-d11f5f033f57%2Fb16e5241-5893-491f-ac20-b8acde7e110b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5747951722001"
        }
    }
]