[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/114417/belles-hamburger-buns/",
        "name": "Belle's Hamburger Buns",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1073329.jpg",
            "width": 1176,
            "height": 1764
        },
        "datePublished": "2020-06-19T03:14:31.000Z",
        "description": "My mom used to make these hamburger buns all the time. They are so easy to make: light and fluffy as well as beautiful to look at. I get raves whenever I make them. Try using them for sandwich rolls too--delicious!",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "12 buns",
        "recipeIngredient": [
            "1 cup milk",
            "1 cup water",
            "2 tablespoons butter",
            "1 tablespoon white sugar",
            "1 ½ teaspoons salt",
            "5 ½ cups all-purpose flour",
            "1 (.25 ounce) envelope active dry yeast",
            "1 egg yolk",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the milk, 1 cup of water, butter, sugar and salt in a saucepan. Bring to a boil then remove from the heat and let stand until lukewarm. If the mixture is too hot, it will kill the yeast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour and yeast. Pour in wet ingredients and stir until the dough starts to pull together. If you have a stand mixer, use the dough hook to mix for about 8 minutes. If not, knead the dough on a floured surface for about 10 minutes. Place the dough in a greased bowl, turning to coat. Cover and let stand until doubled in size, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough and divide into 12 portions They should be a little larger than a golf ball. Make tight balls out of the dough by pulling the dough tightly around and pinching it at the bottom. Place on a baking sheet lined with parchment paper or aluminum foil.  After the rolls sit for a minute and relax, flatten each ball with the palm of your hand until it is 3 to 4 inches wide. You may want to oil your hand first. Set rolls aside until they double in size, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Mix together the egg yolk and 1 tablespoon of water in a cup or small bowl. Brush onto the tops of the rolls. Position 2 oven racks so they are not too close to the top or bottom of the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 minutes in the preheated oven. Remove the rolls from the oven and return them to different shelves so each one spends a little time on the top.  Continue to bake for another 5 to 10 minutes, or until nicely browned on the top and bottom.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LemonLush"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.370716510903427,
            "ratingCount": 642,
            "itemReviewed": "Belle's Hamburger Buns",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "245.8 calories",
            "carbohydrateContent": "46 g",
            "cholesterolContent": "23.8 mg",
            "fatContent": "3.3 g",
            "fiberContent": "1.7 g",
            "proteinContent": "7.1 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "315.4 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-14T11:56:52.017Z",
                "reviewBody": "OK, I have been searching for a good \"all-purpose\" white bread dough recipe - one that looks good, tastes good, feels soft, and doesn't get stale right away (yes, I'm a stickler, but when you go to all the trouble to make it yourself, you want it to be good).  I just made these today, and so far the first three criteria are met!  These rolls are GORGEOUS; even the dough is beautiful when you're working with it.  They didn't taste bland to me at all, and usually I have to increase the salt or the sweetener in doughs.  They are soft and yummy.  I made 6 hamburger buns, 6 hot dog.  I sprinkled sesame seeds on the hamb. buns.  I just greased my cookie sheets - worked great!  I'll see how they hold up in terms of getting stale - homemade bread does dry out sooner, but that's because it's not full of all those preservatives anyway!  I have the leftovers in the freezer and will update on the \"freshness factor\" when I thaw them.  You could easily get 24 smaller rolls out of this recipe. Highly recommend!\n*** Next day... I pulled one of the hamb. buns out of the freezer & thawed it in the microwave.  Still very good texture & softness, although if you overheat it the bun can get a little tough.  Thawing on the counter might have been a better idea.  But this is good enough for me - I will look no further!  LOVE IT!   *** Even more updates - yes, thaw them on the counter, then heat in the microwave JUST until warm (for me, about 25 seconds for a hamb. bun).  Delish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Naomi Witzke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/987100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T22:27:43.327Z",
                "reviewBody": "Lovely soft, ethereal, yeasty pillows that will elevate your burgers well beyond the ordinary. Perfect exactly as written. Just be mindful not to add too much flour. The dough should feel ever-so-slightly sticky to the touch, so go somewhat light on your first flour addition. If you squeeze some in your hand, it should adhere just for a second or two before falling when you release it. If using a bread machine, check it after the initial kneading, while it rests, before the long knead part of the cycle, and add flour if too sticky, add a few drops of water if the dough seems heavy or dry. Check again 2-4 minutes into the second knead and adjust again, as necessary. The complaint that these rolls are too \"dense\", providing sufficient rising time is allowed per the recipe, is because of 1) insufficient kneading 2) insufficient rising time or 3) too much flour in proportion to liquid. The amount of flour when baking breads is not a precise science. Think of it as an \"area\" and not a \"point.\" The amount can vary from one time to the next, depending on the humidity, altitude, barometric pressure, accuracy of measurement, if you've sifted, age of your flour, etc. Work by feel and don't consider any measurement to be carved in stone, if you want to produce perfect yeast breads of any kind. Use the minimum amount of flour necessary to achieve the above-described feel to the dough, and you'll make the most heavenly bread on earth, each and every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-10T20:50:30.853Z",
                "reviewBody": "Due to poor reviews on the other hamburger bun recipes I tried this one which had NO ratings. I liked it. The buns turned out perfect & I even made sandwich rolls (like hoagie). The consistency of this finished product made a perfect (not soggy or mushy) hamburger bun. It is important for all cooks to know when you work with yeast it is important to read on the jar/package the manufacturers recommendations for liquid temperatures. I learned that because I was adding liquid to the yeast/flour mixture I could put in the liquid when it registered 120-130 degrees. It probably wouldn't have risen had I not read the instructions on the yeast pkg first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Valere",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valere/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-24T21:57:16.957Z",
                "reviewBody": "This a nice hamburger bun recipe. My family and I really enjoyed it. I have read many of the reviews and think I can offer some help to those who are stuggling. You will have a very dense bun if you add too much flour. When you are adding the last two cups of flour, add them in a little at a time. When the dough starts to pull away from the bowl and is not so sticky that you have a sticky \"pool\" of it at the base of your bowl, you have the right amount of flour. It will still be a little sticky, but you will have a very light dough.  If you find that your dough isn't rising well, there are a couple things you can do. First, check your yeast and make sure it is still good. You can do this by adding some yeast to warm water and adding a little flour or sugar. Leave it for about 10 minutes. At this point, it should be frothy or creamy looking. If it doesn't do anything, you need new yeast. Another thing you could do is switch flours to bread flour. It has a higher gluten content, and it should do better in the rising phase. If you wish to make the recipe with 100% whole wheat flour add a little gluten flour; a tablespoon for every cup of flour. I use this for making a 100% whole wheat breads with freshly ground wheat. It will help your dough rise. I hope this helps someone. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "happymommyx4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1632397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-20T12:27:07.953Z",
                "reviewBody": "Because I had run out of AP flour, I used whole wheat. I replaced the sugar with honey and only because this is how I'm used to making bread, I proofed my yeast by adding the warm liquid to it. Once bubbly, I then added my dry ingredients. After the egg wash, I sprinkled on some sesame seeds. My family raved over these buns, including my hubby who is not a bread person! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-21T21:24:18.91Z",
                "reviewBody": "This was a simple and delicious recipe. the batch size was perfect. I Wraped the dough around scrambled eggs, sausage, and cheese before the last proof; it made an easy breakfast sandwich which is portable and hearty. I also used it to make hotdog buns for polish dogs ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefAdams1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2491042/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-11T14:27:53.677Z",
                "reviewBody": "Nice texture and very forgiving...My 3yo and I made these to hold bbq filling this weekend and everyone loved them.  I used the exact ingredients, but mixed them up as we usually do. I let my daughter roll and pat the dough until they were almost flat..but they still rose beautifully. I did end up tossing on some minced onion and poppy seeds which gave \"Tay-Tay's buns\" some extra flavor...Thanks Belle!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LPHILLIPS9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/982019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-12T20:40:26.953Z",
                "reviewBody": "Wonderful recipe. I divided the silky dough into 8 large buns. All the family enjoyed them with the soft crust and chewy soft crumb. The buns were a little thick for our tenderloin sandwiches but would be perfect for hamburgers or cold cuts. The next day the leftovers were great warmed with jam too. I make bread quite often and intend on adding this to the favorites.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Jane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2356786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-06T21:26:35.843Z",
                "reviewBody": "Wonderful buns.  I make them up and keep on hand in the freezer.  So much better and healthier than store bought.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Gillogly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1617389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-25T07:51:04.443Z",
                "reviewBody": "The taste was OK--it tasted a bit salty though. The recipe submitter said they are light and fluffy, but that's not how they turned out for me. They were kinda of hard from the outside and chewy from the inside like french bread. They were also too heavy for a hamburger or hot dog bun. The bread is thick and heavy that it steals the spotlight from the slice of meat or hot dog sausage you use. The bread fills you up before you reach the meat. Perhaps this recipe would be better to use for dinner rolls? Definitely not hamburger buns. Also, I wanted to add that you need way less flour than the recipe calls for. I almost used 4 cups. As soon as I mixed 3 cups of flour w/ the yeast mixture, the forming dough looked dry. The dough was easy to work with. Kneading the dough was the only light & fluffy thing in this recipe. Sorry. I may try again since I like to give some recipes a second chance. We'll see.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Liliana Santos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5489994/"
                }
            }
        ]
    }
]