[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14671/desserts/cakes/cheesecake/chocolate-cheesecake/",
                    "name": "Chocolate Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/126432/master-recipe-for-rich-and-creamy-cheesecake/",
        "name": "Master Recipe for Rich and Creamy Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3592544.jpg",
            "width": 2358,
            "height": 4191
        },
        "datePublished": "2020-06-19T03:25:27.000Z",
        "description": "Make this creamy, decadent dessert, then add zest with new flavors.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT4H35M",
        "recipeYield": "1 cheesecake",
        "recipeIngredient": [
            "1 tablespoon softened butter",
            "3 tablespoons crumbs from Famous Chocolate Wafers, graham crackers or ginger snaps, OR",
            "1 (3 ounce) package soft ladyfingers (24 total) left whole, but trimmed to fit pan",
            "3 (8 ounce) packages cream cheese, at room temperature  ",
            "1 cup sugar",
            "3 large eggs, at room temperature  ",
            "2 teaspoons vanilla extract",
            "¼ cup heavy cream",
            "¼ cup sour cream",
            "Heavy-duty foil for pan"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Adjust oven rack to middle position, and heat oven to 325 degrees. Brush interior of a 9-inch springform pan with butter. Add crumbs of choice and tilt pan in all directions to evenly coat, or line pan sides with ladyfingers. Tear off two long strips of heavy-duty foil, overlap in a cross pattern, and set the pan in the middle. Bring up sides, crimping around exterior top of the pan and forming a tight seal. Set it in a roasting pan large enough to hold it.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat cream cheese with an electric mixer until smooth. Gradually add sugar and beat on medium speed until fully incorporated. Scrape down bowl sides and beat again until smooth. Add eggs, one at a time, scraping down bowl after each addition to ensure a creamy batter. Slowly beat in vanilla, then cream and sour cream. (Meanwhile, bring tea kettle of water to a boil, then turn off heat.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into prepared pan. Set the roasting pan on oven rack and pour in enough boiling water to come halfway up the side of the springform pan. Bake until cake perimeter is set but center still jiggles, about 40 minutes (some flavor variations will take longer). Turn off heat and leave oven door ajar; let cheesecake sit in oven so the residual heat continues to cook it, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pan from water; set on a wire rack. Let cool to room temperature. Cover and refrigerate until well-chilled, about 3 hours (can be refrigerated up to 4 days). Run a sharp knife around the edge of the pan, loosen the spring siding and serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "Chocolate Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "USA WEEKEND Pam Anderson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.862903225806452,
            "ratingCount": 124,
            "itemReviewed": "Master Recipe for Rich and Creamy Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "346.9 calories",
            "carbohydrateContent": "23.9 g",
            "cholesterolContent": "135 mg",
            "fatContent": "25.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "15.3 g",
            "servingSize": null,
            "sodiumContent": "212.9 mg",
            "sugarContent": "17.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-08T15:56:59.077Z",
                "reviewBody": "I have been making cheesecakes for my husband's mens group for almost a year.  I made the Apple Spice Cheesecake for them and have been told this has been the BEST cheesecake I have ever made.  Then I made the Reese's cheesecake for my ladies' group (we need chocolate) and again they also thought it was the best.  I highly recommend and look forward to making more variations!  I did however change the crust to a more traditional graham cracker crust for the Apple Spice cheese cake by using 2 cups graham cracker crumbs, a stick of butter melted, and 1 cup of sugar.  For the Reese's Cheesecake I used the Famous Chocolate Wafers.  I used 2 cups crushed wafers and one stick of butter melted to make the crust.  I like the thicker crusts and could not see how 3 Tbsps. of crumbs could make a crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa from VA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2127239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-25T16:36:26.15Z",
                "reviewBody": "The Master Cheesecake recipe was very light and flavorful with a wonderful soft and featherweight texture.  I followed the recipe's directions exactly, struggling somewhat with configuring the foil around the springform pan, but finally got it right! Also, I used the Famous Chocolate Wafers to coat the sides and bottom of the pan...a very, very thin coating that really didn't leave a crust at all once the cheesecake came out of the oven.  Couple of suggestions: the Master Cheesecake recipe says forty minutes in the oven (in the bain marie).  My batch could have gone another 8-10 minutes (and my oven was calibrated at 325 degrees).  Then, as the recipe stated, I turned off the heat and left the oven door ajar for thirty minutes.  Also, I don't understand just using 3 tablespoons of crumbs to line the sides of the pan...not enough.  Should I have not lined the bottom of the pan?  I guess I am use to the traditional thick graham cracker crust.  Anyway, bottom-line here: excellent taste and texture and so light that you \"almost\" feel guiltless eating it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Joe Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2179681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-19T17:18:56.423Z",
                "reviewBody": "I must say I am a cheesecake Connoisseur.  I have been looking for the perfect cheesecake recipe and after trying this one, I found it.  I love the creamy, light texture. I am not a fan of a thick, dense cheesecake.  I made the original recipe once and the second time swirled some blueberry topping in.  I was asked where I bought the cheesecake and my guests could not believe I made it.  It is absolutely wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "swissmiss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2637119/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T22:42:30.867Z",
                "reviewBody": "STOP LOOKING!  You have found the best cheesecake recipe ever!  I made a traditional graham cracker crust (2 cups graham cracker crumbs , 1 stick of butter, 2 TBSP sugar) and baked an additional 20 minutes before turning the oven off and opening the oven door.  Topped with fresh strawberries and hot fudge.  Amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nincompoop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1878922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T23:43:07.36Z",
                "reviewBody": "I made this according to directions (but with a graham cracker crust) except I didn't use the water bath but put a pan of boiling water under the cheesecake. It was an absolute hit with everyone - except the one son who doesn't like cheesecake at all; he said it was OK. The texture was perfect - not grainy or lumpy. Next time I might add a half teaspoon of lemon extract. This is definitely a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paul Morton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1702764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T21:27:55.2Z",
                "reviewBody": "I make a lot of cheesecake but I usually make it \"simple\" no sour cream and no cream..but I decided to give this one a shot. It was really good! A lot creamier than those that I usually make! Since it was my first time making this one I kept to the original version. I just topped it with blueberries and strawberries. Also I made a more traditional crust. I can't wait to experiment with some variations...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sashi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1782166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-04T18:27:20.183Z",
                "reviewBody": "This cheesecake is great!! The sour cream and heavy cream really do make a difference!! So rich and creamy. I had never baked a cheesecake in a water bath like this before (guess I thought it was too much of a pain) but it makes a HUGE difference. I usually put a lot of toppings on my cheesecakes after they are done but what bothered me is that the tops would always crack and then get hard...putting them in a pan of water like this really does stop this from happening! Cheesecake was nice firm and super creamy (I made the Snickers one)....the best one yet!! Will use this recipe from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhonda Boose Jenkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1811499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-04T19:32:29.14Z",
                "reviewBody": "I made the Lemon version of this cheesecake for Easter and it was marvelous! Very creamy and just the right ratio of tart/sweet. I do not recommend the optional ladyfinger lining. Next time I will make a crust of shortbread cookies. Splurge on a good quality lemon curd. It makes all the difference. Thanks for this keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lora Baughey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2927869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-03T20:48:02.927Z",
                "reviewBody": "My son wanted a \"Plain\" Cheesecake for his birthday. Found this. Since other people would be at the party and want some \"Flavors\" I chose this recipe. IT IS AWESOME. I have made it three times since March. I always make some toppings to go with it. Chocolate syrup peanut butter sauce caramel sauce fruit sauces chopped Reese's peanut butter cups and mini choc. chips. I just make regular graham cracker crust. Also I usually bake for about 10 minutes longer then proceed like normal. Everyone that tries this either wants me to make it for them or they want the recipe. Thank you for our \"Families\" cheesecake recipe!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momto3inIL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2687132/"
                }
            }
        ]
    }
]