[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/724/world-cuisine/european/portuguese/",
                    "name": "Portuguese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/262588/abade-priscos-pudding/",
        "name": "Abade Prisco's Pudding",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5124955.jpg",
            "width": 1424,
            "height": 996
        },
        "datePublished": "2020-06-19T04:27:01.000Z",
        "description": "A velvety and sinful pudding, full of pleasure! Don't let yourself be discouraged from using bacon on this pudding -- the abbot knew what he was doing! You barely notice the pork; however, you get that incomparable taste of the yolks, wrapped with notes of Porto wine. It is velvety and melts in your mouth, vanishing. It's divine! This is a typical pudding from Braga, Portugal, and it was one of the finalists at the 7 Wonders of Portuguese Gastronomy.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup white sugar",
            "½ cup water",
            "1 tablespoon water",
            "2 cups water",
            "2 cups white sugar",
            "4 slices smoked bacon, finely chopped",
            "2 cinnamon sticks",
            "peels from 2 lemons, white pith removed",
            "15 egg yolks",
            "½ cup port wine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 1 cup sugar and 1/2 cup water in a small saucepan over high heat without stirring. Reduce heat to low when sugar reaches an amber color, being careful to avoid burning. Carefully add 1 tablespoon water, stir, and remove from heat. Pour caramel into a lidded pudding pan, making sure to coat the entire inside of the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring 2 cups water to a boil in a saucepan over high heat. Add 2 cups sugar, bacon, cinnamon, and lemon peels. Clip a candy thermometer to the side of the pan. Slowly heat syrup to 217 degrees F (103 degrees C) or until a small amount of syrup dropped in cold water forms a thin thread.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 475 degrees F (245 degrees C) while syrup is cooking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pass egg yolks through a sieve into a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat port wine in a small saucepan over medium heat until it reduces by half, 5 to 7 minutes. Remove from heat and allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the cooled port wine into the yolks, stirring as little as possible to avoid losing the color of the yolks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove syrup from heat when it reaches 217 degrees F (103 degrees C). Pour into a bowl through a sieve to remove other ingredients. Allow syrup to cool slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour yolk mixture into the bowl with the syrup. Pass the mixture through the sieve into a bowl. Pour mixture into the caramel-lined pudding pan. Cover the pan tightly with 2 layers of aluminum foil and the lid. Set the pan into a baking pan filled with an inch of water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake pudding in the preheated oven until set, about 1 hour. Add water to the baking pan if necessary. Remove from the oven and place pan on a wire rack. Let pudding cool until center is lukewarm, at least 1 hour. Carefully unmold onto a serving plate. Refrigerate until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Portuguese"
        ],
        "recipeCuisine": [
            "European",
            "Portuguese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Francisca Azeredo Lobo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 1,
            "ratingCount": 1,
            "itemReviewed": "Abade Prisco's Pudding",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "427 calories",
            "carbohydrateContent": "77.1 g",
            "cholesterolContent": "389 mg",
            "fatContent": "10.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "6.6 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "122 mg",
            "sugarContent": "75.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-02-27T05:07:46.567Z",
                "reviewBody": "Editor's Note: We have corrected the oven temperature in this recipe. Do to an editing error it was listed as 250 degrees F instead of Celsius. We are so sorry for the problems this caused! I had this flan (pudim) in Portugal last year from Doçaria Cruz de Pedra and was blown away! It was AMAZING! As I spoke to one of the bakers there about the recipe I knew it contained port wine and bacon though he told us it was important that it was NOT smoked but rather just cured. But I was anxious to try this recipe as is and made it last night. I typically use recipes as more of a general guide but as I was hoping this would be the recipe of the flan I had in Portugal I followed it to the letter... or thought I did. Unfortunately something went wrong somewhere as it wasn't even thinking about setting up after an hour at 250 F... or two hours at 250.. or another hour at 350. I have a pot of awful looking egg soup that smells like bacon. I hate to give it one star but it is truly inedible. I will try again because it will so be worth it if it's anywhere close to being as good as the one I had in Portugal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Temple McTeer DaSilva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11012551/"
                }
            }
        ]
    }
]