[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/262970/tacros-croissant-tacos/",
        "name": "Tacros (Croissant Tacos)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5174523.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2020-06-19T04:27:15.000Z",
        "description": "Behold the best mashup ever, the croissant taco! Fine masa harina in the croissant dough results in flaky layers with a chewy interior. They're dense on the inside -- the better to hold the fillings -- but if you prefer a more tender, croissant-type texture, decrease the masa, increase the bread flour, and omit the gluten. I've also included lard in the dough, but feel free to use all butter. These don't keep well, so plan to eat them all on the day you make them.",
        "prepTime": "P0DT1H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT9H20M",
        "recipeYield": "10 tacro shells and about 12 tacro cups",
        "recipeIngredient": [
            "1 ½ cups masa harina",
            "½ cup boiling water",
            "12 ounces bread flour",
            "1 tablespoon vital wheat gluten",
            "1 tablespoon white sugar",
            "2 teaspoons salt",
            "1 (.25 ounce) package instant yeast",
            "12 ounces milk",
            "2 ounces lard",
            "10 ounces butter, room temperature"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine masa harina and boiling water in the bowl of a stand mixer. Mix until crumbly and set aside to soften for a few minutes. Combine bread flour, gluten, sugar, salt, and yeast in a small bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour milk into the bowl with the masa; add flour mixture and lard. Mix on low speed with the dough hook until dough is well combined and clears the sides of the bowl, about 2 minutes. Scrape dough down and mix for 5 minutes more to develop the gluten; dough will be very stiff.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough to a lightly oiled bowl and cover with plastic wrap. Let rise at room temperature, about 1 1/2 hours. Place butter in the same mixing bowl and use the paddle attachment on low speed to break it up. Mix just until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scrape butter onto a piece of parchment or waxed paper. Form into a 7-inch square. Cover with another piece of parchment and smooth the top with a rolling pin. Re-form the edges of your square if necessary; a little fussing now will save you some trouble later on as you roll out the dough. Place butter square in the refrigerator to chill.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough onto a floured work surface. Pat it into a square, transfer to a parchment-lined baking sheet, cover with plastic wrap, and refrigerate for 1 to 24 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove butter square from the refrigerator about 20 minutes before you plan to roll the dough; it needs to be cool and pliable.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough onto a floured work surface. Roll it into a square a little larger than the butter square. Leaving a 7-inch square platform in the center for the butter, roll each of the 4 corners of dough out into elongated flaps that can wrap around the butter like a present.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place butter square in the center of the dough, fold up the flaps, and pinch together to seal. Roll dough out into a rectangle. Fold in thirds, like a business letter. Wrap in plastic wrap and refrigerate for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return dough to the work surface; dust with flour if needed. Roll dough out into a longer rectangle; you're going to do a 4-fold, also called the \"book fold.\" Fold the left edge of the dough into the center of the rectangle; fold the right side in to meet it. Then fold it in half again, like a wallet. Return dough to the parchment-lined baking pan, cover with plastic wrap, and refrigerate for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place dough on the work surface, roll out into a rectangle again, and make the final turn: another 3-fold, like a business letter. Cover and return to the refrigerator for 30 minutes; the dough can also be frozen at this point.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice dough in half and return 1 piece to the refrigerator to stay cool. Roll dough out to 1/4-inch thickness. Use a cutter to create 5-inch circles. Transfer circles to a parchment-lined baking sheet and let rise for 1 hour. Shape dough scraps into \"tacro cups\" and place in the cups of a muffin tin; let rise. Repeat both steps with remaining dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Gently fold a dough circle in half to form a taco shell shape; holding it with tongs, lower it into the oil. Hold it closed for about 10 seconds. Fry 2 shells at a time until golden, turning once, about 3 minutes total. Repeat with remaining dough circles, maintaining the oil heat between 350 and 375 degrees F (190 degrees C). Drain tacro shells on paper towels.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake tacro cups in the muffin tin until golden, 15 to 18 minutes. Fill cups and shells with your favorite taco fillings.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "FrancesC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 1,
            "itemReviewed": "Tacros (Croissant Tacos)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "465 calories",
            "carbohydrateContent": "41.2 g",
            "cholesterolContent": "68.4 mg",
            "fatContent": "30.3 g",
            "fiberContent": "3.3 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "17.2 g",
            "servingSize": null,
            "sodiumContent": "643.6 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-03-03T07:48:27.023Z",
                "reviewBody": "Absolutely positively delicious! Reminds me Puffy Tacos, but majorly upgraded. Super flavorful and crispy with an addictive crunch. Great just by themselves, even better with any filling you like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rachelc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22197172/"
                }
            }
        ]
    }
]