[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1116/fruits-and-vegetables/",
                    "name": "Fruits and Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1059/fruits-and-vegetables/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1881/fruits-and-vegetables/vegetables/squash/",
                    "name": "Squash",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/130800/holiday-pumpkin-cake-with-rum-cream-cheese-glaze/",
        "name": "Holiday Pumpkin Cake with Rum-Cream Cheese Glaze",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1075418.jpg",
            "width": 2554,
            "height": 1958
        },
        "datePublished": "2020-06-19T03:26:51.000Z",
        "description": "This cake is a huge hit with my family during the Thanksgiving and Christmas holidays. It's very moist and just melts in your mouth. It's a yummy alternative to traditional pumpkin pie. This cake is good as is, or sprinkled with powdered sugar. It is especially tasty with a good glaze drizzled on top. The glaze that my family likes best is made with cream cheese and a little bit of rum.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 cups self-rising flour",
            "3 teaspoons pumpkin pie spice",
            "1 ½ cups white sugar",
            "½ cup light brown sugar, packed",
            "½ cup vegetable oil",
            "¼ cup melted butter",
            "½ cup unsweetened applesauce",
            "1 ½ teaspoons vanilla extract",
            "3 cups unsweetened canned pumpkin puree",
            "4 eggs, lightly beaten",
            "1 (4 ounce) package cream cheese, softened",
            "1 tablespoon butter, softened",
            "2 cups confectioners' sugar",
            "1 teaspoon rum extract",
            "1 tablespoon milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a Bundt pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift the self-rising flour and pumpkin pie spice together into a bowl. In another mixing bowl, beat the white and brown sugars, vegetable oil, melted butter, applesauce, vanilla, pumpkin, and eggs together until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gradually beat the flour mixture into the pumpkin mixture, 1/2 cup at a time, until completely smooth and well blended. Pour the batter into the prepared Bundt pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 60 minutes. Cover cake with aluminum foil to prevent over-browning, and bake until a wooden skewer inserted into the cake comes out clean, 15 to 20 minutes longer. Cool the cake in the pan on a wire rack for about half an hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To unmold the cake, tap the bottom of the Bundt pan on the counter or work surface to help release it. Invert the cake on a serving plate and allow it to cool completely before glazing.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the glaze, mix the cream cheese with the butter, confectioners' sugar, rum extract, and milk in a bowl. Heat in a microwave oven for 15 seconds. Drizzle spoonfuls over the cooled cake. Keep cake refrigerated after serving.\n"
            }
        ],
        "recipeCategory": [
            "Fruits and Vegetables",
            "Vegetables",
            "Squash"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kristi Catalani"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.134615384615385,
            "ratingCount": 52,
            "itemReviewed": "Holiday Pumpkin Cake with Rum-Cream Cheese Glaze",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "492.2 calories",
            "carbohydrateContent": "76.3 g",
            "cholesterolContent": "85.2 mg",
            "fatContent": "19.3 g",
            "fiberContent": "2.5 g",
            "proteinContent": "5.7 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "501.2 mg",
            "sugarContent": "56.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-28T16:20:59.21Z",
                "reviewBody": "I feel bad to be rating a recipe so low but there are some pretty big problems with this one. First please be aware that the recipe calls for self-rising flour not all-purpose. I did not notice this until after mixing it all together and realizing there was no baking powder or baking soda in the recipe! I managed to mix in a tsp. of baking powder at the end before baking but ideally it should be added with the dry ingredients. I believe 3 cups of pumpkin puree is too much. All I had on hand was a 15 oz. can and it was plenty. Also there is no baking time indicated! It just says to bake it till done. I baked mine till a toothpick came out clean (approx. 55-60 min.) but the texture towards the middle of the cake was a little too dense and almost undercooked so I think it could have used a bit more time in the oven or maybe that is just the texture of this cake. I really wanted to like it for a Fall recipe but it needs some fine tuning.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-30T20:32:26.603Z",
                "reviewBody": "Awesome cake, and actually Valerie there is a cookoing time- 1 hr. and all cooks should read the recipe before cooking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Thompson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3129641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-10T23:49:40.917Z",
                "reviewBody": "Wonderful, fabulous, superb, and every other splendiferous adjective you can come up with! I used cooked, mashed sweet potatoes in place of the pumpkin because they were $.25 a pound today. Laced the cake with 2 Tb of rum and added 2 tsp ginger. How to make your own self rising flour: Measure 2 cups all purpose flour and in a bowl. Remove 1 tablespoon (either discard that Tb or return it back to the flour bag.) To the remaining scant 2 cups of flour, add 1 tablespoon baking powder and 1/2 tsp salt. Mix together with a whisk. Voila! Your own self rising flour. Baking took 75 minutes in my recently calibrated oven to get a clean toothpick with only a few, tiny crumbs clinging. Made the glaze with 1 Tb Tortuga Gold rum and replaced the milk  with orange juice, adding a half tsp freshly grated orange zest. The orange imparted subtle counterpoint to the spices and gave a fresh, bright taste. This cake bakes up nice and high for a stunning presentation. It's an impressive cake for important events, like big holiday parties or family gatherings. Your baking skills will be impossible to deny if you make this one. It's a show-stopper for sure, and as super moist and delectable as it was beautiful to look at. Thank you for an outstanding holiday recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-04T20:22:39.207Z",
                "reviewBody": "My family loved this cake.  I like recipes specifically for my Bundt cake pan because a little dusting of powdered sugar dusting will do when you want to cut back on calories or just lighten it up.  The glaze is delicious if you want to go all the way.  This is now a permanent part of my holiday recipe collection because it is so easy to take to the bake sale or holiday dinner.  When I take this cake out I make sure to substitute orange extract, dried or fresh orange peel, OR vanilla extract for the rum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathi Summerfield",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2792812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-04T20:43:36.67Z",
                "reviewBody": "This review is for the glaze only. No snub to the cake recipe intended at all, it's just that I had a cake mix I wanted to use.  If the cake is as good as the glaze I will be sure and remember to try that too.  This glaze is perfect and awesome good! The measurements are right on, the consistency is perfect and the rum extract is a creative and brilliant addition for a pumpkin cake.  In addition to being delicious it's a beautiful glaze too, lusciously thick and glossy.  I'll definitely keep this glaze in mind for other cakes in the future too, varying flavors as the cake would dictate.  Excellent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-18T17:11:27.397Z",
                "reviewBody": "I made the Rum - Cream Cheese Glaze to pour over a spice cake. It was wonderful and very easy to make. Thank you! I will try it with the pumpkin cake next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "netka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2622144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-04T00:16:35.08Z",
                "reviewBody": "Just wanted to say the glaze was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katie_luvs2bake!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/katie_luvs2bake/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-10T18:47:08.187Z",
                "reviewBody": "This review is for the glaze...yummy! The perfect topping for a pumpkin cake. I made this in a glass bowl sitting on top of a small pot of simmering water. Stirred with a hand blender for a smooth consistency. The only thing I would change is two tablespoons of milk this is a bit thick. THANK YOU for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAILORTIFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/979810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-03T22:02:54.46Z",
                "reviewBody": "I made this cake twice: the first time I used the specified 3 cups of pumpkin and the cake deflated into a dense chewy not-so-hot excuse for a cake while it cooled. Then I made it a second time with only 1 1/2 cups of pumpkin and the result was an unbelievably delicious cake that was devoured in a single day at my husband's office and won me a reputation for culinary brilliance. The moral is that this cake deserves five stars IF YOU CUT THE PUMPKIN IN HALF. Otherwise it barely rates three. On the other hand the glaze was deliciously addictive!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JLamb36",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2624327/"
                }
            }
        ]
    }
]