[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/113/appetizers-and-snacks/pastries/",
                    "name": "Pastries",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/268998/texas-sausage-kolaches-klobasneks/",
        "name": "Texas Sausage Kolaches (Klobasneks)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8038455.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T04:33:27.000Z",
        "description": "I grew up in Central Texas, where kolaches and sausage kolaches (also called klobasneks) were plentiful. Every donut shop and bakery had them. Then I moved to Seattle, where nobody had heard of them! I couldn't find a decent recipe online. Everything I tried didn't turn out as fluffy, sweet, and heavenly as the kolaches I know and love. I cobbled together this recipe for what I think is the perfect sausage kolache.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "½ cup milk",
            "½ cup white sugar",
            "1 teaspoon salt",
            "¼ cup unsalted butter",
            "2 (.25 ounce) packages active dry yeast",
            "½ cup warm water",
            "2 large eggs, beaten",
            "4 ½ cups all-purpose flour",
            "1 (8 ounce) smoked breakfast sausage links (such as Eckrich®)",
            "1 (8 ounce) package sharp Cheddar cheese",
            "4 tablespoons unsalted butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat milk in a small saucepan over medium heat until it begins to bubble. Remove from heat immediately. Stir sugar, salt, and 1/4 cup butter into the milk and stir until sugar is dissolved. Set aside to cool to room temperature, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine warm water and yeast in the large bowl of a stand mixer and stir until dissolved. Stir in cooled milk mixture, eggs, and 2 cups flour. Beat using the dough hook attachment until smooth. Add remaining flour, mixing as you go, just until dough is elastic and slightly stiff, but not dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough out onto a floured board and knead until smooth and very elastic, 10 to 15 minutes. Coat dough lightly with butter or oil and place in a bowl. Cover with plastic wrap or a damp towel and let sit in a warm place to double in size, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, cut sausages in half and pat dry; this is important. Thinly slice Cheddar cheese block from the short end so that each slice of cheese is about the same length as the halved sausages.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly oil a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn risen dough out onto a very lightly floured board. Roll into a log, cut into 5 equal pieces, and cut each piece into quarters to make 20 equal-sized pieces of dough. Use the palm of your hand to flatten and press 1 piece into a circle or oval. Place the circle on the board and add 1 piece of Cheddar cheese topped with 1 dry halved sausage. Roll dough around fillings and very tightly pinch all seams together to seal. Smooth seams down and place kolache on the prepared baking sheet. Repeat with remaining dough and filling to make 20 kolaches.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden, 12 to 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Pastries"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Krissi Abbott"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 20,
            "itemReviewed": "Texas Sausage Kolaches (Klobasneks)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "264 calories",
            "carbohydrateContent": "27.4 g",
            "cholesterolContent": "50.8 mg",
            "fatContent": "12.8 g",
            "fiberContent": "0.9 g",
            "proteinContent": "9.4 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "367.3 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2020-03-30T20:49:51.64Z",
                "reviewBody": "I live on the outskirts of Houston and my kids love kolaches.  However, during the lockdown we were not running to the donut shop so I wanted to make them some.  This recipe is as close to our donut shop version as I've found.  I used the larger version of Little Smokies sausage and made more of an oval kolache with sausage and cheese.  The dough came out great.  Thank  you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John David Plumpton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14993709/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-01-20T07:26:59.41Z",
                "reviewBody": "I reduced the salt to 1/4 tsp and used salted butter. I warmed the water to 110 degrees before adding 4 tsp of bread machine yeast. I used 2c bread flour and 2c all-purpose flour. My KitchenAid mixer with dough hook attachment was used to knead the dough 4 minutes on the lowest setting (stir). The recipe made 36 oz of dough I divided into 20 portions, 1.8oz each, that I flattened into 3\" x 3\" squares and wrapped around 1.5\" lengths of fully cooked chicken breakfast sausage and 0.2oz of shredded cheddar cheese. The dough wrapped sausages were then placed seam side down and evenly spaced on a parchment lined baking sheet, left to rest for 30 minutes, then baked at 350 degrees for 15 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2622862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-05-02T19:21:57.4Z",
                "reviewBody": "I had some issues using a food processor instead of stand mixer, so I recommend mixing from hand, if yours is broken like mine??. But, when those sweet babies came out of the oven, the family thought it was the coolest thing they had ever seen!  They ate em up like they were starving!  I’ll definitely be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michele Key Ward",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27462282/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-20T10:21:26.84Z",
                "reviewBody": "I am not a Texan but I ate these while in Texas and wanted to find a recipe.  These taste like the ones we had. The dough was easy to make and work with.  I had a couple of small changes to my recipe.  I used a bread machine and I used oil instead of the butter. I made two types and both kinds were good.  One had sausage and cheese and the other sausage, sauerkraut and cheese.  For the sausage and cheese I used half of full polish sausage. For the ones with sauerkraut, I used 1/4 of a polish sausage. I rolled each dough piece into a rectangle and then added the filling and completely pinched it all closed - similar to the pictures.  I will definitely be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NorthbyNorthwest",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6195547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-05-11T07:49:03.957Z",
                "reviewBody": "I am so happy with how easy this recipe was to follow. This is the first time I’ve ever tried to make these. Growing up in Texas they were everywhere and it’s the one thing I have to go find when I go visit home so being able to make some of my own makes those trips a little easier to endure.  I think the trick here is using a sausage that meets the craving so I used a dinner sausage instead and came out really well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Stewart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27514851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-03-24T23:31:55.193Z",
                "reviewBody": "Once I worked out the details, it turned out to be a wonderful kolache recipe. \n-Add flour incrementally until dough is slightly sticky but still elastic. The first time I made this I added all the flour at once and ruined the batch, because it was too stiff and dry. I ended up using 1 full cup less flour than what is called for. \n-I used ground sausage, eggs and cheese, and would recommend weighing the finished dough, and then dividing by the number of desired kolaches. I did not do this, and my sizes ended up all over the place. Ended up with 25, roughly baseball size, and used .75 lbs ground sausage (Tbs per kolache), 7 medium scrambled eggs (tsp per kolache). \nAll in all, very popular with friends and family, and will make again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25464151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-05-12T03:39:11.54Z",
                "reviewBody": "This was delicious. I brushed some egg on the top to add a little color.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lizzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1854400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-08-05T23:09:54.887Z",
                "reviewBody": "Fantastic! I lived in Breckenridge,  CO and a guy from Texas that worked for me would bring these almost everyday one summer. I made this recipe just as written, only baked them at 350 for about 20 minutes, brushing with butter half way through. Sooo good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/30297826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-05-25T05:25:47.13Z",
                "reviewBody": "I live in Houston and these are the real deal! I made these with pepper jack instead of cheddar. I also made a few with a blackberry jam filling instead. Everyone loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HeatherG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25443135/"
                }
            }
        ]
    }
]