[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/134553/avocado-lime-cheesecake/",
        "name": "Avocado Lime Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F437356.jpg",
            "width": 5070,
            "height": 3276
        },
        "datePublished": "2020-06-19T03:27:20.000Z",
        "description": "I love Mexican food, but Mexican desserts are limited. Flan is great, but not every time. This recipe has real Mexican flavor with avocados and lime. My friends make me make it constantly. It is unique, easy, and fabulous. You must have an ice cream maker.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT3H35M",
        "recipeYield": "1 9-inch cheesecake",
        "recipeIngredient": [
            "1 ½ cups heavy whipping cream",
            "¾ cup white sugar",
            "1 ½ ripe avocados, peeled and pitted",
            "2 (3 ounce) packages cream cheese, softened",
            "½ cup fresh lime juice",
            "1 (8 inch) prepared graham cracker crust"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat cream in a small saucepan until small bubbles appear around edges. Remove from heat and stir sugar into cream until it dissolves. Transfer to a medium bowl and allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine avocado and cream cheese in a food processor and blend until smooth. Add lime juice and process until smooth; whisk into the cooled cream mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill an ice cream maker with the avocado mixture, and freeze according to the manufacturer's instructions for making ice cream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon avocado mixture into the prepared pie crust; smooth surface with a spatula. Freeze until solid, at least 2 hours. Let cheesecake sit at room temperature until slightly softened yet firm enough to slice before serving, 10 to 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Todd"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.672727272727273,
            "ratingCount": 55,
            "itemReviewed": "Avocado Lime Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "470.1 calories",
            "carbohydrateContent": "39 g",
            "cholesterolContent": "84.5 mg",
            "fatContent": "34.8 g",
            "fiberContent": "2.9 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "16.9 g",
            "servingSize": null,
            "sodiumContent": "204.5 mg",
            "sugarContent": "27.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-13T02:47:49.623Z",
                "reviewBody": "Turned out great I skipped the ice cream making part because I don't have one. I just poured it in the shell and froze. it went quick at the party though it tasted more like key lime pie you couldn't really taste the avocados",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren Adams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2345663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-07T17:34:44.193Z",
                "reviewBody": "I've made this incredible dish three times with rave reviews.  I did not have an icecream maker so just froze it in a glass dish.  I served it in champagne glasses, sprikled it with extra-dark chocolate shavings with a dab of whipped heavy cream.  I used fresh edible flowers and mint leaves for garnish!  It looked beautiful and tasted even better!  Great Dessert!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susie Q",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4782270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-15T20:05:52.963Z",
                "reviewBody": "Amazing! Didn't have an ice cream maker. Threw it in the freezer took it out a few hours later and used hand blender... then froze it until i served it the following day. My friends LOVED IT.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ACL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2291162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-10T04:37:03.807Z",
                "reviewBody": "This was very easy to make (I used an ice cream maker). It was a nice refreshing desert that wasn't too heavy. A great way to top off taco night! I added a splash of tequila when the filling was in the ice cream maker which was a delicious twist!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon Bachorick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1030630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-09T16:06:40.873Z",
                "reviewBody": "I made this recipe without a icecream maker. I mixed in my blender and then poured into pie shell and froze. I did exactly the recipe and it was fabulous. I took it to work along with chicken taco soup. My co-workers could not believe there were avocados in there. The only thing is you can't leave it out long or it will get to soft. But the taste is great and it is a very light key lime pie. I garnished mine with small lime wedges.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lynette exline",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2010938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-23T19:35:21.767Z",
                "reviewBody": "What can I say about this.....? It was great. And no...no one could tell it had avocados in it. Unless I told them....it tasted like a lime ice cream treat. I wouldn't call this a cheesecake at all. Even though it had it in there you could only taste that slightly. It was more or less....to me and my family like ice cream. I used my ice cream maker with this and it froze very well. It could go great by it's self in a bowl with a spoon or in a graham cracker crust but it melts fast too. So don't let it sit out long. Or you'll have a serious mess on your hands. My family liked it and said it tasted really good. And we had never tried anything like this so it was a total change of flavor for us. I had to double the batch because I didn't want to waste any avocados and we don't find 3oz pkg of cream cheese around here. Thank you I will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-17T17:46:05.157Z",
                "reviewBody": "Excellent excellent excellent! I have found another way to prepare avocados! I made this tonight and because I didn't have an ice cream machine I followed the advice of some of the other members and froze it! After dinner and cleaning up the dishes I took the pie out and cut two slices for myself anf for my husband. We both enjoyed this so much and I have a feeling this won't last long! I used a prepared graham cracker crust that I had followed the ingredients and all I can say is WOW! The only thing I might do different when I make this again is probably add a little more cream cheese and perhaps some vanilla extract. I used light cream and liked the taste! The avocados I used were slightly over riped but they worked just fine. I will purchase fresh and ripe avocados the next time and really have great pie! Thank you for submitting this recipe! My grandson loves avocados and I do believe he will like this as much as we did! Thanks again! This is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4666253/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-06T20:34:24.023Z",
                "reviewBody": "Fabulous! I made per recipe originally with an ice cream maker then made two more pies for Bunco night...adding 2 tsp lime zest to bump up the lime flavor. I did make the cream/sugar mix the night before and chilled and used chilled ripe avocados to help it freeze up faster and it worked well. This is a keeper and so creamy...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeannine Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2578464/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-11T16:58:55.72Z",
                "reviewBody": "Like another reviewer said it tastes like a light key lime pie. I also did not use an ice cream maker. I just spooned the mixture right into the crust and put it in the freezer for a few hours. I used a shortbread pie crust instead of the graham cracker crust. I took this to a family get-together and at first they were skeptical but in the end there were no leftovers! Very yummy end to a hot day in GA!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ariel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2731447/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-31T01:00:44.233Z",
                "reviewBody": "I don't have a food processor so I tried to chop up the avocado using a blender. That worked OK--I had thought the avocado might end up the consistency of cream cheese but it was chopped up into very fine pieces. I then added the cream cheese to the blender and that was a disaster. It really didn't mix with the avocado. I ended up dumping the mixture into a bowl and used a fork to mix it. I didn't use fresh lime juice so used bottled. I didn't have quite enough so added some bottled key lime juice. I poured the mixture directly into a prepared crust and put in the freezer. I brought it to a Christmas dinner. My friend really liked it and said it tasted like key lime pie. I concur. I don't know that I would make this again. I have made the Key Lime VII pie recipe from this site and that is easier and tastes the same if not better (although the VII recipe has more calories).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "bmcdonald01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2162201/"
                }
            }
        ]
    }
]