[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/396/desserts/cakes/spice-cake/",
                    "name": "Spice Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/136566/georgias-tennessee-jam-cake/",
        "name": "Georgia's Tennessee Jam Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F591454.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:27:55.000Z",
        "description": "This rich holiday dessert was invented by my grandmother and is a tradition in our house over Christmas.  These ingredients were originally the authentic thing -- homemade jam, buttermilk out of the churn, and walnuts you gather and crack yourself.  Now we use purchased items, but the cake is just as good. Frost with homemade caramel frosting, or your favorite cream cheese frosting.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "1 - 3 layer cake",
        "recipeIngredient": [
            "1 cup butter, softened",
            "2 cups white sugar",
            "8 eggs",
            "2 teaspoons baking soda",
            "2 tablespoons water",
            "2 cups seedless blackberry jam",
            "3 ½ cups all-purpose flour",
            "1 ½ teaspoons ground cloves",
            "2 teaspoons ground nutmeg",
            "1 tablespoon ground cinnamon",
            "1 teaspoon salt",
            "1 cup buttermilk",
            "1 cup chopped black walnuts",
            "½ cup golden raisins"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease three 8 or 9 inch round cake pans and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat butter and sugar until light and fluffy. Add eggs one at a time, mixing until each one is blended in. Dissolve the baking soda in the water; stir into the batter along with the blackberry jam. Combine the flour, cloves, nutmeg, cinnamon and salt; stir into the batter by hand, alternating with the buttermilk. Fold in the black walnuts and raisins if using. Divide the batter equally between the three pans, and spread in an even layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the top of the cakes spring back when lightly touched, about 35 minutes. Cool in the pans until cool enough to handle, then invert the cakes over a wire rack and remove pans to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Spice Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Amy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8,
            "ratingCount": 20,
            "itemReviewed": "Georgia's Tennessee Jam Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "684.9 calories",
            "carbohydrateContent": "106.6 g",
            "cholesterolContent": "165.5 mg",
            "fatContent": "25.6 g",
            "fiberContent": "2.5 g",
            "proteinContent": "11.6 g",
            "saturatedFatContent": "11.4 g",
            "servingSize": null,
            "sodiumContent": "583.2 mg",
            "sugarContent": "73 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-26T21:49:46.753Z",
                "reviewBody": "Georgia was my grandmother, but she passed away in January of this year.  She was poor and had no access to cookbooks. Of course, there are tons of jam cake recipes out there, but this was her own special recipe, written and modified many times to make good use of the things she had lots of -- homemade blackberry jam, walnuts, buttermilk, butter and eggs.  I can't speak for anyone else's recipe, but my grandma's special tricks included cutting circles from brown paper, greasing those with butter, and lining her round cake pans to keep the cakes from sticking.  She was a phenomenal person.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-26T22:42:51.707Z",
                "reviewBody": "My grandmother too was a proud Virginia lady who called her recipes receipts (which is the traditional old English way).She called her jam cakes Tennessee Jam Cake because she had eaten her first one at a wedding there and had requested the recipe from a cousin who had cooked it for the wedding feast. It is entirely correct to call a jam cake in the south Tennessee Jam Cake because it is traditionally associated with that state and its long and noble culinary traditions- no matter where it was invented -England has a very similar cake- it is Tennessee Jam Cake! Last word! Tradition rules! Oh yes I can't imagine anything but burnt sugar icing on jam cake; by all means try cream cheese but I think you will go back to caramel. I use cream to keep the burnt sugar from curdling- forget the calories! My grandmother beat the egg whites separately to lighten the cake. Misha",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "misha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3583620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-09T17:08:48.7Z",
                "reviewBody": "Great taste. I was curious on this and wanted to try it out for my father-in-laws birthday. This came out similar to what I would consider a spice cake and I did not really taste the jam. Thank you for sharing the recipe and your story about Georgia.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy Humfleet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3074294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-25T16:58:41.573Z",
                "reviewBody": "This is an exceptionally good spice cake. However the blackberry really didn't come through with so much clove and nutmeg added. The jam's real purpose seems only to be to moisten the cake. For that you could just use applesauce as a cheaper alternative. For my second attempt I drastically reduced the amount of clove and nutmeg to 1/2 tsp each and added 4 tbsp of blackberry liquor. Both cakes got rave reviews but the second was more \"blackberry\" IMHO. As a side note I frosted the first cake with cream cheese icing and found it to be way to sweet for my taste. My family ended up just scraping the icing off. Also for both cakes I spread blackberry jam between the layers. Finally as with most fruit and vegetable based cakes and breads this gets better with age.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bruce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4824373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-17T23:40:55.74Z",
                "reviewBody": "I hate to tell you this but my grandmother made that exact same cake more than 60 years ago in Arkansas. I don't know where she got the recipe but I have it and I have loved it all these years including the black walnuts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bjr6350",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8057210/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T22:56:54.26Z",
                "reviewBody": "This is an excellent cake recipe -- very moist and full of flavor. I used fresh nutmeg which was a nice fresh touch to it. The cake was very dense but the three layers was a nice contrast to the density. I used a caramel frosting which was nice but I think it would also be great with a cream cheese frosting and think I would prefer the tang of that next time. I also subbed chopped dates for the raisins and you don't notice them once baked -- they just give the cake a nice richness. Did not use the nuts. On one of the inside layers did a layer of blackberry jam instead of frosting -- would recommend that; it was nice. Also would suggest heating your jam a bit before adding to the batter if it's cool out because I had trouble getting it to blend in; it clumped a bit. Overall really nice cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crystalg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6808569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-04T23:28:24.117Z",
                "reviewBody": "My family and I really enjoyed this cake and found it as described. It does not taste like blackberry jam; however the jam does impart a very unique flavor to the cake especially alongside the spices and also adds to the texture of the cake which is quite dense but not heavy or leaden. Also to be mentioned is that the next day the cake tasted even better the flavors melded were enhanced and the cake was very moist. I think next time I will make it the night before and store it. NOTE: It makes a ton of batter enough for two bundt cakes so I recommend halfing the recipe or making two cakes. In American recipes I always half the sugar (1 cup) which I did with this recipe. Especially with the jam which has loads of sugar in it anyway. The sweetness was perfect. I also substituted 1 cup of toasted pecans because we do live in the south where they are plentiful and reasonably priced. I omitted the raisins. I dusted the finished cake with powdered sugar and garnished with fresh blackberries. Also had some canned whipped topping for each plate. Very elegant. I would recommend this cake as it tastes delicious and unique plus it makes a beautiful presentation. (I have posted a pic.) Thanks to Amy and her gramma for this traditional recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mamzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10673319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-23T21:38:09.163Z",
                "reviewBody": "This is a nice cake. It makes a lot--I made a full bundt cake and 12 cupcakes. I don't have a clue what I'm going to do with it all so it's a good thing it tastes good! It is very reminiscent of a spice cake--all those spices really jack up the flavor. I didn't have blackberry jam so I used strawberry freezer jam I had made a while ago. I can taste the jam if only slightly but it goes well with the other flavors in this cake. I actually had walnuts (we usually don't have them--bf doesn't like them) so I tossed those in along with the raisins. I didn't use golden raisins though--just regular. This cake turns out very sweet so I personally don't think it needs an icing or glaze at all. I just sprinkled it with powdered sugar and called it a day. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-31T16:40:29.633Z",
                "reviewBody": "A very nice cake! Not too dry at all - just right. I scaled your recipe by 3/4 and as it baked it rose to fill two 9 x 1.5 pans. I buttered and floured the pans well but it still stuck a bit. I will use parchment paper next time. I boiled a can of sweetened condensed milk to make dulce de leche and used that as my topping - came out great! Thank you for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beagle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6789944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-21T13:16:28.330Z",
                "reviewBody": "This recipe is from a  Better Homes and Garden cookbook. It’s a lovely cake but a bit too spicy as written. Worth a try if you know how to edit spice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27392361/"
                }
            }
        ]
    }
]