[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/136587/fastelavnsboller-fastelavn-buns/",
        "name": "Fastelavnsboller (Fastelavn Buns)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F216329.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:27:56.000Z",
        "description": "Traditional Danish buns with a custard-type cream and chocolate icing are always eaten by children on Fastelavn, which falls around Shrove Tuesday.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "18 buns",
        "recipeIngredient": [
            "3 (0.6 ounce) cakes compressed fresh yeast",
            "1 cup warm milk (110 degrees F/45 degrees C)",
            "½ cup melted butter",
            "2 eggs",
            "1 ½ teaspoons salt",
            "2 teaspoons white sugar",
            "4 cups all-purpose flour, or as needed",
            "1 cup milk",
            "1 tablespoon cornstarch",
            "2 eggs",
            "2 tablespoons white sugar",
            "1 teaspoon vanilla extract",
            "1 beaten egg",
            "¾ cup confectioners' sugar",
            "1 tablespoon hot water",
            "2 tablespoons cocoa powder "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast in the warm milk in a small bowl; allow to stand for a few minutes until it becomes foamy. Whisk together the butter, 2 eggs, salt, 2 teaspoons sugar, and yeast mixture until the sugar has dissolved. Stir in flour to form a smooth dough. Cover with a cloth and allow to rise in a warm place until doubled in bulk, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, whisk together 1 cup of milk with the cornstarch in a small saucepan. Cook over medium heat until very hot and steaming, but not quite simmering. Whisk 2 eggs together with 2 tablespoons sugar in a bowl until well beaten. Slowly whisk in half of the hot milk mixture, adding it about 2 tablespoons at a time until incorporated. Stir the egg mixture into the saucepan of milk, and cook gently until thickens and begins to bubble. Remove from heat and stir in vanilla extract. Set the filling aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C), and line 2 baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, and divide it into two pieces. Roll each piece into a 12x12 inch square, and cut each square into 9 equal pieces about 4 inches on a side. Place about 1 tablespoon of the filling into the center of each piece, and fold a corner across over the filling. Fold the opposite corner across and seal the corners over the filling. Fold the two remaining corners across the filling and seal to make a tidy packet enclosing the filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the filled buns, folded sides down, on the prepared baking sheets, and brush each bun with beaten egg. Bake in the preheated oven for 15 minutes, until the buns are golden brown, and let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir together the confectioners' sugar, hot water, and cocoa powder in a bowl, and spread the icing onto each bun.  Refrigerate leftover buns.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mobygirl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.75,
            "ratingCount": 4,
            "itemReviewed": "Fastelavnsboller (Fastelavn Buns)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "214 calories",
            "carbohydrateContent": "30.9 g",
            "cholesterolContent": "67.4 mg",
            "fatContent": "7.4 g",
            "fiberContent": "1.2 g",
            "proteinContent": "5.9 g",
            "saturatedFatContent": "4.1 g",
            "servingSize": null,
            "sodiumContent": "262.3 mg",
            "sugarContent": "8.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-05-07T00:22:10.907Z",
                "reviewBody": "This was my first time making these however I have made different kinds of breads before..I think this would be tricky for someone who never made bread..I liked them but I think it would be better if the pudding center was piped into the buns after they cooled..I found that the bread absorbed the pudding as it cooked...and what was left was too thick and slightly eggy..overall this was a nice recipe and I had fun making them...thanks for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Goguen Fortin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3333873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T22:21:50.593Z",
                "reviewBody": "After baking I would pipe the the custard in the roll. This was very difficult recipe thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "frankaff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3965716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-20T03:18:49.027Z",
                "reviewBody": "I was looking for a recipe for my Norwegian S/O who was feeling a little homesick and this was closest recipe in English to what his family makes. I did make a couple changes-For the dough, I used about 2/3 of a cup of sugar and I mixed in about a tsp of cardamom with the flour and salt. I added the flour about a half cup at a time, and after the first cup, I started mixing with a rubber spatula. IMO, when you don't have a stand mixer to do the work for you, this is the best way to get the ingredients mixed evenly. For the custard, I used three egg yolks instead of the regular eggs, and mixed all the ingredients before heating. When making the buns, I separated the dough into the 6 pieces(the S/O kept emphasizing how huge the roles were supposed to be) and then rolled each ball out to a quarter inch thick. I was able to put about 2 tbsp of custard in there, which is important, because I've heard if you don't have enough it can just bake into the bread. And then after I folded them together, I let them rise again for about a half hour. for the topping, I made a simple icing with powdered sugar and water, dipped the tops of the buns in it once they were cool, and then dipped them in finely shredded coconut. ANYWAY the result was awesome, and most importantly, my S/O was able to feel a little bit of home away from home. Thanks for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Elle Anderson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14078655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-21T06:10:37.913Z",
                "reviewBody": "After reading the reviews I decided to roll out the dough into small rounds and allowed them to rise an additional 30min prior to baking them. After I baked them I allowed them to cool for a few minutes and hollowed them out a little with a skewer. I then piped the custard in the buns. I also filled a few with Nutella. It was a hit at a Christmas party!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13671446/"
                }
            }
        ]
    }
]