[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/219/salad/vegetable-salads/",
                    "name": "Vegetable Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15106/salad/vegetable-salads/asparagus-salad/",
                    "name": "Asparagus Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/138138/red-cabbage-asparagus-salad-with-tahini-dressing/",
        "name": "Red Cabbage-Asparagus Salad with Tahini Dressing",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8644378.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:28:59.000Z",
        "description": "Crispy, colorful, tangy and delicious.  This salad is quick to throw together and is super healthy!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H3M",
        "totalTime": "P0DT0H33M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 bunch asparagus, ends trimmed ",
            "2 tablespoons tahini",
            "1 tablespoon water",
            "2 tablespoons lemon juice",
            "1 clove minced garlic",
            "white sugar to taste",
            "¾ pound thinly sliced red cabbage",
            "2 radishes, thinly sliced",
            "2 green onions, sliced",
            "2 tablespoons crumbled feta",
            "¼ cup toasted pine nuts",
            "2 sprigs dill, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of salted water to a boil over high heat. Blanch asparagus until just tender, drain, and immediately plunge into ice water to stop the cooking process. When the asparagus is cold, drain and slice on the diagonal into 1-inch pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together tahini, water, lemon juice, and garlic. Stir in sugar to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Toss together asparagus, red cabbage, radishes, green onions, feta, pine nuts, and dill in a large bowl. Pour in tahini dressing and mix to combine.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Vegetable Salad Recipes",
            "Asparagus Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GKT"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.269230769230769,
            "ratingCount": 26,
            "itemReviewed": "Red Cabbage-Asparagus Salad with Tahini Dressing",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "161.2 calories",
            "carbohydrateContent": "15.5 g",
            "cholesterolContent": "4.2 mg",
            "fatContent": "9.6 g",
            "fiberContent": "5.5 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "89.7 mg",
            "sugarContent": "6.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-08T22:15:19.443Z",
                "reviewBody": "THIS RECIPE IS AMAZING! The most important ideas/comments/notes are: 1. The dressing IS incredible! I've been looking for the perfect lemon tahini dressing ever since I ate at Mountain Oasis in Flagstaff Arizona and this one is a close second! I doubled it and saved the rest for a simple green salad the next day. 2. I added about a cup of thinly sliced jicama to add another color flavor and crunch to this dish. I'm considering a beet as well for next time. 3. I used the feta as an optional topping. I used one dish of plain feta and one with a mixture of the feta and dill (I omitted the dill from the raw recipe). 4. Leaving the mixture in the fridge for a couple of hours does help the flavors blend better than serving it right away. 5. A pinch of celery salt is nice to add as well upon serving. 6. Next time I'm going to toast some pecans with some sugar and cayenne to add as another optional topping. To toast: Make sure all nuts are coated with butter before sprinkling the sugar and cayenne (VERY LITTLE cayenne goes a long way!). Spread them in a single layer at 375 degrees for 10-15 minutes (until you can smell them... mmmmm!). 7. This recipe still deserves five stars even though I tweaked it a little! It's nice and simple and tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Abbott-Gee, NBCT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1619139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-06T20:34:27.3Z",
                "reviewBody": "This salad tastes way better on the second day! It was pretty good the evening I made it but when I brought it for lunch the second day it was even better. (If you intend to keep it over night don't add the cheese until you are ready to serve individual portions as it will start to run when it mixes witht the dressing.) The cabbage was just too crisp the first time around after it had a chance to soften up in the fridge overnight and mingle with the dressing it was just right. It might have helped if I had sliced the cabbage a little thinner....but I tried to keep it about the same size as the asparagus. I doubled the amount of the dressing because I LOVE LOVE LOVE Tahini! The dressing is very good; I plan to use it as a topping for other salads in the future. The dill...I'm still undecided about; which is why I only gave it 4 stars. I'm not a huge dill fan but that's just me. I think mint might be an interesting option we'll see next time as I plan to make this again. Very simple colorful and tasty salad!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jennifer c.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2298637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-16T19:47:30.16Z",
                "reviewBody": "This salad was excellent with just a few changes.  I mixed up the cabbage, radishes, green onion, and tahini dressing early in the day and let that sit in the fridge.  Later on I thought it needed a little something, so I added about 2 Tbsp of mayo and 1 Tbsp of apple cider vinegar.  That was much better.  I didn't add the dill because I didn't think it was a good dish for dill and I subsituted sliced almonds for the pine nuts.  Before serving I cooked the asparagus and added that along with the feta cheese.  Other than that, the only other addition I made was chicken.  I grilled two marinaded chicken breasts and then thinly sliced them (still warm) onto the salad.  So good.  My husband loved it.  Next time we decided we're going to try adding some golden raisins and bleu cheese intead of feta.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Andi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1222293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-08T16:14:31.463Z",
                "reviewBody": "I loved this! So much better than typical cole slaw (probably because I love tahini). I unfortunately did not have any feta on hand (but I think it would be even better with it) and I replaced the asparagus with broccoli prepared exactly as the asparagus would be because I didn't have any asparagus. My husband told me he wanted me to add Chulula next time to give it a kick which I will try but I'm still giving this five stars because I've eaten it all week and the flavors get better every day in the fridge!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JRFRAHM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1402613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-26T21:12:05.36Z",
                "reviewBody": "I had everything except cabbage and ended up having to use green cabbage instead due to our poor selection at the grocery store. We thought it was a bit bland. Next time I will follow another reviewers advace and add Tabasco more onions and maybe even try lime juice. I will definitly try this again I love the combination of vegetables. Perfect for a cookout!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lucee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3646765/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-16T21:02:49.483Z",
                "reviewBody": "I really thought this was a great recipe until I tasted it! I went out and bought tahini for this recipe as I have never used it before and was a bit taken aback with the flavor of it it's like peanut butter almost! This may be a good salad with a different dressing for my taste. It is quite a big recipe too so I have to discard alot of food because nobody here will finish it. I would suggest halving the recipe if you're not sure...I'm glad I tried it but not for us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2108953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T17:54:37.803Z",
                "reviewBody": "I had everything but the tahini I substituted apple cider vinegar and also added a dash of salt to the dressing and a few drops of Tabasco. This was delicious! Like others I also omitted the dill.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "beach flowers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3592933/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-28T03:06:37.463Z",
                "reviewBody": "I love this recipe! I did not have to change a thing and the dill really adds that extra touch. I did double the tahini dressing recipe it was just so good. I made this for a vegan luncheon and it was a real hit!! Thank you",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "desertwinds",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3002892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-29T02:06:52.913Z",
                "reviewBody": "Okay. This recipe was pretty freaking good. Make more dressing. Instead of water add lemon juice to the dressing. You can add more dill this recipe is conservative. It sounds crazy but I had corn tortillas in the fridge from tacos last week and i ate it in those and is was DELICIOUS. It can use more radishes than the recipe calls for. Also I added a shredded carrot for sweetness. It was sweet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Virgie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3004119/"
                }
            }
        ]
    }
]