[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17530/desserts/fruit-desserts/peach-desserts/",
                    "name": "Peach Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/139349/easy-stovetop-peach-cobbler/",
        "name": "Easy Stovetop Peach Cobbler",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2915591.jpg",
            "width": 5312,
            "height": 2988
        },
        "datePublished": "2020-06-19T03:29:42.000Z",
        "description": "Got a sweet tooth but not much cash? This recipe is so easy and yummy, and you can use almost any kind of canned fruit to make it. You can't mess this one up; it's great for the beginner!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (29 ounce) can sliced peaches",
            "2 teaspoons ground cinnamon",
            "¼ cup white sugar",
            "1 (9 ounce) package yellow cake mix",
            "4 teaspoons margarine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Discard 1/2 of the juice from the peaches and pour the rest into a saucepan. Sprinkle the top with cinnamon and sugar. Empty the cake mix on top of the peaches in an even layer. Place the margarine on top of the cake mix in the center.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover sauce pan with a lid and bring to a simmer over medium-high heat. Once you see steam escaping the saucepan, reduce heat to medium-low, and continue cooking for 10 minutes. Do not lift the lid during this time! Remove from heat and allow to stand with the lid on for 15 minutes before serving. The cake mix should look like dumplings.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Peach Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KELIEGH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.344262295081967,
            "ratingCount": 61,
            "itemReviewed": "Easy Stovetop Peach Cobbler",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "297.7 calories",
            "carbohydrateContent": "57.4 g",
            "cholesterolContent": "0.8 mg",
            "fatContent": "7.4 g",
            "fiberContent": "2.6 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "311 mg",
            "sugarContent": "40.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-30T19:46:45.473Z",
                "reviewBody": "VERY FAST!  VERY EASY!  The first time I made it with canned peaches and I agree - omit most of the sugar.  I added the cinnamon and a bit of nutmeg too.  It was wonderful!  The second time I used fresh peaches and it needed the sugar.  I keep the little 9 ounce cake mixes in the pantry just for this recipe but I have doubled it and used a whole cake mix (in a much larger pot) and it turned out great!  I have used several different fruits, altering the spices to match the fruit (apple pie spice with apples, etc.) and they have all turned out very well.  I made it once with chocolate cake and strawberries and served it with whipped cream on top - YUMMY!  This is an awesome and very versatile recipe!  I made it today for some unexpected guests, a single mother with three kids, and she was impressed with how fast and easy it was.  When she tasted it she made me give her the copy of the recipe I had printed out on the spot and took it with her!\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Colleen Mitchell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lvngwell/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-16T16:00:34.593Z",
                "reviewBody": "I admit, I was a little skeptical to try this recipe after reading the one \"bad\" review on the first page.  I decided to give it a shot anyways, and boy am I glad I did!  I only used about 1/2 cup of cake mix (which turned out to be perfect), I omitted the sugar (I used canned peaches), and I melted the butter before drizzling it over the top.  The result was anything BUT dry...(which is what I was most worried about per the bad review).  We ate it with homemade whipped cream and some vanilla ice cream...perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2602781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-31T16:16:19.567Z",
                "reviewBody": "Great recipe when the peaches are ripe and the weather's hot so you don't want to use the oven!  Beware!  9 oz. of cake mix is 1/2 the standard box usually sold.  I almost made the mistake of adding the whole box.  I used fresh peaches, added 1/2 cup fresh orange juice and sprinkled it with only 2 Tbs. sugar.  Next I'll add some blueberries.  Can't wait to try it with apples when they're ripe this fall!  Very yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pajamann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/grammyjammy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-21T17:14:26.25Z",
                "reviewBody": "An excellent idea that worked out perfect for cooking on a camp stove while camping. I agree with another member if using canned peaches in heavy syrup omit the sugar as there is plenty in the cake mix to go around and balance the flavor. Also I halved the amount of cinnamon called for and added about a 1/4 Tsp. of nutmeg and found that to be enough flavoring without overpowering the taste of the peaches. One more note the famous cornbread people (you know the one in the small blue box) makes a cake mix also that comes in the right size so that you don't have to worry about halving a standard-sized box of cake mix. Overall the family loved this recipe! It is definitely going into our permanent cooking file. Thank you for sharing this easy recipe with us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OJAGAJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/400932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-28T23:11:31.77Z",
                "reviewBody": "So easy my 14 year old son made this. Fantastic fast and no baking! If you use peaches in heavy syrup omit the sugar unless you have a big sweet tooth. The cinnamon seems a little much but could be he did not \"sprinkle\" but dumped in only a few places. Overall great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy JimsWife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2252174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-21T18:41:58.193Z",
                "reviewBody": "Delicious super economical recipe. Doesn't taste exactly like a cobbler but it's yummy anyway. I've made if w/3 different fruits--peaches cherries & apples--& all were hits w/my family. I made it exactly like the recipe calls for the first time & it was a little too sweet for us. The next time I left out the sugar & cut WAY back on the cake mix that I put on top. Used about 1/8 of the box instead of 1/2. Also I melted the butter before drizzling over the cake mix & it seemed to work out better. When I made it the next 2 times I used canned cherry & apple pie fillings & again omitted the extra sugar. I time it so that the dessert is cooking on the stovetop while we're eating supper & when we're done we have a freshly made deliciously warm dessert ready for us. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marcy McClure Mock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1992745/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-09T15:45:07.513Z",
                "reviewBody": "I enjoyed testing this recipe for an upcoming camping trip but felt a few changes were in order. I chose peaches in heavy syrup and cut the slices in half. I also used vanilla cake mix over yellow because something about vanilla ice cream with cobbler that I love. Peach cinnamon and vanilla. Since we won't be able have ice cream I thought this was the way to do it. I wasn't disappointed. I also used butter over margarine because I don't like the flavor of margarine. I used 1.5 times the recipe for my large cast iron skillet (buttered well to prevent sticking) and made this recipe on my coleman stove. My universal lid didn't fit very tightly but this still came out well. I kept it on a med-high flame (my stove is old and finicky) for about 20 minutes peeking after the first 10. The consistency of the peaches was nice some were even slightly caramelized toward the center of the skillet. The topping was moist but did have some characteristing \"crumbs\" that made the dish look rather attractive for its simplicity. Very very sweet but when you're camping you can afford the rich recipe. Only 4 stars because frankly if I was spending a summer night at home I'd make fresh peach cobbler the old fashioned way. That said I've done a lot of camp cooking and this is the best dessert I've had to date. I can't wait to serve this to our group!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine M. Van Tassel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1111131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-09T19:53:58.92Z",
                "reviewBody": "In spite of all the wonderful reviews for this recipe I must say it sucks! I have done it twice and both times came out dry and milly, I tried with different cake mixes and different canned fruit and still something uneatable came out, I was soooo looking forward to taste it since the smell is pretty good but it didn´t came out right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ERIKA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/852172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-03T04:59:47.4Z",
                "reviewBody": "don't discard the extra peach juice make jello",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "cookingrama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7279335/"
                }
            }
        ]
    }
]