[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/139544/marzipan-christmas-kringle-juleskringle/",
        "name": "Marzipan Christmas Kringle (Juleskringle)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1545324.jpg",
            "width": 960,
            "height": 1280
        },
        "datePublished": "2020-06-19T03:29:45.000Z",
        "description": "This marzipan tubular bread is an ABSOLUTE must for the Christmas season, and a traditional dinner would not be complete without this Christmas Kringle for dessert. It may seem complicated at first glance, but if you follow the recipe step by step, it is actually quite easy and you will amaze your family with this beautiful dessert. This is an extremely rich and decadent treat so guests only need a little. Often a coin is hidden in the kringle and it is thought that the finder will be guaranteed good luck for the upcoming year. As such, it is considered bad luck not to indulge at Christmas!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT15H0M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "½ cup warm milk",
            "1 tablespoon white sugar",
            "1 (.25 ounce) envelope active dry yeast",
            "1 cup heavy cream",
            "3 ½ cups all-purpose flour",
            "¼ cup white sugar",
            "1 teaspoon salt",
            "1 teaspoon ground cardamom",
            "½ cup butter",
            "1 (8 ounce) can almond paste",
            "½ cup crushed sliced almonds",
            "½ cup white sugar",
            "1 teaspoon ground cinnamon",
            "1 teaspoon almond extract",
            "½ cup white sugar",
            "1 egg white, beaten",
            "½ cup sliced almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together the milk and sugar. Sprinkle the yeast over the top and let stand for 10 minutes to dissolve. Stir in cream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl, stir together the flour, sugar, salt and cardamom. Cut in the butter using a pastry blender or pinching with your fingers until it is a course mealy texture. Stir in the yeast mixture until well blended. Pat into a ball, flatten slightly, then wrap in plastic wrap. Refrigerate for 12 to 24 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the filling, mix the almond paste, almonds, sugar, cinnamon and almond extract using an electric mixer until evenly blended. It may be crumbly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll the chilled dough out into a 2 inch wide and 24 inch long rectangle. Spread the filling to within 2 inches of the sides and roll up into a tube. Cover your work surface with sugar, and roll the tube of dough in the sugar to coat thoroughly. Roll and stretch the dough out to form a long rope about 40 inches long. Place on a parchment lined baking sheet and shape into a pretzel shape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush the top of the pretzel with egg white and sprinkle with almonds. Cover loosely with a towel and let rise for 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Bake the kringle in the preheated oven until golden brown, 25 to 30 minutes. Cut into slices to serve.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "WOLSELEY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.655172413793103,
            "ratingCount": 29,
            "itemReviewed": "Marzipan Christmas Kringle (Juleskringle)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "397.3 calories",
            "carbohydrateContent": "49.3 g",
            "cholesterolContent": "38.7 mg",
            "fatContent": "19.8 g",
            "fiberContent": "2.4 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "8.3 g",
            "servingSize": null,
            "sodiumContent": "213.9 mg",
            "sugarContent": "18.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-31T02:21:54.203Z",
                "reviewBody": "I was looking for something to bake on Christmas that was a little fancier than my standard cinnamon rolls. This was perfect. The dough is nice to work with and is very delicate and has fantastic flavor. The end result is very pretty- it's a shame we ate it before I thought to take a picture. A couple tips: Make sure to seal the seams very very well- it has a tendency to blow out. I couldn't find almond paste so I ran some sliced almonds and some butter in the food processor until it was smooth. I don't know if that is very authentic but it tasted great! If I could rate this a 4.5 I would for the following reasons: 1- The dough is very fattening with the heavy cream 2- The cardamom makes this relatively expensive to make",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sobachatina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1483274/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-25T18:47:29.06Z",
                "reviewBody": "Thank you very much for this recipe.  We had a bakery that baked these and I have been trying to figure out how to make them ever since it closed!\nThe directions were good but I don't think that the wiodth of the strip is meant to be 2\".  I ended  up making it 6\".  The dough was sticky so I put some flour on the waxed paper which helped.  The sugar coating helped to prevent it from sticking when I stretched the tube.  I think another time I would stretch it quite a lot farther to make a narrower Kringle.  We would put in less sugar and no almond extract and no cinnamon next time as well.\nIt is fussy, but it is very nice. Thanks again.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SCARLETMAPLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/556468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T21:56:43.42Z",
                "reviewBody": "My family loves marzipan things so I decided to try this last Christmas. It was a huge hit and now I'm back this year to make it again! I wasn't able to find almond paste last year so I made my own which was VERY time consuming. So glad I found a can this year! The nice thing about this recipe is the tube can be shaped into something other than a ring. Last year I made a heart not sure what I'll do this year I may attempt a snowflake. I did make mine wider about 3-4\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CrunchySarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4220371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-20T00:57:48.187Z",
                "reviewBody": "This was a fantastic bread recipe! The dough is soft and flavorful but the almond paste filling puts it over the top! I made my own almond paste and rolled the dough out into two 12\"x6\" rectangles which I then rolled up and formed into rings. I left out the sliced almonds because my kids won't eat nuts they can see and sprinkled the top with raw coarse sugar. I will absolutely be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATIETOD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1020410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-13T20:31:26.433Z",
                "reviewBody": "Great recipe. I had some marzipan that I wanted to use. I more or less followed the recipe; I replaced the heavy cream with milk. I added vanilla sugar instead of cardamom. \nI separated one egg, brushed the egg white on the dough before I put the filling on. It helps the roll to stay together. After I let the bread rise, I brushed the egg yolk on the top and added sliced almonds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CA cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4341719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-01T18:59:36.143Z",
                "reviewBody": "This is delicious and fun to make! I was so excited to make this recipe. I made my own almond paste (not as hard as it sounds). I also only used the almond paste as the filling with sprinkling on some sliced almonds over the top of it and a little bit of cinnamon and sugar (I did not combine the almond paste 1/2 cup sugar and 1 tsp cinnamon and almond extract together). The marzipan/almond paste is plenty sweet and already has almond extract in it so 1/2 cup sugar more is unnecessary (in my personal taste). I also wanted less of a cinnamon taste and more of an almond taste. One thing that helped with forming the pretzel shape was watching a you tube video on kringle. There is a bakery that shows how to shape it. The width of the dough should be 6 inches not 2 when you roll it out with the filling taking up the very middle 2 inches. Then fold over each side on top of the filling seal and pat out any air bubbles. Then kind of stretch the roll as you lift it and then shape like the pretzel (I didn't actually roll the dough into a log to stretch it or roll it in sugar at this point). After forming the pretzel shape I used the egg wash and sprinkled the top with raw sugar and the sliced almonds. Beautiful and delicious! I will definitely be making this again. Thanks for sharing the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "punkim30",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4437590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-21T03:36:52.493Z",
                "reviewBody": "This is a delicious bread but needs some clarification in the steps. First the dough will not rise at all in the fridge. This worried me but the bread rose beautifully once it was a loaf shape. Second it's very important that your filling is spreadable and not a powder. I used homemade almond paste and my filling was more of a powder than a paste which caused me problems. If I had it to do again I'd have added an egg white to make it stickier. Third keep the dough refrigerated until right before you roll it out otherwise it will get sticky and will tear easily. Fourth when it's done baking it will still look a little doughy. I overcooked this because I thought it wasn't done and the doughier parts turned out the most delicious later on. The texture is closer to a coffee cake than a loaf of bread. I had a hard time rolling out the shape to the full 40 inches before the outer layer got thin enough to start tearing so at that point (probably about 30 inches) I just twisted it up into a loaf and let it rise. But in the end this was absolutely delicious. Moist and very very rich with beautiful flavors that complemented each other very well. Highly recommend and I will try it again now that I know how.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Zella Henderson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14735224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-16T02:37:17.993Z",
                "reviewBody": "This bread is very very good. I've made it twice now and it's gotten easier each time. I recently made it for a Christmas party and everyone LOVED IT and wanted the recipe!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren Zabowski Skarnulis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4297389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-24T14:59:23.06Z",
                "reviewBody": "I'm still trying to figure out how to get filling in a 2in.wide strip.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bernie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8591429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-21T10:24:03.12Z",
                "reviewBody": "Will not make again. Dough was too hard to roll out. Instructions were not good or complete.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Lis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24680325/"
                }
            }
        ]
    }
]