[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/139673/homemade-ice-cream-cones/",
        "name": "Homemade Ice Cream Cones",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1014135.jpg",
            "width": 834,
            "height": 834
        },
        "datePublished": "2020-06-19T03:29:46.000Z",
        "description": "These cones are in between a crepe and store-bought sugar cones. They're a huge hit with all my friends! If you have extras, store them in an airtight container, unroll, and re-crisp in a 400 degrees F oven.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "8 cones",
        "recipeIngredient": [
            "2 eggs",
            "½ cup white sugar",
            "¼ cup butter, melted and cooled",
            "3 tablespoons milk",
            "½ teaspoon vanilla extract",
            "⅓ cup all-purpose flour",
            "⅛ teaspoon salt",
            "3 tablespoons vegetable oil, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk together the eggs and sugar in a large bowl until frothy. Whisk in the butter, milk and vanilla. Gradually whisk in the flour and salt until smooth. The batter should be thin; you can stir in more milk if needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a small skillet or griddle over medium heat. Brush the pan lightly with oil. Pour about 1/4 cup of batter onto the skillet and turn to spread out the batter into a thin circle. When the underside is golden brown, flip over and cook until golden on the other side. Remove from the pan and form into a cone while it's hot, squeezing the end to seal. Place on a wire rack to cool and harden completely. Repeat with the remaining batter.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mallory Strange"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.088888888888889,
            "ratingCount": 45,
            "itemReviewed": "Homemade Ice Cream Cones",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "184.9 calories",
            "carbohydrateContent": "16.9 g",
            "cholesterolContent": "62.2 mg",
            "fatContent": "12.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "97.2 mg",
            "sugarContent": "12.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-09T20:06:03.743Z",
                "reviewBody": "YUM! The first cone I made didn't dry hard, so the next one, I made sure the heat was on medium-low and when the cone was slightly brown, I flipped it and pressed on it with my spatula so it browned evenly. It must get brown in order to dry hard. Flip it and press down on it again until it's nice and brown on both sides. Then, either shape it into a cone or put in in a small bowl so it's like a little cup. This was a fun recipe Thanx!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Charissa Simonson Okerstrom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1144427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-28T00:17:35.27Z",
                "reviewBody": "My whole family enjoyed these cones. Mine turned out crispy. It takes quite a while to get the cones evenly browned. Next time I think I'll try it with a weight or baking them to get even browning faster. They must be shaped quickly so they don't crack in the process.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ByMarce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1341564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-09T19:47:26.437Z",
                "reviewBody": "I had similar problems as other reviewers getting these to firm up. I suspect it has to do with the heat but that's tricky; too low and it stays soft too high and it burns (ask me how I know). I'm probably going to experiment a little bit to see if I can get a more consistent product. The taste is great but I'd like to make the texture perfect too. Because I burned the first one I turned the heat way down. I have an electric range though and it can be difficult to get good control. I ended up keeping the heat just a bit below medium to keep mine from burning but they were still soft. I'll post again if I can get this to be perfect. Worth it though; very tasty (even if a little greasy). My kids loved them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1961680/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-05T00:55:04.423Z",
                "reviewBody": "I don't have a waffle griddle so my waffle bowls were not gorgeous but the recipe did work out good. I used a flat griddle on medium-low heat and allowed them to slowly brown. They were a little tricky to flip the first time and then they were golden brown I draped them over the bottoms of wine and custard glasses. They hardened fairly quickly within a couple of minutes. I did burn a couple of fingertips in the process of trying to pick them up when turning because I needed to get my spatula underneath. Tip To shape them over a bowl or glass place a paper towl over the hot waffle cone so you can touch it and hold it in place as you shape the cup as you need. Hold for a minute until it cools and remove the paper towel.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "House of Aqua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/houseofaqua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-23T15:59:09.363Z",
                "reviewBody": "I made this gluten free by using white rice flour.  Yum!  Though it only crisped on the edges & it didn't stick together well (expected, with the lack of wheat gluten), it definately delivered the flavor of a good waffle cone.  My husband who hasn't had a waffle cone in years due to celiac, loved it!  I will experiment with other gluten free flours the next time around.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "O1K2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1104707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-22T23:10:55.85Z",
                "reviewBody": "These cones are EXCELLENT! I used a Chef's Choice Waffle Cone Express grill to make them. I do believe using a waffle grill of some type makes these cones perfect. (They won't need flipping) The grill came with a cone form to wrap the warm waffle around. This could be made out of aluminum foil. Take the warm waffle lay it on a towel then wrap it around a cone form and leave on the form until cool. The ingredients are PERFECT it's just a matter of mastering the technique! Thank you Mal for sharing your recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-26T21:53:46.403Z",
                "reviewBody": "The end product was tasty, but the recipe could use a couple tweaks to get the crispiness everyone expects in a waffle-cone.  First of all, the recipe says it makes 8 cones, but it's actually closer to 5 cones based on the 1/4th cup of batter per cone.  You need to scale the recipe up if you want 8.  Next the recipe calls for cooking over medium heat.  This browns the waffles too quickly and you'll end up with soft and pliable cones.  If you want it firm up properly then you'll need to drop the temperature down a little.  Everyone's stove is different, but based on the reviews it seems like those that had success used a medium-low temperature.  In my case, I set the temperature knob to 5 o'clock (assuming 6 o'clock is medium). And my last suggestion is to make sure your work area is ready to go.  You want to be able to quickly form the cone as soon as it is off the griddle, otherwise the edges will start cracking on you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AGHENO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/414903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-01T16:21:21.95Z",
                "reviewBody": "My cones never got crispy or even hard enough for using. They tasted really good though. I think I might use this recipe in a round waffle iron. I think that might work better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PearlJamFan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pearljamfan/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-03T01:16:14.287Z",
                "reviewBody": "I thought this was great. Took a couple times to figure out how much batter to use in order for it to get crispy enough. But it worked and was delicious! I cut a paper plate and taped it into a cone shape and used that as my form. Viola! My kids loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisaadams34",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4426014/"
                }
            }
        ]
    }
]