[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/140517/traditional-russian-pirozhki/",
        "name": "Traditional Russian Pirozhki",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6442022.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:29:52.000Z",
        "description": "I'm Russian, and this recipe has been handed down from my grandma. They taste delicious, and are a great comfort food (or any other food).",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "60 pirozhki",
        "recipeIngredient": [
            "2 cups milk, warmed",
            "1 tablespoon white sugar",
            "1 tablespoon active dry yeast",
            "2 tablespoons butter, melted",
            "1 egg",
            "1 teaspoon salt",
            "6 cups all-purpose flour",
            "1 tablespoon butter",
            "½ medium head cabbage, finely chopped",
            "6 hard-cooked eggs, chopped",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place 1/2 cup milk in a cup or small bowl. Stir in sugar and sprinkle yeast over the top. Set aside until foamy, about 10 minutes. Pour the remaining milk into a large bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the melted butter, egg, salt and 1 cup of flour to the large bowl with the milk. Stir in the yeast mixture. Mix in flour 1 cup at a time until dough pulls away from the sides of the bowl and doesn't stick to your hands. Cover the bowl loosely and set in a warm place to rise for about 1 hour. Dough should almost triple in size.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While you wait for the dough to rise, melt the remaining butter in a large skillet over medium heat. Add cabbage and cook, stirring frequently, until cabbage has wilted. Mix in the eggs and season with salt and pepper. Continue to cook, stirring occasionally until cabbage is tender. Set this aside for the filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the risen dough onto a floured surface and gently form into a long snake about 2 inches wide. Cut into 1 inch pieces and roll each piece into a ball. Flatten the balls by hand until they are 4 to 5 inches across. Place a spoonful of the cabbage filling in the center and fold in half to enclose. Pinch the edges together to seal in the filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Line one or two baking sheets with aluminum foil. Place the pirozhki onto the baking sheet, leaving room between them for them to grow.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven, or until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rex"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.511904761904762,
            "ratingCount": 84,
            "itemReviewed": "Traditional Russian Pirozhki",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "133.8 calories",
            "carbohydrateContent": "21.4 g",
            "cholesterolContent": "53 mg",
            "fatContent": "3 g",
            "fiberContent": "1.1 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "110.5 mg",
            "sugarContent": "1.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-02T18:18:53.34Z",
                "reviewBody": "I'm Russian as well and make pirozhki pretty much the same way. Here is what I do differently: I rub shredded cabbage with garlic salt in a large pot and then pour boiling water over the cabbage covering completely. Boil the mixture until soft usually around 15 min. Take the pot off the heat drain the cabbage and return it to the pot add spices.5 to 1 spoon of butter(I use Smart Balance butter or other butter made with olive oil) and the eggs. Also after pinching the end together I turn piroshok so that the pinched ends are on the bottom rather than on the side. It helps to keep not-so-well-pinched pirozhkis closed during baking and creates a nice symmetric shape.:) After placing the pirozhki on the baking sheet I let the dough rise just a little. Right before baking I brush them with beaten egg yolk for glowing smooth look when ready. Yumm!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHATScooking4DINNER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2603126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-11T01:39:39.503Z",
                "reviewBody": "I love this recipe just like all other russian children I grew up eating these! I also fry onions in olive oil until they are golden and sometimes a little bit burnt and add them to mashed potatoes if you use the oil from frying the onions then you really dont need to add milk or butter whem mashing the potatoes. Another filling is sour cherries i don't think anyone mentioned that from what i know the traditional fillings for pirozhki that you can buy at a russian store is meat potatoes cabbage or cherries sometimes i'll also add 18% fat cottage cheese with a little of my favorite (or whatever i have in the pantry) jam inside.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SarahandtheCity",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1474743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T20:18:43.557Z",
                "reviewBody": "This recipe is wonderful and a real crowd pleaser. My Russian Mother in law loved these. I recommend brushing them with egg yolk just before putting them in the oven for that professional golden color and shininess. Also it is very traditional to add cooked white rice with the filling or mashed potatoes. The salt and pepper are key in the filling; too little is very bland.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3358617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-03T00:35:01.247Z",
                "reviewBody": "Ok..I cannot BEGIN to tell you how awsome this bread is! You simply CANT mess it up...And believe me I did some pretty dumb things this time but the bread just rolled its eyes at me and thought to itself...\"looks like Im on my own!\" I thought for sure it would just be a train wreck but low and behold it was superfabuloso!! For you novices out there this is the recipe for you. And dont let it fool you. I had some leftover dough and filled it with roastbeef rice and cheese and some seasoning on it was a mouth wattering experience!! You can stuff this bread with anything...use your imagination and go wild! thank-you thank-you thank-you mariasaurus Rex!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "margaretd2000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5902420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T16:29:14.683Z",
                "reviewBody": "Delicious plain or with some mustard! I'd never had or heard of these before but I'm glad I tried them out. I was a little surprised the directions didn't say to knead the dough but I followed the recipe & didn't knead it--sure enough it turned out great (and that made the recipe that much easier to do!). I'll definitely be making these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abbey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1714333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T18:59:23.923Z",
                "reviewBody": "I'm having a huge Russian dinner tonight and I was looking for a good recipe for Pirozhki. I scanned a lot of websites including some in Russian and I changed the recipe a little bit according what I found and I used food processor for making the dough: I used 2 eggs reduced milk to 1 and 3/4 cups and used 1.5 packages of active dry yeast. I put 5 cups of flour to the food processor added salt run it for a couple of seconds (I use dough blade and speed) added butter and run it again for a couple of seconds. I dissolved yeast in the milk with sugar after 10 min I added two eggs slightly bitten to the yeast mixture. Turned on my food processor and slowly added the yeast mixture let it run for a minute and slowly added about 1/2 cups of flour (as much as needed to form elastic and non sticky dough). I let it raise around 1.5 hours and made pirozhki I let the pirozhki to rise for 20-25 min brushed with egg and baked them for 20 min on 400F... These turned out great - soft and fluffy... Be sure not to make the dough too thin. I'm sure that the original recipe is also good but I changed it according to the \"Russian sources\". Good luck - pirozhki is a great food especially shared with friends:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nastia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4113474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-10T19:27:33.087Z",
                "reviewBody": "I like to put mashed potatoes in it instead of cabbage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2519568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-07T00:29:33.347Z",
                "reviewBody": "I am so glad to find this recipe a friend requested me to find this and make them for her husband. I believe his mother used to make them. My friend is blind but now I can make them for the both of them thanks for posting it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3015577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T19:35:54.53Z",
                "reviewBody": "This sounds delicious and reminds me of German Bierocks which I used to get in Kansas. The difference is that Bierocks don't usually use hard boiled eggs in the filling, but use cabbage and ground meat.  Great stuff.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "whatacook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4877100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-22T19:18:27.627Z",
                "reviewBody": "If you liked cooked cabbage then this is for you. If not try making some cheese bourekas instead",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "muddyjake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6234257/"
                }
            }
        ]
    }
]