[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/140772/easy-microwave-chocolate-cake/",
        "name": "Easy Microwave Chocolate Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1975995.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2020-06-19T03:29:53.000Z",
        "description": "This is a quick and easy chocolate cake you can cook in the microwave in 2 minutes.  And it tastes great.  Really!  The consistency is dense and cakey.  It would go well with chocolate (or your favorite) chips, nuts, or served warm with hot fudge.  This cake, 'born' out of a pregnancy craving, worked out amazingly!",
        "prepTime": "P0DT0H6M",
        "cookTime": "P0DT0H2M",
        "totalTime": "P0DT0H8M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "3 tablespoons butter, softened",
            "¼ cup white sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "¼ cup milk",
            "½ cup all-purpose flour",
            "2 tablespoons cocoa powder ",
            "¼ teaspoon baking powder",
            "1 pinch salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Spray a medium microwave-safe bowl with non-stick spray and set aside. In a  mixing bowl, combine the butter, sugar, egg, vanilla extract, and milk; blend together. Combine the flour, cocoa powder, baking powder and salt; blend into the mixture until smooth. Pour into greased bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and cook in the microwave on high for 2 to 2 1/2 minutes, or until cake springs back when touched. Since all microwaves cook differently, adjust the cooking time to accommodate your machine. To serve, let the cake cool five minutes, then cover the bowl with a plate and turn both bowl and plate upside down so the cake falls onto the plate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Laura"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.241379310344827,
            "ratingCount": 232,
            "itemReviewed": "Easy Microwave Chocolate Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "433.1 calories",
            "carbohydrateContent": "53.8 g",
            "cholesterolContent": "141.2 mg",
            "fatContent": "21.4 g",
            "fiberContent": "2.6 g",
            "proteinContent": "8.6 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "233.1 mg",
            "sugarContent": "27.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-04T15:27:45.923Z",
                "reviewBody": "I did not like this cake at all! The consistancy was great (very cake like) but the huge serving and was not sweet enough for my tastes.It was made edible by having ice cream with it, but I definately won't try it again.\n\nEDIT* I know I said I would never try this again but I was desperate for easy chocolate cake so I read the other reviews and decided to alter it a little and see what I came up with. I simply added 1/2 cup of sugar and 1T of cocoa. The result was a wonderful chocolatey cake with a great consistancy. Given the improvments I would change my rating from 2 stars to 5 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "claireyloo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2378002/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-20T14:30:42.09Z",
                "reviewBody": "I don't know why the tough reviews. I guess it was just because of the lack of sweetness to it. However once you add extra sugar (abt 1/2 cup extra or so) It becomes perfect! I was watching a movie last night and really was craving chocolate cake so I got up and made this one for the first time and during the commercial break none the less!! Prepared the batter during the first commercial break and put in the bowl and microwaved it during the second! How fast is that! And let me tell you it is really good. I added chocolate chips to the batter to make it even more chocolatey and later made a quick nutella & milk frosting to cover the rest of the cake. One thing I would advise is not to refrigerate it it becomes hard when you do. It really is a good cake and would make again. Love the idea of making it without the fuss of preheating the oven and using lots of dishes and pans. So fast and easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-19T03:03:06.53Z",
                "reviewBody": "Really very good, and so easy! I would give 5 stars, but I had to use slightly different ingredients.  I used 3/4C sugar as another reviewer suggested, used canned coconut milk instead of regular milk, and dry chocolate malt mix instead of cocoa (coconut milk and malt mix were all I had).  I mixed it all up, and put it in the fridge.  Every day I am going to microwave about 1/3 of a cup to have dessert for one - about 5 days worth. I just finished one little cake, and it is not lacking at all for sweetness!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Katy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1640827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-21T02:45:58.817Z",
                "reviewBody": "For a microwave cake that is done in 3 minutes... a definite 5 star! My husband's response was \"why bother baking them anymore!\" I did add an extra 1/2 cup of sugar and an extra tablespoon of cocoa per other reviewers. I'm glad I did b/c it was perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2765666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-09T03:56:52.177Z",
                "reviewBody": "I think this recipe works better if you use 1/2 - 3/4 C. sugar 2 TBSP. cocoa powder & melt 2 oz. of milk chocolate (or whatever you prefer) with your butter and cream it together then add sugar and other ingredients. I used strong coffee in place of the milk to enhance the chocolate flavor. Spilt the batter into two heavy microwave safe cereal bowls and let them go for about 2 min. 15 seconds. In order for them to be really flavorful I let them sit and continue to carryover cook I removed the cakes and glazed them with a simple chocolate butter glaze. I then covered them in foil and let them sit for about 8 hours. They came out tender & chewy more like a brownie than a cake. Just don't use too much cocoa powder or you will have one dry bitter cake. These would be great for slumber parties simply because they are easy to make and fun to decorate- they have potential to be really cute and yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bakergrrl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2146991/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-17T18:40:59.663Z",
                "reviewBody": "I made this recipe just a few minutes ago. I was searching for a quick cake to reward my husband with and this really did the trick. I adjusted the sugar after reading previous reviews and instead put just a little less than 3/4 cup. I didn't have any cocoa so I ended up making a yellow cake. I followed the directions all the way through but added an additional minute to cooking because I'm in the mountains. I also made a quick \"chocolate\" icing by putting about 3 tablespoons of nutella into a microwave safe cup and heated for about 1 minute. I then added about a tablespoon of milk to the nutella and stirred it up to make it easier to spread. Then I just spead the mixture on the top of the cake. Delicious! Not bad for a microwave cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2373713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-04T19:43:43.233Z",
                "reviewBody": "Wow loved this recipe! Just made it and only used a third of the bowl put it in a microwaveable mug and presto - cake in a cup! Only thing I changed was instead of cocoa I used a chocolate milk drink powder (contains mostly cocoa and sugar) and that was only because I didn't have cocoa. I think to post this as a single serving dessert is a mistake as that's a lot of chocolate cake for one craving but it's totally worth making even if you have a mini cake a day for a few days. Brill quick and easy recipe thanks Laura!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sazzyness",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3064541/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-14T09:14:33.547Z",
                "reviewBody": "Awesome cake!I've never made microwave cake before so I was surprised that it came out exactly like a baked cake! It tastes best straight out of the microwave. If you leave it for too long it goes hard. I added 1/2 cup of sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "monchhichi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2425900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-13T01:31:00.12Z",
                "reviewBody": "This was not good at all. I read the reviews before I tried it and I made the recommended adjustments. I even tried to eat it with hot fudge and ice cream, but that didn't help the taste. Some things, I guess, just shouldn't be made in the microwave!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandra Moore Dixon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2537881/"
                }
            }
        ]
    }
]