[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2418/desserts/frostings-and-icings/chocolate/",
                    "name": "Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/141024/gluten-free-chocolate-cake-with-semi-sweet-chocolate-icing/",
        "name": "Gluten-Free Chocolate Cake with Semi-Sweet Chocolate Icing",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F67400.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:29:54.000Z",
        "description": "A delicious gluten-free chocolate cake!",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "½ cup sorghum flour",
            "½ cup tapioca flour",
            "½ cup rice flour",
            "1 cup cocoa powder, sifted",
            "1 ½ tablespoons xanthan gum",
            "2 ½ teaspoons baking powder",
            "1 teaspoon baking soda",
            "¾ cup butter at room temperature",
            "¾ cup (packed) dark brown sugar",
            "1 cup white sugar",
            "3 eggs",
            "2 egg yolks",
            "2 teaspoons vanilla extract",
            "1 ½ cups buttermilk",
            "5 ounces chocolate chips",
            "½ cup sour cream",
            "½ teaspoon vanilla extract",
            "1 tablespoon heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, sift together the sorghum, tapioca, and rice flours with the cocoa powder, xanthan gum, baking powder, and baking soda.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixer bowl, cream the butter until light and fluffy. Slowly beat in the brown and white sugars; whip until fluffy. Beat in the eggs and egg yolks one at a time. Add the vanilla. On low speed, alternately combine the buttermilk with the flour mixture. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 to 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Cool in pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the icing, in the top of a double boiler over medium high heat, melt the chocolate chips (or use microwave). Remove from heat and cool until warm. Stir in the sour cream and vanilla; add heavy cream. Stir in additional heavy cream to make desired consistency. Once the cake is thoroughly cool, spread a thin layer of frosting over the top.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings",
            "Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Gluten Free Mommy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.511111111111111,
            "ratingCount": 45,
            "itemReviewed": "Gluten-Free Chocolate Cake with Semi-Sweet Chocolate Icing",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "429.6 calories",
            "carbohydrateContent": "60.3 g",
            "cholesterolContent": "118.3 mg",
            "fatContent": "20.8 g",
            "fiberContent": "5.9 g",
            "proteinContent": "6.5 g",
            "saturatedFatContent": "12.3 g",
            "servingSize": null,
            "sodiumContent": "395.4 mg",
            "sugarContent": "38.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-15T20:34:52.39Z",
                "reviewBody": "I first saw this recipe on the authors's blog and on my favorite forums.glutenfree message board. I gave it a try today. This is the best GF chocolate cake I have ever made. Moist and tender and not at all heavy. Gluten eaters would never know the difference. I made 24 cupcakes and baked them for 25 minutes. One adjustment however. The measurement for xanthan gum should be 1.5 teaspoon not 1.5 tablespoons. I also used a simple buttercream tinted green for Saint Patrick's day. I'm sure the frosting posted with the recipe is great too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Colleen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1720954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-25T00:57:27.047Z",
                "reviewBody": "This first time that I tried this recipe it wasn't particularly good... but then I actually read the comments and reduced the amount of xanthum gum and it was really good! Nobody believed that it was gluten free!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Magnald",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3013507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-16T16:46:20.17Z",
                "reviewBody": "I will NEVER make this again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Karissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2983096/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-15T19:12:52.08Z",
                "reviewBody": "I absolutely loved this cake. No one could even tell it was GF!! I did take the others recommendations of lowering the amount of xanthan gum though. Also I sifted the dry ingrediants together then mixed the wet ingrediants in a seperate bowl. I read in another post that the consistancy was that of pudding so instead of using a mixer I used a wisk to mix the wet with the dry and Im pretty sure thats why my cake didnt fall in the middle. It definatly made it nice and fluffy!! I would recommend this to anyone... it was really that good!! I will never buy nasty premade mixes again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mom's gone crazy!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3529288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-28T18:55:32.02Z",
                "reviewBody": "I read reviews and also cut x-gum to 1.5 tsp. I cut the white sugar to 3/4 cup (actually a little less than that) and it was still fine. For the rice flour I used mostly white rice flour but a little bit brown rice flour too. And I literally sifted together all the dry ingredients first. I wondered if I should not have used an electric beater so next time I will try not to beat so much. It went into the pan almost like pudding (I guess it was the x-gum?) and btw the I greased first then floured it with rice flour which worked quite well came out of pan perfectly. I cooked for 30 min because my husband likes dense cakes so was hoping for an almost brownie like result. I used 2 round pans and the center did fall A TON but was SO moist! I didn't tell my husband it was gluten free because he would have been against eating it but after eating I told him and he was surprised. for my husband to be surprised that is HUGE. So now I believe all the reviews that no one knew it was gluten free. Definitely worthy of making for my daughters' parties. And though the ingredients are expensive to buy initially (my first GF baking attempt) I can use it all for awhile (except the buttermilk I found that at Trader Joe's) and I tried the choc. topping but was not too thrilled with it I would use a different topping/frosting next time..... my powered chocolate I used was Nestle but best used by date was almost a year ago; I still used it and came out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "trish926",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3710764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-22T00:38:07.337Z",
                "reviewBody": "This cake was excellent. I made it for my sister's birthday and nobody even guessed that it was gluten free. I made 2 round cakes and baked them for 33 minutes. They did sink in the middle though. Not sure if I needed to cook it longer? I put caremal in the middle and on top then frosted it with whip cream. I crunched up a toffee bar and sprinkled it on top and the sides. It was a hit! Moist and dense. Very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRODBECK314",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/896983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-12T01:48:46.123Z",
                "reviewBody": "Where do I begin???? This cake is stupid-good! I'm gluten intolerant but my husband is not. He insisted that I make him a birthday cake that I could eat and he loves chocolate. I was hesitant to try this - even after the other great reviews - but soooo glad I did. I made a couple of additions but the only changes I made to the cake recipe was to use 1 1/2 teaspoons of the xanthan gum as other reviewers pointed out. I used the best cocoa - Callebut - I could find. Trust me on this one the brand of cocoa you use makes a lot of difference. I added a raspberry sauce filling between the layers and iced it with a simple cocoa whipped cream and garnished with fresh raspberries. It was the best chocolate cake we have ever had. An FYI to those baking this for the first time TRUST the recipe! The batter seems too thick gummy and gloppy (for lack of a better word) when you mix it and add it to your baking pans (I used two 9\" rounds) and is hard to spread around the pans but it bakes up perfectly. Thank you Gluten Free Mommy this recipe is a treasure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "clearisfullheart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/clearisfullheart/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-14T15:56:38.12Z",
                "reviewBody": "I think that I'm a baker... but clearly I'm not. I followed the recipe subbing GF baking mix for 2/3 of the flour and soaking the rice flour in the buttermilk for a while (things that I'd read about online having no actual experience in the matter). In the end the batter was THICK and I was worried. Ended up adding about 1 more cup of buttermilk to some of the cupcakes. What a mistake! Once baked the original thick batter became perfectly risen gorgeous cupcakes. The one's that I thinned are sunken in the middle gummy an sad looking. All this to say this is a thick batter and it's great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GreedySmurf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3998303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-02T17:36:46.823Z",
                "reviewBody": "I made this for my boyfriend's birthday and he loved it! Didn't even care that it was gluten-free. I didn't have sorghum flour so I substituted coconut flour. I used 2 circle pans and my recipe of vanilla icing (1/2c shortening 1/2c soft butter 1tsp vanilla 3-4tbs milk 4 cups powdered sugar) and it was wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jamison e",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4147688/"
                }
            }
        ]
    }
]