[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/141833/thai-green-curry-chicken/",
        "name": "Thai Green Curry Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2352284.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2020-06-19T03:30:23.000Z",
        "description": "In this quick and easy recipe that never fails, the chicken stays moist and tender. Serve over jasmine rice for a satisfying meal.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound skinless, boneless chicken breast halves - cut into 1 inch cubes",
            "1 tablespoon dark soy sauce",
            "1 tablespoon all-purpose flour",
            "2 tablespoons cooking oil",
            "2 tablespoons green curry paste",
            "2 green onions with tops, chopped",
            "3 cloves garlic, peeled and chopped",
            "1 teaspoon fresh ginger, peeled and finely chopped",
            "2 cups coconut milk",
            "1 tablespoon fish sauce",
            "1 tablespoon dark soy sauce",
            "2 tablespoons white sugar",
            "½ cup cilantro leaves, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Toss chicken first in 1 tablespoon dark soy sauce, then in the flour, coating pieces evenly. Heat the oil in a large skillet over medium high heat. Place chicken in the skillet, cook and stir chicken until browned, about 5 minutes. Remove chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce heat to medium and stir in curry paste. Cook for 1 minute until fragrant, then stir in green onions, garlic, and ginger; cook an additional 2 minutes. Return chicken to the skillet, stirring to coat with the curry mixture. Stir the coconut milk, fish sauce, 1 tablespoon soy sauce, and sugar into the chicken-curry mixture. Allow to simmer over medium heat for 20 minutes until the chicken is tender. Serve garnished with cilantro leaves.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "laus"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.555938037865749,
            "ratingCount": 581,
            "itemReviewed": "Thai Green Curry Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "472.4 calories",
            "carbohydrateContent": "14.6 g",
            "cholesterolContent": "57.1 mg",
            "fatContent": "40.9 g",
            "fiberContent": "1.8 g",
            "proteinContent": "27.1 g",
            "saturatedFatContent": "24.3 g",
            "servingSize": null,
            "sodiumContent": "934.7 mg",
            "sugarContent": "6.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-19T23:25:32.28Z",
                "reviewBody": "Yummo! It's a very authentic-tasting Thai curry chicken. Warning: the green curry paste varies A LOT by brand. I used Maesri brand: VERY hot (and we love hot foods). I only used 1.5 tbsp which was plenty. Also, the coconut milk should be a full-fat (not low fat) and also varies quite a bit by brand. I prefer the Chaokoh brand which is nice & thick. Both of these brands should be available at any decent Asian market. A couple of changes I made: 1. used boneless chicken thighs (not as dry as breast meat), 2. reduced sugar to 1 tsp. I also added carrots, onions, and peas (gotta sneak those vegies ;) This one's a keeper. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1003613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-08T00:45:42.927Z",
                "reviewBody": "This turns out well except you have to completely leave out the soy sauce if you expect a greenish curry versus a brown curry.  The soy affects both the flavor and the color in a very negative way.  Leave out the soy and it turns out very well and is sooooo easy to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "filthyrob",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2247436/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-14T00:15:25.157Z",
                "reviewBody": "Alert! I made a veggie version with lots of additions: Just like my fave Thai restaurant! I made a veggie version of this recipe by following it after heating the green curry paste. I used 5 ounces of tofu rubbed with a tiny bit of sesame oil and the teaspoon of ginger the recipe called for. I also added fresh basil, sweet peas, mini-corn, and bamboo strips. I served it over brown basmati rice capped with chopped peanuts, green onion, and cilantro. I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/letmegetawutwut/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-16T04:06:41.97Z",
                "reviewBody": "Save your time to measure curry paste and coconut milk, use 1 can (4 oz) of Maesri green curry paste and 1 can (14 fl oz) of coconut milk for cooking will have a good result. If coconut milk is too strong for you, reduce the amount or add some chicken stock.\n\nAll you need is to stir-fry your favorite vegetables in sequence depending on the cooking time. In my case, onions and carrots first, followed by fried tofu curds. Then I add some curry paste and coconut milk before adding tomatoes, green beans, and broccoli stems. Add the remaining of curry paste and coconut milk and let the sauce simmer until green beans are cooked to your liking. At the end, add zucchinis and broccoli florets a few minutes before you put the lid on and turn the heat off. \n\nMeat is almost unnecessary in this dish. If you like chicken, cut it in thin slices and marinate in some cooking oil and green curry paste. To ensure that chicken is tender and cooked thoroughly, stir-fry chicken as soon as vegetables are done. In a separated pan that is big enough for all ingredients, add some oil before adding chicken. Constantly stir chicken until only some pinkness shows. Add steamy-hot cooked vegetables in and mix all ingredients well.\n\nVegetables recommended for green curry: asparagus, bamboo shoot, bean sprout, broccoli, butternut squash, carrot, green bean, eggplant, mushroom, onion, snow pea, sweet pepper, tofu, tomato, zucchini, and etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "CLL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6394851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-08T17:03:59.753Z",
                "reviewBody": "Credit to the Chef - this is an execellent receipe.  The weights, measures and cooking times are all bang on so really no need to improvise!  I've cooked this a few times now and suggest for more bang for buck you add 1 fresh lemon grass stalk (reveal the white stalk center and crush with the flat of a knife)instead of sugar and cut back the coconut milk to 400ml adding 75ml of chicken stock as well.  Use boneless chicken thighs instead of breast.  All this really intensifies the flavours!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steveroller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3297307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-10T19:34:43.757Z",
                "reviewBody": "This was easy for a beginner like me and it came out tasty. However, it did not have enough kick in it, so I would add more curry paste next time. Also, I agree with another reviewer that it was too sweet, so next time I will put in less sugar (I used white sugar). I served this with white rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna Do",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/690998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-23T21:49:55.86Z",
                "reviewBody": "Very tasty! I served it at a book club party and it got great reviews. I doubled the green curry paste as others have suggested (it may depend on the brand you use, so be careful) and I also used cane sugar for a more \"natural\" flavour. I used less sugar the second time around as I prefer dishes like these slightly less sweet in order to bring out the other flavours. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "zuan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2495245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-23T01:03:47.047Z",
                "reviewBody": "This was my first attempt at making Thai green curry, and this recipe was a good base.  I think it heavily depends on the curry paste you have, b/c they vary significantly by flavor and heat.  My green curry paste was not very hot, but was flavorful, so even though I increased the amount of curry paste, the dish was missing heat for me.  Next time I'll add Thai chili peppers with this particular curry paste.  I added lemongrass (cut into large pieces so you can easily remove them before eating), Thai basil (totally essential!!), carrots, and red pepper.  I also tried making coconut rice by putting coconut milk into the rice cooker.  It was mildly fragrant with coconut, so I might tweak with that more.  With the added ingredients I think the curry had a lot more dimension, texture, and flavor, but needed more spicy/heat boost to compare to the Thai curries I had in Thailand!  Will add more curry paste and chili pepper next time... or try a different brand of curry paste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "w",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-24T13:21:46.61Z",
                "reviewBody": "I would give this recipe 10 stars if I could!  We have two really good Thai restaurants in our area and this recipe tops any of their green curry dishes.  I followed the recipe exactly, used Jasmine rice, it was absolutely perfect. My husband RAVED about it, we brought leftovers for lunch the next day.  I think this sauce would also be very good on fish, like tilapia or another mild white fish, maybe even salmon.  This was just perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Martell Bishop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1371349/"
                }
            }
        ]
    }
]