[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/509/main-dish/pasta/macaroni-and-cheese/",
                    "name": "Macaroni and Cheese Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16830/main-dish/pasta/macaroni-and-cheese/baked-macaroni-and-cheese/",
                    "name": "Baked Macaroni and Cheese Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/142500/menas-baked-macaroni-and-cheese-with-caramelized-onion/",
        "name": "Mena's Baked Macaroni and Cheese with Caramelized Onion",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F793985.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2020-06-19T03:30:46.000Z",
        "description": "This is a fancy macaroni and cheese recipe that I came up with. The sweet caramelized onions and the sharp cheese flavors really complement each other. This recipe requires a little more work, but it's worth it. Vegetable broth can be substituted for chicken broth to make this a vegetarian dish. Enjoy!!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 tablespoons butter, divided",
            "1 large Vidalia or other sweet onion, thinly sliced",
            "½ teaspoon sugar",
            "1 pinch salt",
            "1 (8 ounce) box uncooked macaroni",
            "1 cup plain bread crumbs",
            "½ teaspoon dried mustard",
            "1 clove garlic, minced",
            "1 pinch cayenne pepper",
            "3 tablespoons all-purpose flour",
            "1 ¾ cups milk",
            "¾ cup low-sodium chicken broth",
            "8 ounces grated sharp white Cheddar cheese",
            "½ cup grated Parmesan cheese",
            "salt and black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Butter a 9x13-inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 2 tablespoons of the butter in a large skillet over medium heat. Add onions, sugar, and salt. Cook, stirring often, until onions are caramel colored, 15 to 20 minutes. If mixture is too dry, add an additional tablespoon of butter. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add macaroni and cook until al dente, 8 to 10 minutes. Drain, cover and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1 tablespoon of the butter in a small skillet over medium heat. Stir in the bread crumbs and toast lightly for a few minutes, stirring constantly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the remaining 3 tablespoons butter in a large pot over medium heat. Dissolve the dry mustard in an equal amount of water and add to the pot along with the garlic, and cayenne pepper. Stir until fragrant, about 30 seconds. Sprinkle in the flour and cook until golden, about 1 minute. Slowly whisk in the milk and broth. Bring to a simmer stirring constantly until the mixture is slightly thickened, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the pan from the heat and stir in the Cheddar and Parmesan cheeses until melted. Stir in the onions and season with salt and pepper. Add the drained macaroni and stir until blended. Pour into the prepared baking dish and top with bread crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake until golden brown and bubbling around the edges, 25 to 30 minutes. Let cool for 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Macaroni and Cheese Recipes",
            "Baked Macaroni and Cheese Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Malina Bleeding Heart Morris"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9523809523809526,
            "ratingCount": 21,
            "itemReviewed": "Mena's Baked Macaroni and Cheese with Caramelized Onion",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "556.3 calories",
            "carbohydrateContent": "50.9 g",
            "cholesterolContent": "81.7 mg",
            "fatContent": "29 g",
            "fiberContent": "2.6 g",
            "proteinContent": "22.6 g",
            "saturatedFatContent": "17.7 g",
            "servingSize": null,
            "sodiumContent": "582.7 mg",
            "sugarContent": "6.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-15T20:33:25.973Z",
                "reviewBody": "This takes too long to make. I have a tried and true mac n' cheese recipe so I rarely try others. But this one sounded so good that I couldn't resist. Unfortunately it's not as good as it sounds. I didn't have any cayenne so I used paprika. Don't think it made much of a difference. I thought one cup for breadcrumbs was a bit much but I went against my instinct and used the entire cup. Big mistake because it was a big factor in ruining the recipe. All you could taste were breadcrumbs; seriously it was like eating a mouthful of gravel. Also I used 12 oz of macaroni instead of 8 because it really didn't seem like enough. Either 12 oz is too much or 30 minutes is too long to bake the dish because it was really dry. Could hardly taste the cheese; like I said all you could taste were breadcrumbs. I used a large sweet Mayan onion and I thought it would be too much but after the onion carmelized for 1/2 hour it shrank down to almost nothing. If I make this recipe again (and that's a BIG IF) I will use only 1/2 the breadcrumbs twice the onion; if I use 12 oz mac I will add 6 oz shredded jack and definitely will not bake it for 30 minutes. More like 15 probably. What cheese and onion flavors I did taste underneath all those crumbs did not impress me. I also didn't think the broth was necessary. I would use 1/2 n 1/2 or more milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DC_Lady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2025208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-29T21:15:09.017Z",
                "reviewBody": "I loved the concept of this recipe. I also agree cut the bread crumbs in half. I added about a 1/2 cup of white wine also. I didn't delete anything just added the wine with the other liquids. It was divine when it was just sauce. My small kids loved it. Then we put it together and added the bread crumbs and baked. The three of them said \"too many bread crumbs can't taste anything else.\" So cut the crumbs in half add the wine and Bon Appetite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue Hnilicka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1226387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-05T00:14:13.273Z",
                "reviewBody": "Mouth-watering just thinking about it! This is the best mac'n'cheese I've ever had and it's not that difficult to make. Definitely not anything like stove-top varieties- in taste or prep. I would say the prep time on here is under-estimated but most of your time will be spent on the roux building it into the cheese sauce. As suggested by other reviewers use HALF the breadcrumbs and don't waste your time on browning them. Also I have made this recipe a few times with cooked and crumbled bacon mixed in before baking- Mouth-gazm! If you're watching your fat or cholesterol then don't do it but otherwise... yum",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AshleyKR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8541582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T17:34:08.227Z",
                "reviewBody": "Made it as listed except used romano cheese instead of parmasan and cracker crumbs instead of bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VREEVE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/999088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-17T16:03:04.107Z",
                "reviewBody": "I agree with previous reviewer's complaint of too much bread crumbs. Hubby complained that the bread crumbs overpowered/detracted from the mac and cheese and I totally agree. The caramelized onion flavor is nice. I doubled the amount of cheese. Did not taste the mustard or cayenne at all. Previous reviewer is right on target with eliminating the chicken broth and just adding additional milk - I bought a can of chicken broth and used just a partial amount which was a waste of money; I can't see where the chicken broth enhanced the recipe at all. Without the caramelized onions I'd give this 2 stars 3 stars if you halve or delete the bread crumbs - the caramelized onions bring it up another star to a 4.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-10T02:04:08.01Z",
                "reviewBody": "This recipe works. Takes too long? Kinda standard for real mac & cheese. Plus the time for the grilled onions. But that's my favorite so I think it is worth it. I also grilled some stir-fry pork pieces and deglazed the pan with some white wine adding that to the sauce right before the cheese. Freaking good. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OHCRIPE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/990040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-12T21:00:27.447Z",
                "reviewBody": "Although it took a bit of time...I really liked this recipe and will make it again. I did add some swiss cheese as well as using cream instead of milk. The caramelized onions had a great flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "stubbi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1664476/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-21T20:32:51.46Z",
                "reviewBody": "This was pretty good. After reading other reviews I doubled the onions and halved the breadcrumb topping. I should've let the onions cook a bit longer though-after 20 minutes they were very soft and sweet but not very colored. Instead of the chicken broth I used all milk and added some organic chicken base. Next time I will add a few splashes of Worcestershire.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Conger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lissa13/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-23T20:13:11.943Z",
                "reviewBody": "I thought this was very tasty although I could have used more onions and less bread crumbs. I think this would be a good meal for young picky kids and a good way to sneak some vegetables (onions) into their systems.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ANJA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1464013/"
                }
            }
        ]
    }
]