[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/142764/pain-au-chocolat-chocolate-filled-croissant/",
        "name": "Pain au Chocolat (Chocolate-Filled Croissant)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3170763.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:31:04.000Z",
        "description": "This light, flaky French-style croissant roll is filled with delicious chocolate. The entire family will love it! Using the bread machine saves a lot of energy.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT4H0M",
        "recipeYield": "9 pastries",
        "recipeIngredient": [
            "¼ cup warm water",
            "2 ¼ cups bread flour",
            "2 tablespoons instant nonfat dry milk",
            "1 tablespoon white sugar",
            "½ teaspoon salt",
            "2 tablespoons butter, softened",
            "1 ½ teaspoons instant yeast",
            "½ cup butter, softened",
            "1 egg yolk",
            "1 tablespoon milk",
            "8 (7 ounce) bars chocolate candy bar, broken into pieces",
            "8 ounces semisweet chocolate chunks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour the water into a bread machine pan; add the flour. Sprinkle the milk powder over the flour. Place the sugar, salt, and 2 tablespoons of softened butter into the corners of the pan. Make a small indent in the top of the dry ingredients and put the yeast in the indent. Run the bread machine on the basic dough setting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, lay out a sheet of waxed or parchment paper. Shape the remaining 1/2 cup of butter into a 3x5 inch rectangle on the waxed paper; wrap and chill until ready to use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the butter from the refrigerator and allow to soften while you roll out the dough. Turn the dough out onto a lightly floured surface. Roll the dough into a 8x12 inch rectangle. Place the  butter on half of the dough, leaving a 1/2 inch border of dough on 3 sides. Fold the other half of the dough over the butter and press the edges firmly to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll the dough out to a  6x14 inch rectangle. Fold the dough in thirds from the long ends, as you would fold a business letter. Cover the dough loosely with plastic wrap and refrigerate for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the dough from the refrigerator. Place it onto a lightly floured surface so that the folded edge faces you. Roll the dough out again into a 6x14 inch rectangle, and fold into thirds. Cover with plastic and chill for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Repeat step 5, chilling for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, beat together the egg yolk and milk; set aside. Grease two baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll the dough out into a 12x21 inch rectangle. Cut the dough into thirds in both directions, to make 9 rectangles. Divide the chocolate among the rectangles. Lightly brush the egg yolk mixture around the edges of each piece. Starting at a short end, roll each piece of dough around the chocolate as if you were rolling a cigar. Press the edges together to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the pastries onto the prepared baking sheets; cover with greased plastic wrap and allow to rise in a warm place until they have doubled in size, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush the top of the pastries with the remaining egg yolk mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden brown, about 15 minutes. Cool for 5 minutes on the baking sheets, then transfer pastries to wire racks. Serve warm or at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KJKENDA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.368421052631579,
            "ratingCount": 19,
            "itemReviewed": "Pain au Chocolat (Chocolate-Filled Croissant)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1326.1 calories",
            "carbohydrateContent": "152.9 g",
            "cholesterolContent": "101.3 mg",
            "fatContent": "78.1 g",
            "fiberContent": "6 g",
            "proteinContent": "15.7 g",
            "saturatedFatContent": "47.4 g",
            "servingSize": null,
            "sodiumContent": "336.5 mg",
            "sugarContent": "117.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-15T13:30:33.713Z",
                "reviewBody": "These turned out to be my Saturday baking project... I didn't feel like dusting off my bread machine so I just used my KitchenAid with good results. When you start to read this recipe you will find it necessary to add more liquid to the batter I added about 1/2 cup more and used all semi sweet choc chips that I chopped up a bit. Also there is no need to pinch the ends closed. They look prettier if left open... We loved these flaky crispy buttery chocolaty petit pain au chocolat and served with steaming cafe au lait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LPHILLIPS9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/982019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-06T22:34:09.953Z",
                "reviewBody": "I want to give this recipe 4 1/2 stars not the best but very very worth making. I don't have a bread machine so I made the dough by hand and let rise. The first folding would be less messy if you chilled the dough a bit after proofing. I also made cuts for the chocolate to show through (and look more like store-brought). I baked about 12 mins and they turned out lovely golden brown. The taste is different from the normal croissant but still soft fluffy and slightly flaky.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "yuki chou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3651553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-30T16:18:07.3Z",
                "reviewBody": "I've tried to make Pain au Chocolat before with other recipes but they were too buttery and too much hassle. This recipe was wonderful! I only changed the amount of chocolate used to fill the croissants--only 10 oz of chopped chocolate. It was plenty chocolaty and quite delicious. My husband and I who recently returned from a vacation in Europe and there fell in love with the chocolate-filled croissants really enjoyed this recipe. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A. Stratton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2800909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-07T23:07:54.3Z",
                "reviewBody": "This was a fun recipe to make. I don't have a bread machine so it was necessary for me to add about 1/2 cup of water as well. Although this is a recipe I've been wanting for awhile I wasn't satisfied. It was better once the chocolate had cooled but I live at a higher altitude and the croissant came out really hard once cooled. They were ok but I was looking for something with a sweeter croissant and a more mousse like filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "candi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2562643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T19:59:52.637Z",
                "reviewBody": "I don't use a bread machine so I did everything by hand. It worked out great! Very much worth the wait!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stephiehawk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6281314/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T19:58:01.443Z",
                "reviewBody": "sweet",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WONDERMAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/890559/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-05T00:26:21.813Z",
                "reviewBody": "For starters even using a bread machine that water amount is not correct. I found that 3/4 cup is perfect so this must be a typo. Working the butter into the dough is so very critical do not rush this step. You can leave the dough in overnight after you have worked the butter though it instead of 30 minutes. I roll my dough similiar to rolling cinnamon rolls. Cut it in 1/2 (6x21\") and make 2 rows of chocolates one starting at the beginning of the roll and the second one at the half mark. Roll it into a tube and cut into 3\" pieces. I want to try making them next using an almond paste. Thanks so much for sharing this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Ollila",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1844526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-03T23:39:54.717Z",
                "reviewBody": "Croissants are not for the faint of heart! For one make sure you prep your yeast - warm water (105 F) with the sugar and then add the yeast to the water for 5 to 10 minutes or until it is frothy (I didn't do that! Massive Oops!) You need to make sure the dough rises too (I didn't do that - massive Oops!) and you really need to wait between rolling out the dough (I did do that!). If you want them to look like real croissants (real as in the ones you see in a bakery) you have to cut them into triangles (learned this after I made them rolls... oh boy!). Mine are in the oven now for the 15 minutes... hope they taste good!!!...... 20 minutes later... OMG delicious! Even though I made some giant mistakes they are oh so good! i will be doing this recipe again for sure the right way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dan Thomas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5848428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-21T08:04:37.097Z",
                "reviewBody": "A great recipe. I tweaked it as others have said it needs more water and I made the dough by hand. I would stress the importance of the layering process rolling it thin and a few more times. Over all very tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz Hull",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20530993/"
                }
            }
        ]
    }
]