[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/143090/hong-kong-sweet-and-sour-pork/",
        "name": "Hong Kong Sweet and Sour Pork",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3275231.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2020-06-19T03:31:19.000Z",
        "description": "This recipe requires three quick frying steps to seal in the crispy texture of the pork. Serve with rice or noodles for a filling meal.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 teaspoons light soy sauce",
            "⅛ teaspoon white sugar",
            "2 teaspoons potato starch",
            "1 teaspoon sesame oil",
            "ground black pepper to taste",
            "1 pound pork loin, cut into 1-inch cubes",
            "1 cup water",
            "2 tablespoons white vinegar",
            "¼ cup ketchup",
            "¼ cup white sugar",
            "1 pinch salt",
            "2 teaspoons potato starch",
            "1 dash red food coloring",
            "1 egg, beaten",
            "1 cup potato starch",
            "2 cups peanut oil for frying",
            "1 green bell pepper, cut into large chunks",
            "2 cayenne peppers, sliced",
            "4 slices canned pineapple, chopped",
            "2 cloves garlic, sliced",
            "2 green onions, sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk together the soy sauce, sugar, 2 teaspoons potato starch, sesame oil, and black pepper in a large bowl.  Mix the pork into the marinade and turn until all the pork is covered. Allow to rest for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the sauce, whisk together the water, vinegar, ketchup, 1/4 cup sugar, salt, 2 teaspoons potato starch, and red food coloring in a separate bowl. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip the pork pieces in the beaten egg, then dredge in the 1 cup potato starch.  Use your hand to press the starch onto the pork, assuring a consistent coating.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the peanut oil in a wok over medium-high heat to a temperature of 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry the pork pieces in the hot oil until crisp and light brown, 4 to 5 minutes. Remove the pork from the oil and drain, keeping the oil hot.  Return the drained pork pieces to the hot oil for 30 seconds more.  Remove and drain again. Pour off all but 1 tablespoon of oil from the wok.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon of reserved oil in the wok over medium heat. Cook the green bell pepper, cayenne pepper, pineapple, garlic, and green onion in the heated oil for about 5 minutes.  Add the sauce and stir until it thickens.  Stir in the pork and toss until the pork is coated with sauce.  Remove from heat and serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "BETSYLINDSEY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.738636363636363,
            "ratingCount": 88,
            "itemReviewed": "Hong Kong Sweet and Sour Pork",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "588.3 calories",
            "carbohydrateContent": "59.5 g",
            "cholesterolContent": "117.9 mg",
            "fatContent": "28 g",
            "fiberContent": "1.5 g",
            "proteinContent": "25.2 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "402 mg",
            "sugarContent": "25.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-12T22:22:19.87Z",
                "reviewBody": "I made this tonight and it was great. I didn't have the peanut oil and potato starch so I substituted canola oil and corn starch. My husband and I loved it. It wasn't that time consuming to make but it definetly was a good deal of clean up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PrincessKatty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3147761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-12T17:03:46.983Z",
                "reviewBody": "We moved to the midwest from CA some years ago and get serious unfulfilled cravings for decent Chinese food - finally I decided I would just have to learn to cook it myself. This recipe was my first attempt and it was actually very good! It was all the wonderful flavors I remember from Chinese restaurants on the coast and WAY better than any of the slop they sell out here. I made some minor changes depending on what I had to work with. I couldn't find potato starch to save my life so I used tempura flour / rice flour. It seemed to fall off a bit during frying so I'd try the potato starch if you can get it but the pork still turned out great and what remained of the batter was delicious. I added in baby carrots with the other veggies as I love carrots in my sweet and sour pork - they were great! I thought the sauce needed a little extra citrus kick a little perking up and brightening so I added about 1/4 cup of grapefruit juice that I had in the fridge and it was just awesome and perfect. Finally I couldn't find any hot peppers at any grocers here (you see what I mean about where I live) so I went with dried ground cayenne. It was a bit too spicy not quite the right flavor... but still good. If you have to use the dried spice stuff instead of fresh it will work and be tasty just make sure you don't overdo it. As far as the recipe goes it was delightful! It was a lot of work to do but none of it was difficult to manage. The pork turned out WONDERFUL crunchy on the o",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sonnet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2418603/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-20T06:32:43.297Z",
                "reviewBody": "Was looking for recipe to use up some pork i had that was defrosted and this popped up so decided to take a chance with this recipe only having one review. Well just finished making this dish and i can say i will definitely make it again. Awesome dish. I went lighter on the oil and only used about 1/2cup for cooking and coated my pork is flour instead of potato starch because that was what i had on hand (yeah even ran out of corn starch as well) and opted for apple cider vinegar for a bit more flavor. definitely give this recipe a try",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Loki440 (Kyle)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2828891/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T19:58:01.55Z",
                "reviewBody": "Thanks Betsy - Great recipe! I have another excellent S&S Pork recipe from this site but was intrigued with the double-frying of the pork in this one. Being a true carnivore I used 2 pounds of pork (boneless country ribs trimmed of fat) so I doubled the marinade and the egg for dredging. Everything else was kept as written. The pork bits had a very nice crunch to them and the sauce was not the sickeningly-sweet stuff that so many recipes make. At first I thought there might be a little too much vinegar in the sauce but even that ended up just right. I served the sauce over rice topped that with the pork bits then drizzled a little more sauce over the pork. My guest said she has never had such well balanced flavor in a sweet and sour dish. PS: I really couldn't tell the difference in the crunch between the pork bits that had been fried twice versus those that had had taken only one trip through the hot oil but it may be more in the way they absorb (or rather do not absorb) the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WileyP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1775667/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-17T00:01:19.993Z",
                "reviewBody": "I have been yearning for a sweet & sour recipe that rivals my favorite Chinese restaurant in London's Chinatown and I think I have found it! I improvised a bit to assure the meat would stay crispy by only adding the meat on top of the sauce at serving time (not stirring it in and cooking as the recipe states). I also improvised due to the lack of some of the ingredients. I stir fried the bell pepper with carrots and yellow onions and my pineapple substitute was pineapple chutney but I could have skipped it all together as the sauce was sweet enough without it. Thanks Betsey for a new way to cook the same old pork chop!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kellygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4568565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-09T17:49:42Z",
                "reviewBody": "This was awesome! Thanks for a great recipe Betsy. I used cornstarch in place of potato starch and simply rolled the marinated pork pieces directly in it skipping the egg bath. This worked out well and saved significant time. I also forewent the double frying of the pork. Even after these modifications this was still a 5 star recipe all the way. Bravo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deeta Jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/989286/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-06T23:10:16.277Z",
                "reviewBody": "Yummy! I did have the potato starch (also called potato flour) and never did anything with it so this recipe was an eye opener for it's use. The potato starch makes it really crispy instead of soggy like regular wheat flour can get once it is mixed with a sauce. The only changes I made was that I used a small onion that I did a rough 1/2\" chop on instead of the green onions and I left out the cayenne peppers only because I didn't have them. I suppose I could have substituted some Siracha hot sauce but it was so good without it I didn't add it. I also used half a red bell pepper in addition to the green pepper. I would suggest that you do all of your chopping ahead of time so that when your frying is done you are ready to stir fry the veggies. My husband loved it and thinks it's better than a restaurant dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula Kelsay McFarland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/184913/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-12T19:21:49.933Z",
                "reviewBody": "My family really enjoyed this recipe but I did make a few changes. I only fried the pork once and did not add cayenne peppers. It was still delicious. I thought that the sauce was pretty thin before I added the pork back in but it was actually just right. Will be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhonda McG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2335332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-12T17:02:45.003Z",
                "reviewBody": "Don't change a thing! Perfect! (I used corn starch instead but it's the same thing )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J.Mohojo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jocelyn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-19T00:46:45.907Z",
                "reviewBody": "Lacking in flavor this was neither sweet nor sour. I followed the recipe almost exactly--just adding some carrots and celery to fill out the veggie content. Sweet and Sour Pork III is a much tastier and easier recipe and I will be going back to it for my sweet and sour fix next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Mindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2469726/"
                }
            }
        ]
    }
]