[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/725/world-cuisine/european/scandinavian/",
                    "name": "Scandinavian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/145457/swedish-cream-with-summer-berries/",
        "name": "Swedish Cream with Summer Berries",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F389000.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:31:58.000Z",
        "description": "This is an easy and elegant dessert. I get besieged with requests for the recipe every time I make it. Substitute any of your favorite fresh fruits for the strawberries, and it'll be still be just as delicious! You can also serve this in wine glasses because 1/2 cup servings are never enough.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup sour cream",
            "½ cup white sugar",
            "½ cup plain yogurt",
            "1 teaspoon vanilla extract",
            "3 tablespoons brandy-based orange liqueur (such as Grand Marnier®)",
            "2 cups whipping cream",
            "2 cups fresh strawberries, cleaned, hulled and sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the sour cream, sugar, yogurt, vanilla extract, and orange liqueur in a large bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the whipping cream into a saucepan, and heat over medium-high heat just below the boiling point. Slowly stir the heated cream into the sour cream mixture. To serve, pour the cream mixture into 1/2 cup Irish coffee glasses to 1 inch below the rim. Top each glass with sliced strawberries.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Scandinavian"
        ],
        "recipeCuisine": [
            "European",
            "Scandinavian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "HOONDE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.473684210526316,
            "ratingCount": 38,
            "itemReviewed": "Swedish Cream with Summer Berries",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "357.3 calories",
            "carbohydrateContent": "21.8 g",
            "cholesterolContent": "95.1 mg",
            "fatContent": "28.4 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "17.6 g",
            "servingSize": null,
            "sodiumContent": "49.3 mg",
            "sugarContent": "17.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-05-07T22:40:38.543Z",
                "reviewBody": "Hi - I am the cook that entered this recipe and as I was reading through the reviews about the warm cream I realized that one important word had been left out of the instructions - \"CHILL\"! After you pour the cream mixture into the glasses put the glasses into the fridge until chilled- THEN add the berries. It will thicken a bit but won't set up into a really stiff mixture. Sorry for the omission on the original contribution.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOONDE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925696/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-21T17:47:56.67Z",
                "reviewBody": "This is a good recipe with a few changes. After reading through it it sounded like it would be a rather runny sauce that you topped with some sliced strawberries. I didn't really want that...so I made a couple changes. First of all I whipped the cream instead of boiling it. I folded the sour cream mixture into the whipped cream and really liked the results. It was smooth creamy rich and lightly sweet. Also because we are a non-alcohol family I used 1/4 tsp. of orange extract instead of the orange liqueur. This gave it a pleasant and slight orange flavor which really complimented the strawberries. I used more like 4 cups of berries and layered them in wine glasses along with the cream. The end results were beautiful and very tasty. Thanks for sharing the recipe!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "larkspur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3097894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-08T22:35:50.72Z",
                "reviewBody": "I made this recipe for the recipe group... Here's my review: This recipe was AMAZING! We never have alcohol of any kind in our house, so we (my sister and I made this together) used orange extract in place of the Grand Marnier (I've heard that orange juice concentrate would also work...). Another change we made is that we whipped up the cream with the yogurt, sugar, vanilla, orange extract, and sour cream instead of heating it on the stove. Them we made a parfait (check out Larkspur's awesome photo) This was PHENOMENAL! Thanks so much! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "geranium",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3565511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-20T14:50:23.62Z",
                "reviewBody": "I made this as my first participation in the Recipe Group and my entire family is soooo happy that I did! The thought of warm whipping cream mixed with the other ingredients didn't really sound like something we would enjoy. So I whipped the cream and folded it into the yogurt/sour cream mixture. I also used Patron Citronge Orange Liqueur (perfect substitution!) then layered the strawberries and cream added a couple of orange segments and chilled for a couple of hours before dinner. This turned out to be perfect for us. My husband has already started giving me other ideas to change this up with other fruits/flavors. He really loved this and thinks \"The Recipe \"Thingy\"\" I participated in is a great idea! Thank you Recipe Group and thank you to the submitter of this recipe for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-24T01:24:50.18Z",
                "reviewBody": "Even though I messed up and got a tub of Whipped Cream versus getting Whipping Cream it turned out very nice. I just folded in the whipping cream versus cooking the cream as the directions say. My mess up tasted fantastic. It was a very light desert. I layered the strawberries into a glass grated some chocolate on top. It looked great as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "My4boys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/my4boys/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-21T01:10:25.977Z",
                "reviewBody": "I really wish I had read the comments before making this. It was a huge mistake. I expected a light fluffy dessert that was cold and yummy. Instead what I found was a very thin cream. Everyone who enjoyed this \"fixed\" the recipe and to me that means they created their own. When whipping cream is heated it loses the enzyme which allows it to whip. Thus you are left with a runny mess. I was not pleased and will not make this again. I wish people had registered stars that were associated with this recipe and not their own versions of it. I'm sure their versions are fine however that's not the recipe \"as written\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "dfwenigma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dfwenigma/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-20T18:41:39.243Z",
                "reviewBody": "I made this for Recipe Group. My first thought is warm cream gag me with a spoon. However I was pleasantly surprised I must say. It was actually quite good. I used more sour cream in place of the yogurt as I don't use plain yogurt and didn't want to get a big tub that wouldn't get used. I subbed the Grand Marnier with orange juice and a little lemon extract. It still tasted a little like a creamsicle but with the strawberries gave a very nice flavor. I probably would not make this again unless I whipped the whipping cream and folded everything together and used it chilled. It does make for an elegant dessert that would finish off a meal with something not too sweet and not too tart. Thanks Hoonde for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-29T22:01:15.39Z",
                "reviewBody": "I made this in the morning so it could chill. Then I used it as a sauce for a berry trifle with frozen pound cake and chilled it until dessert time. It was fabulous and a huge hit with our guests",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYSTEVE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/244410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-26T19:59:49.98Z",
                "reviewBody": "This is a fantastic recipe that I'll be making again! I cut the recipe in half as there were only 2 of us...I used Triple Sec instead of Grand Marnier as that was what I had on hand. My husband gave it 4 out of 5 stars which is a super good rating from him! Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "witchywoman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/witchywoman/"
                }
            }
        ]
    }
]