[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/147536/dansk-aebleskiver-danish-doughnuts/",
        "name": "Dansk Aebleskiver (Danish Doughnuts)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3450811.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:32:12.000Z",
        "description": "My husband is from Denmark, and making this traditional Danish favorite is a family affair. I make the batter, my husband does the cooking, and the kids help us make them disappear! We like to dip our aebleskivers in raspberry jam, maple syrup, and powdered sugar. The cardamom gives them that something extra. No wonder this recipe is a family favorite! Danish cooks use a long knitting needle to turn the doughnuts, but you can use a fork, too.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "48 servings",
        "recipeIngredient": [
            "8 eggs",
            "1 quart buttermilk",
            "¼ cup melted butter",
            "4 cups all-purpose flour",
            "1 teaspoon salt",
            "2 tablespoons white sugar",
            "1 teaspoon baking soda",
            "1 ½ tablespoons ground cardamom",
            "2 cups vegetable shortening, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an electric aebleskiver pan according to the manufacturer's directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat together the eggs, buttermilk, and butter in a mixing bowl until smooth. Gradually whisk the flour, salt, sugar, baking soda, and cardamom into the egg mixture until evenly blended and smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon 1 tablespoon of shortening into each cup of the preheated aebleskiver pan, and allow the oil to heat. Pour batter into each cup until 3/4 full. Allow the batter to cook in  the bottom of the cup 3 to 4 minutes until golden brown, then use a long skewer or knitting needle to lift one edge and give it a 1/4 turn. The uncooked batter will spill over into the cup, and cook. Continue lifting and turning the edges until the batter is fully cooked into a golden brown ball. Drain on paper towels.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Luanne"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.705882352941177,
            "ratingCount": 17,
            "itemReviewed": "Dansk Aebleskiver (Danish Doughnuts)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "144.6 calories",
            "carbohydrateContent": "9.6 g",
            "cholesterolContent": "34.4 mg",
            "fatContent": "10.6 g",
            "fiberContent": "0.3 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "114.8 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-06T21:37:14.42Z",
                "reviewBody": "I submitted this recipe and it was changed a bit when published.  I just wanted to clarify that the aebleskiver pan is a cast iron pan with 7 rounded cavities about 2\" wide and 1\" deep.  You would preheat pan with melted oil before starting to cook the aebleskiver.  I don't know if there is an electric pan in existence or not, but my recipe is based on using a cast iron pan.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Luanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2459569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-12T20:17:44.78Z",
                "reviewBody": "I absolutely love this recipe.  I like it because I don't have to separate and whip the egg whites.  I've made this with buttermilk and also by making your own buttermilk (curdle milk with lemon juice) - recently I also used the eggs in the carton, super easy and YUMMY.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Soifua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/soifua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-15T14:56:55.977Z",
                "reviewBody": "This is almost the same family recipe that I grew up with. we always filled them with a teaspoon of JAM!  Once poured into the pan, drop a bit of jam in the center, and cover with just a tad of batter, and turn as usual.  We just made these last night.  As a child we made these all the time!  On our(all siblings and cousins) wedding day we all were given the special \"aebleskiver\" pan, that my parents bought at Layman's hardware in amish country, Ohio!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "5frys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2732900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-03T17:08:38.947Z",
                "reviewBody": "I really wanted to try these but I didn't have the special pan. I went ahead and used my cast iron skillet instead. I used a thin layer of peanut oil instead of shortening. The batter was thick enough that it made little pancake shapes but thicker. I fried 4 spoonfuls at a time and flipped them after a few minutes. They turned out tasty. They have a nice crunchy layer on the outside and a soft breadlike middle. Because I like a sweeter \"pastry\" I added a bit more sugar and I also added cinnamon. The cinnamon and cardamom play well together. My son liked them plain. My daughter liked them with the cinnamon/powdered dusting sugar. I liked them with my organic raspberry pomegranate jelly. My husband thought they would taste better in Denmark but he still enjoyed them. ha ha Overall these were pretty good and they worked just fine without the special pan. They would probably be better with the special pan since it would crisp all edges as well but it was manageable and tasty anyway.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Teyana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2123245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-15T05:39:34.753Z",
                "reviewBody": "We asked the server at a restaurant in Solvang what that delicious rasberry sauce they topped their Aebleskivers before dusting with powdered sugar. She revealed that they use a seedless rasberry jam and diluted it with orange juice. Very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "capjak1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10741787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-31T23:25:21.39Z",
                "reviewBody": "Perfect. Made a lot. Freeze well. Great with mulled win or \"Glugg\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cschousboe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7380285/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-31T17:54:34.48Z",
                "reviewBody": "This is my wife's account so take with a grain of salt. She is the real cook in the house. I heard about aebelskivers from My grandfather. He told us about eating them when the Skandinavian women would gahter to quilt. He made sure to show up at the house where they were quilting so he could get some. These women were from pioneering times in my valley. So began my search. I had a great recipe but lost it so I searched here and found this recipe. I didn't have the cardoman so skipped it. They turned out great. We have 7 kids. I could not keep up once I started serving. The only problem is a I need a second pan. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tosha Nielsen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2164682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-29T20:02:58.68Z",
                "reviewBody": "! I am Danish and grew up eating these. They were a special meal (usually breakfast) that we had for special occasions holidays & potlucks and Danish holidays/celebrations. We would eat them warm straight straight out of the pan as my mother made them. I am giving this recipe 5 stars; however I did make a couple modifications to it that I feel are important for this to be more authentic and taste better; and I also feel that there are some tips and things that need to be said. Especially if you have never made these before. So here goes! First off this is a wonderful authentic recipe but with minor changes as stated below. (1) use only 3/4 of a tbsp of cardamon if you have fresh cardamon. If it is older cardamon use 1 tbsp. If you use the 1 1/2 tbsp of cardamon it has a very very strong cardamon taste. (2) once the batter is made add diced apples to it. I core and chop up 1 whole granny smith apple and throw it in there. (I don't peel mine) Any sweet tasting apple will work. I am Danish and we grew up making these in our home. I use CAST IRON aebelskiver pan which you can get from any of the scandinavian store",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly Gaskell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16901627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-15T04:29:58.413Z",
                "reviewBody": "Proud Dan here always looking for different recipes to try. These were fantastic followed recipe exactly. Served at a slumber party all the kids could not get enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ragnhild",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8353486/"
                }
            }
        ]
    }
]