[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/677/main-dish/pork/pork-roast/",
                    "name": "Pork Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/150258/autumn-pork-roast/",
        "name": "Autumn Pork Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9401902.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:32:35.000Z",
        "description": "This pork roast is surrounded by onions and butternut squash, and baked in a savory and sweet sauce.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 ½ pounds boneless pork loin",
            "1 teaspoon garlic powder",
            "salt and pepper to taste",
            "2 tablespoons olive oil",
            "½ cup dry white wine",
            "2 cups cubed butternut squash",
            "1 large onion, sliced",
            "½ cup applesauce",
            "1 tablespoon Dijon mustard",
            "1 tablespoon soy sauce",
            "½ cup brown sugar",
            "½ teaspoon ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season the pork loin with garlic powder, salt, and pepper. Heat olive oil in a large oven-proof skillet or Dutch oven over medium-high heat. Brown the pork loin on all sides in the hot oil, about 10 minutes total. Remove the pork loin from the pan, and set aside. Pour in the white wine, and bring to a simmer, stirring to dissolve the caramelized bits in the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scatter the butternut squash and onion in the skillet and place the browned pork loin on top so they work as a roasting rack. Stir together the applesauce, mustard, soy sauce, sugar, and cinnamon. Pour over the pork loin, then cover the pan with a lid or a double layer of aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake pork loin in preheated oven until it has reached an internal temperature of 145 degrees F (63 degrees C), about 1 hour. Allow to rest for 10 minutes before serving\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SJRJA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.727891156462585,
            "ratingCount": 147,
            "itemReviewed": "Autumn Pork Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "450.1 calories",
            "carbohydrateContent": "29.8 g",
            "cholesterolContent": "91.8 mg",
            "fatContent": "21 g",
            "fiberContent": "1.8 g",
            "proteinContent": "31.4 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "288.6 mg",
            "sugarContent": "22.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-03T13:37:47.413Z",
                "reviewBody": "How delicious was this?  Outstanding!  I prepared exactly as written, but added some sliced granny smith apple and dried cranberries to the vegetable mix, and decreased the brown sugar to 1/4 cup.  Roasted for about 1 hr 10 minutes, and let the meat rest before carving.  Tender, flavorful, sweet, it was perfect.  The house smelled wonderful while this was cooking.  Thanks for sharing this terrific recipe, SJRJA, it's going to be a classic in this house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Saveur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-19T17:28:58.493Z",
                "reviewBody": "Oh me, Oh my this is sssssooooo good.  I did change a few things.  I added 2 pealed apples to the squash mixture(only because I had tons of apples on hand) and I used fresh garlic, homemade apple sauce with cinnamon, so I didn't add any extra cinnamon.  When I deglazed the pan with the wine, I added the onions, garlic, and extra two apples and let everything cook down some and carmelized the onions lightly.  And just before I put it in the oven, I added a couple of small handfuls of dried crandberries for some tartness...........it turned out simply wonderful.  We gave this recipe five stars.  My husband loved it and I did as well.  With autumn being my favorite season, I will make this dish often during my favorite time of the year.  I served it with mashed patatoes, and German coleslaw from this site.  This one is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Keener",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1078669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-04T18:04:32.293Z",
                "reviewBody": "This was great! I'd had a boneless shoulder roast in my freezer for a couple months because there are many times that I do not like pork as it gets SO dry and I was reluctant to make it! Anyways I made it today and it was SO moist and delicious I couldn't believe it. The juices from the roast and applesauce and cooking out of the squash and onion really soaked into the meat and made it so moist and flavorful! I followed the recipe except that I put it in the oven before church and needed way longer than 1 hr. so I put it in at 250 F and vented the foil to prevent boil over- was gone about 4 hours. Pretty much fork-tender- amazingness.:) Served the veggies and broth over white rice. Very yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I_learned_to_cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3390993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T20:10:07.573Z",
                "reviewBody": "An excellent recipe as written. The flavors of the apple sauce sugar and soy meld really well as it cooks and no 1 flavor stands out too much. I consider the original recipe a fairly \"safe\" dish that almost everyone kids included would probably like. I also made this using the Cranberry Chutney I recipe from this site in place of the apple sauce and I loved that even more. That recipe has cranberries apple chunks and lots of \"pie spices\". The spices and cranberries kicked up the flavor and complemented both the pork and the veggies. I found adding the brown sugar unnecessary. Of course I added way more onions and squash each time and the leftovers were super for lunch the next day. So good in fact that I didn't even need the pork to go along with it and just added some leftover boiled potato to make my meal. All the juices had cooked into the veg and it was awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susanne_NL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/538634/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-27T22:00:23.687Z",
                "reviewBody": "Thumbs up on this one! I mixed the garlic powder and about tsp each s & p and rubbed into the loin before browning. Added water instead of wine. Put into 13x9 as I don't have oven safe pan and baked to temp. Still little pink in the middle which is fine with us. Great taste on the sauce. Squash was nicely flavored still couldn't get hubby to eat that though. Not to sweet nor tart. Very nice flavor on the pork when drizzled with a little of the jus. I like apples with pork may add some of those part way through next time. Thanks for the recipe SJRJA!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-27T23:18:38.66Z",
                "reviewBody": "AMAZING!!! I used a boneless pork shoulder since that's what I had on hand. Along with the butternut squash and onion I also threw in some granny smith apples and dried thyme and cooked it all together in my slow cooker on low for 8 hours. I would recommend cutting down the amount of brown sugar. The roast I cooked was a pound heavier than the one this recipe calls for and 1/3 cup of sugar was more than enough. Perhaps add more if your applesauce is unsweetened though. Either way this recipe was fantastic and totally hit the spot:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "angelique1256",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2549374/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-15T22:14:05.5Z",
                "reviewBody": "This was great I used a roast with a fair bit of marbling in it as that is my preference. Delish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5347257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-12T17:46:20.537Z",
                "reviewBody": "WOW! This was a delicious combination of flavours and a very pretty autumnal meal. I added an extra sliced apple and a handful of dried cranberries (even though I don't like them) and it was DIVINE--cranberries included!! As one reader posted make extra as it is EVEN better the next day! This will definitely be made again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3643663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-20T17:58:44.943Z",
                "reviewBody": "THIS IS A KEEPER!!!!! My boyfriend will not stop raving about this (and I cook ALOT)!! I did change a few things for convenience sake though. I changed the veggies the roast sits on to whole cloves of garlic (about 5) carrots and potatoes. let me tell you: the carrots need to be added to this recipe. they are PERFECT in the sauce! I'm sure many veggie combos would go great in this so just use what is on hand! Again: you will NOT regret using this recipe! easy and makes you look like a super-star!!!! I love the sauce so much I might just use it on veggies as a holiday side-dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kristi-marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9637937/"
                }
            }
        ]
    }
]