[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1452/bread/quick-bread/irish-soda-bread/",
                    "name": "Irish Soda Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/150426/perfectly-moist-irish-wheaten-bread/",
        "name": "Perfectly Moist Irish Wheaten Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2034460.jpg",
            "width": 6016,
            "height": 4000
        },
        "datePublished": "2020-06-19T03:32:39.000Z",
        "description": "My husband, a native Northern Irishman, loves this bread with a bowl of tomato and lentil soup or with butter and cheese or jelly. It really is so easy to make and comes out perfectly every time! I hope you will enjoy it too!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "1 cup bread flour",
            "2 ¾ cups whole wheat flour",
            "1 ¼ teaspoons salt",
            "1 ¼ teaspoons baking soda",
            "2 teaspoons white sugar",
            "¼ cup margarine",
            "2 cups buttermilk",
            "¼ cup vegetable oil",
            "1 tablespoon buttermilk",
            "1 teaspoon white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Prepare a shallow baking pan with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together the bread flour, whole wheat flour, salt, baking soda, and 2 teaspoons sugar in a bowl. Cut the margarine into the flour mixture until pieces are nearly indistinguishable. Make a well in the center of the mixture and pour in the oil and buttermilk. Stir with a spatula until dry mixture is completely moistened. Move the dough to a lightly-floured surface. Lightly knead the dough for no more than 1 minute. Place the dough into the prepared pan; pat down and around to form a round loaf. Cut a cross into the top of the loaf with your finger. Brush the top with 1 tablespoon buttermilk; sprinkle 1 teaspoon sugar over the top of the loaf.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 30 minutes. Reduce heat to 375 degrees F (190 degrees C); rotate pan and bake another 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Allow loaf to cool on a wire rack before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Irish Soda Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "laracucina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.467741935483871,
            "ratingCount": 62,
            "itemReviewed": "Perfectly Moist Irish Wheaten Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "225.2 calories",
            "carbohydrateContent": "27.7 g",
            "cholesterolContent": "2 mg",
            "fatContent": "11 g",
            "fiberContent": "4 g",
            "proteinContent": "6.2 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "555.3 mg",
            "sugarContent": "3.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-18T01:27:18.227Z",
                "reviewBody": "Excellent recipe!\nAs a native Belfast man I can recommend this as perfect Wheaten bread.\nTexture and consistency just right!\n \nDidn't quite see the point of brushing with buttermilk or sprinkling with sugar prior to baking but it did no harm anyway.\n \nThere is absolutely no need to bake this within a pan and certainly this is something I have never heard of or come across before!\nI formed the cake round onto a lightly floured Pizza baking stone.\nAgain, cutting the pre-baked bread with a finger is new to me and does not quite give the quartered effect achievable by knife.\nJust make sure to cut no more than 1/3 to 1/2  way through to give the splendid quartering or 'flowering' effect desired on all wheaten or soda breads.\n\nI used Olive Oil in lieu of vegetable and butter instead of margarine.\n\nButtermilk is not usually in one's pantry so you can add a small amount of vinegar or lemon juice to regular milk to substitute for buttermilk. Dry mix can be purchased.\n\nThe mixture stays easily on a pizza stone for baking.\nThis ensures the bread 'free-forms' as it should without using a spray buttered pan.\n\nI have uploaded two photos.\nPhoto #7 shows the consistency of the pre-baked bread and #8 shows the finished product.\nServe with Irish smoked salmon.\n\nUPDATE: 17th Mar 2011\nI deleted some info to include this...\nReviewers  have mentioned the bread as being \"too crumbly\".\nToday I added 1 egg to the mixture and found it to be \"tighter\". See Photo #10 for the texture after egg addition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BelfastJimmy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2972545/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-05T03:04:51.883Z",
                "reviewBody": "I was very happy with how this recipe turned out and will definitely make it again. I had never heard of wheaten and was a bit concerned by the lack of yeast or rising time in the recipe. I did an internet search and found out that in wheaten (aka brown Irish soda bread) the buttermilk and baking soda cause the bread to rise during baking. The bread doubled in size during baking and had the consistency of cornbread; in fact we had it with chili and it was excellent. It would be great with any meal that you'd typically have bread as an accompaniment. The dough was sticky and did not lend itself well to being free formed on a flat pan. I used the bottom of a ceramic tortilla warmer as a pan. A round cake pan would probably work well too. I used 2 TB butter instead of 1/4 cup margarine reduced the oil to 1/8th of a cup and used low fat buttermilk. The bread was still very moist and did not feel or taste \"low-fat\". I also did not sprinkle sugar on top before baking as I wanted a more savory bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "txvtchick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2441020/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-01T19:07:42.927Z",
                "reviewBody": "This is exactly the bread I loved while visiting Ireland. Our group of four lived on cheese and brown bread from Jack's in Killorglin County Kerry and were disappointed not to be able to bring extra home. Now I can make it myself -- despite the fact that I have always been a total failure at bread baking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jayne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2271217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-06T01:01:19.037Z",
                "reviewBody": "My husband is also from Northern Ireland and your wheaten bread recipe wins his approval and mine! The bread looked so gorgeous when it came out of the oven it was a shame to cut into it! And to all who have never tried wheaten bread this recipe gives the authentic taste and texture! Please try it toasted as well to bring out the nutty flavor of the wheat! On my first trip to Belfast to meet the in-laws I was given the family's recipe for wheaten bread and the bowl that the flour was measured in. I haven't made wheaten bread in some time and thought I'd give your recipe (which is different from mine) a try. It is Wonderful! One tip: whenever I have to cut in butter or margarine into flour I grate the margarine/butter over the flour. The smaller pieces are easier to cut in and it takes less time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindym",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3763304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-01T13:13:31.037Z",
                "reviewBody": "Very very happy with the results. It came out perfect just like the submitter said it would. This bread has a wonderful hearty texture and natural nuttyness from the whole wheat. As suggested by another reviewer I used only 2 T. butter and 1/8 c. oil also only 1 tsp. salt and no sugar with outstanding results. It smelled amazing while it baked and tasted delicious after it cooled a bit and the next day toasted. This recipe is a winner! Update I have made this bread more times than any other recipe on this site. I have added varying combinations of seeds nuts and dried fruits (be creative) mix seeds nuts and/or dried fruits into the dry ingredients. This recipe is adaptable as long as you stay with the original amounts of flours b. soda and buttermilk. This recipe deserves more than 5 stars!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindalmt/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T17:24:06.513Z",
                "reviewBody": "A very easy recipe. It's only fault was that maybe it was a little too crumbly - making it difficult to butter. Still very tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1760109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T19:37:27.293Z",
                "reviewBody": "I had some left over buttermilk from a different recipe I wanted to use up and decided to try this recipe. It is fantastic!! I added 1 1/4 cup of raisins as well baked it in a loaf pan rather than a round pan and it turned out excellent!! I have made a few trips to the store specially to by buttermilk now for this recipe...it has not failed me yet!! It is a must try!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHANIEBERGEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1262921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-08T17:15:02.877Z",
                "reviewBody": "This bread was very easy (and fast) to make and the result is excellent!  I baked the bread on a cookie sheet and had no trouble with the dough keeping it's shape.  The bread is very moist, but not doughy or too dense.  The sprinkling of sugar on top gives it a nice hint of sweetness.  This bread is great with jam!  I will definitely make this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzanne Taylor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2799254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T19:58:18.047Z",
                "reviewBody": "Holy Cow! I had to make 4 more batches to put in the freezer for later! My family RAVED over this bread! I havent found a whole wheat bread they liked till now! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynette Sullivan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2332618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T15:08:36.06Z",
                "reviewBody": "Just not something that we would make again. None of the family was really crazy about it. It was fun to try once.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Roger Bender",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4563195/"
                }
            }
        ]
    }
]