[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2419/desserts/frostings-and-icings/white/",
                    "name": "White",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/150741/easiest-most-delicious-meringue-buttercream/",
        "name": "Easiest, Most Delicious Meringue Buttercream",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1043716.jpg",
            "width": 1280,
            "height": 1280
        },
        "datePublished": "2020-06-19T03:32:45.000Z",
        "description": "I have tried every meringue buttercream recipe I could get my hands on over the years. I make it to decorate all our children's (and husband's) cakes and cupcakes. This is my recipe. It is easy, quick, and perfect: perfect for frosting, decorating, and eating. It is delicious. This makes a generous amount. You will not run out when frosting and decorating two 9 inch round cakes.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT0H15M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "6 egg whites",
            "2 cups white sugar",
            "3 cups unsalted butter, at room temperature ",
            "1 tablespoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the egg whites and sugar into a metal bowl and set over a pan filled with about 2 inches of simmering water. Heat, stirring frequently, until the temperature of the egg whites reaches 140 degrees. They will feel very hot to the touch.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the heated egg whites and sugar to a large mixing bowl or stand mixer. Mix at high speed (or as high as you can go without egg flying out of the bowl) until they have reached their maximum volume, 5 to 10 minutes. Mix on medium or medium-high speed while pinching off small pieces of butter and throwing them in. Mix in vanilla if using. The buttercream may look like it is breaking down, but keep on mixing and it will come back together.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings",
            "White"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "dsrinivasan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.12781954887218,
            "ratingCount": 133,
            "itemReviewed": "Easiest, Most Delicious Meringue Buttercream",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "273.5 calories",
            "carbohydrateContent": "16.8 g",
            "cholesterolContent": "61 mg",
            "fatContent": "23 g",
            "fiberContent": null,
            "proteinContent": "1.2 g",
            "saturatedFatContent": "14.6 g",
            "servingSize": null,
            "sodiumContent": "17 mg",
            "sugarContent": "16.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-07T18:52:14.377Z",
                "reviewBody": "*** Couple of notes for people who are having trouble!!  First, your egg whites should actually be heated to about 160 degrees, not 140!  An easy way to tell without using a thermometer is to dip the tip of your finger into the mixture and rub the mixture between your fingers.  If the mixture doesn't feel grainy at all, you're good to go (I also whisk the eggs constantly while heating).  Second, when you beat the egg white mixture, make sure it comes to room temperature before adding the butter (and make sure the butter is unsalted, otherwise your buttercream will taste salty).  Just feel the bowl of your mixer, and if it no longer feels warm, the beaten eggs have come to room temperature.  And finally, the most important: DO NOT THROW AWAY YOUR BUTTERCREAM IF IT APPEARS SOUPY!!!  This is normal and really, really should be mentioned in the directions for this recipe.  Your buttercream may appear curdled at first, but it will come back together.  Then it will most likely appear soupy.  All you have to do is put your mixer on the highest speed and beat the  out of it and I promise that it will stiffen up!  Don't throw all the lovely buttercream away because you think you've done something wrong.  You haven't!!  Make sure to follow these tips and try the recipe!  It won't disappoint!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aosuki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3167542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-09T15:51:15.76Z",
                "reviewBody": "Wonderful!  I just made a test batch since I'm auditioning frostings for a wedding cake, and it came out fabulous!  I actually halved the butter fearing it would be too \"buttery\" as some of the prior reviews mentioned,  but I think I might add more (if not all) next time.  Besides, when reducing the butter, you'd have to cut the sugar a bit in order to account for the lesser volume.  I put a little aside, and added a little espresso powder and a little cocoa powder for a mild mocha, and that was great too.  I used it for piping, and it piped well.  This recipe is the one I'm using for the wedding cake; chocolate cake, mocha buttercream filling, vanilla buttercream frosting and decoration.  This is a Swiss meringue buttercream, and I think it's much easier than the Italian buttercream that I tried making before.  Oh, I also heated the egg whites to 160*F to eliminate salmonella concerns; recipe turned out fine for me.  I used an electric hand mixer, not a stand one also; took a little longer, but the results were good. ****Voice of Experience- DO NOT USE PRE-PACKAGED LIQUID EGG WHITES. They will NOT work (or not well).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1961680/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-26T16:27:38.35Z",
                "reviewBody": "This was so good! Might be the best buttercream I have ever tasted. I only gave it four stars because I only put in two cups of butter and I don't know how it would be with three. I stopped at two cups of butter because that was when it came together and was really fluffy. I was worried about too much butter because other recipes I have tried similar to this have ended up just tasting like butter. Two cups worked perfect for our taste. I filled and frosted 26 cupcakes with plenty left over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DebraMahon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2710665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-15T16:40:01.543Z",
                "reviewBody": "Ok I'm pretty sure that I am not crazy here I have never had trouble following directions! I have made this buttercream THREE times and have wound up with a yellow soup like mixture that isn't really suitable for cake frosting (plus it doesn't taste the greatest unless you like eating raw butter). All three times I followed the directions to a T! Each and every single time my buttercream ends up into a messy yellow soup! I even refrigerated it OVERNIGHT and woke up to a lumpy yellow mess. Can someone tell me what I amm doing wrong??? I really wanted this to work out as I have heard so many good things about this frosting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy TM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3688494/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-08T05:38:41.8Z",
                "reviewBody": "I can't believe how good this is! While my egg white/sugar mixture never seemed to increase in volume to any degree (perhaps because I used raw sugar?) it still came out wonderful. It is not too sweet and is very smooth. Because of the egg whites however it might be advisable to refrigerate this after icing the cake. I used this for my son's dragon cake for his 11th birthday.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurel Harvey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/594997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-10T19:14:14.743Z",
                "reviewBody": "People who are ending up with yellow soupy icing: your meringue is not cool enough and your butter is too soft. When you are adding it to the egg whites it is melting the butter which causes the fat to separate from the milk solids which causes oily runny frosting. The butter should be soft but not glistening and the meringue should be lukewarm when you add it. Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baker Beverly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1871292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T17:10:25.393Z",
                "reviewBody": "I can't say enough good things about this recipe: Simple ingredients Easy instructions Wonderful taste and texture. I am definitely keeping this one. As others have said the only thing that I did differently was to cook the eggs to 160 degrees. It turned out perfectly. I don't see it mentioned anywhere however after I frosted the cake I did place it in the 'fridge fora while and it only got better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Skunkee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/756357/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-01T13:20:58.447Z",
                "reviewBody": "I made this twice thinking I did something wrong the first time. The flavor was wonderful however the frosting came out VERY thin and runny each time regardless of how long I beat the egg whites. The butter completely thinned it out and it was not stiff at all. I even refridgerated it for several hours thinking that might stiffen it up with no luck. I could be doing something wrong but I followed the recipie exactly and both times I ended up with very thin frosting more like an icing actually.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "cjja77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3113054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T00:59:16.327Z",
                "reviewBody": "So smooth and creamy and delicious! Not too sweet. Perfect consistency and I love how bright white it is. I'll never use another frosting recipe ever!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2937794/"
                }
            }
        ]
    }
]