[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/151366/costas-french-market-doughnuts-beignets/",
        "name": "Costas French Market Doughnuts (Beignets)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4379140.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2020-06-19T03:32:51.000Z",
        "description": "As kids, we always put in a heart-filled request for these on Christmas Eve. It was quite a family affair - my mom would make up the dough, my dad would roll them out and cut them and then after frying them up, us kids would take turns shaking them in a paper bag with powdered sugar! I finally got to go to New Orleans and I was excited to get to try 'the real thing' at the famous Cafe Du Monde...I was SO HAPPY because my husband and I both said our recipe was a near carbon copy of CAFE DU MONDE! We've made this recipe for over 40 years and I promise it won't disappoint!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "½ cup water",
            "1 tablespoon yeast",
            "¼ cup shortening",
            "½ cup sugar",
            "1 teaspoon salt",
            "1 cup boiling water",
            "1 cup evaporated milk",
            "2 eggs, beaten",
            "7 ½ cups flour",
            "1 quart vegetable oil for frying",
            "1 cup confectioners' sugar for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour 1/2 cup room temperature water into a small bowl. Sprinkle the yeast over the water and let stand for about 5 minutes to dissolve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the shortening, sugar, and salt in a large bowl. Pour the boiling water over the shortening mixture and then stir in the evaporated milk. Wait for the mixture to cool down until it is lukewarm. Then, add the yeast and water mixture and beaten eggs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slowly mix in the flour until the dough forms a ball. Cover the dough with plastic wrap and refrigerate for 30 minutes to 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working with a small portion (a little larger than a baseball) at a time, roll out the dough 1/8-inch thick. Cut the rolled out dough into strips 2 to 3-inches wide, then cut again in the opposite direction and at an angle, making diamond shapes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat your oil for frying in a deep and wide, heavy-bottomed skillet over medium-high heat to 360 degree F (180 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slide dough slowly into the oil to avoid splattering and deep fry until they puff up and are golden brown, 3 to 5 minutes. Carefully remove onto a rack with paper towels underneath and allow to cool until you can handle them. Place in a clean paper bag with confectioners' sugar and shake gently until covered generously  or, use a sifter to dust the beignets with powdered sugar.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Adrienne Belaire"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.612403100775194,
            "ratingCount": 258,
            "itemReviewed": "Costas French Market Doughnuts (Beignets)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "502.9 calories",
            "carbohydrateContent": "80.9 g",
            "cholesterolContent": "37.1 mg",
            "fatContent": "14.8 g",
            "fiberContent": "2.3 g",
            "proteinContent": "10.9 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "230.8 mg",
            "sugarContent": "20.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-05T17:32:53.89Z",
                "reviewBody": "These little gems are not Cafe Du Mond quality but darn close.  I think the dough is missing a little something.  I think I might try adding some vanilla or almond extract on my next go around.  A couple of modifications I made to this recipe was to use peanut oil rather than the vegtable oil and for the topping, add a little cinnamon and pumpkin pie spice to the powdered sugar.  I highly recommend giving it a try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Knoblock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/763637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T19:09:24.49Z",
                "reviewBody": "This took a bit of trial and error to get right. The oil on medium high is way to hot and the beignets just burned. My perfect temp was medium low. Dont cook more than 2 - 3 inch squares or 4 triangles at a time or it will lower the temp of the oil to the point that they will not puff up. When cooked properly they will first sink then puff up and float, then turn golden, if they start to spot your oil temp is to high. When I finally got the temp right they seemed a bit bland so I added brown sugar and cinnamon in my next dough ball and rolled it out so it had a marbled effect (this is so the way to go and I will continue to do that). If you put your paper towel and cooling racks on a cookie sheet you will be able to powder them there too and clean up will be a breeze. I made 3/4 of a batch and froze the rest. My 3 kids consumed them all only letting my husband and I snag 2 a piece so I will make a whole batch next time. Please also note that if you use the packets of yeast that it is only equivalent to 2 1/4 tsps and that would make your beignets not puff up as much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffin Mom N Garlic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/domesticgoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-04T23:33:39.063Z",
                "reviewBody": "This recipie makes a massive amount of Beignets!  I refrigerated the dough and made a batch for breakfast a few days in a row!  Just like New Orleans!\n\nJust a warning - clean up immediatly - the dough is like cement when it dries!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Wade",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2679934/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-08T09:06:29.25Z",
                "reviewBody": "Yummy Yummy beignets. Haven't tasted the real thing from Cafe Du Monde, but judging from the outcome of these yummy delights I can imagine what the real taste must taste like :) Also what I did was to eat them with sardine in tomato sauce. Tips when frying: Make sure the oil is not TOO hot or the inside won't cook and the outside would browned too much. Always flip them over and over again to get even colors on both sides. Thanks for sharing the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZAKIAH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1165800/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-08T17:35:35.15Z",
                "reviewBody": "oh my goodness oh my goodness!!! I was craving donuts so badly and decided this was the recipe for me. So glad that I did! I have never had the \"real\" ones but if they taste this good...they would be awesome. Huge recipe but good if you can take them to work or have a hungry family! Next time I will try filling them with some vanilla pudding and drizzling with some choc syrup for a nice presentation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LITTLECHILE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1446818/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-23T19:30:04.017Z",
                "reviewBody": "These brought me back to my honeymoon in New Orleans! So light, melt-in-your-mouth delicious. They're good the first day, but AMAZING right out of the pan. I agree that this recipe makes a TON-- next time I'll cut it in half at least. I didn't have shortening so I used butter, and I didn't have evaporated milk so I used water and \"coffee whitener\" (that creamer powder). I also added in about a tsp of vanilla as someone else suggested. I was concerned at first about rolling out the dough so thin, but it puffed up a huge amount while being fried. To dust with powdered sugar, I lined a tupperware container with paper towels, put in some of the fresh beignets and powdered sugar, and shook the whole thing. It worked beautifully and was a great way to transport as well. These will be a new chanukah tradition in our family! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maya Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/855086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-02T14:39:24.547Z",
                "reviewBody": "Very good! The full recipe made 52 beignets (not all exactly the same size)! I think I'll try half a recipe next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3110022/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-03T16:33:28.54Z",
                "reviewBody": "It's a great recipe. I walked within a half-block of Cafue Du Monde a few years ago, but I couldn't convince anyone to go there. So I have nothing for comparison.\n\nI wanted to give it four stars only because I'm not sure it's significantly different than any other fried dough recipe. In fact, it reminds me of the corn nuggets at Sonny's BBQ. But this dough recipe is a little less  sweet. \n\nAlso, I'd like a little more. For example, I plan to mix up a chocolate mousse next time and use a piping bag to squirt some mousse inside the beignets.\n\nThe best part of the recipe is that the dough could be used for much more. I think it might work for Jamaican beef. Given its utility, I decided to give it a full five stars. But I'd like to see what people can do by combining this recipe with another on the site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ron White",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1257774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-16T15:15:05.487Z",
                "reviewBody": "These are excellent and can be frozen! I followed the recipe exactly except I cut it in half. This still made a ton and I had no choice but to try freezing them. I made sure they were cool and I did not add the confectioners sugar to the ones I was going to freeze. I thawed them in the microwave on med power for 30 second intervals and then shook them in the bag of sugar. They were perfect - just like the day I made them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherise Montie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/889956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-17T15:25:13.707Z",
                "reviewBody": "I followed the recipe and ended up with fried bricks after 4 hours total of my time. Wasted ingredients and wasted time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Amandandoug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5141731/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Costa's French Market Doughnuts (Beignets)",
            "description": "See how to make pillowy beignets like they serve at Cafe du Monde.",
            "uploadDate": "2013-06-12T18:47:04.705Z",
            "duration": "PT4M46.578S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F699a92df-5d71-4fbd-ad38-ce2f328f3420%2Fd51e5ea5-6e3c-449a-a33d-681175581a2a%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2474807505001"
        }
    }
]