[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/152690/angies-perfect-dinner-rolls/",
        "name": "Angie's Perfect Dinner Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7377192.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:33:07.000Z",
        "description": "This is a recipe given to me by my aunt. The rolls are excellent!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT4H35M",
        "recipeYield": "36 rolls",
        "recipeIngredient": [
            "2 ½ cups warm milk",
            "4 teaspoons active dry yeast",
            "½ cup sugar",
            "2 eggs",
            "½ cup butter, softened",
            "2 teaspoons salt",
            "7 cups all-purpose flour, or as needed",
            "½ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour milk into a large mixing bowl, and sprinkle yeast over the surface. Allow to rest for 5 minutes. Beat in the sugar, eggs, 1/2 cup butter, and salt; blend thoroughly. Gradually stir in the flour to make a soft dough. Cover bowl, and set in a warm place until dough doubles in size, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, cover the bowl, and allow to rise again. Repeat this step two more times.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Break off 2 to 3 inch size pieces of dough, roll lightly into round shape, and place in prepared baking dish, edges touching. Repeat to make 36 dough balls. Cover and let rise until doubled in size.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake rolls in preheated oven until tops turn golden brown, 10 to 15 minutes. When rolls are finished baking, drizzle melted butter over the top, and serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cristy H."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.647492625368732,
            "ratingCount": 678,
            "itemReviewed": "Angie's Perfect Dinner Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "158.2 calories",
            "carbohydrateContent": "22.3 g",
            "cholesterolContent": "25.2 mg",
            "fatContent": "6 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "177.1 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-02T01:59:26.167Z",
                "reviewBody": "I am first of all a long time yeast dough maker and familiar how things should be done.  These are excellent!  Because I have a dough hook, I put all wet ingredients including the butter (I warmed it with the milk)...then the dry ingredients from smallest amounts to the largest.   Dough is slightly wet, and it would not hurt to add a little extra flour, perhaps a 1/2 cup.  \nI also egg washed (beaten egg with 1 TBL water)and brushed them.  The rolls shined  coming out of the oven.  Will make these again.  Urge you to give this a try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J. P. Medvit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1668832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-16T00:52:13.143Z",
                "reviewBody": "I am 10 years old and I love these rolls!!!!!!!!! If I had to chose ice cream or these rolls, I would diffenitly chose the rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2441313/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-04T19:33:36.923Z",
                "reviewBody": "Followed the directions exactly and got nice fluffy, beautiful dinner rolls!  Everybody loved them and they made great little sandwich rolls the following day.  Watch the quantity though, this recipe makes 36 rolls which is a lot of rolls for a small family!  I cut the recipe in half and still got 20.  Also if you are having a hard time getting the dough to rise while in the bowl, heat up your oven and then turn it off and leave the bowl of dough to rest on top of your oven door while the door is open, it helped my dough to rise.   Will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Peacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2326483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T00:05:35.937Z",
                "reviewBody": "These are FANTASTIC!!!!\nThe dough is very sticky, and I did have to use about an extra cup of flour.\nI used my KitchenAid Artisan stand mixer, and note to those of you who own the same model: there is too much dough for this size mixer and it got jammed all up in the arm.  I had to stop the machine, divide the dough into two piles, and knead each one separately and then tossed them together in a bowl.  Excellent, excellent, and excellent! They are soft and pillowy and turn out HUGE!  I rolled my dough into the smallest of balls and they turned out the size of bakery muffins.  My one and only (minor) qualm: I will add more salt to the recipe next time.  Perhaps a half teaspoon and see how that goes.  Thank you though, these are the rolls I've been looking for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "April",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/356163/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-30T21:52:21.77Z",
                "reviewBody": "These are amazing! A few comments for some of the problems others have mentioned below:\n\nIf you knead the dough it will get too chewy and  will  not rise as much. So seriously, mix just like you would a muffin batter, easy does it.\n\nButter your hands to shape. And use that flour you were tempted to add for working into balls.\n\nGo easy on the salt. Salt enhances flavor but it also slows the yeast growth down. Too much salt will kill your yeast and result in heavy dense roles that just don't rise. No more than 4 - 5 tsp.\n\nAbout that flour. Use All Purpose for these, not bread flour. Too much gluten give a firm crumb. The goal here is pillowy softness.\n\nHumidity and storage time can all affect how much moisture your flour  needs, not the other way around. Think of the dough like pie crust and wait until the final shaping to add additional flour. Just use a stout spoon to punch down. Again, no kneading!\n\nBig batch means more to freeze! After the final rise before shaping, scoop out as much as you want to bake right away and stash the remaining dough in the fridge. Shape and let the rolls rise. Now, Line a cookie sheet with wax  paper. Shape balls of dough and position on the paper without touching and put in the freezer. If you don't have room for multiple pans, stash the remaining dough in the fridge and set up a production line.\n\nCongrats you now have rolls, the making of monkey bread, breadsticks, you name it.  Store in a plastic bag or tub.  Thaw, covered and shape and bake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catherine Gibson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14382257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-24T05:23:09.06Z",
                "reviewBody": "very easy!  I'm not a bread maker but these turned out much better than store bought. I think I might try a bit more flour next time as one reviewer stated.  The dough was very wet. Not so easy to work with. I found out you can make these the day before and freeze.  I put them into a greased 8x8 pyrex dish and froze them just before the final raise. The next day it took about three hours to thaw and raise before they were ready for the oven. I don't know how well a larger dish would work though as the rolls in the middle took longer to thaw and raise than the ones on the outside. But they were delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristie Ann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1642596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T12:09:54.91Z",
                "reviewBody": "The rolls tasted good, but I would bake them in a bigger baking dish next time. I had to throw out 2 of the center ones because they just wouldn't bake and the rest of them were already really brown on the top and bottom.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetnsassy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1889207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-07T15:14:29.447Z",
                "reviewBody": "I've made these twice. First time I was impatient and let the dough rise only once before shaping into rolls. Second time I replaced half flour with whole wheat flour. Both times they were delicious but the recipe dose need more flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "McHannah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2531458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T23:44:18.453Z",
                "reviewBody": "I had these at my mom's house and had to have the recipes.  I used my bread machine on the dough cycle and cut the recipe by half (except used 4 C flour) and they were really good.  Not quite as good as mom's, but maybe that is because someone else made them!  Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill Emanuel Myers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/76410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-23T17:17:51.827Z",
                "reviewBody": "Followed the recipe exactly - came out with \"rolls\" that were golden brown on top and gooey in the middle.... now trying to salvage to have some sort of bun with the beef dip... since the buns are key in that dinner. The parts that cooked tasted ok but I am very dissapointed with the results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SuperMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4154129/"
                }
            }
        ]
    }
]