[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/377/desserts/cakes/cupcakes/",
                    "name": "Cupcake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17559/desserts/cakes/cupcakes/pumpkin/",
                    "name": "Pumpkin",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/153245/pumpkin-spice-cupcakes/",
        "name": "Pumpkin Spice Cupcakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F466758.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:33:11.000Z",
        "description": "This hearty pumpkin cupcake with a cinnamon-cream cheese frosting is good in the fall or any other time of the year.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "24 cupcakes",
        "recipeIngredient": [
            "2 ¼ cups all-purpose flour",
            "1 teaspoon ground cinnamon",
            "½ teaspoon ground nutmeg",
            "½ teaspoon ground ginger",
            "½ teaspoon ground cloves",
            "½ teaspoon ground allspice",
            "½ teaspoon salt",
            "1 tablespoon baking powder",
            "½ teaspoon baking soda",
            "½ cup butter, softened",
            "1 cup white sugar",
            "⅓ cup brown sugar",
            "2 eggs, room temperature",
            "¾ cup milk",
            "1 cup pumpkin puree",
            "1 (8 ounce) package cream cheese, softened",
            "¼ cup butter, softened",
            "3 cups confectioners' sugar",
            "1 teaspoon vanilla extract",
            "1 teaspoon ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C). Grease 24 muffin cups, or line with paper muffin liners. Sift together the flour, 1 teaspoon cinnamon, nutmeg, ginger, clove, allspice, salt, baking powder, and baking soda; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat 1/2 cup of butter, the white sugar, and brown sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Stir in the milk and pumpkin puree after the last egg. Stir in the flour mixture, mixing until just incorporated. Pour the batter into the prepared muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden and the tops spring back when lightly pressed, about 25 minutes. Cool in the pans for 5 minutes before removing to cool completely on a wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the cupcakes are cooling, make the frosting by beating the cream cheese and 1/4 butter with an electric mixer in a bowl until smooth. Beat in the confectioners' sugar a little at a time until incorporated. Add the vanilla extract and 1 teaspoon ground cinnamon; beat until fluffy. Once the cupcakes are cool, frost with the cream cheese icing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cupcake Recipes",
            "Pumpkin"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Javaru"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.542087542087542,
            "ratingCount": 594,
            "itemReviewed": "Pumpkin Spice Cupcakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "243.9 calories",
            "carbohydrateContent": "37.2 g",
            "cholesterolContent": "41.6 mg",
            "fatContent": "9.8 g",
            "fiberContent": "0.8 g",
            "proteinContent": "2.9 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "220.1 mg",
            "sugarContent": "26.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-05-13T22:32:28.42Z",
                "reviewBody": "The first thing I noticed is that just about every person making these were changing the recipe to make them better so therefore they are not rating this specific recipe. I am only giving this recipe 3 stars because there are a few things I noticed that is a big no no. First for the perfect moist cupcake you should use oil instead of butter. While butter does taste better the oil will give it the moistness that is needs. The second thing was the ratio of pumpkin. I added an extra 1/4 cup because I knew it would need it. Also it does not matter whether or not the eggs are at room temperature. I use them straight from the fridge. Because I am adding extra pumpkin I just make sure that the spices are not level but instead are slightly mounded. One last thing that I add is 1/4 cup applesauce because that will also give them a great texture. To cook them, you should ALWAYS bake cupcakes at 350 degrees so they cook more evenly and then you should not bake them for 25 minutes, otherwise you will overbake them. I cook them for 19 minutes and they come out perfect. This recipe does  have potential but I have created my own recipe since I have more then 10 years of baking experience.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DelightfulDines",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2908393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-29T17:23:49.13Z",
                "reviewBody": "After following the top rated reviews I decided to make some of my own personal modifications. The result was the most MOIST, SPICY and DELICIOUS pumpkin spice cupcake I've ever had!   First, I definitely replaced the butter for an equal amount of vegetable oil- BIG contributor to the moist factor. Second, I reduced the heat to 350 deg and cooked for 22 minutes, NO MORE! Third, wait for it... I DOUBLED the pumpkin, nutmeg, cinnamon, and cloves. I know it sounds crazy but it contributes to the beautiful deep color I got and the spicy, full flavor.  Fourth, I DOUBLED the frosting recipe. I had a bit leftover but when I tried the original recipe AS IS, it was not nearly enough.  Fifth, I added an extra egg and did not worry about keeping them at room temperature. Mine came straight out of the fridge.   This modified version was STELLAR!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwenith Lammers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5666068/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-02T15:27:07.32Z",
                "reviewBody": "I just made these cupcakes and they were by far some of the best I have had in a long time. They taste and look like they were purchased from a cupcake store. I did however read a lot of the reviews, and took all the tips into consideration. Here are the changes I made for perfection:\r\n1. Reduced Heat to 350 and baked 22 minutes.\r\n2. Put 1 whole can of pumpkin puree (equals about 1 1/2 cups)\r\n3. Used 1/2 cup vegetable oil instead of butter.\r\n4. used \"heaping\" spoonfuls of the spice, and left out the clove.\r\n5. used 1 tsp salt (instead of half)\r\n6. For the frosting only used about 2 cups sugar instead of 3.\r\n\r\nI am already heading out to the store to buy ingrediants to make these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CorinneRW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7780723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-12T21:51:11.203Z",
                "reviewBody": "mmmmmmmmmmm SO GOOD! will definately make again! followed the recipe exactly and they are delicious. and everyone loves them. THANK YOU!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christy Lee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2620265/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-29T15:39:53.82Z",
                "reviewBody": "WHY ARE ROOM TEMPERATURE EGGS SO IMPORTANT? A typical step in a buttercake recipe is to cream with fat and sugar and then add in the eggs one at a time. This creates an emulsion. Fat and liquid by nature are unmixable and the goal when mixing a recipe is to form a water-in-fat emulsion. A well emulsified cake batter for example should not be curdled or weeping liquid which happens if cold eggs are introduced to a room temperature butter/sugar mixture. If the emulsion breaks the batter will loose air cells. This results in a baked cake that is grainy or flat in texture dry and flavorless look uneven and may even sink......This is why she used room temperature eggs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "stephanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4444847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T20:31:05.23Z",
                "reviewBody": "I am giving four stars based on the original recipe...my changes would boost it up to five.  This is a great, basic pumpkin cupcake recipe as-is.  However, as other cooks have commented, OIL is really what is needed to make a very moist and tender cupcake.  Leave butter for your full-size cakes, bundts, and pound cakes (I even have certain bundt cake recipe that are all oil rather than butter.)  I am not big on all the spices, so I kept it simple: 1 tsp. of cinnamon and 1/2 tsp. of pumpkin pie spice, that's it!  This will sound crazy, but I also double the salt.  Why?  Because something magical happens when you add a hearty dose of sea salt to a spicy cake.  I make a spiced applesauce bundt cake a few weeks ago, and the recipe called for 1 and 1/2 tsp. of salt.  I was hesitant but made it that way anyway.  It was UNBELIEVABLY good!  Now I always double my salt when using cinnamon and other spicy ingredients in my sweet stuff.  As for the sugar, I just did equal parts of white and brown.  And I made cake flour instead of using all-purpose.  This small change alone will make your cuppies very fluffy and moist.  I used buttermilk instead of whole as that's what I had on hand.  Buttermilk is great with pumpkin anyway.  And as a few others did...I increased the pumpkin by 1/4 cup, and then I added another 1/4 cup of sour cream.  It seems like a lot of moisture, but it really makes the cupcakes super moist.  I made both large and small, all turned out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Bakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-20T17:33:17.197Z",
                "reviewBody": "I followed the recipe exactly, which I NEVER do, but did this time, since I was making this to put out for Bunco night, and gatherings like that require full-fat goodies.  Well, they taste delicious, but I found them to be a bit dry, so next time I will use oil instead of butter and moisten them up a little more with some applesauce!  Good recipe, just not the ultimate- Yet!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffinmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2457961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T18:39:11.79Z",
                "reviewBody": "After MUCH searching for the perfect pumpkin recipe I think this one is close! I added a bit more cinnamon and clove and used \"pumpkin pie\" mix instead of puree. I also added an extra cup of the pie mix to make the cupcakes much more moist. they are perfect! Crunchy on the outside and VERY moist on the inside!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Kai",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3960029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-04T18:18:24.997Z",
                "reviewBody": "These cupcakes were so good! I did change a few things though after reading some reviews. I replaced the butter with oil and I doubled the pumpkin and cinnamon. I baked them at 350 degrees for 20 min. They were so moist and tasty and the cinnamon cream cheese frosting topped it off nicely. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelli F",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2168402/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Pumpkin Spice Cupcakes",
            "description": "These delicious cupcakes make any fall occasion special.",
            "uploadDate": "2012-10-24T22:17:10.244Z",
            "duration": "PT6M32.559S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb5e4ca2e-5b0a-4973-a5db-2f11a17864f7%2F7148d831-3a66-4b0b-a824-ae497798a113%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1922538345001"
        }
    }
]