[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/154297/italian-cream-cheese-and-ricotta-cheesecake/",
        "name": "Italian Cream Cheese and Ricotta Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F403548.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:33:18.000Z",
        "description": "This is my grandmother's cheesecake recipe passed down to my entire family. It's the best. I can't believe I'm sharing it, but everyone needs to know how to make an authentic Italian cheesecake. It is creamy and not thick, which is why our family LOVES it! For best results, do NOT substitute any ingredients with low-fat unless you've made it before and want to experiment.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT6H15M",
        "recipeYield": "1 9-inch cheesecake",
        "recipeIngredient": [
            "2 (8 ounce) packages cream cheese, softened",
            "1 (16 ounce) container ricotta cheese",
            "1 ½ cups white sugar",
            "4 eggs",
            "1 tablespoon lemon juice",
            "1 teaspoon vanilla extract",
            "3 tablespoons cornstarch",
            "3 tablespoons flour",
            "½ cup butter, melted and cooled",
            "1 pint sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9-inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the cream cheese and ricotta cheese together in a mixing bowl until well combined. Stir in the sugar, eggs, lemon juice, vanilla, cornstarch, flour, and butter. Add the sour cream last and stir. Pour the mixture into the prepared springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven 1 hour; turn oven off and leave in oven 1 hour more. Allow to cool completely in refrigerator before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "April Caudle"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.720450281425891,
            "ratingCount": 533,
            "itemReviewed": "Italian Cream Cheese and Ricotta Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "703.5 calories",
            "carbohydrateContent": "49.8 g",
            "cholesterolContent": "228 mg",
            "fatContent": "50.1 g",
            "fiberContent": "0.1 g",
            "proteinContent": "16.1 g",
            "saturatedFatContent": "30.7 g",
            "servingSize": null,
            "sodiumContent": "384.2 mg",
            "sugarContent": "38.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-27T00:24:19.32Z",
                "reviewBody": "I've made this cheesecake twice now. The first time I followed the recipe exactly. The texture was exactly what I was hoping for and it tasted great. Unfortunately the cake developed a gigantic crack while it was cooling. I think the baking temperature was too high and it got overbaked/dry. I really loved the flavor so I made it again with a couple alterations. This time around I used only 8oz of sour cream, and added another 8oz of cream cheese. I made a cinnamon graham cracker crust for it. I also baked it at 475 F for 10 minutes, then dropped the temperature to 200 F for an hour. I let it sit in the oven for about 3 hours after it was done baking, then set it on the counter to cool completely before putting it in the fridge. I blended up some fresh strawberries, and diced a few and mixed them together to top the cake. This time it didn't crack, the cake was very soft with a fluffy texture, and it tasted amazing! Quite possibly the best cheesecake I've ever had.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dan le Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3329538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-27T18:31:03.27Z",
                "reviewBody": "This is the best recipe by far but I've added some of the tips from my own experience that worked perfectly.  I preheated at 350 degrees and then turned down to 325 to cook.  I wrapped the base of the springform pan in 3 layers of tin foil (take my advice and try not to be cheap on the foil).  I placed the pan in a roasting pan and then put about 1-1/2\" of boiling water in the pan after its in the oven (easier not to spill or tip).  I then bake for approx. 1-1/2 hours at 325 degrees instead of the 350.  The center will still wiggle (area about the size of a 1/2 dollar) and then I turn off the oven and leave it in for 3 hours and I make sure once I check for it to wiggle, I don't open the oven door again for the entire 3 hours.  I take it out and leave it on the counter for another 2 hours and then put in the refridgerator overnight.  If you follow exactly the time limits, you are sure to have no cracks, no soggy crust from water seepage, and the most deliciously moist cheesecake you've ever had.  I also add 1/2 tspn of lemon zest which gives it a nice slight lemony flavor which my family loves.  I will continue to use this recipe and thanks for the hints.  I hope I've helped.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4362771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-17T18:30:39.623Z",
                "reviewBody": "This is MY grandmother's recipe, too!  I was just handed this recipe from my mother, who decided of the five of her daughters, I was the only one qualified to get my grandmother's recipe book!  Awesome cheesecake - but I leave it in the oven for 3 hours (don't even open it!) after it's cooked, then leave on the counter for another two hours, then chill it.  And, to avoid a split top, bake the cheesecake inside of a shallow pan with about an inch of water.  Keeps the cake moist and it won't crack!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KelleyBelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/crazycookingcatlady/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-28T23:15:36.203Z",
                "reviewBody": "I decided to make this cheesecake because it's true Italian with the use of Ricotta. I followed the ingredients; exactly. I also used a water bath by adding warm water and wrapping the 9\" spring pan in foil, so that the water would not seep into the pan. I let it sit, after cooked, in the oven for 2 hours and then refrigerated overnight. Let me say--this is the BEST cheesecake that we have ever had! By \"we\" I mean about 12 people for dessert on Christmas. Everyone there was from New York (we now live in Texas) and they were beyond impressed. I was asked for the recipe by everyone. I will be making this again for New Year's Eve for some local friends. THIS IS A KEEPER and I will be making it often!!! THANK YOU!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annmarie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3214332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-09T01:03:49.84Z",
                "reviewBody": "It's a basic good recipe-it's much like the Argo Cornstarch recipe of years ago. But by no means whatsoever is it an authentic Italian recipe:sour cream and cream cheese...these ingredients are just not Italian or used in Italy in  ricotta pies or cheesecakes. Sorry. It's not a bad recipe-it just irks me when something is billed as authentic Italian fare and it's just not. Americans of Italian descent living in America would make this and call it \"Italian\". I would call it American-Italian. Like Ragu.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ValerieSara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4548238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-26T23:27:05.053Z",
                "reviewBody": "Easily the BEST cheesecake I've ever eaten!  And with no crust to distract from the creamy \"cheese\" taste...yum!  It took me 4 tries to finally get zero cracks on the top.  After mixing the cream and ricotta cheeses until smooth, add the sugar, eggs, lemon juice and zest, vanilla, cornstarch, flour and butter and combine all at the same time.  Don't over-mix!  Gently add sourcream last and don't pour everything right into the middle of the pan--try to evenly distribute.  I also added two 9x13 pans filled with boiling water on the rack beneath the cheesecake.  Baked at 325 degrees for one  hour only and left in the oven for 2 hours with the hot water.  After 2 hours removed the pan with the beautifully, un-cracked, perfect cake!  After greasing the springform pans, you may want to cut a piece of parchment paper for the bottom before pouring in the batter.  When releasing the pan, remove the ring, but leave the cake on the bottom (with the parchment) and place on a lovely footed cake stand for serving.  The parchment will protect the cake from picking up the \"metal\" taste of the pan.  Also, it is a necessity to let the cake sit in the refrigerator at least overnight prior to serving--make sure it's covered so it won't pick up the flavors of nearby foods.  I've noticed that if it sits in the frig for a couple of days prior to serving, it tastes better.  GREAT recipe--thanks SO MUCH!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KatMac",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4405112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-13T23:02:19.487Z",
                "reviewBody": "Very good cheesecake! Not too sweet. It was light and creamy. I followed the recipe exactly as it called for. I never opened the oven after the first hour of cooking and left it in there another hour. After I took it out the cheesecake jiggled in the middle - I was so worried it wasn't cooked enough. But after the 6 hours of chilling in the fridge it was awesome! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2024611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-17T00:50:49.483Z",
                "reviewBody": "Very good cheesecake. I did substitute lower fat ingredients (1 block of 1/3 less fat cream cheese and low fat sour cream - other than that regular ingredients). It was very quick to make since there is no crust. Just the right texture and wonderful flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2853544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-02T02:39:34.943Z",
                "reviewBody": "This cheesecake recipe is EXCEPTIONAL! I made it for my mom for Thanksgiving as she prefers and authentic crustless toppingless cheesecake. I made it in a bain-marie and it turned out beautifully. The cake itself is light and airy and not very sweet at all just like the cheesecakes at the deli! Tastes even better the day after!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MKCortes (Latin Goddess)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2975620/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Italian Cream Cheese and Ricotta Cheesecake",
            "description": "Delectable, classic Italian creamy cheesecake.",
            "uploadDate": "2017-03-30T21:40:15.674Z",
            "duration": "PT50.55S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fed706e14-918d-4f4d-90cf-9f79be503f4b%2F5545e22c-4c95-49b6-98f9-6d96002f2f80%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5379562671001"
        }
    }
]