[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/854/desserts/cookies/refrigerator-cookies/",
                    "name": "Refrigerator Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/155114/christmas-pinwheel-cookies/",
        "name": "Christmas Pinwheel Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F319681.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:33:21.000Z",
        "description": "This recipe was handed down by my 'Baba' (Ukrainian for 'grandmother'). She originally just made a chocolate and plain pinwheel cookie, but I adapted it easily to create a very colorful variety that my kids and husband adore at Christmas time!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT8H30M",
        "recipeYield": "72 servings",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "1 teaspoon baking powder",
            "¼ teaspoon baking soda",
            "1 teaspoon salt",
            "1 ⅓ cups butter",
            "1 cup packed brown sugar",
            "⅔ cup white sugar",
            "2 eggs, beaten",
            "1 ½ teaspoons vanilla extract",
            "1 drop red food coloring, or as needed",
            "1 drop green food coloring, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sift the flour, baking powder, baking soda, and salt together into a bowl. Resift again into another bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the butter with the brown and white sugars in a mixing bowl until light and fluffy. Beat in the eggs and vanilla until smooth. Gradually stir in the flour mixture until evenly blended. Gather the dough into a ball, and divide into two equal parts. Place one half in a second bowl. Add red food coloring to the dough in one bowl, and green food coloring to the dough in the other bowl. Use a fork or wooden spoon to blend the food coloring into the dough until evenly blended. Add additional drops of food coloring to make the desired shade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out the red dough to 1/4 inch (5mm) thickness. Roll out the green dough to 1/4 inch (5mm) thickness, and place on top of the red dough. Beginning on one edge, roll the doughs to make a log so the two colors spiral inside each other. Wrap the log in waxed paper, then in a cotton towel, and refrigerate at least 8 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease 2 baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Unwrap the dough log, and place on a clean, lightly floured surface. Slice the log into rounds 1/8 inch (3 mm) thick, and place on prepared baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until set, 5 to 6  minutes. Watch carefully to prevent edges from browning. Remove from oven, and cool on racks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Refrigerator Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Gitano"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9928057553956835,
            "ratingCount": 139,
            "itemReviewed": "Christmas Pinwheel Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "76.5 calories",
            "carbohydrateContent": "10.2 g",
            "cholesterolContent": "14.2 mg",
            "fatContent": "3.6 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.9 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "70.6 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-23T19:28:05.333Z",
                "reviewBody": "I loved these, although I suspect the brown sugar is what made them difficult for others, therefore I only used white sugar. I rolled the dough in between wax paper, layed them on a cutting board and stuck in the fridg. for 10 min. before putting the 2 doughs together and rolling. Then I froze the roll for an additional hour before cutting into slices, and baking. They turned out fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Celeste",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/celeste/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T15:14:06.37Z",
                "reviewBody": "These were pretty good and my kids really loved them.  My only issue was that the recipe tells you to roll the dough out and place one color on top of the other after adding the food coloring, but there was no way that was going to happen, the dough was far too sticky.  I had to refridgerate the dough overnight and then roll them out and put them together.  Then I had to return them to the refridgerator again overnight to get a clean slice and nice looking cookie.  This whole process was slightly time consuming, but otherwise they tasted good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KATE715",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1404418/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-02T20:55:08.513Z",
                "reviewBody": "This is my recipe, yes, it is a time-consuming one, but well worth it. I split it over 2 days, make the dough one day and bake the next. As for the other baker's difficulty in the stickiness of the dough, I have never had that problem.  Add more flour to the dough if it sticks as it should roll out like a dense pie dough. Also, AR said to add one drop of food colouring (not what I had submitted), you need half a bottle to get the desired shades of vibrant green and red!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gitano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2356139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-17T00:58:16.92Z",
                "reviewBody": "I made this cookie for a cookie ex-change so I made 4 batches across three days and tweaked it a little each time. Findings: 1st batch I made it exactly as called for in the recipe. I tried to make red and white. Dough was sticky and because of the brown sugar the white was actually tan. 2nd batch I ditched the brown sugar for white used only egg whites. White was white this time Green looked brighter as well. I couldn t tell when the cookies were actually done before they turned brown on the edges and then it was too late. They didn t look as pretty with brown edges. Batches 3 & 4 - 1. No brown sugar use white 2. No egg yolks. 3. One batch - Green / One batch Red. Added food color before flour. 4. Refrigerated the dough before rolling it out. 5. Divide each color in to three equal balls of dough 6. Rolled out dough between pieces of wax paper. 7. Reshaped the dough while rolling so I got 8 squares. Did this by rolling out the dough in to a round shape drawing the largest square possible on the rolled out down. Folding the rounded edges back into the dough squares and re-rolling. 8. Laid the two squares of rolled out colored dough on top of each other and rolled to make the spirals. Refrigerated as directed. (I only did 4 hours). 9. Sliced dough to thick or 5 mm. for cookies. 10. Cooked only 7 minutes.. did not rely on visual queue of doneness. Just took them out at seven minutes. Does not yield 72 - more like 48",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "msacco",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6063641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-23T04:02:25.37Z",
                "reviewBody": "I like to mess with the flavors according to the time of the year. During Christmas I like to do a Chocolate and Peppermint mix. Valentine's Day I like to do a Chocolate and Strawberry. You get the idea. Just use what flavoring you like for the \"White\" side of it or do a vanilla and an orange.....that is a orange cream twist. oh lala.......Great recipe. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUPERDUPERFOOD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1184031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-07T18:44:29.737Z",
                "reviewBody": "I am pinwheel cookie challenged. So I thought I could roll these like my pie crusts. After colouring the dough (I cheated and used some kool aid to get the colors darker though they don't show up dark in the picture) I rolled the dough out on flexible cutting boards. I could easily set the colours on top or each other to adjust size. I used a dough scraper to even off the edges and make square corners. Then I flipped the dough onto the other colour and peeled back the board did this 2 times. I used the bottom cutting board to aid with rolling similar to using a tea towel to roll a jelly roll. Wrapped in waxed paper and left to cool. Delicious cookies and will be fun to play with the colours according to the season. Next time I will leave the dough in the cutting board and wrap with elastic bands. This way the dough will not get a flat bottom as it cools. Thanks for the recipe Gitano-it's making the Christmas goodie list in my house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "recipes need gluten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3990518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-28T21:03:48.623Z",
                "reviewBody": "I used Wiltons concentrated paste for these cookies in the Halloween theme. As you can see from my pic mine didn't turn out that well. Not as pretty as the other posted pictures. I found the dough sticky I added some more flour as mentioned and I refrigerated it over night but it softened quickly. The cookies seem to taste better more buttery the next day. I love the idea of this pinwheel cookie ( especially for halloween)and the taste is pretty good. My daughter loved them and her friends from school really enjoyed them as well. THX.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1837326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-03T17:39:10.623Z",
                "reviewBody": "I made these for Halloween but had trouble with the dough. I am thinking that maybe the butter wasn't soft enough. Everyone really liked them though... Update 2/1/09 just put the dough into the freezer so I can make the cookies sooner. Wow what a difference from the first time I made them. I let the butter get really soft and it made all of the difference in rolling the dough. The dough was nice and soft and rolled very easy. I rolled each color on parchment paper and then put the one color on top of the other color and rolled. Very easy and I am sure will taste just as good as they did the last time I made them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DeniseY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/denisey/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-04T00:09:21.137Z",
                "reviewBody": "I thought these cookies were amazing! and they're very easy to play around with and make creations/colors for any occasion!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShouldBeABlondie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3136555/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-28T01:29:33.087Z",
                "reviewBody": "I had a really hard time with the dough.  It was so sticky to handle and I added more flour and refridgerated them overnight, but my batch was unsuccessful! Mine didn't look like any of the posted pics at all. The taste wasn't all that either.  Not very sweet.  I will NEVER make these again. A total waste of my ingredients.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Cherry Blossom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3422373/"
                }
            }
        ]
    }
]