[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/155182/pfeffernusse-cookies/",
        "name": "Pfeffernusse Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4807631.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:33:23.000Z",
        "description": "I have searched far and wide for a recipe that mimics my favorite, store-bought version of these cookies. I think, after days of thrown-out cookies, I have come as close as I can get.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "3 dozen cookies",
        "recipeIngredient": [
            "½ cup molasses",
            "¼ cup honey",
            "¼ cup shortening",
            "¼ cup margarine",
            "2 eggs",
            "4 cups all-purpose flour",
            "¾ cup white sugar",
            "½ cup brown sugar",
            "1 ½ teaspoons ground cardamom",
            "1 teaspoon ground nutmeg",
            "1 teaspoon ground cloves",
            "1 teaspoon ground ginger",
            "2 teaspoons anise extract",
            "2 teaspoons ground cinnamon",
            "1 ½ teaspoons baking soda",
            "1 teaspoon ground black pepper",
            "½ teaspoon salt",
            "1 cup confectioners' sugar for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir together the molasses, honey, shortening, and margarine in a saucepan over medium heat; cook and stir until creamy. Remove from heat and allow to cool to room temperature. Stir in the eggs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the flour, white sugar, brown sugar, cardamom, nutmeg, cloves, ginger, anise, cinnamon, baking soda, pepper, and salt in a large bowl. Add the molasses mixture and stir until thoroughly combines. Refrigerate at least 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Roll the dough into acorn-sized balls. Arrange on baking sheets, spacing at least 1 inch apart.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven 10 to 15 minutes. Move to a rack to cool. Dust cooled cookies with confectioners' sugar.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Thebeansma"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.689497716894977,
            "ratingCount": 219,
            "itemReviewed": "Pfeffernusse Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "284 calories",
            "carbohydrateContent": "53.9 g",
            "cholesterolContent": "20.7 mg",
            "fatContent": "6.3 g",
            "fiberContent": "1.1 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "212.8 mg",
            "sugarContent": "30.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-11T15:36:07.847Z",
                "reviewBody": "My only suggestions to make this recipe closer to Pfeffernusse made in Germany, are: Use more pepper, and use white instead of black.  One and a half to twice the amount of pepper will give the \"nuts\" a real peppery zing.  Also, don't spare the XXXX sugar coating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Essayons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2740208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T23:16:07.643Z",
                "reviewBody": "My problem is not the flavor of this recipe, which was very good, but the way it was put together. I would definitely change the order of mixing a bit. The recipe has you add the anise extract to the dry ingredients before the wet are added. This causes little unmixed bits of flower in the dough. Doesn't affect taste much, but I'm a perfectionist and care about the aesthetics of it. I would follow the recipe as it says except leave the sugars and the extract out of the dry ingredients. Instead mix those into the wet after the egg is added, then add the dry to the wet, in installments, and resume the recipe. 4 stars because the flavor is good, and the recipe can be fixed with only a few tweaks. Enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jcis1013",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5620415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-03T16:00:54.82Z",
                "reviewBody": "Love these cookies! My mom had the store bought version so my family compared the two cookies.  This recipie won by far.  They have a wonderful spice that gets even better after a few days.  The center stays soft and moist (even after freezing!) This recipe makes a large batch of cookies. Only change i made was that i rolled the cookie dough balls in powdered sugar before placing on baking sheet.  Then before serving i dusted them with a little more powdered sugar.  I will be making these every christmas!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Matushak Plach",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2563612/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T16:42:50.957Z",
                "reviewBody": "Loved the recipe! Reminded me of Grandmas,(she took her traditional german recipes to the grave with her). I added 1 teaspoon of allspice and changed the black pepper to white. The spice level turned out perfect. I have not been a fan of the powdered sugar coating. A reviewer on another site had an excellent glaze coating for the cooled cookies. Beat 1 eggwhite with 1 tablespoon of honey and 1/2 teaspoon anise extract. Gradually sift in 1 cup confectioner's sugar, mixing until smooth. The other reviewer put a bit of glaze in a bowl with a few cookies and stirred until coated. I dipped the top of the cookies in the glaze and placed on a drying rack until coating hardens. Thanks again, I am happy I am able to bring back an old tradition to the family Christmas .",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I82MANY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6035414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-10T11:34:25.713Z",
                "reviewBody": "this is pretty close to my mums traditional german recipe. One suggestion though instead of black pepper use all spice. I haven't made pfeffernusse for a while because i moved away from home and don't have access to the recipe any more. Going through your recipe helped me to remember what was in my mums recipe. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "renee rochow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3130669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-11T19:47:50.447Z",
                "reviewBody": "Awesome recipe! Suggestions to omit pepper is not accurate. Pfeffer means 'pepper' in German and is an essential ingredient. I used I82Many's suggestion to use white pepper instead of white (black pepper may be why some reviewers suggest leaving it out...the switch to white is important) and added 1 tsp allspice. Add anise to wet ingredients, not dry. While a glaze is nice, it's not traditional. Toss in powdered sugar once completely cooled and set up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "druidfaerie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1689550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-12T21:02:03.98Z",
                "reviewBody": "Absolutely delicious! I added 1/2 cup butter instead of 1/4 cup margarine followed all the rest exactly as written in recipe. Just like my Aunt's in Germany! If you like ginger snaps...you will LOVE this cookie...think ginger snaps on steroids....FANTASTIC!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janedough",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5028189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-21T00:18:58.15Z",
                "reviewBody": "I have been told by all my relatives that pfeffernusse is a Dutch Advent treat. The spices are from the Dutch Indies - a way to show off all those spices that the Dutch were dealing in and affluent the family was. My recipes - Dutch and over 100 years old by several relatives - never use eggs and let the dough rest overnight in a cool place. Then the dough is rolled into ropes and the ropes sliced into small cookies about the size of a nut. Rolling into ropes then slicing it prevents working the dough too much. But if you use eggs then I guess it doesn't matter how much you work the dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6106313/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-07T03:31:46.31Z",
                "reviewBody": "My German grandmother used to make these every Christmas.  I had always loved her home made version of these cookies, and after she passed, no one had a copy of her recipe.  Over the years I have been buying store bought versions and I finally decided to try and find a recipe for these and make them from scratch.  This version is great and brings me back to my grandmother's during the holidays!  They just get better and better after they are made.  A couple of changes that I made had to do with the assembly of the dough and baking.  After bringing the liquid sugars to a boil I poured the hot mixture into my Kitchaid stand mixer with the paddle attachment and beat the mixture on medium for about 8 minutes until cooled and thickened.  I added the eggs and let them combine, and then added a couple of tablespoons of the flour mixture before adding the Anise Flavoring.  Then on medium low speed I added the remaining flour mixture in a steady stream and it all came together in one smooth dough.  I also refrigerated the mixture tightly covered for a good 6 hours before baking off the cookies.  I used a 1 inch cookie scoop, and cooked the cookies about 22 minutes, rotating the baking sheets after 11 minutes.  They came out perfect, somewhat crunchy on the outside and still moist and soft on the inside.  And don't skimp on the sugar dusting...shake them in a bag with the confectioner's sugar...don't just dust them.  The more the better!  Grandma would be proud!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Matt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14845147/"
                }
            }
        ]
    }
]