[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/157201/vanilla-bean-cheesecake/",
        "name": "Vanilla Bean Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F805319.jpg",
            "width": 3664,
            "height": 2748
        },
        "datePublished": "2020-06-19T03:33:37.000Z",
        "description": "If you like restaurant vanilla bean cheesecake, then try this!  The cookies make this one much more special and far more yummy. Pure vanilla bean extract is a must.  I use Tahitian vanilla beans and extract.  This also makes more than enough batter for a 10 inch pan, so you can make cupcakes too.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT5H45M",
        "recipeYield": "1 -10 inch cheesecake",
        "recipeIngredient": [
            "1 (18 ounce) package vanilla sandwich cookies (such as Oreo Golden Original Sandwich Cookies®)",
            "1 vanilla bean, split lengthwise and seeds scraped",
            "¼ cup butter, melted",
            "2 pounds cream cheese, softened",
            "1 ½ cups white sugar",
            "5 eggs",
            "2 vanilla beans, split lengthwise and seeds scraped",
            "1 tablespoon pure vanilla extract",
            "¾ cup sour cream",
            "½ cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C), and lightly butter a 10 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the sandwich cookies into a plastic bag, and crush with a rolling pin. Pour the crumbs into a bowl, and mix with the scraped seeds of 1 vanilla bean. Drizzle the crumbs with melted butter and stir to combine. Press the crumb mixture firmly into the bottom and up the sides of the springform pan, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the softened cream cheese and sugar into the work bowl of an electric mixer, and beat for about 3 minutes on Medium speed, until the mixture is smooth. Beat in the eggs one at a time, incorporating each egg before adding the next one. Add the scraped seeds of 2 vanilla beans, the vanilla extract, sour cream, and heavy cream, and beat on Medium-High speed for about 1 minute, until the mixture is blended and smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the mixture into the cookie crumb crust, leaving about 2 inches of space from the top of the pan for the cake to expand as it bakes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a baking dish onto the bottom rack of the preheated oven, and fill it halfway with boiling water. Place the cheesecake onto the middle rack, above the pan of boiling water, and bake until a small knife inserted into the middle of the cheesecake comes out clean, about 1 hour and 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the oven off and let the cheesecake cool down inside the oven for 1 hour. Cover the cheesecake with plastic wrap, then aluminum foil, and refrigerate at least 4 hours or overnight before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AIMEEBOZ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.795180722891566,
            "ratingCount": 83,
            "itemReviewed": "Vanilla Bean Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "538.3 calories",
            "carbohydrateContent": "47.4 g",
            "cholesterolContent": "143.1 mg",
            "fatContent": "35.8 g",
            "fiberContent": "0.5 g",
            "proteinContent": "8.3 g",
            "saturatedFatContent": "18.9 g",
            "servingSize": null,
            "sodiumContent": "333.4 mg",
            "sugarContent": "21.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-22T17:37:54.72Z",
                "reviewBody": "First, let me start by saying I make cheesecakes, a lot of them.  Right now this is the reigning favorite.  I follow the recipe other than:  adding 4 vanilla beans, and I cook it a little differently.  I cook all my cheesecakes the same, 325 degrees, in a water bath.  To do this, wrap the bottom of your pan with a double layer of aluminum foil, place the springform pan in a roasting pan, then fill the pan with boiling water until it is half way up the side of your springform pan.  Most importantly, your cheesecake is done when it jiggles slightly in the middle, don't wait until a knife comes out clean, it will be overdone.  Then, place it on your counter after baking for about 30 minutes, then put into the refrigerator, uncovered for a few hours.  Then wrap with plastic and let it set overnight, yes, you need to wait.  This produces a perfectly baked, creamy, crack free cheesecake every time, regardless of the type of cheesecake.  This one is super good, try it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tina2972",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3174252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-03T15:51:08.29Z",
                "reviewBody": "I'm giving this 4 stars only because I changed so many things about it.  The main part is that I used 1/2 mascarpone and 1/2 cream cheese.  Also, if you're going to bother using real vanilla beans, don't throw vanilla extract in there (which is likely not that high quality anyway), just use about 5 vanilla beans, and you're fine.  And if you actually want to TASTE the cheesiness, then use 1/2 the sugar recommended.  Using 1/2 & 1/2 instead of heavy cream also doesn't take a way from the flavor, and keeps the flavor lighter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3240857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-11T20:42:07.39Z",
                "reviewBody": "I am not a big fan of Cheesecakes but was asked to make one.  I choose this recipe and it turned out great.  The only thing I would change the next time is to add more vanilla bean or extract.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keith Gillis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3119352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-01T21:29:46.74Z",
                "reviewBody": "I'm rating the actual cheesecake part because I went with a traditional graham cracker crust instead of the vanilla sandwich cookie crust. I had just found a super good buy on fresh vanilla beans and was searching for the perfect recipe to showcase them. This is the recipe I chose and it is delicious! It's a somewhat dense cheesecake - not light or fluffy in any way. Even though I put the seeds of 3 whole vanilla beans into my cheesecake batter the telltale black specks were not evident. But even so the flavor was out of this world. I must comment on the baking time though. My cheesecake ended up being in the oven for close to 2 hours even though the recipe states 1 hour 20 minutes. I was so worried it would be dry but I shouldn't have worried. I turned off the oven when the very middle of the cheesecake was only slightly still jiggly and then left it in the turned off oven with the oven door ajar for another hour. Then I wrapped it well (still in the unmolded springform pan) in plastic wrap and placed it in the fridge overnight. Let me add that after it had cooled all night the middle was slightly lower than the sides so it wasn't the prettiest cheesecake and I'm not sure what caused that sinking but it didn't effect the texture or flavor. In fact the texture of the cheesecake was very even throughout - whether next to the crust or in the middle of the cake. I topped mine with a lovely seedless raspberry sauce. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1462254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-08T01:30:40.343Z",
                "reviewBody": "My husband hates cheesecake and always begs me to make this one. I did omit the vanilla bean from the crust and just added it to the batter. I usually make mini cheesecakes (2in) and it is the perfect amount of batter and crust to make 48. It took me a while to figure out the temp and time I needed to cook the minis for but I finally got it. I put a metal bowl of water on the bottom rack and cook on 300 degrees for 25 to 30 minutes. I only have one pan so it takes a while but it is worth it. I've started to make these for every party we have or go to. Everyone loves it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8027281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-02T15:22:48.837Z",
                "reviewBody": "I find the Madigascar beans impart the vanilla flavor most are familiar with so I used those. I figured that since I'm using the real thing with the beans I couldn't just use artificially flavored vanilla cookies for the crust -so I used homemade vanilla bean sugar in a graham cracker crust! Was really good! Thank you for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna Marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/barefootcontessa/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-01T18:01:43.237Z",
                "reviewBody": "amazing!!!!!!!!! my springform pan broke so i used a 9X13 and it worked just as well...i improvised and placed another 9X13 pan of just water on the other rack in my oven and it worked perfectly.....even had enough batter to make little individual cheesecakes",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke Schauer Sottosanti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/97624/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-31T00:30:09.193Z",
                "reviewBody": "I followed this recipe exactly and it was delicious. I would add a little more vanilla as others have said but that is just a minor change. The crust is perfect - much better than a vanilla wafer crust or graham cracker. It tasted better the longer it sits in the fridge so I'd suggest making a few days in advance.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2481955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T23:36:04.483Z",
                "reviewBody": "Made exactly as directed great recipe. Just makes too much enough for a full 10\" cheesecake plus a pan of mini's and still had a lot left over. Maybe scale back the amounts so there is less waste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "scottjl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/scottjl/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-26T04:27:25.16Z",
                "reviewBody": "The directions said bake for an hour twenty minutes. I kept it in the oven for an hour twenty five..... At this point the center didnt seem jiggly so I figured it was done. Well it wasn't done enough to tast like cheesecake. It was kind of cottage cheesy and puddingy.....also I should have listened to others and added more vanilla bean. Would not make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Hanan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2515598/"
                }
            }
        ]
    }
]