[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/161019/dark-chocolate-bacon-cupcakes/",
        "name": "Dark Chocolate Bacon Cupcakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1693893.jpg",
            "width": 2046,
            "height": 2047
        },
        "datePublished": "2008-02-12T09:40:35.000Z",
        "description": "Dark Chocolate. Bacon. What's not to love? Take yourself on a taste adventure and give these a go. They were a challenge by friends that turned into a great success.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "2 dozen cupcakes",
        "recipeIngredient": [
            "12 slices bacon",
            "2 cups all-purpose flour",
            "¾ cup unsweetened cocoa powder",
            "2 cups white sugar",
            "2 teaspoons baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon sea salt",
            "2 eggs",
            "1 cup cold, strong, brewed coffee",
            "1 cup buttermilk",
            "½ cup vegetable oil",
            "1 tablespoon unsweetened cocoa powder, for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, 3/4 cup cocoa powder, sugar, baking soda, baking powder and salt. Make a well in the center and pour in the eggs, coffee, buttermilk and oil. Stir just until blended. Mix in 3/4 of the bacon, reserving the rest for garnish. Spoon the batter into the prepared cups, dividing evenly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the tops spring back when lightly pressed, 20 to 25 minutes. Cool in the pan set over a wire rack. When cool, arrange the cupcakes on a serving platter. Frost with your favorite chocolate frosting and sprinkle reserved bacon crumbles on top. Dust with additional cocoa powder.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mkecupcakequeen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.260869565217392,
            "ratingCount": 276,
            "itemReviewed": "Dark Chocolate Bacon Cupcakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "184.6 calories",
            "carbohydrateContent": "26.8 g",
            "cholesterolContent": "21 mg",
            "fatContent": "7.5 g",
            "fiberContent": "1.2 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "285.3 mg",
            "sugarContent": "17.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-12-02T20:30:49.02Z",
                "reviewBody": "WOW!  If you LOVE Chocolate and you LOVE Bacon you have to try this! This definitely is the perfect marriage of sweet and salty.  My husband thinks bacon should be a food group so I thought I'd surprise him with this for his birthday instead of making a regular 'ol birthday cake.  This definitely fit the bill.  The cake in and of itself is beyond moist and chocolately.  You could tell that right away from the buttermilk and oil that it was going to be good.  I used 1 cup of Hershey's cocoa but other than that didn't change a thing.  I think I'll use this cake recipe with or without the bacon because it was so rich and decadent!  I didn't want huge chunks of bacon in this so I put the bacon in a mini-food processor and then added it to the batter.  I didn't want to do small cupcakes because I needed a \"WOW\" factor so I made a dozen Texas sized cupcakes in a oversized muffin pan.  They took a little longer to bake but ended up looking like mini-cakes.  I iced them with \"Rich Chocolate Frosting\" from this site which is to die for and toppped them with the additional crumbled bacon.  When I tried one for the first time I thought why not have these for breakfast - it's got everything...coffee and bacon. Definitely a case of \"don't knock it 'til ya try it\"!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-27T22:11:32.53Z",
                "reviewBody": "These had an awesome depth of flavor. I am not a coffee drinker so I only had gourmet chocolate caramel coffee and I am made it real strong (3 tablespoons for 1 cup). I finely crumbled the bacon. Within the mixture they end up being almost undetectable except for a slightly salty bit everyso often which mixes wonderfully with the chocolate flavor. Not to mention these cupcakes are supermoist and fluffy! Note: My first batch flattened cause I took them out too early to check them...second batch came out perfect I left them in there when I saw that they rose nicely I turned off the oven and let them sit for 5 minutes in the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Messy Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/themessycook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T04:05:28.5Z",
                "reviewBody": "As soon as I saw this recipe I knew I would have to try it. My curiousity got the best of me tonight and I whipped up a batch. These are seriously THE best cupcakes I've ever eaten, let alone made. Moist, full of flavor, and heavenly rich. I love the depth that the bacon and coffee add to the chocolate flavor. I highly recommend this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinBug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookinbug/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-04T22:30:58.67Z",
                "reviewBody": "Do NOT be scared of these! They are FABULOUS! The bacon adds a nice salty/smoky flavor and the coffee (I HATE coffee/coffee flavor) serves only to bring out the depth of the chocolate taste. I'm also not a fan of from scratch cake recipes (they never taste as good as the box to me) but THIS does! Unbeknownst to me Mr. LTH had used the last of our milk so I had to use heavy whipping cream in its place but that was the only change I made (other than to halve the recipe which gave me 11 cupcakes). DO try these; TY for a great recipe!!! EDIT: I made these for the second time as minis for a meeting I was catering in case people were a little intimidated by them. They make 10 dozen minis!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-28T21:42:15.273Z",
                "reviewBody": "BEST Bacon cupcake recipe out there! A couple things to mention that might help other bakers: the bacon should be CRISP. If you leave your bacon chewy and tender the bits will blend into the cake too much and you won't tell there's bacon in there. Same goes with crumbling the bacon too fine. You want pinky-nail to dime-sized chunks in there. Also I suggest cooking your bacon in the oven. (@400 degrees until it's dark red 12-20 minutes depending on how thick your bacon is. Keep an eye on it!) This keeps the bacon flat and crisps it up perfectly. Crumble it after it's cooled. I am eating one of these after it spent a night in the refrigerator and they are still really good maybe better. Really CRISPY bacon is the key. There's nothing like biting into that salty crunch amidst sweet chocolate. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHAOTICA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/878112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-06T20:11:00.86Z",
                "reviewBody": "I couldn't believe these and my boys couldn't either. They loved them! I followed this recipe exactly EXCEPT I added some 71% dark chocolate which I grated into the batter I only put in like 1/4 of a bar. I wanted to make sure they were chocolately enough and they definetly were.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Halo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2532388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T21:45:50.217Z",
                "reviewBody": "I had such high hopes for this recipe! I made it for a girls' weekend thinking it would be just the thing - we all love chocolate bacon and coffee. I followed the recipe exactly and found the batter VERY difficult to work with - extremely runny. I would suggest using a container with a spout to pour into the cups. I also thought the bacon was a lot of extra work and didn't add anything extra to the cupcakes just weird little chewy bits in them (and I crumbled them very small). And while the batter was very runny the finished cupcakes were pretty dry. Interesting idea and I'm glad I tried them but I won't make them again - I'd just as soon make cupcakes from a box which I never do. No one who tried them really liked them even before they were told the ingredients. Their only saving grace was the chocolate ganache icing from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Elisa Stamm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2561233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-16T02:00:03.61Z",
                "reviewBody": "I was browsing youtube one night when I came upon a video that praises this recipe. I just had to try it! I substituted dark baking chocolate bits for the cocoa reduced the oil and sugar and they came out fantastic. _ I brought them to work... and they keep asking for them! I'm keeping this one for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "li'l miss baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3084208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-15T01:28:27.487Z",
                "reviewBody": "These cupcakes were fantastic! I left the bacon out of a few for my vegetarian friends, and they were excellent. However, the cupcakes with the bacon were even better! I've never eaten a more moist cupcake, and the added richness of the bacon was a huge hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs.Disco",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1748245/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Dark Chocolate Bacon Cupcakes",
            "description": "Get ready for a rich chocolate and smoky bacon flavor explosion.",
            "uploadDate": "2014-01-16T23:42:59.445Z",
            "duration": "PT2M56.192S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F60ad18fb-6acf-4b6d-83c8-aa755cbb7cbd%2Fed17fb22-becd-45e1-8f90-e96f39f662fc%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3063758071001"
        }
    }
]