[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/72819/soft-onion-sandwich-rolls/",
        "name": "Soft Onion Sandwich Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F588376.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2020-06-19T03:10:54.000Z",
        "description": "This is it!  I've been through many recipes to come up with this one.  Great for BBQ beef sandwiches.  If you prefer plain rolls, omit onion ingredients.",
        "prepTime": "P0DT3H0M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "8 buns",
        "recipeIngredient": [
            "¾ cup lukewarm milk",
            "5 tablespoons lukewarm water",
            "3 tablespoons butter, softened",
            "1 ½ teaspoons salt",
            "3 tablespoons white sugar",
            "1 teaspoon onion powder",
            "3 tablespoons dried minced onion",
            "¼ cup instant potato flakes",
            "3 cups all-purpose flour",
            "1 (.25 ounce) envelope active dry yeast",
            "1 egg white",
            "1 tablespoon water",
            "¼ cup dried minced onion"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the milk, water, butter, salt, sugar, onion powder, 3 tablespoons of dried onion, potato flakes, flour and yeast into the pan of a bread machine in the order recommended by the manufacturer. Select the Dough cycle, and press Start.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the cycle has completed, remove the dough from the machine, and knead on a lightly floured surface. Cut into 8 equal pieces, and form into balls. Gently flatten the balls until they are 4 inches in diameter. If they keep shrinking back, just let them relax for a minute before flattening. Place on a baking sheet, and cover loosely with a towel. Set in a draft-free place to rise until doubled in size, about 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Whisk together the egg white and water in a cup. Brush over the tops of the risen rolls, and sprinkle with remaining minced onion.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 20 minutes in the preheated oven, until golden brown. Cool completely, then slice in half horizontally before using.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "claudygirl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.669767441860465,
            "ratingCount": 215,
            "itemReviewed": "Soft Onion Sandwich Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "259.9 calories",
            "carbohydrateContent": "45.9 g",
            "cholesterolContent": "13.3 mg",
            "fatContent": "5.3 g",
            "fiberContent": "1.8 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "487.1 mg",
            "sugarContent": "7.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-01-14T20:51:14.1Z",
                "reviewBody": "Hi Everyone, I'm Claudygirl.  First, a reminder to use 2.5 teaspoons of yeast, not a package that has 2.25.  Some have complained that they didn't rise well, but the recipe was changed after I submitted it.  And, thank you for all the great reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "claudygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-11T19:57:59.843Z",
                "reviewBody": "Fabulous.  I made a few modifications- I used about 1/2 of an onion, finely diced and sauteed, instead of the other onion ingredients and did not top them.  I also used oats instead of potato flakes (they didn't need to be chopped up- they just melt into the dough).  Another thing I altered was that I used all water.  In my experience, breads made with milk get tough quickly and aren't that good unless they're super fresh.  Makeing it with all water keeps it fresher longer.  But these were wonderful!  My husband called them \"a little piece of heaven.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chickiefantasma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2727503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-15T19:33:47.32Z",
                "reviewBody": "Fantastic Onion Rolls! We’ve made them for burgers, pulled pork and lunchmeat sandwiches. We loved the onion flavor of these rolls so much that I will never buy them from the bakery again. I made one small change to the recipe since I do not have dried onions on hand and that was to sauté about 1/4 cup worth of onions to get the moisture out and they worked out fine every time. I also don’t have a bread machine which is simply to proof the yeast and only start out with 1 ½ to 2 cups of flour and knead in the last cup. Knead for the standard 8 or so minutes and let rise, covered, in a warm place for an hour or more and then follow recipe from step 2. They are Easy to make without a bread machine and Mmmmm are they sooooo good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LehighBarbie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2802301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-22T02:33:42.937Z",
                "reviewBody": "Although I don't have a bread machine these rolls turned out great! I used my Kitchen Aid Mixer and made them (somewhat) the old fashioned way. I did not have dried onion flakes which in the end I was actually happy about because I finely diced a fresh onion and then fried in a pan until very brown. The rolls tasted bakery fresh Claudy and we were all very happy! Thanks so much for a weeks worth of lunch sandwiches!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-20T19:13:28.48Z",
                "reviewBody": "Our family loves these rolls! I usually brush the tops with melted butter instead of egg white since my oldest is allergic to eggs. Be sure to note that 2.5 tsp of yeast will cause the rolls to rise better than only one pkg, which only has 2.25 tsp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gingersnapp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1928398/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-08T06:21:38.173Z",
                "reviewBody": "Delicious!  Be warned that these have a very strong onion flavor but my family loves onions so we all loved them!  I agree with the reviewer who said they taste like onion bagels.  I substituted the milk with water and used ground oats in place of the potato flakes.  I got 14 dinner size rolls out of this recipe but will double next time and try freezing some. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "6MOUTHS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1068412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-27T20:33:11.92Z",
                "reviewBody": "FANTASTIC! I use these a lot make them about once a week. Tonight we're using them toasted for French Dip sandwiches. I didn't modify the recipe in any way so the review is \"as is\" and it's great!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "luvmykids",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2724618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-11T23:57:33.713Z",
                "reviewBody": "Yum! Super easy & worth every bit of (little) effort involved! Even the shaping step was simple and I'm not a baker per se (which is the reason I waited so long to try these...). Made these to serve w/  slow cooker French dips (lonwolf32). I'm used to French dips on crusty bread, but as it turns out, onion rolls are an excellent substitue! I pretty much followed claudygirl's directions to the letter except for 3 (minor) changes. Not wanting tough rolls, I used all H2O. I also flash fried 1/4 c. of fresh, finely choped onion instead of using the dried minced variety in my topping mixture (I added dried onion to my dough, but didn't have enough left for the topping also). Finally, I added about an 1/8 c. of poppyseeds to my topping. The popular St. Rosen's brand onion rolls include poppyseeds in theirs, so I decided to do the same! :) NOTE: This recipe yeilds 1 lb. worth of dough. My bread machine users manual includes several recipes, one of which is an rye onion roll recipe. The 8 roll yeild instructs to chose the 1 lb. loaf setting. Additionally, your liquid should be no cooler than 98 degrees F & no warmer than 105 F to be considered \"lukewarm.\" Oh, and be SURE to increase the amount of yeast to 2.5 t as claudy's top review suggests. Doing so will yield a batch of perfectly risen rolls! I'm SOOOO glad to have given these a try. These were FANTASTIC fresh & just as good the next day! This recipe will be added to my keeper file for sure. Thanks for sharing, claudygirl! :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-22T11:21:58.17Z",
                "reviewBody": "For whatever reason, my dough didn't rise, and I ended up tossing out the dough and starting from scratch, but my second batch didn't really rise much either.  I shrugged my shoulders and popped the rolls in the oven anyway, and they ended up puffing up nicely while cooking.  So despite all my worries, they turned out perfectly!  I didn't have any dried minced onion, so I put fresh minced onion inside the dough.  I flash-fried some more fresh minced onion in very hot oil for a few seconds until it was golden and put this on top of the rolls before baking.  The flash-fried onions were a flavorful addition.  Great recipe!  We had BBQ beef sandwiches on these rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JessicaAnne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1577431/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-09T18:18:33.73Z",
                "reviewBody": "Sorry but I did not like these. The flavor wasn't 'wow' and the texture was a bit too dense for me - I did use 2 1/2 tsp of yeast. I make fresh bread every day so I'm not a novice. The dough seemed good mixing it up but not happy with the end result. (I used fresh onion and sauteed it like others.) I think I'll try adding onion to one of our other recipes to create an onion bread for my husband who has been asking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Stella67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3109560/"
                }
            }
        ]
    }
]