[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16220/bread/yeast-bread/pretzels/",
                    "name": "Pretzel Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/161586/papa-drexlers-bavarian-pretzels/",
        "name": "Papa Drexler's Bavarian Pretzels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F592304.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:34:40.000Z",
        "description": "Fun to make, traditional pretzels are great with a nice mug of beer!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "6 big pretzels",
        "recipeIngredient": [
            "3 cups all-purpose flour, divided",
            "1 tablespoon active dry yeast",
            "1 teaspoon white sugar",
            "2 tablespoons butter, softened",
            "1 ⅓ cups water",
            "¼ teaspoon salt",
            "3 tablespoons baking soda",
            "3 cups water",
            "2 tablespoons butter, melted",
            "1 tablespoon coarse sea salt, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together 1 cup of flour, yeast, sugar, 2 tablespoons of butter, and 1 1/3 cup water. Let this mixture stand until bubble begin to form, about 15 minutes. Stir in the salt and gradually stir in the remaining flour until dough can be picked up and kneaded on the counter. Knead until smooth and elastic, about 8 minutes, adding more flour if needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough into 6 pieces and let them rest for a few minutes. Roll out one piece at a time into a rope about 15 inches long. Loop and twist into that cool pretzel shape. Set on a baking sheet while you roll out the remaining portions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 450 degrees F (220 degrees C). Bring the remaining 3 cups of water to a boil and add the baking soda. Remove from the heat. Dip pretzels into the water bath for about 45 seconds, flipping over about halfway through. Place the soaked pretzels on a greased baking sheet. Brush them with melted butter and sprinkle with coarse salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden brown, 8 to 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Pretzel Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tim Drexler"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6127946127946124,
            "ratingCount": 297,
            "itemReviewed": "Papa Drexler's Bavarian Pretzels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "304 calories",
            "carbohydrateContent": "49.2 g",
            "cholesterolContent": "20.4 mg",
            "fatContent": "8.4 g",
            "fiberContent": "2.1 g",
            "proteinContent": "7.3 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "2800.8 mg",
            "sugarContent": "0.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-26T14:09:25.1Z",
                "reviewBody": "Out of the oven, the first bite gives a crisp crunch and wonderful pretzel flavor with the softest dough in the middle. Absolutely delightful! Once the boys heard the crunch, it was all hands on the cooling rack and nothing left in minutes. The flavor is good enough not to need extra butter (as my husband is wont to do at times) but also goes well with a goood coarse ground mustard and yes! a nice beer.\n\nIt was so easy I made multiple batches to play with. I reccomend not changing a thing in this recipe. I split the batch into 12 moderate sized pretzels rather than big ones. so that they would last longer (they didn't :)\n\nOne thing I did try that showed interesting results:\nKneading by hand made the inside very soft like frsh white bread.\nKneading by Kitchenaid made the center more tough for a heartier chew.\n\nAlso tried wrapping around already simmered turkey brats after dipping pretzels in baking soda solution and made fantastic pretzel brats.\n\nThis recipe is a definite keeper. My thanks to the Drexlers for passing this on! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIDDAH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1463652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-24T19:32:53.863Z",
                "reviewBody": "Awesome! You probably saved me from going to jail!!! Having grown up in Bavaria, I miss pretzels terribly and always play with the idea of trying to break the law and smuggle them back with me to the U.S., not a good idea if you don't want to get to know customs and who-knows-what agencies from up close. I knew that usually the pretzels get washed with lye in Germany and that always stopped me from even trying to make them over here. Then I saw your recipe and the baking soda wash and went to work right away. They were absolutely delicious, the best thing you can make without lye. I followed the recipe exactly and found the dough to be just the right consistency but I also didn't overknead the dough. I made my baking soda wash a little stronger by using only 2 1/2 cups of water. If you use a smaller pot the fluid is deep enough that you don't have to flip the pretzels over, the will simply swim in the solution and be coated all around. A large slotted spoon is just the tool for the task and works perfectly. To get the pretzels off the baking sheet, be patient and let them cool a bit on the sheet before going to remove them. Then a turner will slide them off easily enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AllrecipeFan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2633474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-01T19:37:10.91Z",
                "reviewBody": "This was a good basic recipe and made a delicious pretzel. The only complaints that i had with this recipe were one; the directions were somewhat lacking and two The dough  is much better when you let it rise right after kneading, then separate the dough into portions, let it rise again then make one ball into a pretzel and dip immediately into the soda bath, then make the next and so on. one additional tip that helped to give the pretzels a lovely brown color was to give it an egg wash instead of brushing them with butter. A really good recipe on the whole though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "beth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4650520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-29T21:05:44.733Z",
                "reviewBody": "The pretels were really good - I made them for an Oktoberfest party and got a lot of compliments.  I had to add a lot of extra flour to the dough - it was too sticky to work with after adding just the stated amount in the recipe.  I worked the dough by hand.  I had to use a spatula to take the pretzels out of the water bath - they were a little easy to fall apart at that stage, but it got easier the more I did.  It took a lot longer than the stated time - mostly due to having to keep adding more flour and the learning curve in shaping the pretzels - next time I might make \"stix\" instead of the traditional shape.  Would probably go a lot faster the 2nd time around.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda J.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2845674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-31T13:31:58.003Z",
                "reviewBody": "Great recipe!! I used my kitchenaid for about 3/4 of the kneading and the rest was done by hand - they turned out fabulous - soft in the middle and chewy on the outside. We also made about 20 little ones as opposed to the large ones and they were delicious! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine Catherine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2314190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-06T00:50:15.617Z",
                "reviewBody": "This recipe is fabulous!  We love soft pretzels at our house and these were a huge hit!  We tried half of the batch with mustard and the other half with cinnamon & sugar!  Either way they were amazing!  The only note I have is probably a no brainer for most people but I didn't think about water temperature when adding to the flour/yeast mixture and used cold tap water and had to repeat that step using warm water to activate the yeast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3247600/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-27T19:40:06.593Z",
                "reviewBody": "These were insanely good!!! I portioned the dough into 8 pretzels, and they were still a good size. They were gone a few hours after I made them...my husband ate 4 in less than 10 minutes. I'm so glad I found this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "happywife05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1539130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-06T23:55:50.72Z",
                "reviewBody": "Oh my goodness! These were delish! I almost made the \"Mall pretzles\" but i'm really glad I stuck to this recipe. Nobody in the house gave it lower than a 9 on a scale from 1 to 10. The only thing I changed about this recipe was that I used more yeast than the recipe called for because the Fleischmann's packet had a little over 2 Tablespoons. I divided the the dough into 8 parts instead of 6 because there are 4 people in my house and I wanted them to get 2 each:). And they were super simple to make! BRAVO DREXLER!!!! THANKS SO MUCH FOR THE RECIPE!!! I AM DEFINITELY KEEPING THIS AND WILL BE MAKING IT AGIAN SOON!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "princessofnora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3425923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T20:01:10.583Z",
                "reviewBody": "SUPER Awesome and easy (i'm eating one as I type). It took in total about 50 minutes for me to make and I did add quite a bit more flour during the kneading process (I used my mixer w hook for kneading). They are SO soft and good. I am going to make my kids a turkey sandwich on pretzel \"bread\" for dinner using a pretzel cut in half. very easy and delicious. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "utah0rbust",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6775927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-02T15:15:14.77Z",
                "reviewBody": "I was super excited about making these because it sounded so simple with great reviews - but ended up disappointed. Fairly easy to make I used parchment paper on my baking sheet to prevent sticking and also stretched the dough by lifting off the counter and pulling after I had rolled it out to 15\". I felt the flavor was lacking not a lot of that pretzel flavor as you'd expect. My husband said \"not bad\" which I think sums it up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "enlightenedfood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7527151/"
                }
            }
        ]
    }
]