[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/77/drinks/",
                    "name": "Drink Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/162202/dandelion-wine/",
        "name": "Dandelion Wine",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1694077.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2020-06-19T03:34:53.000Z",
        "description": "This very old recipe utilizes the bane of homeowners: the dandelion!  I found this in 1993 when a flood left our front yard full of beautiful, very large dandelions. The blossoms CANNOT have been sprayed with any pesticides, and should be thoroughly rinsed.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P21DT1H10M",
        "recipeYield": "4 quart jars",
        "recipeIngredient": [
            "1 quart yellow dandelion blossoms, well rinsed",
            "1 gallon boiling water",
            "1 (.18 ounce) package wine yeast",
            "8 cups white sugar",
            "1 orange, sliced",
            "1 lemon slice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place dandelion blossoms in the boiling water, and allow to stand for 4 minutes. Remove and discard the blossoms, and let the water cool to 90 degrees F (32 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the yeast, sugar, orange slices, and lemon slice; pour into a plastic fermentor, and attach a fermentation lock. Let the wine ferment in a  cool area until the bubbles stop, 10 to 14 days. Siphon the wine off of the lees, and strain through cheesecloth before bottling in quart-sized, sterilized canning jars with lids and rings. Age the wine at least a week for best flavor.\n"
            }
        ],
        "recipeCategory": [
            "Drink Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Elle"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 17,
            "itemReviewed": "Dandelion Wine",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "197 calories",
            "carbohydrateContent": "50.7 g",
            "cholesterolContent": "0 mg",
            "fatContent": "0 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.2 g",
            "saturatedFatContent": "0 g",
            "servingSize": null,
            "sodiumContent": "9 mg",
            "sugarContent": "50 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-11-05T16:32:24.083Z",
                "reviewBody": "A few notes on what's wrong with this recipe:\n1) Double the amount of dandelion flowers.  The flowers are best picked at mid-morning to mid-day.  When preparing them remove all the green, especially the green stalk which is very bitter.  Most of the green sepals should be removed as well, but if a few get through that's fine, they'll add some body.\n2) Allow the flowers to steep for 2 days, not 4 minutes.  Keep the pot covered during this time.  \n3) After 2 days strain off the flowers, add the remaining ingredients except the yeast, but as others have noted only use half the sugar.  1-2 lbs (2-4 cups) of sugar will be plenty, depending on how dry or sweet you like your wine.\n4) Bring it back to a boil for 10 minutes and then put the liquid into your sterilized primary fermentator.  After it has cooled to roughly 30 C or 90 F add the wine yeast (not baker's yeast, although that might do in a pinch) and the fermentation lock.  When the bubbling has mostly subsided (10-14 days) remove the liquid from the lees and rack it for 2 months before bottling (unless you like exploding bottles).  Like all wines, it's best if it's aged in the bottle for at least a year, although there'll be a noticible improvement after just 6 months.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "knowan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3892896/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-06T21:16:58.713Z",
                "reviewBody": "It was great",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hungryguy123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5024922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-15T22:08:00.817Z",
                "reviewBody": "This was a bit sweet, but I can tame that next time - easy to make too!  I'm going to experiment with this next time, I like it alot.  Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "THEPETALER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1049521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-03T11:26:13.55Z",
                "reviewBody": "I  made this wine myself this summer.  It was delicious! I used  only the petals, no green parts of the flowers at all and I used only 6 cups of sugar instead of 8 and I distilled it using glass bottles with balloons on top. You have to release the air of the balloons periodically to stop it from bursting. When the balloons will no longer inflate the yeast is dead and the wine is done.  I filtered out the sediment with coffee filters and stored it in sterilized mason jars. It was lovely!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Louisette Lulu Lanteigne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9779880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-24T05:31:14.317Z",
                "reviewBody": "we had a field in front of our old farm house with 11/2 diameter blossoms. the dandelion greens were so nice. If nobody was home we may come home and somebody could be digging dandelions. People just thought weeds , we will help them get rid of them. My Dad decided one year to make dandelion wine. he would mix it in one of the old crocks and put it in the cellar. and bottle it when ready. so the old ceramic crocks work good as a formenting container. He always had something in the old root cellar. One time making brew/beer. .We were at the supper table Mom was giving Dad the business about spending to much time in the root cellar. Are you making brew?She didn't want it around raising 11 children/ eight boys would get into it, corse he said no fixing the root cellar under the house to be ready for fall harvect/ or cleanibg after winter season. well the night at the supper table, Pop something hit the floor ubder the table, Pop, Pop Pop. Dad gets up rushes to rge cellar abd found his brew bottles all popping the corks off his bottles. As they were popping they would it the ceiling of the root cellar, happens to be the floor of the kitchen. disappointed, but didn't admit to what was happenig in the cellar. use the crocks and let them it forment untill bubbles stop.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michael Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14327821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-26T19:26:26Z",
                "reviewBody": "I think this is a pretty good recipe- mine came out a bit too sweet, it was like Boone's farm plus a cup of sugar!   So I would try 6 or 7 cups of sugar next time- otherwise, nice flavor and fizz!  I left the fruit in with the wine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda Fack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6023934/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-20T22:33:47.847Z",
                "reviewBody": "I have not mad any yet but there is a vacant lot across the street with lots of dandelions. I DO remember a co-worker brought some to work which was made by his landlord;an old Jehovah's Witness woman. It was bright yellow and sweet. Great wine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jon D Eager",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16575306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-04T04:29:43.35Z",
                "reviewBody": "I was amazed how simple and quick this wine was to brew. I used 7 cups of sugar, 2 oranges and 2 lemons. I tried adding orange and lemon slices to some jars and left other jars with just wine. I like the ones with a lemon and an orange slice the best. Also after trying different mixes with the finished wine I found mixing wine with an ounce of real cranberry juice and a squirt of lime juice in a wine glass to be the best. The cranberry juice sourness equals out the wines sweetness in a very tasty way. \nIf you have a bunch of dandelions don't think twice about trying this recipe out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDowney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12322386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-11T20:03:36.12Z",
                "reviewBody": "Works great!! Best made if using extra dandelion pedals. DO NOT try to use honey in place of sugar will not work well and have to much alcohol content and lack of good flavor. Also works well if you add strawberry's in to the wine. Best kept in cold dark and dry area.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Hungry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15740969/"
                }
            }
        ]
    }
]