[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/151/breakfast-and-brunch/pancakes/",
                    "name": "Pancake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76448/truck-stop-buttermilk-pancakes/",
        "name": "Truck-Stop Buttermilk Pancakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F969723.jpg",
            "width": 1492,
            "height": 1492
        },
        "datePublished": "2020-06-19T03:11:20.000Z",
        "description": "A yummy breakfast treat, and very easy to make!! Serve with bacon or sausage, and some fried eggs, wonderful!!! Batter will keep in fridge for a couple of days if you can't make all at once, or you can freeze and make at a later date.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H15M",
        "recipeYield": "12 Servings",
        "recipeIngredient": [
            "5 eggs",
            "1 ½ cups milk",
            "6 tablespoons butter, melted",
            "5 cups buttermilk",
            "5 cups all-purpose flour",
            "5 teaspoons baking powder",
            "5 teaspoons baking soda",
            "1 pinch salt",
            "5 tablespoons sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whisk together the eggs, milk, butter and buttermilk. Combine the flour, baking powder, baking soda and sugar; stir into the wet ingredients just until blended. Adjust the thickness of the batter to your liking by adding more flour or buttermilk if necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side. Continue with remaining batter.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Pancake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Steve Whiting"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.626291079812207,
            "ratingCount": 1065,
            "itemReviewed": "Truck-Stop Buttermilk Pancakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "347.3 calories",
            "carbohydrateContent": "51.8 g",
            "cholesterolContent": "99.3 mg",
            "fatContent": "9.8 g",
            "fiberContent": "1.4 g",
            "proteinContent": "12.4 g",
            "saturatedFatContent": "5.3 g",
            "servingSize": null,
            "sodiumContent": "865 mg",
            "sugarContent": "11.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-05T16:54:49.543Z",
                "reviewBody": "These are the BEST pancakes I have ever eaten.  Usually I like to drown my pancakes in my homemade apple syrup, but these were awesome with a minimal amount of syrup.  \r\nI made these last week, substituting milk and lemon juice for the buttermilk.  It did not work, not sure if that was because of my error or whatever.  In any case, I made it as stated today and they were perfect.  I also scaled the recipe down to 9.6 servings to get equal eggs, etc.  \r\nI really can't say enough about these, this recipe will be my pancake recipe from now on.  You can also scale to 7.2 (3 eggs, 3 flour, 3 buttermilk, etc.); 4.8 (2 eggs, 2 flour, 2 buttermilk); 2.4 (1 egg, 1 flour, 1 buttermilk). \r\nThank you for contributing!  My family and I thank you very much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHARISSALYNN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1376665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-18T13:21:37.06Z",
                "reviewBody": "Okay, so I have never felt compelled to write a recipe review before, but after making and (better yet) tasting these pancakes I just had to write a review!  I am a pancake fiend and have tried just about every pancake mix there is, but I was never fully satisfied w/ the results.  Well, that's all behind me now because this recipe is a keeper!  The pancakes come out so light and fluffy and utterly delicious!!!  I've made this 4 times now for friends and family and everyone raves about them and asks for the recipe.  Also, the last couple of times I made them I added 2 tbsp each of milled flax seed and wheat germ; it doesn't change the taste at all and it adds a little healthy twist to it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Sherman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1706508/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-02T18:33:08.047Z",
                "reviewBody": "Now that's a pancake!  Light and fluffy...everyone loved them. I scaled recipe back to 4.8 to feed 3 adults and 2 kids. Did not have buttermilk on hand so used 2 tblsp of lemon juice and filled measuring cup to 2cups of Milk...let sit for 5-10 mins to make your buttermilk, then added the required 1/2c regular milk with the rest of the wet ingredients.   Will certainly make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Loralie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1547742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-29T22:46:40.063Z",
                "reviewBody": "Holy PHENOMENAL pancakes, Batman!  I cannot say enough great things about this recipe.  The pancakes come out REALLY light and fluffy... and have a GREAT flavor!  The other reviewer who said that they don't need much syrup, it's true!  I was eating most from the griddle, plain.\n\nI made the recipe as specified, but added a splash of vanilla.  [I also like to try to eat healthy, so I substituted whole wheat flour, which I couldn't even taste because the flavor of this pancake is so awesome, and nonfat plain yogurt for the buttermilk.]\n\nI cannot recommend this recipe enough!  They do come out soooooo light and fluffy and taste like they're straight from the griddle of your fave breakfast restaurant.\n\n[Also, note to those who found their pancakes to be tough and chewy: That's usually a sign that the pancake batter was mixed too long or strongly... try gently mixing in the dry ingredients into the wet slowly and gently until moistened, and see if that makes a difference!]",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sweets",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2709149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-17T15:36:38.873Z",
                "reviewBody": "I have to add my two cents. My family has consistently turned their collective noses up at the many pancake recipes I have tried over the years. Finally, I got unanimous cheers from this one. I never eat pancakes, and I love these. They remind me of the ones at IHOP, soft, fluffy, sweet. These are going in my family recipe book. Thanks a bunch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kati Remington Blackledge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kati/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-18T20:16:52.747Z",
                "reviewBody": "My husband has always told me how much he loved the pancakes at a favorite diner that he visited as a child.  He called them \"flapjacks\", and described them as a thinner, firmer and more flavorful version of traditional pancakes.  I have repeatedly tried and failed to duplicate them for him, UNTIL NOW!!  These are it!!  I made them a few weeks ago for the first time, and he was ecstatic!!  He has requested them every weekend since!!  Since the first time I made them, the only thing I have changed is to add a little vanilla, (makes them a beautiful golden color), but everything else is exactly the same. My search for the perfect \"flapjack\" is over!!! (After 11 years!!)  Thank you soooo much for this fabulous recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KimberMc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2319269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-14T16:54:35Z",
                "reviewBody": "Yummy! I had to scale this recipe way down as there are only two of us at home and was a little nervous when the conversion was kind of funny (1 1/4 eggs?) but I guesstimated as best I could. They were fabulous! My husband's not even a huge pancake fan and he said these were excellent. They weren't hugely thick like some pancakes but they fluffed nicely and were oh so good with real maple syrup! Thanks for the wonderful recipe - it'll be used often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FAILE819",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-08T19:39:38.957Z",
                "reviewBody": "Great, reliable recipe.  I always like to prepare the batter, then let it sit while I heat the griddle.  The batter thickens a bit which guarantees thick, light and fluffy pancakes.  Real buttermilk pancakes are the best!  I added some frozen blueberries to the batter which made these particularly delicious. Thanks for sharing the reciupe BOBOBEARZOE - these were a real treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T21:01:17.153Z",
                "reviewBody": "These are so good! Scaled these back a bit and still had enough to freeze for another time. There's just something about using real buttermilk that makes things light and fluffy! Be sure to let the butter cool after melting before adding the eggs so you don't \"cook\" the eggs. Served with scrambled eggs bacon toast juice and coffee - it's like having the diner experience right in your own house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-21T19:04:34.44Z",
                "reviewBody": "I'm sad to say I am not a fan of this recipe! I was so excited to make them based on all the reviews. I halved the recipe for my husband and I and let the batter sit about 25 minutes. The batter was a bit runny and made yummy flat pancakes. I added flour to make it less runny as the recipe noted and they plumped up a bit but turned completely tasteless. Syrup could not save them. Now I have a dozen tasteless disks in my freezer. Bummer! I was elated to finally find a buttermilk pancake recipe. I will not be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ag",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4084946/"
                }
            }
        ]
    }
]