[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
                    "name": "Canning and Preserving Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
                    "name": "Jams and Jellies Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/170998/habanero-pepper-jelly/",
        "name": "Habanero Pepper Jelly",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5839567.jpg",
            "width": 1536,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:36:40.000Z",
        "description": "Blazing hot pepper jelly is addictive if you can handle it!  The grated carrot adds nice color and texture. Pepper hotness and people's tolerance varies, so you'll have to experiment to find the right number to add. If chopping habaneros by hand, rubber gloves are recommended since the habanero peppers will burn the skin.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT4H50M",
        "recipeYield": "8 half pint jars",
        "recipeIngredient": [
            "8 half pint canning jars with lids and rings",
            "1 ½ cups cider vinegar",
            "6 ½ cups white sugar",
            "1 cup shredded carrot",
            "½ cup minced red bell pepper",
            "15 habanero peppers, seeded and minced",
            "2 (3 ounce) pouches liquid pectin"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir the vinegar and sugar in a saucepan over medium-high heat until the sugar has dissolved, then stir in the carrot and red bell pepper. Bring to a boil, reduce heat to medium, and simmer 5 minutes. Add the habanero peppers and simmer 5 minutes longer. Pour in the pectin, and boil for 1 minute, stirring constantly. Skim and discard any foam from the jelly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pour the jelly into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all).\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Canning and Preserving Recipes",
            "Jams and Jellies Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lunasea"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.81283422459893,
            "ratingCount": 187,
            "itemReviewed": "Habanero Pepper Jelly",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "81.6 calories",
            "carbohydrateContent": "20.8 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": "0.2 g",
            "proteinContent": "0.1 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "1.9 mg",
            "sugarContent": "20.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-14T20:22:36.223Z",
                "reviewBody": "Fabulous!  I knew this was going to be a good recipe when I read the ingredients, but it's beyond good.  I only had the powdered pectin which I added slowly, stirred frequently and used two boxes.  I think in hind sight I could have used a box and a half.  You need to cook jelly until it passes the \"gel-test.\"  Put a small dish in the freezer until it's cold, drop a puddle of your concoction on the dish and push it back with your finger - if there's a light skin on the top and the mixture slides back, it's done.  Mine turned out a little too thick when I put it in the fridge, but at room temperature the texture is perfect.  Instead of mincing the red peppers I used peeled/roasted red peppers and put them in a food processor.  Worked out perfectly - lovely red flecks of peppers mixed in with the carrot shreds.  Now here's the real orgasm... pour some jelly on top of chèvre (goat cheese) and serve it with crackers...  OMG!  That'll snap any silly cowgirl right on out of the blues!  Tomorrow I will try to blend some with butter to make habanero butter...  Thank you so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ling Sigstedt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3324220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-03T15:59:44.173Z",
                "reviewBody": "I am giving this a 5 star because I think I did something wrong that was no fault of the recipe. I am new at making any kind of jam with my concentration being on pepper jams. I did not notice the recipe called for LIQUID pectin so I accidently added the stated amount in powder. My jam has not set up like others I have made. Can someone tell me if it had to do with using powder instead of liquid or is this particular jam more of a honey consistency? I haven't tried any yet because I keep hoping it will set up however it has been about a month and hasn't. Should I just toss and make again using liquid?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Red Hat Milli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3328016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-14T20:11:52.55Z",
                "reviewBody": "This is wonderful! I was looking for a way to use up our Habeneros from our garden and I made a small test batch of this. I wish I would have made more! While the carrots scared my bf they ended up being perfect. They added great color and needed texture. This is very sweet with a lot of warmth it in. It's perfect! Everyone that has tasted it loves it. My bf has eaten it on crackers on sandwiches and even added it to some chili I made. It's so good! Now we are eagerly waiting for the current harvest of habeneros to get ripe so I can make a large batch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1120366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-13T19:41:28.46Z",
                "reviewBody": "Awesome...I made this in October (picture posted by me) and I opened a jar on Christmas eve and it was a hit.  Great with brie... and pretty much anything creamy. Try procuitto(sp?) wrapped pears with blue cheese, and a dollop of jelly.  Also I made this into a salad dressing using  a spoonful of jelly, olive oil, salt, lemon, & vinegar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tragik T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3718741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-09T23:56:34.867Z",
                "reviewBody": "very addictive I added the seeded hot peppers to a food processor with a little of the vinegar and semi pureed before adding to the surgar mixture. The final heat w/ 15 peppers was just right for us maybe little hot for some and not enough for others. ended up w/ 6 or 7 half pints.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hoisi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2521301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-08T15:58:03.613Z",
                "reviewBody": "First time canning and it was a fun and delicious success! The only change I made was using Serrano peppers in place of Habaneros (we had a bumper crop this year) which turned out to be the perfect combination of heat and sweet. The jelly looks almost artistic inside the jars! I will definitely be giving these out as gifts! As a side note the yield was actually 6 half-pint jars instead of the 8 shown in the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Booyah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7636397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-01T19:17:52.533Z",
                "reviewBody": "We had bags of habaneros from the garden and this was a great way to make use of them. The recipe came together very easily--though you may want to make sure you have plenty of ventilation when you de-seed the peppers. The taste and texture of the jelly is very good. Like others I had concerns about the carrots but they do blend well. There is a strong vinegar scent to the finished jelly that I find off-putting. When I make a second batch I'll cut the vinegar with a little water or use apple cider instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Steve Seebart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/621481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-11T13:38:59.467Z",
                "reviewBody": "Followed this recipe and it turned out really really well. Mind you I adjusted the servings to 20 (which fills a 650ml/22 oz jar). I used powdered pectin instead of liquid pectin. Did a bit of reading and found that 2tbsp powdered pectin is roughly equivalent to 1 packet liquid pectin. Was also advised to whisk the pectin powder into the sugar prior to mixing to help prevent clumping and encourage more even setting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14334300/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-05T02:50:37.29Z",
                "reviewBody": "I haven't tried it yet but the ingredients add up to almost four 8 oz. jars. How did you get eight 8 oz. jars? What did I do wrong? I must add that I'm a first time jelly maker. I'll update my review after I taste it (hoping that I didn't accidentally sabotage the recipe).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Patrick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6809526/"
                }
            }
        ]
    }
]