[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1316/breakfast-and-brunch/waffles/",
                    "name": "Waffle Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/171978/great-easy-waffles/",
        "name": "Great Easy Waffles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F334650.jpg",
            "width": 1000,
            "height": 1000
        },
        "datePublished": "2020-06-19T03:36:58.000Z",
        "description": "This recipe has been handed down in my family and has become a favorite. If you have leftover waffles, they are great to freeze and then toast at a later time. I usually make a double recipe and then have plenty of leftovers for the kids to have for breakfast before school.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "4 waffles",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "2 tablespoons white sugar",
            "½ teaspoon salt",
            "2 egg whites",
            "2 egg yolks",
            "2 tablespoons grated lemon zest",
            "1 teaspoon vanilla extract",
            "2 cups milk",
            "6 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat a waffle iron according to manufacturer's instructions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk the flour, baking powder, sugar, and salt together in a mixing bowl; set aside. Beat egg whites until foamy in a separate large glass or metal mixing bowl. Whisk the egg yolks, lemon zest, and vanilla extract together in a third bowl; whisk in the milk. Stir in the flour mixture until smooth. Fold in the melted butter and then the beaten egg whites until just incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the waffles according to manufacturer's instructions until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Waffle Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cooking Mom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.670411985018727,
            "ratingCount": 267,
            "itemReviewed": "Great Easy Waffles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "505.5 calories",
            "carbohydrateContent": "61.3 g",
            "cholesterolContent": "158 mg",
            "fatContent": "22.5 g",
            "fiberContent": "2 g",
            "proteinContent": "13.8 g",
            "saturatedFatContent": "13.4 g",
            "servingSize": null,
            "sodiumContent": "740.4 mg",
            "sugarContent": "12.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-09T22:35:19.97Z",
                "reviewBody": "I've tried so many waffle recipes and thought many of them were really good, but this one- WOW!  These are the yummiest waffles I've EVER had-soft, but slightly crunchy, super fluffy, and with just the right amount of sweetness.  I didn't add the lemon zest (no lemons) and thought I had messed it up, as I ran out of milk and had to leave everything to run to the store.  But they still came out perfect.  You have to try these!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheri Fontenot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1377387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-19T21:46:51.807Z",
                "reviewBody": "Of all the waffles recipes I've tried on this site this one would probably be the least easy to make with its requirements of grated lemon zest and beating the egg white separately. However the bit of extra work is worth it. The recipe says to beat the egg whites until foamy but keep going until stiff peaks form. I only used half the amount of lemon zest as that is all I had and still got a nice lemony flavour which went well topped with blueberries. Finally the yield is incorrect-- I got three times as many waffles as stated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JPMJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1417148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-27T16:54:42.29Z",
                "reviewBody": "The boys were bummed out there weren't any frozen waffles in the freezer so we decided to make a couple big batches together and freeze them. I only made one change and that was using \"sour\" milk in place of the regular milk. My one issue with this recipe was that the batter was SO runny. With waffles I've made before the batter is a little fluffier and thicker. The waffles turned out just fine just thin. Next time I'll try adding an extra half cup of flour or try this recipe with half whole wheat flour. Using whole wheat flour it just sucks up more of the liquid and makes for a heartier waffle than AP flour does. IMO. NOTE: I made four batches of this recipe today. The last three I added an extra half cup of flour. That made them just right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-08T19:41:17.707Z",
                "reviewBody": "These waffles were restaurant quality. My husband and I loved them. Hope the leftovers heat up as good. I subbed 1/2 cup ww flour and 1/2 cup oatmeal for one of the cups of flour to make them healthier. I had to make sure to put cooking spray on the waffle iron each time I cooked up another batch or it would stick. Cooking time was 4 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeri Packer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3981802/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-01T23:40:33.613Z",
                "reviewBody": "These are FANTASTIC! I have made them 3 times now and absolutely love them. I have yet to add the lemon and are still wonderful. Thanks for the recipe... A A A A A A Also --- today I discovered I did not have any vanilla therefore I added a couple of dashes of cinnamon... yum!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "michy74",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3966519/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-16T17:14:37.63Z",
                "reviewBody": "Wow! These definitely were easy and tasted great!I cut back on the milk a bit and used buttermilk vs. whole milk. They were crispy on the outside and tender on the inside. This recipe is perfect as-is but if you want a sweeter waffle you can up the sugar to as much as you like. I upped it to about 4-6 Tbsp and was liberal with the vanilla. These are delicious topped with real maple syrup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-06T17:49:02.85Z",
                "reviewBody": "I followed the recipe exactly I usually make belgian yeast waffles but today i didn't have the time so I tried this one. I found they were a little on the chewy side and didn't stay crisp. The taste was just ok similar to the box stuff where you add your own egg and milk. For all the work that went into this one ( egg white beating and separate bowls) I would rather go the extra step and make yeast waffles. They taste much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "missmuffins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/missmuffins/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-29T20:13:21.64Z",
                "reviewBody": "I just bought a waffle iron for my sister as a gift and I am printing out this recipe to go with it. This recipe is just as important as the waffle iron!!! It is definitely restaurant quality. This recipe is awesome... every time I make it... it's a hit! I recently made it for breakfast at my daughter's slumber party... and even her friends who are the \"picky eaters\" LOVED LOVED LOVED the waffles. The kids love it with butter syrup (obviously) and Redi Whip whipped cream on top. We've also had it with cooked blueberries over the top... YUM. Another kid pleaser is to put some Hershey's Chocolate chips in the batter and use Hershey's syrup and whipped cream on top. ANY WAY you serve this you will love it. (And the leftovers are even good whether you refrigerate or freeze them... not something you can say for all waffle recipes!) I've tried many other recipes and this is BY FAR the best. (Also... FYI... ditto on waffle makers and I love the GE waffle maker.) I suggest doubling the recipe and making it up the night before since it uses different bowls etc. in the preparation. It's nice to wake up have the batter in the refrigerator ready to go and no mess in the kitchen. DON'T leave out the lemon zest... a small thing but it makes the recipe much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6175069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T17:53:08.347Z",
                "reviewBody": "great recipe! I didn't have any lemon so i added orange zest. it was really good but i would like to try them with the lemon. I love the crunchy outside and the soft inside. They didn't even stick at all. I thought the batter was a little thin at first like maybe I had added too much milk but they came out perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amyleem",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4089172/"
                }
            }
        ]
    }
]