[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/149/breakfast-and-brunch/french-toast/",
                    "name": "French Toast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/173452/mascarpone-stuffed-french-toast-with-peaches/",
        "name": "Mascarpone Stuffed French Toast with Peaches",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F813012.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2008-08-06T18:27:21.000Z",
        "description": "Lemon zest and mascarpone stuffed into thick white bread slices, dipped in batter, pan fried, and smothered in fresh peach sauce. I love this recipe for breakfast but it could be fancy enough for dessert too.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "8 fresh peaches",
            "½ cup sugar",
            "4 pinches ground nutmeg",
            "½ teaspoon ground cinnamon",
            "4 Mexican bolillo rolls",
            "1 cup mascarpone cheese",
            "6 tablespoons confectioners' sugar",
            "1 lemon, zested",
            "6 eggs",
            "¾ cup milk",
            "½ teaspoon vanilla extract",
            "2 teaspoons butter, or as needed",
            "2 teaspoons vegetable oil, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Peel peaches, remove pits, and slice into a heavy saucepan, catching all the juices. Stir in sugar, nutmeg, and cinnamon, and cook over medium heat until bubbly. Continue cooking, stirring occasionally, until the sauce reaches a syrupy consistency, about 10 minutes. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, cut off and discard the ends of the bolillo rolls. Slice the rolls into 1 1/4-inch-thick slices. Lay each slice of bread on a board, and with a sharp knife held parallel to the board, cut a pocket into each slice, leaving three sides intact. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir together the mascarpone, confectioners' sugar, and lemon zest until smooth. Scoop this mixture into a small plastic bag. Cut off one corner of the bag, and pipe as much filling into the pocket in each slice of bread as will fit without overflowing.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk together the eggs, milk, and vanilla in a shallow bowl. Melt butter with oil over medium heat in a large nonstick skillet.  Dip each stuffed piece of bread into the batter, add to the skillet, and cook until browned on both sides.  Serve hot with the warm peach sauce.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "French Toast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Escapechef"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.755102040816326,
            "ratingCount": 98,
            "itemReviewed": "Mascarpone Stuffed French Toast with Peaches",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "456.5 calories",
            "carbohydrateContent": "56.3 g",
            "cholesterolContent": "179.5 mg",
            "fatContent": "20.4 g",
            "fiberContent": "1.3 g",
            "proteinContent": "12.7 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "91.9 mg",
            "sugarContent": "26.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-09T17:34:50.97Z",
                "reviewBody": "This recipe was delectable. I have prepared French toast per this recipe three times and the French toast has been awesome each time.  Each time I have used Texas Toast as I could not source the Mexican Bolillio Rolls. I find that if you don’t over saturate your bread in batter (to a point of sogginess) and that if your skillet or griddle is hot enough, the mascarpone filling should not melt as it takes the toast less than a minute (about 45 seconds)  to brown on each side. This is a recipe that one should definitely try more than once--making adjustments according to one’s taste; i.e. with different fruit, etc. Also to those who cannot locate Mascarpone cheese or the cheese is too expensive etc., I have found an awesome substitute for Mascarpone cheese that is as good as, if not better, than the real thing.  Enjoy!  Mascarpone Cheese Substitute: 1 (8 ounce) package cream cheese  1/4 cup heavy whipping cream  2 1/2 tablespoons sour cream  Combine well. Do not substitute low fat cream cheese or sour cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol's Daughter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3831925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-11T17:27:32.133Z",
                "reviewBody": "Oh wow! I had left over mascarpone from a dessert recipe and not knowing what else to do I looked here. This recipe is absolutely delicious! The only changes I made were: I used french bread instead of bollio and I added regular sugar to the mascarpone in addition to the powdered because I didn't think the confectioners cut it. Also since it wasn't peach season U used frozen peaches and it still came out really well. I'd recommend this recipe to anyone! UPDATE: I just wanted to share a much easier way of making this. Forget the loaf and cutting and stuffing! Just buy a presliced loaf of french sandwich bread and spread the filling between two slices and make as normal. So much easier and I say even better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dsperin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3222912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-09T16:39:31.44Z",
                "reviewBody": "This recipe was wonderful! The subtle flavors of the lemon in the marscapone and the nutmeg in the peaches really made an exciting yet warm/comforting breakfast. My husband stated that he much preferred this breakfast to anything else we've had before because it's not overtly syrupy sweet like so many other french toast/pancake recipes. The only changes I made was using canned peaches as this was a last minute recipe and I didn't have fresh. Since the canned peaches were already sweeter than fresh I did not add the granulated sugar but just left in a little bit of the light syrup it came in and then seasoned according to the recipe. I also used plain bread slices as I've never even seen Mexican Bolillo Rolls in my small northern town. I will definitely be using this recipe again in the future. Thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AmberJo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1163149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-01T18:42:48.05Z",
                "reviewBody": "My favorite allrecipes.com recipe! Absolutely fantastic. I've made this several times and with different breads. Of French bolillo rolls blue berry crepes and sub rolls the bolillo rolls were the easiest to work with and the fluffiest. I found them in the bakery bread section of the grocery store near the buns and dinner rolls. The texture of the French bread made it difficult to stuff without tearing. The fresh lemon zest makes this dish. The peaches were excellent and I've also modified it with fresh blue berries and fresh black berries. Easy to make & decadent this is our 'go to' recipe for special occasions and company. Highly recommend. Revised 01/01/16 - Here's what I've learned.... Wheat Bolillo rolls work great with a mixed berry compote in lieu of peaches if desired. The slight bitterness of the bread is offset by the sweetness of the berries. The recipe as presented will easily make (6) rolls which will easily feed 6-8 people especially when served along side sausage (highly recommend). I've found if you cut the pointed ends off first then alternate slice cuts as follows it's an easy dish to make: Main slice through half way slice main slice through. Much less work than making slits for pockets. Each individual serving piece then ends up about 1 inch wide. The cheese mixture can then be spread by knife onto the roll in between the two sides (instead of piped) dipped by hand into the egg wash and placed on griddle. The half way cut keeps the",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gokili",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3387044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-07T18:34:31.91Z",
                "reviewBody": "I love this recipe. I used the french bread and cut it into thick slices. I used frozen respberries instead of peaches for the sauce. This made a sauce with a bit of a tart flavor to go with sweetness of the mascarpone. It came together so well and tasted wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "beachy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2260831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-28T18:50:25.79Z",
                "reviewBody": "I made some changes to this to suit my minimalist cooking style and make it a little healthier. Just made plain french toast without the pockets with a good multi grain bread. Spread the mascarpone filling in the middle of two pieces and served with fresh peaches and blueberries. I thought the blueberries were a nice compliment to the lemon and peaches. My teenage son will be demanding I make this every weekend and I will happily comply.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SANDYARENZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1175101/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-14T16:36:24.197Z",
                "reviewBody": "This really was awesome. My new favorite breakfast. I did use the rolls even though they make tiny pieces but they were very very good. You could probably use any type of fruit (apples strawberries blueberries...).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "juliemf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/781222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-02T18:45:06.853Z",
                "reviewBody": "delicious and always gets rave reviews! i've used french bread and sourdough and both have worked well. i let the stuffed bread soak in the batter mix for 5-10 minutes on each side before frying instead of just dipping it. much better in my opinion. i LOVE the flavor of blueberry and lemon together so instead of topping with peaches i simmer about 2 cups of frozen blueberries with a few tablespoons of sugar for about an hour then drizzle that over the french toast when serving. add a little dark maple syrup for an amazing brunch:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anjanette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-11T22:12:08.74Z",
                "reviewBody": "This was wonderful. The filling has a great custard-y flavor. I tried it once with blueberries on top and once with apples (fresh cooked down with sugar and cinnnamon). I also couldn't find the right bread so used a good loaf of fresh French bread. Turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "haleighlachance",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1369760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-04T16:42:56.473Z",
                "reviewBody": "Loved the idea of this recipe it sounds very warm and comforting. Tried it this morning for daughter's birthday brunch. While they all said they enjoyed it and that it was good... I was a little less impressed. Used the bread suggested and I don't know just seemed to much bread to filling ratio. I will make again but making a few changes. Probably will try Texas toast and making a sandwich version before frying in a pan. Peach topping was very good and could see other toppings being just as good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mdteachick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mdteachick/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Mascarpone Stuffed French Toast with Peaches",
            "description": "Stuffed French toast is served with delectable peach sauce.",
            "uploadDate": "2013-04-18T22:01:52.316Z",
            "duration": "PT4M45.619S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F595e978b-1aa8-4f2c-8aa6-51e58da8d603%2F2608153f-23ad-416c-a720-3b556d494591%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2310656651001"
        }
    }
]