[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/395/desserts/cakes/pound-cake/",
                    "name": "Pound Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/174491/chocolate-chocolate-chip-sour-cream-pound-cake/",
        "name": "Chocolate Chocolate Chip Sour Cream Pound Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6641842.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2020-06-19T03:37:23.000Z",
        "description": "After I couldn't find a recipe for chocolate sour cream pound cake, I made this recipe by combining three cake recipes and using some suggestions from my brother-in-law. It will stay moist for a week, but this cake is so good it won't last that long!",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT4H5M",
        "recipeYield": "1 10-inch cake",
        "recipeIngredient": [
            "2 ¾ cups all-purpose flour",
            "¼ teaspoon baking soda",
            "¼ teaspoon salt",
            "2 tablespoons unsweetened cocoa powder",
            "1 cup sour cream",
            "2 teaspoons vanilla extract",
            "1 cup unsalted butter",
            "2 ½ cups white sugar, divided",
            "6 eggs, separated",
            "¼ teaspoon cream of tartar",
            "½ cup semisweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Before you begin, bring all of the cold ingredients to room temperature: set out the sour cream, butter, and the eggs (separate the eggs while they are still cold) for about half an hour before making the cake batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 325 degrees F (165 degrees C). Grease and lightly flour a 10-inch tube pan. Sift together the flour, baking soda, salt, and cocoa powder. Combine the sour cream and vanilla extract in a separate bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the butter with an electric mixer in a large bowl until creamy, about 30 seconds. Gradually add 2 cups of sugar and beat on high speed until light and fluffy. The mixture should be noticeably paler in color. Add the room-temperature egg yolks one at a time, allowing each yolk to blend into the butter mixture before adding the next.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in one third of the flour mixture and mix on low speed until combined. Blend in half of the sour cream mixture. Continue adding the flour mixture alternately with the sour cream, mixing until just incorporated. Fold in the chocolate chips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the egg whites and cream of tartar in a clean mixing bowl with clean beaters until soft peaks form. Gradually add the remaining 1/2 cup sugar and beat until medium-stiff peaks are formed (lift your beater or whisk straight up: the tip of the peak formed by the egg whites should curl over slightly.) Use a whisk or rubber spatula to fold 1/3 of the meringue mixture into the cake batter to lighten it.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold the remaining egg white mixture into the batter until combined. Pour the batter into the prepared pan and spread it evenly. Bake the cake for about 1 hour and 15 minutes, or until the cake springs back when you touch it lightly and a toothpick inserted in the cake comes out clean.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let the cake cool in the pan for ten minutes before inverting the cake onto a wire rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Pound Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Amanda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.551724137931035,
            "ratingCount": 29,
            "itemReviewed": "Chocolate Chocolate Chip Sour Cream Pound Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "515.8 calories",
            "carbohydrateContent": "69.6 g",
            "cholesterolContent": "142.1 mg",
            "fatContent": "24.4 g",
            "fiberContent": "1.5 g",
            "proteinContent": "7.3 g",
            "saturatedFatContent": "14.4 g",
            "servingSize": null,
            "sodiumContent": "230.4 mg",
            "sugarContent": "45.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-04T20:10:12.9Z",
                "reviewBody": "Five stars for the recipe instructions! Amanda, you are a great instructor. You've put all the best tips here. Everyone could benefit from bookmarking this recipe and using its techniques for tender cakes. The texture of this cake was phenomenal, not as dense as typical pound cake. I would call this a \"cocoa cake\", though, because the ONLY change I made was to add twice the amount of cocoa, and it still wasn't very chocolatey. Chocolate ganache from this site topped it well. I wonder what substituting melted bittersweet chocolate for cocoa (2-4 squares) and cream cheese for sour cream would do. At least, DO add more chocolate chips!- 2 cups if you really like chocolate; just don't refrigerate it, or the chips will be hard. I'm savin' this recipe =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joy-of-jesus-smileymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2217912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-05T19:42:01.8Z",
                "reviewBody": "This cake is awesome! I do quite a lot of baking and this is one of my favorite cakes ever. The texture is velvety smooth. Really perfect with a cup of tea or coffee. It has a really nice subtle chocolate flavor that was just right for me. I didn't make any changes to the recipe and I have made it twice. I'm normally one to take shortcuts and rush through a recipe (as I have two young children) but I really took my time both times I made this cake...following every step. I will definitely keep this one on file and make it again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3532264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-11T17:51:24.27Z",
                "reviewBody": "I made this today for my church community group and it turned out wonderful. I think it may be the softest cake I have ever made...even tasted. I agree too that the directions were fabulous. Great job Amanda and thanks for sharing such a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "n.schaeffer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3319752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T21:00:52.05Z",
                "reviewBody": "I made this for my son's birthday he wanted a train cake so I needed to cut loaves up to make the engine stack and cars. It cut up so nicely and held together so I could shape the cake perfectly! There wasn't so much as a crumb left it was delicious. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "donnaR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3802050/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-02T19:46:01.13Z",
                "reviewBody": "Super good! Since we don't like too much sweetness I cut down (a little less than 1/4 cup) on the sugar. The cake is very pretty with a sprinkling of confectioner's sugar over the top. Serve with lightly sweetened whipped cream and you've got a marvelous dessert for family or dinner parties.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tmce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3723078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-01T23:22:52.943Z",
                "reviewBody": "This cake is so good! It is moist and light. I made it in a Bundt pan. Short on time I baked it for 1 hour on 350. I doubled the salt based on another review and didn't include cream of tarter (didn't have any) and it turned out fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Abbie Marnell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5364623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-25T01:47:26.367Z",
                "reviewBody": "I decided to do a test run of this cake tonight before I serve it at Thanksgiving dinner. It is absolutely FANTASTIC! Altho time consuming it for sure beats out any pound cake I've ever had...and that makes up for it! I will be making another one tomorrow night because I cut into the one i made tonight. I did however double the cocoa. Immediately it has a very light cocoa flavor at the end a buttery flavor. AMAZING!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Megan-Ashley Maine-Ludlow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5814066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-12T19:30:00.143Z",
                "reviewBody": "Mmm yum yum! I agree that the recipe directions were clear and easy to follow. I had been looking for a yummy chocolate chip cake to satisfy my craving for choco chips without resorting to cookies. Most cakes I found used ingredients like packaged jell-o pudding. I always prefer to take things from more basic ingredients- so I know exactly what is going in my food and so I feel like I am actually baking! So this recipe was great! We have a large oven and a smaller oven for side dishes and rolls and such. I used my smaller oven so the result was shorter cooking time and a crust that was not too hard but a little crispy. The inside is still moist and creamy melt-in-your-mouth good. It is just great! Thanks for this recipe I will be using it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "StopTeri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5085798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-19T19:06:29.317Z",
                "reviewBody": "I don't know what to say. It is definitely not what I consider to be a pound cake. I won't make it again. It is definitely not what I'm looking for. This is also fairly complicated but the steps are spelled out. Don't do this if you are an experienced cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Karies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2424356/"
                }
            }
        ]
    }
]