[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/176090/adzuki-mooncake/",
        "name": "Adzuki Mooncake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F777190.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:37:36.000Z",
        "description": "This traditional Chinese cake is so moist and indulgent. You can substitute adzuki beans with mung beans, lotus seeds, chestnuts, mixed nuts, dried fruits, etc. Once cool, these are ready to be served or wrapped as gift. They will be even more moist if you leave them at room temperature for 2 days. For a more authentic shape, press the cakes into a mooncake mold, small cake tins, cookie cutters, even muffins tins after they have been rolled in flour.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H50M",
        "totalTime": "P0DT8H30M",
        "recipeYield": "8 moon cakes",
        "recipeIngredient": [
            "⅓ cup golden syrup",
            "3 tablespoons peanut oil",
            "1 cup cake flour",
            "½ teaspoon baking soda",
            "1 pinch salt",
            "1 ½ cups dry adzuki beans",
            "4 cups water",
            "¼ cup peanut oil",
            "¼ cup white sugar, or more to taste",
            "2 tablespoons wheat starch",
            "½ cup all-purpose flour",
            "1 egg yolk, beaten"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir the golden syrup together with 3 tablespoons of peanut oil in a small saucepan over low heat until the mixture becomes very warm, and the syrup is easy to stir, about 3 minutes. Meanwhile, whisk together the cake flour, baking soda, and salt in a mixing bowl. Stir in the golden syrup until a smooth dough forms. Wrap well with plastic wrap; refrigerate at least 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, combine the adzuki beans and water in a large saucepan over high heat. Bring to a boil, reduce heat to medium-low, cover, and simmer until the beans are tender, about 1 hour. Drain and allow to cool for 10 minutes. Puree the beans in a blender or food processor.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1/4 cup of peanut oil over medium heat in the saucepan the beans were boiled in. Stir in the pureed beans along with the white sugar. Cook and stir until the bean paste clings to the stirring spoon, 10 to 20 minutes. Stir in the wheat starch. Scrape into a mixing bowl. Chill in the refrigerator until cold.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough and the filling each into 8 equal portions and roll into balls. Press the dough balls between your palms to form circles large enough to envelop a filling ball. Place a ball of the filling onto the center of each pastry circle, wrap the pastry around the filling, and pinch the edges together. Roll the mooncakes in the all-purpose flour to coat; shake off excess. Place the mooncakes seam-side-down onto the prepared baking sheet and press to flatten slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mist lightly with water. Bake in the preheated oven for 8 minutes. Remove the mooncakes from the oven and reduce the oven temperature to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush with the beaten egg yolk, applying more of the yolk to to tops than to the sides. Return to the oven and bake until golden brown, about 15 minutes more. Cool completely before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "hearty_cook"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.2,
            "ratingCount": 5,
            "itemReviewed": "Adzuki Mooncake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "395.5 calories",
            "carbohydrateContent": "61.7 g",
            "cholesterolContent": "25.6 mg",
            "fatContent": "12.8 g",
            "fiberContent": "5.2 g",
            "proteinContent": "10 g",
            "saturatedFatContent": "2.3 g",
            "servingSize": null,
            "sodiumContent": "113.5 mg",
            "sugarContent": "10 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-02-01T23:54:34.863Z",
                "reviewBody": "I purchased a wooden moon cake mold in a Chinatown some years ago and was happy to finally use it. I've loved mooncakes since I first tried one as a teenager. I couldn't find golden syrup locally so I made the dough with a mixture of 1/3 light corn syrup and 2/3 molasses since this is what I had. I also substituted corn starch for the wheat starch in the bean paste. The resulting cakes are delicious. Because of the molasses the color is much darker than authentic Chinese moon cake but the flavor is very good and they are pretty. I will look for golden syrup and try these again but would also make again with these substitutes. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LBC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6466204/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-21T17:40:50.077Z",
                "reviewBody": "should be six stars. The most heavenly tasting cookie/cake I have ever eaten. The very first one I had at China Town in Boston Ma. about 27 years ago. I have never forgotten how wonderful they are. Very expensive to buy. So if you give one or two as a gift to a DEAR friend you are indeed giving a little treasure. Bev",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beverly Jane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3390440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-23T01:29:07.113Z",
                "reviewBody": "I wanted to make something special for Lunar New Year (year of the Dragon) so I made these mooncakes. I have had adzuki filling before but I've never had mooncake so I knew that however this recipe turned out it would be somewhat of a surprise. After I made the pastry and filling and put them into the refrigerator I watched some YouTube videos on how to make mooncake.... I realized then that this recipe would not be similar to what you would find in the bakery. I used 1/2 cup of sugar and the filling was only slightly sweet. I used a rolling pin and a little flour to roll out the pastry. I used soymilk in place of eggwash. My husband and I enjoyed this recipe but my kids did not care for it. My biggest problem with this recipe is that it makes 4 times more filling than what can possibly fit into the pastry. I do not recommend this recipe for a pastry novice as the pastry is tricky to wrap around the filling balls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Momi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/tacy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-03T22:41:21.603Z",
                "reviewBody": "This recipe didn't work for me. The pastry fell apart the moment heat is applied even handling it on my hand is enought to melt the pastry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jason Goh CS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7654912/"
                }
            }
        ]
    }
]