[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17533/desserts/fruit-desserts/raspberry-desserts/",
                    "name": "Raspberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76935/molten-chocolate-cakes-with-sugar-coated-raspberries/",
        "name": "Molten Chocolate Cakes With Sugar-Coated Raspberries",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F999239.jpg",
            "width": 2994,
            "height": 3000
        },
        "datePublished": "2020-06-19T03:11:25.000Z",
        "description": "Dessert is individual molten chocolate cakes. They're simple and elegant, and they bake in under 10 minutes in a standard muffin pan. The best part about these little beauties is that the cake batter is extremely forgiving: You can make it up to six hours before you plan to serve the cakes. Fill the pans with batter and refrigerate, but remember to remove the pan far enough in advance of baking to let the batter return to room temperature. Because they bake for only 8 to 10 minutes, pop these little cakes into the oven as you're clearing the main course dishes and making coffee.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup unsalted butter or unsalted margarine*",
            "8 ounces semisweet chocolate chips, or bars, cut into bite-size chunks",
            "5 large eggs",
            "½ cup sugar",
            "Pinch of salt",
            "4 teaspoons flour (or matzo meal, ground in a blender to a fine powder)",
            "8 extra-large paper muffin cups (or use regular paper muffin cups, which will make 12 cakes)",
            "1 (6 ounce) container raspberries, barely moistened and rolled in about",
            "½ cup sugar right before serving"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt butter and chocolate in a medium heat-proof bowl over a saucepan of simmering water; remove from heat. Beat eggs, sugar and salt with a hand mixer in a medium bowl until sugar dissolves. Beat egg mixture into chocolate until smooth. Beat in flour or matzo meal until just combined. (Batter can be made a day ahead; return to room temperature an hour or so before baking.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Before serving dinner, adjust oven rack to middle position; heat oven to 450 degrees. Line a standard-size muffin tin (1/2 cup capacity) with 8 extra-large muffin papers (papers should extend above cups to facilitate removal). Spray muffin papers with vegetable cooking spray. Divide batter among muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake until batter puffs but center is not set, 8 to 10 minutes. Carefully lift cakes from tin and set on a work surface. Pull papers away from cakes and transfer cakes to dessert plates.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Top each with sugared raspberries and serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Raspberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ben S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.640583554376658,
            "ratingCount": 754,
            "itemReviewed": "Molten Chocolate Cakes With Sugar-Coated Raspberries",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "494.2 calories",
            "carbohydrateContent": "46.4 g",
            "cholesterolContent": "177.3 mg",
            "fatContent": "34.7 g",
            "fiberContent": "3.1 g",
            "proteinContent": "5.7 g",
            "saturatedFatContent": "20.5 g",
            "servingSize": null,
            "sodiumContent": "210.3 mg",
            "sugarContent": "41.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-21T14:32:36.2Z",
                "reviewBody": "I've cooked this twice. First time, I prepared it and then put it in the refrigerator for 3 hours and cooked it after dinner. Second time, I cooked it straight away. It was definitely better the first time (more dense and chocolatey). The second time was too fluffy and dry. I'm guessing the reason was that the eggs had some time to deflate. Next time, I will make it in advance again. \r\n\r\nThanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIKO2828",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/876000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-04T01:09:02.423Z",
                "reviewBody": "Hubby and I travel frequently several times a month which means we eat out frequently as well. We've both had our share of Molten Lava Cakes in fine restaurants all over the country. And so you understand the significance then when hubby said these were as fine as we've had anywhere. But you do get out of these what you put into them so use good quality chocolate not chocolate chips--I used Scharffen Berger. Chocolatey rich and delicious perfectly moist and cakey on the outside gooey and \"molten\" on the inside. I made these in 6 oz. buttered ramekins and served with homemade raspberry sauce. A definite make again. BIG pay off for very little effort!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-23T05:24:43.67Z",
                "reviewBody": "This is, hands down, my favorite dessert. A.k.a. chocolate lava cakes, they can be served with raspberry liqueur drizzled on the plate with a mint garnish or topped with whipped cream.\r\n\r\nI've put the batter in the freezer and have been able to store for several weeks. (Baking time is increased to 12-15 minutes.)\r\n\r\nI recommend:\r\n\r\n1) replacing the paper muffin cups in muffin pan with ramekins sprayed with oil or cooking spray. (You can turn them over on plate for presentation.)\r\n\r\n2) using Ghirardelli or another high quality chocolate",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RebeccaStMartin.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1627206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-26T08:10:59.92Z",
                "reviewBody": "Oh boy.  These got RAVE reviews, and mine were even under-done.  And sooo easy.\nMy batter was a bit cool still when I popped them in, and it took a good 14 minutes at least.  \nHere's a tip: when the top pops up and starts to crack they are perfect.  The inside is still molten and that cracked gooey part will fall back in.\nMy sugar coated raspberries were not the prettiest...but they tasted great.\nDefinitely make these again and again and again...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Theresa's Cookin'",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1940451/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-15T19:27:16.293Z",
                "reviewBody": "I too made these for Valentine's Day dinner & man they were good! And easy!!! I cooked 4 in ramekins & 4 in muffin cups minus the papers. I sprayed both ramekins & muffin cups w/ Baker's Joy first & both came out cleanly when warm. (I did not immediately remove 2 of the ramekins & even though I microwaved each for 20 seconds they still fell apart when removed. So be sure & remove these while warm even if you don't eat them right away.) I pooled a bit of raspberry liqueur on the plate before adding the cake & then topped w/ the sugared raspberries. Will have this again many times!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-11T23:57:23.093Z",
                "reviewBody": "Unbelievable dessert!!! It was so easy to make and ohhhh soooo good to eat.  I make at least once a week (requested by my husband).  No need to change anything in this recipe (although I have added instant coffee to the chocolate chips and butter for a deeper flavor).  To reheat any that are left over just put in the microwave for approx 25 seconds- it's like taking them out of the oven for the first time (they're also just as good cold-fudgelike).  Five stars just doesn't do this recipe justice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cathy a.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1698490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-11T12:09:20.857Z",
                "reviewBody": "This is a phenomenal recipe. I have used this one twice and it has been a HUGE hit both times. I used Giardenelli (sp) bittersweet chocolate to make it even more wonderful. Defintely make batter in advance and let set in refrigerator several hours before using. You do not need to let it warm up to room temperature. I used raspberry perserves for an easy delicious topping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "C. Coleman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1633081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-22T22:56:43.747Z",
                "reviewBody": "Yum, these are delish.  I never bother with the double boiler.  I just microwave the butter and chocolate together and this goes together so quickly.  I also just serve them with heavy cream poured straight over.  Very rich and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAMKNAUSS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/70215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-02T03:43:20.36Z",
                "reviewBody": "Perfect as written and so easy to make. Can be baked ahead and microwaved before serving. I have made this many times and like it best served with whipped cream and fresh raspberries. I use custard cups sprayed with pam and have never had problems getting them out. This can be frozen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-10T04:04:23.31Z",
                "reviewBody": "If you are expecting an actual \"cake\" forget this recipe. Notice that it only takes 4 tsp of flour?! What a disappointment. This was more like an over-coagulated chocolate type pudding. I wish the description had been more accurate. Not only was I disappointed but it tasted strange. Maybe because I expected cake? I'll never make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Ingrid Alma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1892686/"
                }
            }
        ]
    }
]