[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/839/desserts/cookies/chocolate-chip-cookies/",
                    "name": "Chocolate Chip Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/178151/felix-ks-dont-even-try-to-say-these-arent-the-best-youve-ever-eaten-because-they-are-chocolate-chip-cookies/",
        "name": "Felix K.'s 'Don't even try to say these aren't the best you've ever eaten, because they are' Chocolate Chip Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F251031.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2020-06-19T03:37:51.000Z",
        "description": "After years of tweaking my chocolate chip recipe, it is now ready for public consumption. It has been laboratory-tested on many of my friends all of whom seem to think its pretty great, as do I. They certainly aren't healthy, but its well worth the requisite post-cookie eating cardio workout. I hope it works for you as well as it has for me! Enjoy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "24 cookies",
        "recipeIngredient": [
            "3 ½ cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "1 teaspoon salt",
            "1 cup butter, softened",
            "2 cups brown sugar",
            "6 tablespoons white sugar",
            "2 eggs",
            "4 teaspoons vanilla extract",
            "1 (12 ounce) bag chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently mix the flour, baking powder, baking soda, and salt with a fork in a bowl. Beat the butter, brown sugar, and white sugar with an electric mixer in a large bowl until smooth. Add the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg.  Mix in the flour mixture until just incorporated. Fold in the chocolate chips; mixing just enough to evenly combine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough into 24 3-tablespoon-sized balls. Flatten the balls to about 1/4-inch thick onto a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the edges are golden, 15 to 17 minutes. Allow the cookies to cool on the baking sheet until the centers begin to set, about 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Chocolate Chip Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Professor Felix"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3601190476190474,
            "ratingCount": 672,
            "itemReviewed": "Felix K.'s 'Don't even try to say these aren't the best you've ever eaten, because they are' Chocolate Chip Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "267.4 calories",
            "carbohydrateContent": "37.9 g",
            "cholesterolContent": "35.8 mg",
            "fatContent": "12.5 g",
            "fiberContent": "1.3 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "235.3 mg",
            "sugarContent": "22.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-11T16:12:14.827Z",
                "reviewBody": "I decided to give this one a shot, in spite of my skepticism about the amount of flour - it's more than a cup more than my usual recipe, so I was a little nervous. I followed the recipe exactly, including the (also scary, LOL) 300 degree oven temperature. This is a great cookie for all the chewy CC cookie lovers, I think that's the effect of the additional flour - a chewier cookie. The dough is VERY stiff to work with, my KA didn't like it much. Very tasty cookies, and I'll probably make them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShariV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/898784/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-10T18:25:11.527Z",
                "reviewBody": "well.. I think with a title like this one they're going to disappoint.  They are really really good cookies! I like them.  They would be amazing with some ice-cream.  I would have given them a five if the title wasn't so ... final.  I do recommend only putting eight cookies on a sheet, when you flatten them they get much bigger then you might expect.  so to avoid an unfortunate mess just put less cookies on the sheet.   *edit*   I have made these cookies MANY times now.  I think this is officially \"my\" chocolate chip recipe.  I usually use 1/2C margarine and 1/2C shortening, it saves on using up all my butter at one time.  I also don't usually put in all the vanilla it calls for (depending on who I'm cooking them for, my mom hates cookies with a lot of vanilla flavor)  If your using vanilla extract use the full amount, but if your using REAL vanilla, you can half the amount and they still turn out wonderful.   I've also noticed that sometimes I don't always use the last 1/2 C of flour, I add the flour 1/2 a cup at a time and sometimes 3 1/2 cups is too much.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LRoecker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3046761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-29T20:44:01.33Z",
                "reviewBody": "There are SO many great chocolate chip cookie recipes, many of them on this site. I can't remember ever making a \"bad\" chocolate chip cookie. This is no exception, but it is not exception-AL compared to other great recipes. While it may not hold the distinction of being \"the best,\" it nevertheless holds its own with the best of them. Looking over the reviews I noticed these described many ways - cakey, crumbly, chewy, crunchy and more - all are correct. Experienced bakers will know that how cookies turn out, even with the same recipe, will depend on a number of variables such as size, thickness and how long they're baked.  In my case, I prepared the dough as written, but couldn't bring myself to bake them at 300 degrees. I baked them at 350 and they were delightfully crispy on the edges and chewy in the middle, just how I like them. After scooping the cookies onto the sheet I flattened them only slightly and they turned out pleasantly thick and substantial. All and all, I was very pleased with this recipe - and hubs and I were both very pleased with the resulting cookie. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-21T00:20:43.44Z",
                "reviewBody": "This is exactly the recipe I was looking for! The cookies came out chewy, with a crispy outer edge - perfection! Just like another reviewer said, they're like Subway cookies. I like my cookies chewy, and the crispy outer edge is enough so that it doesn't fall apart and doesn't appear underbaked. It is a large cookie - about 1/4 cup dough for each. \n\nNotes:\nThe recipe didn't say if brown sugar was to be tightly packed or lightly packed; I made mine tightly packed. I didn't grease the baking sheet since the recipe didn't call for it, not a problem at all... it actually came out a bit greasy. I left the cookies on the baking sheet for 10 minutes after taking them out of the oven (15 mins baking time), then put them on paper towels to absorb some of the grease. \n\nI can understand how the title can put some people off. It uses a lot of ingredients and I was a bit afraid to make the full recipe but went for it anyway. I'm more than happy I did!!! SINFULLY YUMMY! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "purplegold",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1125239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-01T04:53:28.87Z",
                "reviewBody": "Sorry, but these aren't the best I've ever eaten. \n\nFor my tastes, they're way too big, dry and have too much flour. \n\nThat said, the ingredients list shows 6 tablespoons of white sugar, but it's not called for in the instructions. Maybe the white sugar is not supposed to be there, but I added it with the brown sugar. Maybe that's why mine came out dry and hard.\n\nAlso, when baking at 300 degrees, there was no way these cookies were done in 17 minutes. I kept going until the edges were golden, and the result was that they were just hard lumps. I upped the oven temp and the second batch seemed a little better. \n\nI don't have any incentive to try again, but my recommendation to anyone attempting this recipe is to boost the oven temp to 325 and make sure you flatten the dough balls quite thin.\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Steve G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3342528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T20:20:48.87Z",
                "reviewBody": "The Byrds are a family of stubborn authority-fighters. We hate to be told what we can't say. Still not one of us was able to say these aren't the best we've ever eaten. A couple of us said they were ONE of the best but no one said NOT the best. So there you have it. I've made the reipe several times with great results except for when I doubled the batch. If you double this recipe you probably don't want the full amount of flour so add it slowly. I didn't. The cookies are still fabulous but not as chewy as I would like. My fault. Thanks so much for this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-23T18:31:51.41Z",
                "reviewBody": "I had a hard time believing there was a chocolate chip cookie recipe better than the one I already use. Curiosity got me and I tried them out. Absolutely fabulous! A nice big cookie...great for wrapping individually for a gift. Took a little longer in my oven...more like 18-20 minutes. I'm going to go hide them before the kids come home from school!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sheena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3224312/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-13T19:13:10.793Z",
                "reviewBody": "A great recipe! I have spent years trying out various chocolate chip cookie recipes and this one reminds me of the delicious big ones you can buy at Subway or lots of sandwich shops. They are a bit greasy which is why I took off one star. Otherwise a delicious treat and a nice chewy texture with a crispy outer edge. I made the cookies about 1/2 the original size so you can 2 without quite as much guilt.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Carraux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3203446/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-27T01:40:44.773Z",
                "reviewBody": "These really are amazing cookies! It's silly to rate them lower than 5 because of their name. Be prepared for stiff dough but I still managed even with a hand held mixer. A bag of chocolate chips is approx. 2 cups and I made mine heaping. The cooling time on the sheets is important since it lets the middle of the cookie finish baking through. My kids couldn't believe I gave them a cookie THAT big. The only down side to these is that the dough being stiffer isn't so tasty uncooked. More for the oven then.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Magnificent7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2249662/"
                }
            }
        ]
    }
]