[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/179802/asian-water-roux-white-bread/",
        "name": "Asian Water Roux White Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2411542.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2020-06-19T03:38:02.000Z",
        "description": "Secret to homemade bread that will stay soft for days! If you enjoy the silky, cotton-soft but expensive loaves from Chinese bakeries, then you will love these!  My kids can't rave enough about them. It might be more work than the usual white bread, but trust me, this is so worth it! Water roux works best refrigerated overnight; however, if you don't want to wait, make sure it's room temperature when you add it to the dough! The dough is quite moist to work with. It is easier to do the kneading in a mixer.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT10H50M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "½ cup water",
            "1 tablespoon white sugar",
            "¼ cup butter",
            "1 cup all-purpose flour",
            "2 ½ teaspoons active dry yeast",
            "¾ cup warm water",
            "3 cups all-purpose flour",
            "⅓ cup white sugar",
            "3 tablespoons instant dry milk powder",
            "1 teaspoon salt",
            "1 egg",
            "2 teaspoons melted butter, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make the water roux, bring 1/2 cup of water to a boil in a small saucepan, and stir in 1 tablespoon of sugar and the butter, mixing to dissolve the sugar. Place 1 cup of flour in a heatproof bowl, pour the boiling liquid over the flour, and whisk it well to remove lumps and transform the flour into smooth paste. Cover the bowl with plastic wrap, and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "The next day, bring the water roux to room temperature. In the work bowl of an electric stand mixer, stir the yeast with 3/4 cup of warm water, and let it stand until a creamy layer of foam forms on the surface, 5 to 10 minutes. Add 3 cups of flour, 1/3 cup of sugar, dry milk powder, salt, and egg. Scoop all the water roux by spoonfuls into the mixing bowl, and let the machine knead the dough on low speed to thoroughly combine the ingredients, about 2 minutes. Increase the mixer speed to medium and knead until the dough is soft and smooth, about 8 more minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the dough out into a greased bowl, cover lightly with a cloth, and let rise in a warm place until doubled, about 1 hour. Punch down the dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease 2 8x4 inch loaf pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working on a floured surface, cut the dough in half, and form each half into a loaf shape. Place the dough in the prepared loaf pans, cover lightly with a cloth, and let rise until doubled, about 1 more hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C). Bake the loaves in the preheated oven until the tops are lightly golden brown, 30 to 40 minutes. Remove the bread from the pans, and brush loaves with melted butter while still warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jessica Choi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.75,
            "ratingCount": 36,
            "itemReviewed": "Asian Water Roux White Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "139.3 calories",
            "carbohydrateContent": "23.8 g",
            "cholesterolContent": "16.7 mg",
            "fatContent": "3.2 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "146.1 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-23T22:25:28.337Z",
                "reviewBody": "I was so excited to try this recipe, because I've always struggled with the texture of my yeast breads. I've never tried Chinese bakery bread, but the description sounded excellent to me. It is easy to make, but I found the texture to be very similar to a regular good homemade yeast bread. It also took longer than an hour to rise...possibly because my house is rather chilly :) The finished bread did not rise up real high...I think the pan size is a bit large. Even though I don't think the texture lived up to the description, my family devoured the loaves. I will be experimenting with this recipe, using different flours/yeasts, and will report here with the results! Thanks again for a yummy recipe!\nUpdate: I've tested the recipe twice, using bread flour and a smaller loaf pan both times. The first loaf, I used the fresh, warm roux, no refrigerating overnight. The second loaf, I chilled the roux overnight, and then heated it in the microwave until it was warm.  Both times, the loaves were super soft, tender, fluffy, cottony, silky, mouth-watering good! I actually think, though, that the fresh roux bread rose a little higher. I am not going to bother with the overnight refrigeration next time. So,to get the ultimate soft bread, just make this recipe with bread flour instead of all-purpose, use a smaller loaf pan than called for, use fresh, warm roux, and your family will thank you! 5 stars for this delicious bread!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "larkspur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3097894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-28T14:15:00.663Z",
                "reviewBody": "Jan 28 10. I tried a new way. Substituted 1.5 cups Whole wheat flour for 1.5 cups of the white flour. Used 1/4 cup dark molasses plus 1/6 cup white sugar for the sugar. Followed remainder of recipe.. Wonderful!. Absolutely Wonderful! I make it twice a week. Soft moist wonderful flavor. Crust is soft. Please note that the recipe calls for \"Active Dry Yeast\" This yeast is the one which requires 2 rise. Rapid Dry yeast is a different item. Be sure the yeast is fresh. Use Gold Medal or Pillsbury flour for best flavor. This is such an easy recipe to make. I do knead it with the mixer and dough hook for the 8 minutes. ( Dough is moist.) I don't bother putting the dough on a floured surface prior to placing in bowl to rise; I just dump it in the greased bowl let it rise. Punch down and place it in the greased pan or pans. I find it makes one 5x8 loaf or two smaller loaves. Either way - - very good. The roux can also be held for even a week in the frig and is good. If one needs to bake fresh the next day the second rise can be placed in the refrig over night. It is called \"slow rise.\" Take out of refrig - set on counter while oven preheats. Wonderful. Cooking time ranges from 25 minutes to 30 minutes. If kitchen temperature is below 70 time for dough to rise will be longer. I also put more humidity in the air by simmering a pan of water on the stove. I do use a digital thermometer. Temp cook to 190 works well. I am so thankful for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ladypeach",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3202264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-17T21:00:31.937Z",
                "reviewBody": "I couldn't see how only 1/2 cup of water was called for to make the roux? It resulted in a really stiff dough and was not enough liquid to incorporate 1 cup of flour. I ended up having to boil and add another 1/4 to 1/3 extra water. I used just one packet of rapid rise yeast which is equivalent to 2 1/4 tsp. and it doubled in size within 1 hr. to 1 hr. and 15 minutes. Though it has doubled in bulk this dough is really soft and doing the indentation test to check that the dough has risen enough is impossible. That is the stage I am at now and am getting ready to punch it down and form my loaf for (1) 9\"x5\" pan. Will update with my results. Results: Per comments I opted to do just one 9\"x5\" loaf but I think I easily could have made 2 of the 8\"x4\" loaves (edit: was perfect for 2-5'x9's) though as this in one BIG loaf of bread!! (I used less yeast at 2 1/4 tsp but since I used rapid rise that may account for the large \"top\". Only other change I made was to add the extra boiling water to the roux and I used it fresh. Other than that this was an easy and wonderful bread to make!! The first thing tomorrow morning I will be making more! Thanks! edit I googled for information regarding the \"water roux\" for bread making and from what I could find the flour should be 1 part to 5 parts water! I thought this roux was awfully thick! I had only uped my water from 1/2 c to just shy of 1 full cup but it still came out good. Will try the suggestion of 1:5.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VeraWa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2826060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T02:45:49.51Z",
                "reviewBody": "Took forever to rise and my kitchen was plenty warm. I even tried to speed up the rising by setting the dough in a warm/turned-off oven. Obviously there wasn't enough yeast for the amount of flour so next time I will add another 1/2 teaspoon or so. The end result is a dense moist bread but a little too sweet forsandwiches. Would taste fine as a dessert bread. I baked in one 9x5 loaf pan and it was perfect. Dividing this into two loaves would definitely create loaves too small. I also used fresh roux without the overnight and it turned out fine. Unlike a real bread sponge letting this sit overnight doesn't make a difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-10T15:12:07.64Z",
                "reviewBody": "This is really delicious bread! I'd never made bread that involved a roux nor have I ever had bread from an Asian market/bakery so I was intrigued to see what it was all about. After reading the other reviews I also used more water in my roux starting with the 1/2 cup and adding more until I had the right consistency (I ended up using almost 1 cup total). My roux had the consistency of a thick milkshake. I let the roux cool to room temp and proceeded skipping the overnight part. Other modifications: I used 1 T of yeast; and since I did not have the milk powder I used 1/4 cup of 2% milk and decreased my water to 1/2 cup. Using a mixer is a must with this recipe as the dough is very sticky and not stiff enough to handled. I used a hand mixer w/dough hooks for about 8 minutes. As it mixed it developed into a good dough though at first I was unsure if it was going to turn out. Even when done being kneaded it still wasn't as easily handled as other doughs I've worked with (softer moister than a lot of doughs and will slip through your fingers) but I guess that's just how it is b/c this dough made an excellent loaf of bread despite it's differences. I made one tall fluffy 9x5 loaf instead of 2 and it baked for about 25 minutes. I also laid a piece of foil across the top for the last 10 minutes to keep it from over-browning. The bread was very soft & moist had a finer texture than other breads I've made soft crust & was slightly sweet. DELICIOUS.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie-Cat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7772758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-19T21:22:31.423Z",
                "reviewBody": "I've made this bread three times so far and am quite pleased with the results but I disagree that this makes the soft loaves that you get at Asian bakeries. All three of my attempts have produced tasty but still somewhat dense loaves. It is soft but not the cottony crumb that Asian breads tend to have. I love the starter and it is a pleasure to work with. I also agree with other reviews that 1/2 cup water isn't quite enough. To get it to a workable paste I needed closer to 3/4 cup. I don't let it sit overnight but I do let it cool to room temperature and use it within a few hours. It makes such a beautiful workable dough! I make this in my stand mixer and it have never found that I need to add more flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1481176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-22T22:35:20.193Z",
                "reviewBody": "The recipe gave a great starting point. If you feel like baking this immediately you can start the roux/sponge by boiling water in microwave for a few minutes while creaming the sugar and butter. then mix boiled water creamed butter mixture and (make sure you use twice sifted flour) flour; hand mix it at a gentle speed to remove lumps or use hand blender to smooth. Cool to room temperature or tepid warm Should take 20-30 minutes. While cooling the starter mix twice sifted flour sugar dry milk powder. Beat the egg. Take a big bowl and a cloth that can cover the bowl. Run both in hot water or soak it in very hot water. Activate the dry yeast with warm water after 8-10 minutes. Wring out water from the damp warm cloth and dry/wipe excess water from the bowl. Once roux is cooled yeast is activated egg beaten and dry mixture mixed continue by combining all ingredients except salt and butter. gently knead and fold all ingredients for 4-7 minutes or use bread machine by combining the ingredients for 8 minutes. Take your warm big bowl grease very lightly and proof your dough for an hour. Cover your dough with warm damp cloth to create humidity. After an hour of proof punch the dough down for brief seconds.Cut the dough in half. Take a rolling pin roll the dough in a thick rectangular shape. roll the the dough into a log or any shape and add filling. lightly grease pans and place both dough.cover both dough with damp warm cloth to proof for 20 minutes. bake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ivy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2408825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-25T16:55:41.02Z",
                "reviewBody": "I made mine in the KA. It produced two smaller loaves. I was pleased with the rise process as well as the texture of the dough however a little discouraged as they didn't bake up as large as expected. I read some other reviews after making the bread and I agree with a few things. My roux was a ball of dough not a paste but I still pulled off lumps and added it to the dough like the paste. Also adding an extra 1/2tsp of yeast is necessary. I have had this kind of bread from the Asian Market and this is very close probably the closest you could get at home. A few of the other reviewers said this wouldn't be an ideal sandwich bread but I disagree the beau loved it with some ham and butter. Will be making this again not as an every day table bread but certainly a good treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/amber/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-26T03:16:16.56Z",
                "reviewBody": "This recipe is definitely a keeper! \n All I had was a small hand mixer so I used that to make the roux the night before.  I refrigerated it over night and brought it out in the morning to warm up.  I made the yeast mixture as per the directions all though I took about a tsp. of the sugar from the dry ingredients and mixed that in with the yeast and water.  Make sure your water is hot enough (around 110 degrees) or your yeast will take a long time to act. \nSince I have a wimpy mixer I added the proofed yeast to the roux and mixed that up.  Then I added the egg and  1/4 cup of milk (since I didn't have any dry milk powder) then the rest of  the dry ingredients slowly until my mixer was about to seize up.  I dumped the remaining dry ingredients on my bread board and turned the semi mixed dough out on top of the dry ingredients and kneaded all of the remaining dry ingredients in to the dough.  It took about 10 minutes and the dough was smooth and elastic.  Covered the dough in a greased bowl with a damp dishtowel, and set the bowl  in a couple of inches of hot water in my sink.  After an hour it had raised to at least double, so I turned it back out on a lightly floured bread board, cut the dough in two and shaped two round loaves which I put on a parchment paper covered baking sheet and covered again with a damp towel.  I let it raise another hour, removed the towel, and baked for 30 minutes.  AWESOME!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roberta",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12270970/"
                }
            }
        ]
    }
]