[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/181278/monkey-bread-muffins/",
        "name": "Monkey Bread Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F963165.jpg",
            "width": 2178,
            "height": 2178
        },
        "datePublished": "2020-06-19T03:38:26.000Z",
        "description": "Easy refrigerated biscuit dough monkey bread cooked in muffin pans. My son who calls these 'monkey sins' loves to be in charge of shaking the biscuit pieces with the spiced sugar. I love that I can make a few of these at a time and eat them warm without waiting for a large enough crowd to justify a tube pan full.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "6 muffins",
        "recipeIngredient": [
            "1 teaspoon apple pie spice",
            "¼ cup white sugar",
            "1 (12 ounce) can refrigerated biscuit dough, separated and cut into six pieces",
            "½ cup brown sugar",
            "3 tablespoons butter",
            "1 teaspoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C). Butter 6 muffin cups or line with paper muffin liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the apple pie spice and white sugar in a small bowl; roll the biscuit pieces in the mixture to coat. Divide the coated pieces between the prepared muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the brown sugar, butter, and water in a small saucepan over medium heat; bring to a boil, stirring continuously. Allow the mixture to boil until the sugar is completely dissolved, 2 to 3 minutes. Spoon the mixture over the biscuit pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden, and the tops spring back when lightly pressed, 8 to 12 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lindsay Deaver"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.661904761904762,
            "ratingCount": 210,
            "itemReviewed": "Monkey Bread Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "312.8 calories",
            "carbohydrateContent": "45 g",
            "cholesterolContent": "15.8 mg",
            "fatContent": "13.5 g",
            "fiberContent": "0.5 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "5.6 g",
            "servingSize": null,
            "sodiumContent": "612.1 mg",
            "sugarContent": "24.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-04-05T19:57:37.69Z",
                "reviewBody": "I loved it, Loved It, Loved It....Yummmy. I did make some changes, to make it low calorie. I used sugar sub (equal and splendar).  I've been looking for a recipe that was quick and easy this one was perfect.  So, Yummy with my coffee Easter moring. I dld make some spice changes.  I used cinnamon instead of apple pie spice and changed the butter to low cal butter sub.  I cut each biscuit in four pieces.  I put six pieces in each muffin cup. And as a Weight Watcher each muffin was only 1 1/2 points.  This was so good it truly reminded me of a \"REAL\" cinnamon roll from the donut shop.    Thanks Lindsay. great idea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tallone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4758463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-01T23:52:46.127Z",
                "reviewBody": "I used the bread dough from the Cloverleaf Rolls, which is also from this site (I don't usually keep whomp biscuits on hand). Because the recipe made twelve \"muffins\", I had to double the rest of the ingredients. This was good, though next time I'll just do what I usually do with monkey bread and dip the ball in butter and roll in the sugar/spice blend. I did make a cream cheese drizzle for the top of these which the boys flipped for. It took a little more time with a homemade bread dough but the outcome was great. The kids especially liked these. NOTE: I used my small cookie scoop for this and made three balls in each muffin tin, just like I did for making Cloverleaf Rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-22T18:30:04.23Z",
                "reviewBody": "I didn't have pie spice in my cupboard so I used cinnamon and nutmeg. I used 7 muffin cups but could have spread it out to 8 or 9. These got rave reviews from my kids and my dad. Super easy to make. These do not last long. Update: Made these again and they fill 9 muffin liners nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shalaine_1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1971650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-14T23:28:36.477Z",
                "reviewBody": "Absolutely Fantastic!! However, I did make a few changes. I only had a mini muffin pan so I used that instead. I cut the biscuits into six pieces and put 3 pieces in each... I was short 12 pieces so I had to cut up 2 more biscuits from another can and I just doubled the spice sugar mixture. I put my pieces into a plastic bowl and put a top on it so all I had to do was shake it around and the pieces were coated. I added a half a teaspoon of vanilla extract to the butter mixture while it was cooking and spooned it on. Took eight minutes to bake and is absolutely wonderful! (I made an account just to write this review! XD)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sequoya D.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4960781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-17T18:49:09.67Z",
                "reviewBody": "These were excellent and super easy to throw together. This recipe makes it easier to serve a small crowd without breaking out the bundt pan. If you're like me and didn't have apple pie spice on hand, you can use the following measurements to arrive at the total of 1 tsp apple pie spice: 1/8 tsp ground ginger, 1/8 tsp ground nutmeg, heaping 1/8 tsp ground allspice and 3/4 tsp ground cinnamon. This recipe will be added to my recipe box for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacy Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2172348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-17T16:29:44.31Z",
                "reviewBody": "My Husband LOVED these. I give this 4 stars instead of five becuase I had to search elsewhere for a recipe for biscuit dough, as I do not purchase premade dough. Heres what I used for my dough-2cups flour, 4 tsp powder, 1 tbsp sugar, 1/2 c butter, and 2/3 c milk. Filled 12 muffins well and had enough to have a few plain biscuits on the side.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "amandanico",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3786900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-18T15:15:34.313Z",
                "reviewBody": "Simple receipe to follow. My son is going to a early morning potluck on Sunday so I wanted to try this out before hand...yes I use my sons a guinea pigs. I read through most of the reviews and used a lot of their suggestions from those reviews. I used the Grands Original (16 oz) which meant I needed to tweak the measurements for the mixture you rolled the pieces in. I also used a ziploc bag to get all the pieces covered completely (one biscuit cut up at a time). I used the apple slicer someone else suggested putting 6 of those covered pieces in each liner. I was sure not to over fill the those liners with the sugar mixture by using a spoon to drizzle it on and making sure all the pieces were covered somewhat (because one review said it all pooled at the bottom). I reduced my temp to 350 degrees as someone else suggested and ended up extending the time by 2 min increments (total of 16 mins) until they were done on top and sprung back as the recipe calls for. We shared one to make sure they were done all the way through and I must say we all gave them two thumbs up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "babyrn58",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4768083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T17:23:29.23Z",
                "reviewBody": "These are sooo good & sooo easy to make.  Introduce your children to the kitchen.  Let them help you make these.  My grandchildren all want to bake monkey muffins when they come over.  We use Grands muffins.  They are large so we cut them into 8 to 10 pieces. I cut the pieces.  They put them in a covered tupperware bowl. Shake, Shake, Shake.  Then they put them in the muffin tins & I finish them off. They put them in the oven.  I take them out & they are so proud of themselves.  If there are no parents around we make up little gift bags for them to take home for a surprise for Mommy & Daddy.  At Christmas time they wanted to make some for their teachers.  For the apple pie spice mix I use:\n4 tsp cinnamon\n2 tsp nutmeg\nThere is an \"Apple pie spice\" recipe on this site & that one calls for 1 tsp cardamon.  This is a spice which I never have on hand & the recipe tastes just has good w/o it.  Have Fun!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRAYCE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/82626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-25T01:57:54.107Z",
                "reviewBody": "This is so good!! I will say it is best if you use the metal looking muffin papers. They keep the goo in better:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ashley Funke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3814525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:32:36.747Z",
                "reviewBody": "For some reason these did not turn out so well for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "yadikeith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3204453/"
                }
            }
        ]
    }
]