[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/184068/double-crust-stuffed-pizza/",
        "name": "Double Crust Stuffed Pizza",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F389653.jpg",
            "width": 3504,
            "height": 2336
        },
        "datePublished": "2020-06-19T03:38:49.000Z",
        "description": "This is my take on a Chicago style pizza.  Don't be afraid of the sausage patty, it makes the pizza!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ½ teaspoons white sugar",
            "1 cup warm water (100 degrees F/40 degrees C)",
            "1 ½ teaspoons active dry yeast",
            "1 tablespoon olive oil",
            "½ teaspoon salt",
            "2 cups all-purpose flour",
            "1 (8 ounce) can crushed tomatoes",
            "1 tablespoon packed brown sugar",
            "½ teaspoon garlic powder",
            "1 teaspoon olive oil",
            "½ teaspoon salt",
            "3 cups shredded mozzarella cheese, divided",
            "½ pound bulk Italian sausage",
            "1 (4 ounce) package sliced pepperoni",
            "1 (8 ounce) package sliced fresh mushrooms",
            "½ green bell pepper, chopped",
            "½ red bell pepper, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the white sugar and the warm water in a large bowl or in the work bowl of a stand mixer. Sprinkle the yeast over the warm sugar water, and let stand for 5 minutes until the yeast softens and begins to form a creamy foam.  Stir 1 tablespoon olive oil into the yeast mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir 1/2 teaspoon salt into the flour.  Mix half of the flour mixture into the yeast water, and stir until no dry spots remain. Stir in the remaining flour, a 1/2 cup at a time, mixing well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes (or mix with dough hook in stand mixer).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a light cloth, and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the crushed tomatoes, brown sugar, garlic powder, 1 teaspoon olive oil, and salt in small saucepan.  Cover pan, and cook over low heat until tomatoes start to break down, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 450 degrees F (230 degrees C). Deflate the dough and turn it out onto a lightly floured surface. Cut the dough into 2 equal pieces.  Roll one piece into a 12 inch thin circle.  Roll the other half into a thicker, 9 inch circle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the 12 inch dough round into an ungreased 9 inch springform pan.  Sprinkle dough with 1 cup of cheese.  Shape sausage into a 9 inch patty and place in pan on top of the cheese.  Layer pepperoni, mushrooms, green pepper, red pepper, and remaining cheese on top of sausage patty.  Top with the 9 inch dough round and pinch edges to seal.  Cut several 1/2 inch vent holes in the top crust.  Spread sauce evenly on the top crust, leaving a 1/2 inch border at the edges.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake pizza in the preheated oven until the crust is set, the cheese is melted, and the sausage is cooked through, 40 to 45 minutes.  Let hot pizza rest for 15 minutes before cutting into wedges and serving.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "pnutmommy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.666666666666667,
            "ratingCount": 84,
            "itemReviewed": "Double Crust Stuffed Pizza",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "409.6 calories",
            "carbohydrateContent": "32.5 g",
            "cholesterolContent": "53.1 mg",
            "fatContent": "21.1 g",
            "fiberContent": "2.1 g",
            "proteinContent": "22.2 g",
            "saturatedFatContent": "8.6 g",
            "servingSize": null,
            "sodiumContent": "1063.2 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-09T20:54:13.447Z",
                "reviewBody": "I am the one that submitted this recipe, but allrecipes left out an important detail. With the cooking time and temperature being what it is, the crust will tend to overbrown. I cover the edges with aluminum foil about halfway through to avoid this. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pnutmommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2501451/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-03T22:11:12.55Z",
                "reviewBody": "Its not often that I am compelled to review something but this recipe is incredible!  I've made it once a week for 4 weeks now.  The only thing I do different is make it in a 9X13 and double the sauce, everything else is done as is.  I strongly recommend using a stand mixer with a hook to knead the dough, the smoother it is, the easier it will be to roll out.  I always end up adding an additional 1/2 C to 1 C of four, just until it pulls together into a ball and adding an additional teaspoon of salt.  For the sausage patty, which is a MUST (don't brown and crumble, for authentic Chicago style pizza, you must use the patty) I fold a sheet of foil into a template the size of my pan, spray with cooking spray, spread out sausage to the edges, invert over pan and peel back.  No mess, no fuss.  Also, I use a long sheet of foil folded into a strip to crimp around the top of the pan to protect the crust from browning to much, it works very well.  It's a labor intensive pizza, true.  But this is a $35 dollar pizza at Uno's, I make it once a week for around $8.  Call it \"sweat equity.\"  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MamaMia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/796761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-06T23:47:19.65Z",
                "reviewBody": "Very labor intensive but the results were very good. The dough can be made in the bread machine on dough cycle but I found I needed to add 1/2 c. flour. The crust was great though! The sausage patty added a LOT of grease to the pizza but then the diet conscious probably aren't going to be indulging in deep dish Chicago style pizza; ) Certainly need to cover the edges of the pan in foil so the crust doesn't over-brown. I left the sugar out of the tomato sauce just not a sweet sauce fan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "klbm23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3653403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-08T00:06:53.14Z",
                "reviewBody": "This pizza is AMAZING!! You can fill it with just about anything you want. We used two chicken breasts that we had left over from last night and pepperoni. A few things I did differently: I tripled the sauce recipe. I didn't have crushed tomatoes so I used a large can of petite diced tomatoes and cooked the sauce for about an hour which gave the sauce a great texture. It's a sweet sauce so if you can cut back on the brown sugar if you don't want it as sweet. When layering the middle I layered it as follows: cheese pepperoni chicken cheese sauce (about half of what you make) pepperoni chicken cheese and then topped it off with the crust. Seal the edges and pour the rest of the sauce over the top:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mionephillips",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5202717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-01T17:10:20.297Z",
                "reviewBody": "Can't believe I never got around to reviewing this great recipe! I've made it twice once exactly as written and the second time with my own sauce which for our palates improved things tremendously. The sauce recipe which is slightly sweet and disappointingly bland loses one star. If a nice hearty appropriately spiced tomato sauce is used however the recipe benefits exponentially and it's catapulted into the 5 star stratosphere. Also I added about 1/2 cup of the sauce to the filling ingredients in the middle which increased our enjoyment and tied everything together nicely. It's extremely filling and no one but the heartiest of eaters will be able to consume more than one slice without busting a gut. Because of the fat in the sausage which melds into the crust as it bakes it's not healthy but this is a favorite very occasional guilty pleasure in this house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-30T23:35:13.79Z",
                "reviewBody": "This was really good but next time I'll use a larger pizza dough recipe because I found that half the dough was not quite enough to bring it up the sides of the springform pan. I waited untill half way through the baking to put tomato sauce grated moozerella and parm on top. Looked great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANDREA VETERE CANADA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1389862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-09T17:50:28.46Z",
                "reviewBody": "This recipe is fantastic! I love that this is a great base recipe that can be improvised based on taste and ingredients on hand. I add some dried herbs and garlic salt to the dough while mixing and leave out the sugar in the sauce. I've made it twice in the last week with a variety of cheeses and whatever veggies I have around. The sausage patty is really delicious and cooks so well as kind of a base to an incredible pizza. ALSO-- I have never had a pizza crust bake up so perfectly! It neither gets overdone nor remains too doughy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarahmarie_co",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1542064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:57:33.353Z",
                "reviewBody": "This was wonderful. I can't rate the pizza sauce however I used my own that I had in the freezer. Only difference is I don't use the brown sugar and do add oregano to mine. The filling is fantastic as well as the crust. Cooking time is right on. Will be making again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4016694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-06T20:34:42.69Z",
                "reviewBody": "This is a terrific authentic Chicago stuffed pizza recipe. I moved away from Chicago in 1993 and apart from a couple of visits over the years I'd never found a way to buy or make a good version of my favorite pizza until using this recipe. I even looked into Giordano's mail order service at my most desperate - thanks for saving me that 75!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ed Poole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7147953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-12T23:59:08.333Z",
                "reviewBody": "My family did not like this pizza. For the amount of work that goes into this it is VERY disappointing. I followed the recipe exactly. The crust was good though so I may make a different stuffed pizza sometime in the future with my own fillings instead of this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "KitchenMama88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3562482/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Double Crust Stuffed Pizza",
            "description": "Who doesn’t love stuffed crust?",
            "uploadDate": "2018-07-30T18:02:03.930Z",
            "duration": "PT2M24.021S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff3cb9cb1-84c7-4ec5-bcb9-1cad07b4b4d0%2F9df847af-569c-49ea-a493-294c744c5306%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5813655119001"
        }
    }
]