[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14734/soups-stews-and-chili/soup/vegetable-soup/squash-soup/",
                    "name": "Squash Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 7,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16370/soups-stews-and-chili/soup/vegetable-soup/squash-soup/butternut-squash-soup/",
                    "name": "Butternut Squash Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/185896/roasted-butternut-squash-soup-with-apples-and-bacon/",
        "name": "Roasted Butternut Squash Soup with Apples and Bacon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F769899.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2020-06-19T03:38:54.000Z",
        "description": "I created this soup on Christmas Eve and it was a huge hit. The roasted squash caramelizes giving the soup that extra depth of flavor. This soup has a very creamy consistency but is completely dairy-free except for the optional garnish of sour cream (I did this on purpose due to a guest who is allergic to dairy). It is also extremely healthy. Don't shy away from the curry powder; it gives the soup that extra flavor. Feel free to play around with the amount of carrot, onion or celery, garlic to your taste. This soup can be made the day before and reheated.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "12 cups",
        "recipeIngredient": [
            "1 (3 pound) butternut squash - peeled, seeded, and cubed",
            "1 tablespoon olive oil",
            "salt and ground black pepper to taste",
            "8 strips bacon, chopped",
            "1 large onion, chopped",
            "6 stalks celery, chopped",
            "6 carrots, chopped",
            "1 bay leaf",
            "2 teaspoons curry powder",
            "1 teaspoon dried thyme",
            "salt and ground black pepper to taste",
            "1 Granny Smith apple - peeled, cored, and cubed",
            "4 cloves garlic, minced",
            "1 cup apple cider",
            "1 ½ quarts chicken stock",
            "½ teaspoon ground nutmeg",
            "1 ½ cups sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C). Place squash in a large bowl and drizzle with olive oil; mix to coat; sprinkle with salt and pepper. Spread squash into a single layer on a baking pan. Roast the squash in the preheated oven, turning once, until fork-tender and caramelized; 30 to 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the bacon in a Dutch oven and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to a paper towel-lined plate, reserving the drippings in the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the onion, celery, carrot, bay leaf, curry powder, thyme, and salt and pepper in the Dutch oven; cook in reserved bacon drippings until the carrots and celery are soft. Mix in the apples and cooked squash and cook another 5 minutes. Stir the garlic into the mixture and cook another 1 minute. Pour the apple cider over the mixture; reduce heat to medium-low and bring to a simmer; allow to reduce to about half its original volume. Stir in the chicken stock; simmer over medium-low heat for about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Puree the soup in small batches in a blender, or use an immersion blender. If using a blender, don't fill the blender more than half-way. Always remove the center lid piece of a stand blender when blending hot liquids so the steam can escape. Cover the hole with a dish towel while blending. Stir the nutmeg into the soup. Garnish each bowl with 1 tablespoon of sour cream and some of the bacon pieces to serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Squash Soup Recipes",
            "Butternut Squash Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LEXINOLE29"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.506944444444445,
            "ratingCount": 144,
            "itemReviewed": "Roasted Butternut Squash Soup with Apples and Bacon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "218.6 calories",
            "carbohydrateContent": "29.2 g",
            "cholesterolContent": "19.8 mg",
            "fatContent": "10.4 g",
            "fiberContent": "6.6 g",
            "proteinContent": "5.7 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "947.4 mg",
            "sugarContent": "9.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-19T18:15:37.903Z",
                "reviewBody": "This soup is a little labor-intensive, but completely worth the time and effort.  I didn't follow the directions exactly.  I blended the bacon in with the vegetables, rather than using it just for the drippings and as a garnish.  I added a little olive oil to the pan when sauteeing the celery and carrot.  My partner can't eat onions so I omitted that and I don't miss it.  I added nutmeg to the mix rather than as a garnish.  I didn't strictly follow the timing of cooking the celery, apples, garlic, etc. because I was going to boil it down over several hours.  This thick, creamy, comforting soup has a bouquet of flavors.  The squash, then the bacon, then the apple, then the curry and spices and celery and carrot and garlic bloom on your tongue.  Marvelous and complex.  This soup could sell for $8/bowl in a snazzy restaurant.  It's amazing!  I'm serving it tonight with a garlic/cheddar/mozzarella/parmesan bread and pomegranate juice and some vanilla yogurt drizzled with melted seedless blackberry jam.    ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Oehler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3536194/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-11T23:53:24.66Z",
                "reviewBody": "This was actually quite excellent and well worth the effort. This has a rich blend of flavors that will catch peoples' attention yet is also somehow simple enough that my kids went back for seconds and thirds - something that almost never happens. A few notes: (1) I did not have apple cider onhand so used 3 cups of unsweetened applesauce with a touch of cinnamon instead and it came out great (I'll be curious to see if it's better/worse with cider next time); (2) I doubled the curry and still barely noticed it so would recommend others do the same; (3) if you use microwave steam bags for the squash you can avoid using the oven and can get it cooked in 6 minutes shaving some time off the overall prep time; and (4) definitely blend this... we're a family that likes chunky soups and I read the review suggesting to leave it chunky (I used a potato masher instead of blender) and the result was everyone in the family opting to stick theirs in the blender. This does not make a great chunky soup in my opinion but is restaurant-quality as a blended soup. This was truly excellent and the best thing we've made out of over 20 top-rated recipes from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joe Pontes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3974574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-13T17:09:27.04Z",
                "reviewBody": "I made exactly as the recipe stated.  Way too vinegary for my family.  Other than that I think it has the potential to be a good soup.  If I ever made again I would considerably cut the vinegar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "texasgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2641357/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-12T18:14:00.977Z",
                "reviewBody": "this soup is full of bold delicious flavors. My boyfriend and I both enjoyed it a lot. I used just one quart of chicken broth instead of 1 and a half. I tripled the curry powder as another reviewer suggested. Oh and I poured most of the bacon fat out of the pot before adding the onions and other veggies. The fat from 8 slices of bacon was just too much in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1827308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-22T21:42:20.63Z",
                "reviewBody": "I make butternut squash soup all the time - most of the time without a recipe - but I decided i had to try this and I am thrilled with the results. I did not have bacon - so I just skipped this step and instead sauteed everything in butter and olive oil. (i also didn't have celery) I also went heavy on the curry. We are skipping the sour cream when serving because it's so good - and so healthy - why ruin a good thing. I think if I had used the bacon the sour cream might be needed. We'll see because I'm making this again for sure! Note - someone reviewed this and said it was too vinegary....? Made no sense to me and then I realized they must have used apple cider vinegar instead of apple cider. Made correctly - it isn't vinegary at all. The apple really makes this extra special.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bretany W. Pilko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2504747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T20:02:50.637Z",
                "reviewBody": "I've made this once a week since I found this recipe. We love it! It does take time to make. I also make my own chicken broth and leave all the meat in the soup from the chicken so that take even more time but makes it a meal with meat. And it is SO worth the effort! What I also do different is I use leeks instead of celery I use 3 apples instead of one and never puree it up we love it chucky with the chicken and all the veggies and the sweet chunks of apple. Oh its a favorite my kids will consider a comfort food mom made growing up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thomasandchristin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2925844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-19T18:23:28.09Z",
                "reviewBody": "This soup is excellent the way it is written don't understand why anyone would make all the changes to it and then give it a 4 rating. You really need to roast the squash in the oven to give this soup its full flavor. Bacon sour cream finish are a must.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1984523/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T15:32:43.557Z",
                "reviewBody": "I think they need to increase the prep time.. it is very time consuming to make.. but the results are worth it. I made it exactly as listed and it was awesome. I recommend making a double batch then for all your efforts you'll have some to freeze.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AUSTINS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/austins/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-13T16:29:08.137Z",
                "reviewBody": "This is a delicious soup perfect to enjoy on a cool fall day. The only things I did differently was add two apples a little less carrots and celery and used 3 tablespoons of curry powder. I used two medium size butternut squashes which I cut in half and roasted and then scooped into the soup. The blend of flavors is outstanding. I will definitely be making this again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3079787/"
                }
            }
        ]
    }
]