[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/189015/grandma-georgies-cardamom-rolls/",
        "name": "Grandma Georgie's Cardamom Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F578385.jpg",
            "width": 1200,
            "height": 1200
        },
        "datePublished": "2020-06-19T03:39:02.000Z",
        "description": "They take awhile to make, but these rolls are a family favorite through 4 generations. Gramma Georgie made these for every family get-together for at least 50 years. They're perfect for sandwiches, dinner rolls, or toasted for breakfast. These can rise overnight in the fridge.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H5M",
        "recipeYield": "28 rolls",
        "recipeIngredient": [
            "1 cup butter",
            "1 ¾ cups boiling water",
            "1 ½ cups white sugar",
            "1 tablespoon salt",
            "2 teaspoons ground cardamom",
            "3 (.25 ounce) packages active dry yeast",
            "2 eggs, slightly beaten",
            "7 cups all-purpose flour",
            "1 teaspoon vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the butter up into chunks, and place in a large mixing bowl. Pour the boiling water over the butter, and stir in the sugar, salt, and cardamom. Stir the mixture until the butter is melted and the sugar is dissolved, and let it cool down to about 105 degrees F/41 degrees C.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the yeast, eggs, and flour into the butter-sugar mixture to make a runny dough, lightly oil the top of the dough, and cover with a cloth. Let rise in a warm place until doubled in size, about 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly grease a baking sheet, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, and knead until soft and springy, about 12 minutes. Form the dough into golf ball-sized rolls, and place them about 2 inches apart on the prepared baking sheet. Let the rolls rise until double, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Bake the rolls in the preheated oven until the bottoms are browned and the tops are lightly golden, 12 to 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MOLLYSMAMA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.875,
            "ratingCount": 8,
            "itemReviewed": "Grandma Georgie's Cardamom Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "222.5 calories",
            "carbohydrateContent": "35 g",
            "cholesterolContent": "30.7 mg",
            "fatContent": "7.4 g",
            "fiberContent": "1 g",
            "proteinContent": "4 g",
            "saturatedFatContent": "4.4 g",
            "servingSize": null,
            "sodiumContent": "302.3 mg",
            "sugarContent": "10.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-02-04T23:48:07.063Z",
                "reviewBody": "Well as the 1st reviewer I thought I should follow the recipe exactly so I did. Except for using White WW Flour instead of all-purpose (we are a non white flour house!).:) These were excellent - good flavor from the cardamom just sweet enough and very tender. However I do have a problem with the making of the bread. I am going to try this again using more traditional techniques (proofing the yeast kneading before the 1st rise). Reason - it didn't rise AT ALL during the 1st rise.... I mean at all. Now this could be partly because my water mixture was barely at 100 degrees (it cooled really fast!) I like to have mine at 110. So! I will try this again and see how it goes. Def worth trying!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "squarepear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3427490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-24T10:35:42.547Z",
                "reviewBody": "NOTE: This website made changes to the recipe! This dough is best when it rises overnight in the fridge. Due to its high sugar content it rises VERY slowly. Mix 3 cups of flour with the yeast then add the liquid (up to 120 deg. F) and the eggs. Mix to create a runny dough. Then slowly add the rest of the flour and knead 8-10 min. to form a soft sticky dough (I do all this in my KitchenAid.) Then put in fridge overnight - cover top loosely with non-stick foil. Then continue with the rest of the recipe. The formed rolls will take longer than an hour to rise because they were formed from cold dough so be patient. Whew!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLLYSMAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1330299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-20T00:57:48.763Z",
                "reviewBody": "Like the last reviewer my rolls did not rise during the first rising either. Next time I make these I will try them in my breadmaker. But they tasted delicious (cardamom is one of my absolute favorite spices) and I will definitely make them again in the future.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATIETOD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1020410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T21:00:57.45Z",
                "reviewBody": "So this was my first attempt at making home made rolls and I ended up not using as much water as the recipe called for by accident. The rolls still turned out fantastic light and fluffy and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jessicaice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6298028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-23T05:19:22.78Z",
                "reviewBody": "I did not like this recipe. The dough did not raise and the buns browned on the bottom but not the top and some were doughy in the middle. Not like bread because they did not rise. more like a bagel. To be fair I even started over with a new batch in case I had done something wrong. Second batch same as the first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "RW261657",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8182669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-20T23:22:19.613Z",
                "reviewBody": "I really like the taste of these rolls. I love the taste of the cardamon and they are sweet enough to eat plain but you could put jam and butter on it and go to town. And in fact that is what my coworkers did. I have to say though that I'm not pleased with how they rise separately on a cookie sheet. These are more workable as pull apart rolls in my opinion. They rise outward and so when I tried on the cookie sheet I ended up with flat little disks so I reshaped and placed in a pan then let them rise again. Although this made for some funny looking rolls (I don't do consistently sized rolls well) this worked much better. Takes a lot longer to bake though but I liked how they rose better. I couldn't fit all the rolls in the pan so I played around and made five braided rolls placed them together in a bread pan then let rise and baked along with the pan. It turned out really well actually and made for a small but tasty and pretty loaf. I might do that next time again. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-13T22:05:15.577Z",
                "reviewBody": "I was looking for a recipe for Cardamom rolls as I remembered MY grandmother's. This wasn't it. I couldn't really taste the cardamom...guess it needs more. I'm a novice yeast bread maker and this recipe assumed WAY too much knowledge for a new yeast baker. I wasted an entire batch because my butter was too cold and the yeast didn't activate! It also would be nice to have the # of rolls the recipe yields. I'd NEVER attempt to do this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "wkendgolf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15501543/"
                }
            }
        ]
    }
]