[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17533/desserts/fruit-desserts/raspberry-desserts/",
                    "name": "Raspberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/189657/raspberry-fudge-brownies/",
        "name": "Raspberry Fudge Brownies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F356829.jpg",
            "width": 3296,
            "height": 2472
        },
        "datePublished": "2020-06-19T03:39:03.000Z",
        "description": "These moist chocolate brownies are topped with a rich fudge layer and a fluffy raspberry cream cheese frosting. To make them even prettier, I like to garnish them with chocolate curls.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "32 brownies",
        "recipeIngredient": [
            "1 cup white sugar",
            "2 eggs",
            "½ teaspoon vanilla extract",
            "½ cup butter or margarine, melted",
            "½ cup all-purpose flour",
            "⅓ cup unsweetened cocoa powder",
            "¼ teaspoon baking powder",
            "¼ teaspoon salt",
            "½ cup miniature chocolate chips",
            "½ cup evaporated milk",
            "1 egg yolk",
            "4 (1 ounce) squares semisweet baking chocolate, chopped",
            "6 ounces cream cheese, softened",
            "2 tablespoons seedless raspberry jam",
            "1 cup frozen whipped topping, thawed",
            "2 drops red food coloring",
            "16 chocolate curls"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C).  Line an 8 inch square baking pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, beat the sugar, 2 whole eggs, and vanilla until combined. Mix in butter. In another bowl, combine the flour, cocoa powder, baking powder, and salt; stir into butter mixture, mixing just until incorporated.  Fold in the chocolate chips.  Pour the batter into the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until a toothpick inserted in the center comes out with moist crumbs attached, 25 to 30 minutes.  Cool pan on wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk together the evaporated milk and egg yolk in a small saucepan.  Heat over medium low, stirring constantly, until the mixture is very hot and thickens slightly; do not boil.  Place the 4 ounces of chopped semisweet chocolate in a medium bowl, and slowly pour in the hot milk.  Stir until the chocolate is melted and smooth.  Pour the filling over the cooled brownies; refrigerate until firm, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the cream cheese with the raspberry jam in a large bowl until smooth.  Fold in the whipped topping, and add the food coloring if desired.  Top the cooled brownies with the frosting, using a cake comb to create a design.  Cut brownies into 16 squares, then cut each square in half diagonally to form triangles.  Garnish with chocolate curls if desired.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Raspberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "larkspur"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.64,
            "ratingCount": 125,
            "itemReviewed": "Raspberry Fudge Brownies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "134.9 calories",
            "carbohydrateContent": "14.5 g",
            "cholesterolContent": "32.9 mg",
            "fatContent": "8.4 g",
            "fiberContent": "0.8 g",
            "proteinContent": "2 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "68.7 mg",
            "sugarContent": "11.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-09T19:08:35.45Z",
                "reviewBody": "Sinfully rich, over the top delicious, oh so chocolately, and absolutely fabulous! I mean to try to describe these brownies using just one word may be virtually impossible, just as impossible as it is to eat just one of these brownies- yes, they're that good. If you're a self proclaimed chocoholic or have ever been accused of being one this is the brownie for you. They are definitely worth the time it takes to make these. I followed the recipe exactly and kept thinking, \"Will this be enough?\". But, these are so rich that the recipe yield is perfect. I highly recommend using the foil liner in the pan. I used Reynold's non-stick and I also highly recommend rinsing/wiping down your knife between each slice when cutting your brownies. The raspberry is awesome, but I might try using chocolate syrup or even some Bailey's next time to change it up. Another hit right out of the park - Thanks larkspur for another great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T20:54:13.383Z",
                "reviewBody": "I just finished making these and they are delicious! I don't have good luck with chocolate curls, so I melted the chocolate and made chocolate hearts for Valentine's Day. I froze them to harden and set them on the frosting. They look awesome! My recommendation is to remove the brownies to a cutting board for cutting, and be sure to wipe the knife off after each cut. The fudge topping tends to gum up the knife, so this makes cutting easier and the finished result picture perfect!! Thanks for a keeper - I will definitely be making these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-11T16:50:19.357Z",
                "reviewBody": "VERY good!  I did make a few slight changes, but that was only because I was trying to use what I had around the house.  Instead of raspberry jam I used cherry preserves & it turned out very yummy.  Also, I added a little extra vanilla.  The only other adjustment that I made was using milk chocolate chips instead of the mini chocolate chips (again, trying to use what I had around).  Very rich!  Next time I may try adding a bit more preserves/jam to the mix or omit the chocolate chips in order to have a lighter brownie that showcased the fruit flavor a little more. The suggestion for wetting your knife between slices was very useful or else I would have had a mess on my hands. Thank you Larkspur for submitting such a creative & tasty recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADZELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1129071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T21:37:32.89Z",
                "reviewBody": "I just made these & they are VERY delicious dense FABULOUS superb quite likely the-best-I've-ever-made sad-I-made-only-a-half-batch even-sadder-I-already-promised-to-share-this-with-several-people though-glad-they-turned-out-so-credibly-great-that-I'm-proud-to-share (-though-still-disappointed-that-I-HAVE-TO) fabulous (oops! already used that superlative!) fudge brownies with whisp of raspberry flavor!!!! Aaaahhhhhh.....If you're going to halve this recipe (though I think the only circumstance under which you should even think such a thing is if you only have 1 Tblsp. raspberry jam & 1/4 c. heavy cream to whip which happened to be my circumstance!) half a recipe fits perfectly in a 9\"x5.25\" loaf pan & bakes in 25-27 mins. I followed the recipe precisely and these brownies have the dense chocolate texture of a flourless chocolate torte; they aren't 'cakey' which suits my & my family's preference. The tip about wiping the knife in between slices keeps each slice looking picture-perfect. I garnished each triangle with chocolate shavings & a raspberry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T21:37:32.827Z",
                "reviewBody": "Wow! These are some rich decadent and oh so good brownies! The first thing I would like to say about this recipe is although it may seem like a long one you won't believe how quickly it came together. I couldn't get raspberry jam/preserves here so I just subbed strawberry jam instead and I put in a generous helping of food colour to get a deep pink frosting. I generously greased my brownie pan so it slipped out easily when cooled. I then took some wax paper and lined the pan with it and dropped the brownie \"brick\" back into the pan made up the fudge frosting and put it over stuck it in the fridge and when it was time for the cream cheese frosting I just lifted the wax paper with the brownie and \"hardened\" fudge frosting out and I actually piped the cream cheese frosting onto my brownies. Let it rest again in the fridge and finally did the cutting. Definitely need to clean the knife in-between cuts for clean cuts as another reviewer suggested. I kept these in the fridge as soon as they were done and decided to have a slice tonight. The result is a chewy fudgy brownie with a delicious creamy topping and of course that slight hint of strawberry (raspberry) almost cheesecake-like flavour finishing off this heavenly dessert. I got to admit even for my sweet tooth...one little piece does go far! Thanks for sharing your recipe Larkspur!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxanne J.R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-12T00:06:27.543Z",
                "reviewBody": "For the top I did a drizzle of melted Raspberry chocolate like Petit Fours across the tops of the brownies. They are were so pretty. I did as was suggested and rinsed my knife between cuts and they came out with no jagged edges. The Raspberry topping is almost framed by the dark chocolate. But I didn't cut them in triangles. I cut them in 1/4 inch slices 4-inches wide and then layed them on a dessert plate that I had drizzled with the melted Raspberry Chocolate. The dessert plates I used were white with pink ribbons and light and dark pink tiny roses around the outside. The presentation was stunning. Thank you for such a beautiful dessert. This is going in my recipe file under Impressors. Thats where I put my \"Blow your socks off\" recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kitten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kitten/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-23T20:04:39.087Z",
                "reviewBody": "I don't mean to be negative but this is the first 5 star recipe I've tried from this website that WAS NOT a hit. I followed the recipe exactly as written and was very disappointed. Everyone else that tried it agreed not a very good brownie recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "tdalrymple",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2408378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-12T00:55:32.723Z",
                "reviewBody": "Very good and very rich! I used regular choc. chips that's what I had on hand. However I think the miniature ones as stated would be better. I cut some into squares some into triangle...My husband and his friend asked why the triangles and I said that they might be too rich for some. They both shook their heads NO! I sent some home with this friend for his family he said - They won't make it!:) (meaning he would eat them all before he got home) Thanks for the recipe Larkspur!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tracyc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3142475/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-11T22:34:23.77Z",
                "reviewBody": "These are soooo good. I didn't do the chocolate curls because I'm not to good at them so I left them off. I could not decide which part was my favorite the brownie or the topping. I did use about a tablespoon extra of raspberry jam and made my own whipped cream since I didn't have any of the store bought. Cut these bigger than suggested. And I cleaned my knife after each cut as was suggested in another review. Worked great. Thanks for the yummy recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            }
        ]
    }
]