[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/190997/traditional-layered-french-croissants/",
        "name": "Traditional Layered French Croissants",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6553029.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2020-06-19T03:39:08.000Z",
        "description": "Crisp buttery outer layers and a soft, delicate interior make these delectable croissants melt in your mouth.",
        "prepTime": "P0DT2H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P1DT6H45M",
        "recipeYield": "2 dozen croissants",
        "recipeIngredient": [
            "2 tablespoons all-purpose flour",
            "1 ½ cups unsalted butter, at room temperature",
            "4 cups all-purpose flour, divided",
            "½ teaspoon salt",
            "3 tablespoons sugar",
            "2 (.25 ounce) packages active dry yeast",
            "¼ cup lukewarm water",
            "1 cup milk",
            "½ cup heavy cream",
            "1 egg",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle 2 tablespoons of flour over the butter and mix it together with your hands in a mixing bowl or on a work surface. Transfer the butter to a length of foil or parchment paper and pat it into a 6 inch square. Fold up the foil to make a packet and refrigerate until chilled, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 2 cups of the flour with the salt and sugar in a mixing bowl. Dissolve the yeast in the lukewarm water (100 degrees F/38 degrees C) and set aside until frothy, about 10 minutes. Meanwhile, warm the milk and the heavy cream to lukewarm. Add the yeast, milk, and cream to the flour mixture and stir well. The dough will have a batter-like consistency.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the remaining 2 cups of flour 1/4 cup at a time to form a soft dough. It should no longer be sticky. Turn the dough onto a lightly floured work surface and knead until smooth, about 5 minutes. Place the dough in a mixing bowl and cover with plastic wrap. Refrigerate for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To begin the rolling and folding process, both the butter and the dough should be at a cool room temperature. [See Cook's Note.] Place the dough on a floured surface and roll it into a 10-inch square. Set the block of butter diagonally on the square dough. Bring each point of dough to the center of the butter square; the edges of the dough should overlap. Pinch the edges together to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Starting from the center of the square and working outward, use a rolling pin to roll the dough out into a rectangle. The butter should be pliable enough to roll smoothly with the dough; if it's too soft and starts to ooze out the corners, wrap the dough in plastic and refrigerate before proceeding. Roll the dough into a long rectangle, approximately 8 by 18 inches. Fold the length of dough into thirds, like a business letter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "If the dough is still cool, you can continue with another fold. Otherwise, wrap it in plastic and refrigerate for 45 minutes to 1 hour. Remove the dough from the refrigerator and let it warm up for about 10 minutes before you begin rolling it out again.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Position the dough so that the open ends are at 12 and 6 o'clock.  Roll the dough into a rectangle, working from the center of the dough and pressing outwards. Reposition the dough as necessary to fit your work space. You should have a long rectangle for the \"book fold.\" Fold both ends of the dough into the middle; the ends don't have to be touching, but should be close. Fold the already-folded dough in half; it will look like a thick book. Wrap the dough well with plastic and refrigerate for 1 to 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the dough from the refrigerator and let it rest at room temperature for about 20 minutes. Roll the dough into a rectangle again and fold it into thirds, like a business letter. Wrap it in plastic and refrigerate for 4-6 hours or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To shape the croissants, roll the dough into a 10- by 38-inch rectangle on a lightly floured work surface. It should be about 1/4 inch thick. Use a pizza wheel or sharp paring knife to trim the edges of the dough. Divide the rectangle in half so that you have two 5-inch wide strips of dough. Use a clean yardstick to mark each strip into triangles that are 5 inches wide at their bases. Cut the triangles and place them onto parchment-lined baking sheets. Chill for 15 to 20 minutes, if necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Starting at the base of the triangle, roll the dough up into a log; the tip of the triangle should be under the body of the croissant to prevent it from unraveling. Bend in the corners to form the traditional crescent shape. Repeat with the remaining dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the croissants on the parchment-lined baking sheets and allow to rise until doubled in size, about 1 to 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 425 degrees F (220 degrees C). Beat the egg with the tablespoon of water to make the egg wash. Brush the croissants with egg wash and bake in the preheated oven until deep brown, 22 to 25 minutes. Cool on a rack before serving.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "moeagaru"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.394736842105263,
            "ratingCount": 38,
            "itemReviewed": "Traditional Layered French Croissants",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "212.5 calories",
            "carbohydrateContent": "18.8 g",
            "cholesterolContent": "44.9 mg",
            "fatContent": "14 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "8.7 g",
            "servingSize": null,
            "sodiumContent": "139.6 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-01-11T21:47:04.293Z",
                "reviewBody": "I love these. This recipe is also very detailed, so it's easy to follow. One problem was the cooking time. I found it took only 13-15 or so minutes. Not the 22-25 minutes in the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Zan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4432619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T21:26:17.7Z",
                "reviewBody": "Some recipes you need to leave to the bakery down the street.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CPA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/816929/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-20T15:42:05.09Z",
                "reviewBody": "Pay attention to the sizing of the croissants. If they are too small they will be crisp with very few folds inside. Try to keep the final triangles larger than 5 inches at the base.  The folding process is actually much simpler than it sounds. It does not take as many chill-thaw cycles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "art67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2568170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-15T13:04:46.583Z",
                "reviewBody": "Everything in this recipe seems to be spot on...except the bake time.  425 degrees at 22 minutes (minimum time given) is way too long.  I over baked half of my recipe (and work) by following this time.  The second pan I am giving 16 minutes and then watching.  This is not an oven to oven temperature difference...it's a frustrating bake time error in the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "wyunker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7052698/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-30T19:20:03.28Z",
                "reviewBody": "The recipe was easy to follow. The croissants turned out light and fluffy but they greatly lacked flavor. I might try this again but with salted butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "hb1229",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5902818/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-31T21:29:00.85Z",
                "reviewBody": "I followed the very detailed recipe to a \"T\". This author was right on. They turned out perfect and I am so glad. I ALWAYS wanted to make Croissant and now I can say I FINALLY did it! Thanks so much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Barron Rodriguez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10307604/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-23T20:06:14.51Z",
                "reviewBody": "Thanks so much for a great detailed recipe! It was my first attempt at any real pastry and it was a huge success! This isn't difficult at all if you have patience. I spread a little bit of almond paste on some of them before rolling and sprinkled sliced almonds on top after brushing on the egg wash to make my favorite french treat croissant aux amandes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LaBoulangere",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4983266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-17T00:03:36.267Z",
                "reviewBody": "This is very much worth the time and effort. It was a lot of work but the end result was delicious buttery crossaints! I will make it again for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vani",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4310590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-03T18:02:47.53Z",
                "reviewBody": "Have the look and texture of a great croissant. I may have missed something but it needs a little more flavor. I am a novice at baking breads so it may be me and not the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "smithay21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3870923/"
                }
            }
        ]
    }
]