[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/197576/chocolate-chocolate-chip-bacon-cookies/",
        "name": "Chocolate-Chocolate Chip Bacon Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F468541.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:39:28.000Z",
        "description": "The best of both worlds! Sweet, savory, and absolutely delicious.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT0H32M",
        "recipeYield": "3 dozen cookies",
        "recipeIngredient": [
            "6 slices maple-cured bacon, chopped",
            "1 ½ cups white sugar",
            "1 cup softened butter",
            "2 eggs",
            "2 teaspoons vanilla extract",
            "2 cups all-purpose flour",
            "⅔ cup cocoa powder",
            "¾ teaspoon baking soda",
            "¼ teaspoon salt",
            "2 cups semi-sweet chocolate chunks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the sugar, butter, eggs, and vanilla extract with an electric mixer in a large bowl until fluffy and smooth. Stir in flour, cocoa powder, baking soda, and salt. Mix in the chocolate chips and bacon. Drop cookies by rounded spoonfuls onto ungreased cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 to 12 minutes in the preheated oven. Let stand 5 minutes before transferring to wire racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MegPie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.546762589928058,
            "ratingCount": 139,
            "itemReviewed": "Chocolate-Chocolate Chip Bacon Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "167.1 calories",
            "carbohydrateContent": "20.9 g",
            "cholesterolContent": "25.6 mg",
            "fatContent": "9.3 g",
            "fiberContent": "1.3 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "119.4 mg",
            "sugarContent": "14.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-06T21:47:48.883Z",
                "reviewBody": "Please pay attention to all of the 5-star reviews, particularly those who made no changes to the recipe, other than maybe using regular bacon rather than maple (I used regular bacon too) - because they are dead on accurate.  I have to admit I made these today basically as an experiment out of curiosity.  The chocolate-bacon combo has been a hot trend for awhile and I wanted to check it out for myself.  Now I don't know if it's necessarily the bacon in these cookies that makes them so awesome good, but trust me and all the other 5-star reviewers, this is just a fantastic, perfect chocolate-chocolate chip cookie, one of the best I've ever tried as a matter of fact. I had Hubs try one without telling him the \"mystery ingredient\" and while he didn't notice the bacon, he quickly devoured it (eating the whole thing quickly is a VERY good sign of a VERY good cookie).  I tried one myself and what struck me immediately was the lightness of this cookie - a completely different texture and density than others I've tried. I did notice the bacon, but perhaps only because I was looking for it -and the hint of it was nice, and just right.  I wouldn't add any more. If the cookie is good already, what would be the point?  And if I wanted a bacon cracker, or a bacon sandwich, I'd look for another recipe. These are delicious - moist, fudgey but light with just the slightest crispness on the surface.  Trying this  excellent chocolate-chocolate chip cookie today was sheer serendipity.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-13T21:58:59.263Z",
                "reviewBody": "I wanted to try this as close to the recipe as I could. I used half butter half Crisco and I chilled the dough during the kids' quiet time before baking. That was the only change I made. I used my small cookie scoop for uniform cookies and they were done at about ten minutes to the chewy-soft stage that our family likes. My kids and I fell in love with these. Oh em gee you should have heard them go sideways over chocolate-bacon cookies. I recommend you use a quality maple bacon I bought mine at Tacoma Boys and I cooked it on tinfoil to crisp in the oven. This one's a keeper. I'd like to try this cookie dough recipe in Lovestohost's cupcakes! NOTE: I made a second batch today this does work with all butter as long as you chill the dough. These ARE absolutely delicious. Completely addictive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-08T17:08:15.273Z",
                "reviewBody": "These are an excellent cookie! DON'T BE AFRAID OF THE BACON! Trust me. Chocolate & bacon make for a happy marriage...they're like (trying to think of a happy celebrity marriage to use for an example....still thinking.....) LTH & Mr LTH (I gave up). I followed the recipe except I halved it because I didn't have enough bacon for the whole recipe. I also don't care for maple so I used regular bacon. I made teaspoon sized balls (and I didn't flatten them) and they made perfect little bite sized cookies. Be sure to almost OVERcook your bacon so it falls apart when you touch it. Don't be afraid to give these a shot; they're worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-10T22:16:42.97Z",
                "reviewBody": "Absolutely delicious. My mother said they were the best cookies she'd ever eaten. I recommend substituting brown sugar for white for a richer flavor. Make sure to blend the room-temperature butter and sugar FIRST before you add any other ingredients and use a handmixer. Otherwise the butter is nearly impossible to fluff and will just break up and make the batter lumpy. I'd also recommend putting the bacon into a food processor to crumble so that the pieces are a consistent size. There is very little liquid in this recipe (just the eggs and vanilla) so the batter with all the ingredients is going to be extremely thick. I actually destroyed my handmixer trying to mix it (it started smoking and just broke) so I'd recommend only mixing this by working it with your hands or in a sturdy standing mixer. You can make the balls of batter tablespoon-sized for a bigger more moist cookie and don't flatten them! Refrigerate for one hour before baking so the cookies will be thick. I baked for 14 minutes and they were flawless or bake them until the very outer edges have hardened slightly and the rest of the cookie is still very soft. My new favorite cookie of all time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheHotPinkLady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2874405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-28T15:57:47.01Z",
                "reviewBody": "When I saw bacon and chocolate chips together I thought they would turn out nasty. Now they're my new favorite. Combining the best of both worlds meat and chocolate This is simply delicious with a savory twist. The only thing I recommend is to not add 2 cups of chocolate chips- it can overpower the bacon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MichiGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4826143/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-03T18:15:46.46Z",
                "reviewBody": "i won a cookie bake-off with this recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LKCHANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/719630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-30T04:57:14.99Z",
                "reviewBody": "I really want to give this recipe 10 STARS!!!! They are officially my NEW FAVORITE COOKIE!!! I ate so many this evening I have a tummy ache. Who knew these little gems could be so danged good? I followed the recipe exactly and added a sprinkling of kosher salt on top immediately upon taking them out of the oven. They are addicting and I'M ADDICTED. I actually don't know if I should make them again. I may need monitoring or a 12 step progam. Thanks for a wonderful recipe MegPie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candice100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-27T18:13:22.887Z",
                "reviewBody": "I love bacon. I love chocolate chip cookies. I don't think the two are compatible textures. The flavour was okay it was just strange to come across little hard bits of bacon. I used relatively thick bacon cut into small pieces. We'll see how they go over at work tomorrow - I work with all boys. Bacon anything should be a hit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "susie0839",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4128054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T21:03:41.863Z",
                "reviewBody": "I had originally tried the bacon/chocolate combo in a cupcake and after loving that started searching for similar recipes! I made the recipe exactly as is and so far it's delicious! We'll see what my husband thinks when he gets home...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsCrazyPete",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4222143/"
                }
            }
        ]
    }
]