[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15510/bread/yeast-bread/egg/",
                    "name": "Egg",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14742/bread/yeast-bread/egg/challah/",
                    "name": "Challah Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77478/shabbat-challah/",
        "name": "Shabbat Challah",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6705848.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:11:29.000Z",
        "description": "My Shabbat Challah is something out of this world. I made it up on my own, because the ones I tasted, I just didn't like. Try it you will love it!! This can make 6 regular sized loaves, or two large braided loaves.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "6 Challahs",
        "recipeIngredient": [
            "3 tablespoons active dry yeast",
            "4 cups warm water",
            "2 tablespoons salt",
            "½ cup white sugar",
            "1 cup vegetable oil",
            "4 eggs",
            "12 cups all-purpose flour",
            "1 egg",
            "3 tablespoons water",
            "½ teaspoon vanilla sugar, or vanilla extract",
            "¼ cup sesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, sprinkle the yeast over the water. Let stand for about 5 minutes to dissolve the yeast. Stir in the salt, sugar, oil and 4 eggs until well blended. Gradually mix in the flour. When the dough becomes too stiff to stir, turn it out onto a floured surface and knead for 8 to 10 minutes. Place dough underneath the bowl to rise until double. Or, you can place the dough in the bowl, and cover with a towel.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, and divide into 6 or 8 even pieces depending on what shape you want. Remember to take a small piece off and make a blessing (Jewish law). Roll the pieces into ropes. Braid into two loaves, or one really big 6 piece braid - but only if your oven is large enough. Or, you can make the spiral shape challahs out of each rope. Tuck the ends under, and place on a baking sheet to rise until your finger leaves a small dent when you gently poke the bread.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Whisk together the remaining egg, water and vanilla sugar. Brush over the tops of the loaves. Sprinkle sesame seeds over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 35 to 40 minutes in the preheated oven, until the bread is deep golden brown. Wrap the small piece of dough that was blessed in aluminum foil, and burn in the oven as an offering while the other loaves are baking.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Egg",
            "Challah Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "NUNU123182"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.610169491525424,
            "ratingCount": 118,
            "itemReviewed": "Shabbat Challah",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "140.9 calories",
            "carbohydrateContent": "21.2 g",
            "cholesterolContent": "15.5 mg",
            "fatContent": "4.6 g",
            "fiberContent": "0.9 g",
            "proteinContent": "3.4 g",
            "saturatedFatContent": "0.8 g",
            "servingSize": null,
            "sodiumContent": "239.7 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-04T16:30:37.127Z",
                "reviewBody": "This is a fabulous recipe. I tried the other Challah I recipe first because it had more reviews, but then I decided to try this one because of the shorter prep time. This one is definitely moister and more flavorful, which is especially good considering it takes less time. I did add a few swirls of honey and used poppy seeds instead of sesame seeds, but other than that I followed the recipe. This recipe does make A LOT of dough. I ended up with two huge braided loaves (did the 6-braid). Next time I think I'll cut it in thirds to have three more managable loaves. Great recipe; even my in-laws (who grew up with homemade challah) loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sylvia Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1291006/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-16T00:57:01.78Z",
                "reviewBody": "THis is a great recipe, and the idea of vanilla with the glaze on top is cool. As someone experienced with Jewish law, may I please offer a correction, though: Regarding the Challah offering - THis is a praiseworthy custom in place to keep in practice for the actual \"Challah\" portion given to our Cohanim in the Temple of Jerusalem (going back 2,000 years and we still do it). They worked, we fed them. Here are a couple of parameters for nowadays, when the Cohanim are kind of \"unemployed\" in the old sense: THere is a minmum amount of flour needed for this, as follows - about 3 lbs for taking off without a blessing, and about 5 lbs to say a blessing. For the words of this blessing contact Chabad.com This can actually be done for almost any type of dough! To dispose of it, because it is considered unusable and technically not kosher, one cannot burn it where the challh is baking, but where there is nothing being cooked, such as straight over a flame on your burner or under the broiler, later. (Temporarily shut off your smoke alarm!)  Alternatively, some Rabbis allow you to double-wrap the dough (which doesn't have to be a lot; can be as small as a large olive) and then throw it out. Here's my favorite part: THis is one of the 3 Mitzvas specially handed to women, and our power of prayer is very great, so, just as we can pray for our families, ill people, etc at candle lighting time for the Sabbath, we can pray when we are taking the Challah portion. It becomes very spiritual.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cholentgang",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4452915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-13T23:54:19.613Z",
                "reviewBody": "This is an EXCELLENT recipe. I did make a few changes though so I'll list those before I tell you what I liked about this recipe. I cut down the sugar to only two tablespoons for a less sugary challah. I also used only a third cup of vegetable oil and used only 3 eggs but omitted the yolks. My challah was very soft and moist almost velvety on the inside with just a slight crunch on the outside. I made this into one large 6 braid challah and brushed with only egg. Then I dipped my finger in water then into the sesame seeds and gave each segment a roll of sesame for a more even look. Overall this was SUPERB and I have already been asked to make it for a baker friend of mine who wants to feature it in her bakery!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gitana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2955976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-16T16:58:28.32Z",
                "reviewBody": "To be honest I have no idea what it should taste like. However My wife and I spent the morning making this bread and when we tasted it it was wonderful. Dense hearty soft crispy crust. We enjoyed it very much and plan on making it for future gatherings with family and friends. We made the six braid version we found a easy how to video on youtube that made it very easy to braid. We halved the recipe and it made a very large loaf. so consider that before making. Thanks for sharing...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "solar_biscuit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2943636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-05T20:15:58.077Z",
                "reviewBody": "This is a delicious bread! I can't say how it compares to other Challah breads as I have never had any but it is spectacular in it's own right. I saw a show on Food Network that suggested using specialty breads for french toast namely Challah and I decided to try it for a ladies brunch I was hosting. They went raving mad for it!! It has been requested continuely since then some ask for the recipe others just want me to make it for them. I am making a batch today for another brunch tomorrow! This makes the most delicious french toast if you cut it 30 minutes early to let it dry out a little. Soak it for ten minutes a side and after cooking in the skillet it is thick and hearty and tasty! One last thing this bread is especially easy to make which is why I originally chose it. I had never baked bread before and this turned out golden and delicious. It was simple and fun and makes me want to move on to more challenging bread. Thanks NUNU!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HIX2PETEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1328043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-25T22:52:41.773Z",
                "reviewBody": "This is a FANTASTIC challah recipe. Very authentic very moist. A couple of caveats: it is a very LARGE recipe - one batch turned out three challahs each bigger than 2 pounds. I baked up two and tossed the third in the freezer for another time. Also it is not very sweet. It is very comparable to a typical bakery egg challah nice and rich with great texture but next time I'm planning on adding a half cup more sugar or some quantity of honey instead. For those who prefer weight measurements instead of cups I wasn't comfortable with Allrecipes' conversion of cups into grams so I did my own calculation to use 1700g of all-purpose flour in this recipe... with fantastic results. Very sticky dough but with a bit of flour on my hands and the table it braided up nicely and the braids held their shape beautifully.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tzivia Jennifer MacLeod",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4491727/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-14T16:30:58.92Z",
                "reviewBody": "WOW! This recipe is fail proof and fantastic! I have to say that in the middle of making this we ran out of flour and you need 12 cups. SO I ran to the store came back and the yeast was bubbling on the top of the batter and I thought I ruined it but NO! It made it better and the bread fluffed up and cooked beautifully! WOW! This is easy wonderful and makes great Challah French toast! You cannot go wrong with this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "piebear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6233589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-03T15:18:50.277Z",
                "reviewBody": "I used 6 cups whole wheat flour and six cups white flour and the result was still great. I was worried the texture might suffer but it was still dense (but not too dense) moist and delicious. I ended up making 5 challah loaves and 7 challah buns which means I've got enough to last me for a good few weeks! I froze them right after they cooled but next time might try freezing them after they're braided before they rise the second time. That way I can have really fresh challah on demand each shabbos. I also threw in some chocolate chips to a couple loaves/buns and cinnamon sugar into a few others. They all turned out yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Fried430",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3178624/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-16T21:19:41.44Z",
                "reviewBody": "I've never had Challah bread but this one turned out not only beautiful but very tasty and good. The flavour is lightly sweet and the texture is velvety inside soft and light. One thing that I was a little confused by was the rising time. The first rise took 1hr and the 2nd took 40 minutes. I did only 1/4 of the recipe (15 servings) and it turned out into a big loaf so I can't imagine how the big the full recipe turnos out to be. The instructions said 40 minutes but mine was done in 25-28 minutes - probably because it was smaller than intended. Bottomline - the bread was delicious and I will try the full recipe for Easter dinner. Thanks! June/2012 Update!!!! I made half the recipe as described (except for the sesame seeds). This time I let it rise for about 1 hour in the oven with the light on for some heat and it rose beautifully! t was too late that night and decided to form the bread (braid it) and then leave it rising in the fridge overnight. I covered it with saran wrap (loosely) and then placed a wet cloth on top. Bread was looking great in the morning. As an experiment I baked one of the loaves right away at 400 for 30 minutes and it turned out beautiful. The second one I let it sit and come up to room temperature before baking. I did not see a difference but the dough itself on both breads was so elastic and almost velvet like. The flavor was different more yeasty and less sweet. It was delicious and so convenient to have fresh bread for breakfast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DCANT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/500385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-20T20:34:55.957Z",
                "reviewBody": "This came out flat and hard. I halved the recipe. I am glad I didn't make the whole thing. What a waste. I don't know why it got such rave reviews. I like the taste of the ones with honey better anyway. Thanks anyway.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Bake4fun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3003148/"
                }
            }
        ]
    }
]