[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/364/desserts/frozen-desserts/",
                    "name": "Frozen Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1556/desserts/frozen-desserts/ice-cream/",
                    "name": "Ice Cream",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/199701/cake-batter-ice-cream/",
        "name": "Cake Batter Ice Cream",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4500386.jpg",
            "width": 4096,
            "height": 3434
        },
        "datePublished": "2020-06-19T03:39:32.000Z",
        "description": "I was in love with this ice cream from a couple of local stores, and I combined a couple of different recipes and came up with this one.",
        "prepTime": "P0DT0H5M",
        "cookTime": null,
        "totalTime": "P0DT4H5M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup milk",
            "½ cup white sugar",
            "2 egg yolks, beaten",
            "1 teaspoon vanilla extract",
            "2 cups heavy whipping cream",
            "¾ cup white cake mix, sifted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk together milk, sugar, egg yolks, vanilla, cream, and cake mix in a saucepan until well blended. Cook over medium-low heat until mixture reaches 160 degrees F (70 degrees C), stirring frequently. Remove from heat and place in the refrigerator or freezer until liquid is cold.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the chilled mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Transfer ice cream to a one- or two-quart lidded plastic container; cover surface with plastic wrap and seal. For best results, ice cream should ripen in the freezer for at least 2 hours or overnight.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frozen Dessert Recipes",
            "Ice Cream"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ekho"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5608108108108105,
            "ratingCount": 148,
            "itemReviewed": "Cake Batter Ice Cream",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "378.2 calories",
            "carbohydrateContent": "21.1 g",
            "cholesterolContent": "180.2 mg",
            "fatContent": "31.6 g",
            "fiberContent": null,
            "proteinContent": "3.8 g",
            "saturatedFatContent": "19.3 g",
            "servingSize": null,
            "sodiumContent": "49.5 mg",
            "sugarContent": "18.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-05T15:54:15.35Z",
                "reviewBody": "The major ice cream manufacturer's should take note of this recipe, because this is the most true form of cake batter ice cream I have tasted. It is comparable to Cold Stone Creamery's Cake Batter Ice Cream. I added 1 cup of yellow cake mix, which is just a little more than the recipe calls for. I realized after I began making this that the recipe required a ice cream maker, but have no fear, you can make this without one with success! Let your mixture cool in the freezer for 20 minutes and then pour into a large casserole dish or a cake pan. Freeze for 20-30 minute increments and take out in between and beat the ice cream with a hand mixer. I only had to freeze and beat the ice cream 4 times until it was done. I honestly think I will never buy ice cream again. This was easy and you could easily use a chocolate cake mix too. This is not runny at all as some other reviewers said, make sure you use the correct ingredients. For the milk, I used whole milk and make  sure you do not substitute the heavy cream for anything else. This is a CREAMY ice cream, not an icy ice cream. **Update** I have since purchased a Kitchen-Aid Ice Cream Attachment and I use that and it works great. I have used both white cake mix and yellow cake mix and the white cake mix tasted \"off\" so I highly suggest using yellow cake mix for a more authentic taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "House of Aqua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/houseofaqua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-08T23:54:52.473Z",
                "reviewBody": "This ice cream is SO yummy! It was the perfect creaminess! Not too thick! I thought the cake batter taste wasn't too strong, you could maybe add a litte more, but I thought it was good as it. The only difference I did was use vanilla bean paste in place of the vanilla extract. I do that with all my homemade ice cream. This recipe is for sure a keeper that I will make again and again! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISSALU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1183976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-14T18:27:29.89Z",
                "reviewBody": "Unreal. Quite simple for someone like me to make without messing it up. Flavor is just wonderful. I did use REAL vanilla extract, didn't mess around with that imitation stuff. One of my most favorite ice cream flavors ever....and now I can make it at home. Thank you for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T22:25:40.803Z",
                "reviewBody": "YUMMY!!! I can't believe I've forgotten to rate this little gem! My family eats ice cream year round and we LOVE this. We do make it like MySweetCreations recommends and use 1cup of yellow but otherwise follow the recipe! Thanks so much for sharing. This was our first homemade icecream recipe to try out and I'm so glad we did!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kerstin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4005052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-08T01:15:52.83Z",
                "reviewBody": "For once my homemade ice cream turned out great! Very yummy. I used devil's food cake mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TARIYORK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1237011/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-03T04:13:04.81Z",
                "reviewBody": "This was a nice base recipe inspiration but not all that wonderful on its own. I agree with the reviewer who said to use yellow cake mix and more of it -- that's a no-brainer. White cake mix has zero flavor and usually makes an awful tasting cake. I used a DH yellow cake mix. I used organic jumbo sized eggs which I think gave it too much of a custard-y egg-y taste so next time I'll cut back to two eggs or three regular large eggs (the recipe doesn't tell us what size eggs). This recipe has to increase the vanilla to get it anywhere in the ballpark of Cold Stone's cake batter ice cream. I think I probably used two or three TABLESPOONS before I decided it had sufficient vanilla taste. I also doubled the recipe and added two full cups of cake mix. Next time I might get a vanilla bean and scrape the insides into the batter for a stronger more authentic vanilla taste. Last I finely chopped two semi sweet chocolate bars and added them once the ice cream was getting to milkshake consistency. Without the chocolate this would not have been half as good. I will try this again with less egg and maybe more cake mix and more vanilla via fresh beans. This is a good recipe inspiration but needs some help to reach the right to be called even close to cold stone's or any commercial brand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-09T18:59:34.43Z",
                "reviewBody": "I managed to make this ice cream like my \"local creamery\" by trial & error...I don't have an ice cream maker so I put the mixture in a covered glass casserole dish in the freezer whisking every 30 minutes until set up. The first day it was ok...a little soft & not exactly tasting as rich as the \"creamery's.\" We left the rest in the freezer overnight which resulted in a really hard lump. 60 seconds in the microwave resulted in a creamy delicious treat that's a mirror image of what you'd buy at the mall. With my favorite mix-ins I won't be spending 4.95 on the same thing anytime soon. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Burnt Toast",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1989859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-13T16:40:35.097Z",
                "reviewBody": "Delicious & comparable to Cold Stone Creamery's. I used a  yellow cake mix & upped the amount from 3/4 to one cup mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-24T16:27:01.817Z",
                "reviewBody": "great recipe.  I made mine with red velvet cake mix and pieces of red velvet cake it turned out perfect.  I did add 1 cup of milk and 4 egg yolks to make it more custard like.  Also, it is better to add the cake mix and cream after you cook the yolks, sugar, and milk to keep it from being so thick and cooking the cake mix. great idea!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lizzieliz29",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7987301/"
                }
            }
        ]
    }
]