[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/202754/super-bean-pie/",
        "name": "Super Bean Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F951398.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:39:46.000Z",
        "description": "For the legume fanatic, have this for dessert or as a side. A major bean infusion pour into a nutty crust. WARNING: Soak the beans to release any gassy properties.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT10H15M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "2 ½ cups all-purpose flour (spooned and leveled), plus more for rolling and cutting out dough",
            "2 tablespoons white sugar",
            "1 teaspoon salt",
            "1 cup vegetable shortening, chilled",
            "1 ½ cups butter",
            "6 tablespoons ice water",
            "½ cup dried great Northern beans, soaked overnight",
            "½ cup dry garbanzo beans, soaked overnight",
            "½ cup dry navy beans, soaked overnight",
            "½ cup dry black beans, soaked overnight",
            "½ cup dried black-eyed peas, soaked overnight ",
            "½ cup dry mixed lentils, soaked overnight",
            "½ cup dried pinto beans, soaked overnight",
            "½ cup dry kidney beans, soaked overnight",
            "¼ cup olive oil",
            "½ cup prepared hummus",
            "1 teaspoon ground nutmeg",
            "1 teaspoon ground ginger",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground allspice",
            "½ teaspoon cream of tartar",
            "1 tablespoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk together the flour, sugar, and salt in a mixing bowl. Cut in the chilled shortening and butter with a knife or pastry blender until the mixture resembles coarse crumbs. (This can also be done in a food processor: pulse the cold shortening and butter until it's the size of small peas. Turn mixture into a bowl and proceed.) Add the ice water a tablespoon at a time, tossing with a fork, until the flour mixture is moistened. Do not add more water than you need: when you squeeze a handful of the moistened pastry mixture, it should form a ball. Divide the dough in half and shape into balls. Wrap in plastic and refrigerate for at least 1 hour or up to three days. Roll one ball out to fit a 9 inch pie plate. Place bottom crust in pie plate and chill for at least 20 minutes before baking. Roll out top crust and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain the great Northern beans, garbanzo beans, navy beans, black beans, black-eyed peas, lentils, pinto beans, and kidney beans and place in a food processor. Blend beans while slowly drizzling the olive oil into the mixture. Blend in the hummus. Pour the batter into a large mixing bowl and stir in the nutmeg, ginger, cinnamon, allspice, cream of tartar, and vanilla extract. Pour the batter into the pie crust and smooth with a spatula. Place the second pie crust on top. Seal the edges using a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a knife inserted into the center comes out clean, about 45 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TaurusChefNYC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 2,
            "ratingCount": 3,
            "itemReviewed": "Super Bean Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1078 calories",
            "carbohydrateContent": "90.1 g",
            "cholesterolContent": "91.5 mg",
            "fatContent": "70 g",
            "fiberContent": "18.6 g",
            "proteinContent": "25.1 g",
            "saturatedFatContent": "29.8 g",
            "servingSize": null,
            "sodiumContent": "643.7 mg",
            "sugarContent": "6.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-13T23:23:35.683Z",
                "reviewBody": "Very strange.  Pretty dry.  I wonder if the beans were supposed to be cooked after soaking? (its not in the directions)... also, the end result after processing all those beans came to 8 c... way too much for one pie.  I think I'll try to cook the other half of the bean-mush and try again... Back again... cooking the stuff just made it lumpy and more solid, but it seems to be a good hamburger substitute.  The pie is very good cold with lots of ketchup (sorry, chef)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "mpease61",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4295480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-05T20:27:40.577Z",
                "reviewBody": "I did not care for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "erink",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4180911/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-07T13:27:50.54Z",
                "reviewBody": "I was pleasantly surprised by the flavor of this pie. It was a bit bland but other than that the taste was pretty good albeit reminiscent of refried beans with unusual seasonings. The only unpleasant part about the flavor is the hint of vanilla. I should have followed my instincts and left that out. I did cook the bean mixture before pureeing it because uncooked/undercooked beans can be toxic and I didn't want to end up poisoning my family. I'm only giving the recipe three stars because of the blandness fact that the beans really do need to be cooked more thoroughly and also I really think there's something wrong with the measurements for the crust. I've never seen a pie crust where the amount of fat equaled the amount of flour so I reduced the amount of butter (COLD) to 1 cup and chilled the shortening for over an hour. Even so I still ended up with a thin paste rather than a dough. I had to add almost two cups more of flour before I had anything close to a dough. Like the previous reviewer I noticed that the amount of beans were way too much for a single pie. I only pureed about half of the beans and still had enough for an 11-inch pie. I used the rest of the beans to make chili for dinner. While this was a fun experiment I doubt that I'll make it again. It was a lot of work and the end result just wasn't enough to justify it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Keri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3018112/"
                }
            }
        ]
    }
]