[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/202895/whole-wheat-chocolate-banana-bread/",
        "name": "Whole Wheat Chocolate Banana Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F402897.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:39:47.000Z",
        "description": "Satisfy your chocolate cravings with this whole wheat recipe that uses only 1 tablespoon of oil! Enjoy a low fat recipe that still tastes great.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "1 - 9x5 inch loaf",
        "recipeIngredient": [
            "⅓ cup skim milk",
            "1 teaspoon lemon juice",
            "1 ¾ cups whole wheat flour",
            "½ cup unsweetened cocoa powder",
            "2 teaspoons baking powder",
            "½ teaspoon baking soda",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground nutmeg",
            "½ teaspoon salt",
            "2 large eggs",
            "¾ cup white sugar",
            "3 ripe bananas, mashed",
            "1 tablespoon canola oil",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Lightly spray a 9x5 inch loaf pan or 16 muffin cups with cooking spray. Stir the skim milk and lemon juice together in a glass measuring cup; let stand until curdled, about 30 minutes. Whisk together the whole wheat flour, cocoa powder, baking powder, baking soda, cinnamon, nutmeg, and salt; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the eggs and sugar together with an electric mixer until smooth. Mix in the mashed bananas, the milk mixture, canola oil, and vanilla extract. Stir in the flour mixture just until all ingredients are moistened. Pour the batter into the prepared pan or muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour for a loaf, or 30 minutes for muffins. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "omghi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.028169014084507,
            "ratingCount": 71,
            "itemReviewed": "Whole Wheat Chocolate Banana Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "127.5 calories",
            "carbohydrateContent": "26.1 g",
            "cholesterolContent": "23.4 mg",
            "fatContent": "2.3 g",
            "fiberContent": "3.2 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "185.4 mg",
            "sugarContent": "12.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-08-20T20:22:57.983Z",
                "reviewBody": "I made this today and it's really good.  I only changed a few things (some to make it healthier and some that probably took that away).  I added 1/2 tsp of oil and swapped to olive oil (omega 9 - much healthier) because I freeze sometimes and lower oil gets dry.  I also used half the sugar and used brown as there are a few more nutrients there and subbed out the rest with a tsp of stevia extract.  Finally I added 1/4 cup pecans and 1/4 cup chocolate chips into the bread and on top of the loaf I sprinkled 2 tablespoons white sugar (only use of it) and sprinkled a few chocolate chips (not many) for appearance sake mostly.    It turned out wonderfully and will present in a way that my church people (that are not healthy eaters) will like it.  (I've discovered if you want them to eat healthy, put all the sugar on the outside!).  The only thing I will do differently next time is add maybe a little more banana (I used frozen and it was in chunks so I don't think I got the full \"three\" it called for) and possibly a tablespoon of applesauce to keep it moist but it was so good that my daughter kept saying, \"Are you sure it's healthy?\".  I may also lose the nutmeg next time but I'm thrilled with the antioxident power of this bread...all that dark chocolate with little fat and sugar - wow!  Thanks for this recipe and I'm so glad you posted it.  No one will know this is a healthy bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Meghan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1932940/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-07T20:42:45Z",
                "reviewBody": "This bread is really good. Here are some changes that I made to make it even better: Reduced the cocoa powder to 1/4 C., increased the oil to 1/4 C. (to make it more moist,) added 1/2 C. semi-sweet chocolate chips, 1/4 C. of applesauce, and omitted the cinnamon and nutmeg (I felt like two flavors were already plenty.) I quadrupled the recipe and made fifteen mini loaves for gifts. I had my kids try one and they loved it. It was moist, delicious, and not overly sweet, with the added benefit of whole wheat. I bake A LOT, and I'll definitely make this one again! (Note: the above changes I included are for the original, one-loaf recipe.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyndy Jorgensen Perkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2660495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-27T00:38:47.553Z",
                "reviewBody": "I would have liked to give this recipe more stars.  The texture was nice, and the loaf turned out very moist (I had small bananas, so I used four instead of three).  The whole wheat flour works very well in this recipe.  It just seemed that the chocolate and banana were competing with each other instead of complimenting each other.  I think I would prefer to make regular banana bread and add chocolate chunks to it, rather than adding cocoa powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "porkchop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/701730/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-05T11:48:32.347Z",
                "reviewBody": "I made this while waiting for my bread dough to rise. Didn't want to waste that oven heat! I did mush one and a half bananas and cut up the other one and a half. I had a bag of chocolate chips I needed to use so I just threw them in. I had to cover it halfway through with foil so it wouldn't burn. Came out perfectly. EDITED REVIEW: I made these again last night and cut back the flour to 1 1/2 cups and found even cutting back the flour there wasn't near enough liquid for the muffins. Maybe because my bananas were smaller? I added 1/4 cup greek yogurt and it came out perfectly. Very moist. I got 12 muffins out of one recipe and only four remain this morning!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-27T00:22:57.327Z",
                "reviewBody": "I just made this bread and my 8 year old daughter and I can't stop eating it. I only changed up the spices a bit. I like cloves but less nutmeg so I put in 1-1/4 tsp. cinnamon 1/4 tsp cloves and 1/2 tsp nutmeg. I made it in a bundt pan and baked for 30 minutes and it was perfect! Thank you! What a treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Masty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1675051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-28T01:05:32.353Z",
                "reviewBody": "This is an excellent dessert bread! I followed the recipe exactly and loved it! The loaf was dense moist and simply scrumptious. The chocolate and banana were delicious together and you couldn't even taste the whole wheat. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kendra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/246158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-17T20:16:00.15Z",
                "reviewBody": "This recipe yielded twelve beautifully high domed flavorful and moist muffins for me. One thing I did differently than the recipe instructs was to use real buttermilk (1%) rather than the written substitution. I believe there is nothing like the real thing when it comes to buttermilk. It makes a real difference. I would not change another thing though. Each flavor was distinct and all worked well together. Thank you for sharing a delicious healthy and unique twist on a traditional favorite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-16T00:03:48.54Z",
                "reviewBody": "This is a keeper since I am always looking for new ways to use up ripe bananas. They were perfect just the way the recipe is I wouldn't change a thing. Only difference was that I made 12 muffins instead of the 16 that it says. They were done in 25 minutes and were just right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Birdy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3992701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-11T23:47:28.07Z",
                "reviewBody": "I just made this and my 3 year old are eating a muffin. Muffins were completely done after 25 minutes. I would have given it a three because while they are pretty good I am not crazy about them. However my three year old just piped up to say \"I like these black muffins.\" So he bumped it up a star. lol I would try it again and maybe add a little less nutmeg.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1704838/"
                }
            }
        ]
    }
]