[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/202975/potstickers-chinese-dumplings/",
        "name": "Potstickers (Chinese Dumplings)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F692888.jpg",
            "width": 1596,
            "height": 1372
        },
        "datePublished": "2020-06-19T03:39:47.000Z",
        "description": "An authentic potsticker recipe using ground beef and ground shrimp instead of the usual pork filling. You can fill the whole package of gyoza wrappers and have filling left over for next time around.",
        "prepTime": "P0DT0H50M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT1H2M",
        "recipeYield": "50 potstickers",
        "recipeIngredient": [
            "1 pound raw shrimp, peeled and deveined ",
            "4 pounds ground beef",
            "1 tablespoon minced fresh ginger root",
            "1 shallot, minced",
            "1 bunch green onions, chopped",
            "3 leaves napa cabbage, chopped",
            "2 tablespoons soy sauce",
            "1 teaspoon Asian (toasted) sesame oil",
            "salt and white pepper to taste",
            "1 pinch white sugar",
            "1 (10 ounce) package round gyoza/potsticker wrappers",
            "vegetable oil",
            "¼ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the shrimp in the work bowl of a food processor, and process until the shrimp are finely ground. Set aside in a large bowl. Working in batches, process the ground beef to a fine grind, and set aside with the shrimp. Combine the shrimp and ground beef with ginger, shallot, green onions, napa cabbage, soy sauce, sesame oil, salt and pepper, and white sugar, and mix the ingredients until thoroughly combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To fill the pot stickers, place a wrapper on a work surface in front of you, and place a scant teaspoon of filling in the center. With a wet finger, dampen the edges of the wrapper. Fold the dough into a half-moon shape, enclosing the filling, and press and seal to remove extra air and tightly seal the edges together. It's nice to fold several small pleats in the top half of the wrapper for a traditional look before you seal in the filling. Refrigerate the filled wrappers on a parchment-lined baking sheet while you finish filling and sealing the pot stickers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large nonstick skillet with a lid over medium heat. Place pot stickers into the hot oil, flat sides down, without crowding, and let fry until the bottoms are golden brown, 1 to 2 minutes. Turn the dumplings over, and pour the water over them. Cover the pan with a lid and let the dumplings steam until the water has nearly evaporated and the dumplings have begun to fry in oil again, 5 to 7 minutes. Uncover the skillet, and let the pot stickers cook until all the water is evaporated and the wrapper has shrunk down tightly onto the filling, another 2 to 3 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ayeen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4375,
            "ratingCount": 96,
            "itemReviewed": "Potstickers (Chinese Dumplings)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "411.1 calories",
            "carbohydrateContent": "16.1 g",
            "cholesterolContent": "151.5 mg",
            "fatContent": "22.3 g",
            "fiberContent": "1 g",
            "proteinContent": "34.5 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "454.2 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-08-11T20:55:04.83Z",
                "reviewBody": "Awesome, AWESOME recipe! I changed mine a bit, and greatly reduced the quantity (made 4 servings instead of 12... but I still had a bag full of extra filling after making 10 stickers for me and my roommate!). I actually used sausage instead of shrimp and beef, but next time I think I'll use half sausage and half ground chicken (the flavor was VERY strong, which we liked very much, but others may not). I did not add any sesame oil, and added a bit of honey insead of the sugar. Also, I cooked the meat/cabbage mixture in a pan until nearly done, and then stuffed the wrappers. I baked the potstickers at 425 degrees for 7 minutes, turned them over and baked for another 3 minutes. Came out perfectly crispy outside with the piping hot filling juicy on the inside. Delicious!! **also, I added minced garlic, of course!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "piper_says",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5089245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-16T18:35:48.2Z",
                "reviewBody": "Great recipe. I did mine without the shrimp (didn't have any) and added orange zest for an incredible flavor. I used my bamboo steamers and skipped the frying stage to save time and calories. If you put the pot stickers on lettuce leaves in the steamer, they won't stick. Serve them with a dipping sauce of soy sauce, rice wine vinegar and white suger.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Claire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1751405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-13T02:36:43.79Z",
                "reviewBody": "I handed out this recipe to all of my colleagues.  amazing flavor and texture but, for a dumpling novice like myself,  the prep of stuffing the wontons took FOREVER.  I cut the recipe to 1/3 : 1/3 lb shrimp and 1.3 pound ground beef was enough for an entire packet of gyoza wonton skins.... we ate them for days!  after trying to pan fry all these little dumplings and spattering the kitchen with hot oil because my dumplings were kinda wet, I gave up on the frying method.  Instead, baked the filled wontons and then steamed them.  Bake at 275 for 10-15 minutes until slightly dry then steam for 10 minutes. As an experiment, we also steamed then baked... that worked pretty well too.  I would be willing to do it all again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUCSONALI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/566576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-16T22:58:34.73Z",
                "reviewBody": "It's great to see a non-pork recipe for pot stickers! These were ok but I probably won't make them again because the middle became a hard ball regardless of whether we steamed the pot stickers (if steaming lay down a bed of napa cabbage leaves so that they don't stick to the basket) or cooked them in a pan as instructed. We used lean beef and think that may have been the problem. We did love the smell however as we were grinding all of the ingredients in the food processor. It smelled exactly like our favorite Chinese restaurant. A few tips: when sealing the mixture in the gyoza wrapper make sure you squeeze as much air out as possible before sealing. The times we didn't remove all of the air our pot stickers puffed up while cooking. This recipe makes a lot of pot stickers (4 pounds of beef worth) so watch out for that. We ended up using three entire packages of gyoza wrappers and each package was around two inches high. Also when freezing these pot stickers you'll need to freeze each dumpling separately before putting all of the dumplings together in a freezer safe bag. This might be common sense to some but we just threw all of them in a bag together to freeze and they were a pain to thaw separate and refreeze when we wanted to eat them. I'm not sure which sauce is supposed to accompany these pot stickers but we made a very simple sauce from lime juice orange juice and soy sauce (a tad bit more orange than lime but enough soy sauce to make it taste good).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Aevida",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2986909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T21:04:52.017Z",
                "reviewBody": "GREAT RECIPE! I used ground pork instead of the shrimp/ground beef. They tasted just like restaurant made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "needs garlic!!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2501520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-01T22:13:03.15Z",
                "reviewBody": "Yummy! I cut the recipe in half and had plenty of leftovers to freeze for later use. A few minor modifications I made for a healthier version: baked at 425F for 10 minutes instead of frying; substituted ground turkey for the ground beef. I will definitely make these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Traci",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2934938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-01T18:57:32.567Z",
                "reviewBody": "These were OK, but still prefer the pork & ginger version...and before I made these I cut WAY back on the shrimp and beef!  I make my own dipping sauce: 1/3 C soy sauce, 1/3 cup rice wine vinegar, (or Mirin if you like a sweeter sauce) 1 teaspoon sesame oil, 1/3 C sliced green onions, & 1 Tbls of Sambal. (An Asian condiment found in Asian or some grocery stores.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "joeyblue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6540567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-13T00:55:57.317Z",
                "reviewBody": "These pot stickers are wonderfully tasty. I did use ground turkey instead of the beef but they still turned out fantastic. You can do up a batch and freeze them for nights you have guests over they're a wonderful hor d'oeuvre too. I use my beef to make my samosas so there will be a variety. Thank you for sharing Ayeen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KokoChanel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3274913/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-07T00:49:56.42Z",
                "reviewBody": "This is a great starting recipe. I use thin wonton wrappers (square) maybe a touch smaller. I also steam them in a bamboo steamer set in a wok spray bamboo with non stick spray and steam for 6 to 8 depending on amount or stacked levels of bamboo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mvshark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7030859/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Pot Stickers (Chinese Dumplings)",
            "description": "See how to make ground beef and shrimp-filled Chinese dumplings.",
            "uploadDate": "2013-12-17T16:48:22.217Z",
            "duration": "PT3M55.485S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F253158e6-f0ee-425d-bb1c-a1c598e9d913%2F994f9afc-f7d9-44b7-b9b0-51534dfca55e%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2943014099001"
        }
    }
]