[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/77/drinks/",
                    "name": "Drink Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17106/drinks/juice/",
                    "name": "Juice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/211772/homemade-apple-cider/",
        "name": "Homemade Apple Cider",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1113438.jpg",
            "width": 2000,
            "height": 2585
        },
        "datePublished": "2020-06-19T03:40:49.000Z",
        "description": "Homemade apple cider.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT3H20M",
        "totalTime": "P0DT7H35M",
        "recipeYield": "1 gallon cider",
        "recipeIngredient": [
            "10 apples, quartered",
            "¾ cup white sugar",
            "1 tablespoon ground cinnamon",
            "1 tablespoon ground allspice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place apples in a large stockpot and add enough water cover by at least 2 inches. Stir in sugar, cinnamon, and allspice. Bring to a boil. Boil, uncovered, for 1 hour. Cover pot, reduce heat, and simmer for 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain apple mixture though a fine mesh sieve.  Discard solids. Drain cider again though a cheesecloth lined sieve. Refrigerate until cold.\n"
            }
        ],
        "recipeCategory": [
            "Drink Recipes",
            "Juice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "scollins"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.373239436619718,
            "ratingCount": 142,
            "itemReviewed": "Homemade Apple Cider",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "83.2 calories",
            "carbohydrateContent": "21.9 g",
            "cholesterolContent": null,
            "fatContent": "0.2 g",
            "fiberContent": "2.4 g",
            "proteinContent": "0.3 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "1.2 mg",
            "sugarContent": "18.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-03T22:18:19.297Z",
                "reviewBody": "This is an excellent recipe! I used the same recipe, but I used my juicer to juice the apples instead of heating and simmering them on the stove. I highly recommend using a juicer if you have one, it makes this recipe quick and easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "House of Aqua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/houseofaqua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-20T16:21:49.663Z",
                "reviewBody": "I made this today using ten very large apples, cores removed, and following the rest of the proportions.  I reduced the heat on the boil - just barely kept it boiling but not boiling too hard - and did the full hour.  I really didn't lose that much liquid.  My cider wasn't too sweet at all, but we felt it needed a pinch of salt and more spices, so I added those at the end.  After straining, I got 2.5 liters of cider, so definitely not a full gallon.  I followed the advice of a previous reviewer and used the pulpy apples that were left to make the best darn apple butter I've ever had: added 2/3 cup brown sugar, 2/3 cup white sugar, a tsp of salt, ground cloves, nutmeg and more cinnamon and cooked with a lid for three hours and without a lid for another hour and a half.  I used an immersion blender to blend in the apple skins and got four cups yield.  YUM all around - happy with the cider and the apple butter, too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cklee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4667081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-20T16:41:56.49Z",
                "reviewBody": "Try simmering everything in a crock pot and strain it when you get home from work - easy peasy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Opal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2536724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-21T09:59:05.383Z",
                "reviewBody": "I live in China and was missing apple cider so much. I made this recipe at home and was so excited when it was finished but was shocked at how sweet it was. The apple taste was wonderful but there is waaaay too much sugar in this recipe. As my friend said (another foreigner here) it was like drinking liquidized apple pie. My suggestion is to use only a 1/2 cup or less of sugar and it would be perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily Winger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8151154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T02:54:48.23Z",
                "reviewBody": "I just finished making it.  It was simple, but time consuming.  I made it exactly as written.  It is very good.  My picky 12 year old even drank a cup and said she would drink it again.  I will say that something must've went wrong because I only got about a quart of cider when it was all said and done.  I think boiling it for an hour was too much and broke it down too fast and then after that it started evaporating.  I will for sure make it again, but will put less heat on at first and not boil it uncovered that long.  I will make more within the next couple of days and let you know how that goes.-----ok I made it again, I added more water (won't do again) it was ok just watered down, so if I happen to do it again, I will do exactly as stated but will just shorten the boiling time and end up with only a quart of cider, but very yummy...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Racquel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3666827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-01T16:51:12.49Z",
                "reviewBody": "not sure why everyone is saying \"time consumeing\". I cut up the apples, filled the pan with water, put in the sugar and spices and threw it on the woodstove.  was impressed with how simple the whole process was.  I used a v-shaped coffee filter and it took out all the soilds.  this is a simple recipe for those who don't have a press.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mike Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4264102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-09T16:46:27.253Z",
                "reviewBody": "Thank you for having a GENUINE apple cider recipe as apposed to all of the so-called recipes that call for apple cider as an ingredient to \"MAKE\" apple cider. I am applaud that allrecipes has published soo many fraudulent \"recipes\" yet I have a very unique family candy recipe they have yet to to even review (after 4 years!).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cakeatron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cakeatron/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-23T20:35:17.06Z",
                "reviewBody": "This was an exciting new technique and recipe for me. I'm hardly an apple cider aficionado (and had to look up the difference between \"juice\" and \"cider\"), but this tasted really good, and the bottle of store-brand cider in my fridge couldn't compare. I followed the recipe exactly as written. It didn't say what kind of apples to use, but I did a tiny bit of research and decided to mix 5 Cameos and 5 Granny Smiths. I also presumed I didn't need to bother removing the stems, cores or seeds; I just quartered the apples and tossed them into my stockpot. This also marked only the second time I'd ever used cheesecloth. I was a bit careful with the two sieving steps, but overall the recipe is quite easy, even though it stretches out over 3 hours, plus more time to chill. I've already told people about how easy and tasty this is, and I plan to make another batch this coming weekend. Thanks for opening up a new dimension for this intermediate cook, and such a delicious taste too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NMChef1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1200757/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-09T19:08:35.99Z",
                "reviewBody": "Awesome! I made this exactly as written and it was delicious. While I would say make this when you're going to be around the house all day just so you can keep an eye on it it is certainly NOT time consuming. What could be easier than cutting up apples dumping them in a pot with some spices and letting it do its thing? The straining can be a bit messy but it's not too bad. Next time I may add less sugar and cinnamon and more apples just because I like my cider really strong but overall it's wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOEYPOT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1199256/"
                }
            }
        ]
    }
]