[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212390/bread-maker-doughnuts/",
        "name": "Bread Maker Doughnuts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6451347.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2020-06-19T03:40:50.000Z",
        "description": "Light and fluffy doughnuts, made with a yeast dough. I finally found a good doughnut recipe!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "16 doughnuts",
        "recipeIngredient": [
            "½ cup warm milk",
            "½ beaten egg",
            "¼ cup butter",
            "2 cups all-purpose flour",
            "¼ cup white sugar",
            "1 teaspoon salt",
            "1 teaspoon active dry yeast",
            "8 cups vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the milk and egg into the pan of your automatic bread machine, and add the butter, flour, sugar, salt, and yeast in that order, with the yeast on top. Select the dough setting, and start the machine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the dough cycle is finished, remove the dough to a floured work surface, and knead a few times to collapse all the bubbles. Cut the dough into 16 pieces, cover them with a damp cloth, and allow to rest for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stretch each ball out into a disk about 1/4 inch thick, and use a small cutter to cut a hole in the center (I used the top of a salt shaker; a bottle top works good too). Let the doughnuts rise on the floured surface until doubled, 30 to 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently place a few doughnuts at a time into the hot oil, and fry until they float to the top and turn golden brown, about 3 minutes. Flip the doughnuts over, and fry on the other side. Remove from the oil, and drain on paper towels.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "rachel :D"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1,
            "ratingCount": 60,
            "itemReviewed": "Bread Maker Doughnuts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "198.4 calories",
            "carbohydrateContent": "15.5 g",
            "cholesterolContent": "14 mg",
            "fatContent": "14.3 g",
            "fiberContent": "0.5 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "171.5 mg",
            "sugarContent": "3.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-22T18:42:29.167Z",
                "reviewBody": "I just made them and OMG they are sooo good.  Instead of waiting 30-45 min to rise. I placed in a 130 degree oven to let them rise, and then cooked them.  Glaze:  1 cup powder sugar, 1/2 milk and vanilla extract to taste.  Great Recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookin for 4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3795730/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-17T02:06:15.073Z",
                "reviewBody": "So good and really easy!  This was my first time making doughnuts so I was actually shocked that they came out as well as they did.  I did everything exactly as stated in the recipe except the order of the dry ingredients.  I put the sugar and salt in before the flour because that's just how my other breadmaker's recipes have it.  It probably doesn't even make a difference.  Afterwards, I dipped the doughnuts in a glaze I found in a review of another recipe.  It's 1/4 cup milk, 1 teaspoon vanilla extract and 2 cups powdered sugar.  Yummmmm....\nUPDATE-----I just made these for a second time and they were SOOO much better!  Make sure the wet ingredients (butter, milk, egg) are room temp or sligtly warmer.  I placed the egg and the milk (in a cup) in a big bowl of warm/hot water to speed things up. Also, I turned up the temp on the deep fryer.  It seemed the hotter, the better.  Last time the taste was very similar to funnel cakes you get at the fair.  This time they DEFINITELY tasted like doughnuts.  This recipe is a keeper, for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Sullivan Lange",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2208509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-25T21:02:23.807Z",
                "reviewBody": "The first time I made these doughnuts I used plain flour as the recipe called for and put the ingredients in my bread maker in the order that the recipe said but my dough did not rise, so I started over.  The second time I used bread flour and put the salt in the flour because I used bread machine yeast and read on the lable not to let yeast come in contact with salt.  My dough did great the second time.  I also put it in my propane oven with a standing pilot so it would stay warm.  First time making doughnuts and they turned out great.  I used a doughnut glaze that I found on recipezaar.  My family loved these.  Next time I will try using a biscuit cutter and filling the center with jelly.  Good recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2130862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-06T19:25:53.2Z",
                "reviewBody": "*p.s. Wooden chopsticks work great to manuver doughnuts while frying.*",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rachel :D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3778007/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-07T01:03:26.207Z",
                "reviewBody": "Yummy! Simular to crispy and creamy donuts but no rolling pin necesssary it took 2 hours in my bread machine then it went straight to the oil everyone in my family loved them and I have really picky eaters",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ebony",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3617070/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-21T14:43:10.64Z",
                "reviewBody": "Follow your bread machines instructions!  DO NOT PUT THE YEAST ON TOP OF THE SALT!!! Salt and yeast do not like each other, the yeast will never rise....that being said I've made these twice.  The first time following the recipe and they came out tasting good but definately not all light and fluffy.  The second time I followed the order that the bread machine recommends, liquids first then dry ingrediants followed by a small well in the flour for yeast.  They came out super fluffy like at Dunkin Donuts.  Yum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "asianchick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8344196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-26T15:47:45.517Z",
                "reviewBody": "I had tried this as directed a few times. It wouldn't rise though they puffed up nicely when frying still my results weren't doughnut like. I recently saw another doughnut recipe that was very similar ingredient wise. Using advise from there and only a slight change in ingredients I got very good results. First melt the butter combine it with milk sugar and egg make sure this mixture is warm but not to warm. Add this mixture to bread maker mix salt with flour add to maker. Put yeast on top. I ended up adding an extra 1/8-1/4 cup of flour while the dough was kneading as the dough was way to soft other wise. The other recipe was a refrigerator recipe so you may be able to yet away with the soft dough if refrigerating but the extra flour is a must if you are not. I just made a batch last night I doubled the recipe cooked a third of the dough right away and refrigerated the rest and cooked this morning. To refrigerate add a little oil to a glass bowl roll the dough in the oil to coat cover and refrigerate. Last nights doughnuts where good much better then previous efforts with this recipe. this mornings were great. With this mornings I took the extra step of letting an oven heat up a bit then adding a pan of hot water to help hold the temp and letting them rise in there. It may account for the difference in quality between last nights and this mornings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lsmithiii",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7245257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:35:43.107Z",
                "reviewBody": "making these for the first time I'm a newbie at the bread machine as well might be a silly question but do I melt the butter?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vashon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6239723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T17:41:34.75Z",
                "reviewBody": "Okay recipe but leaving the doughnuts in 350 degree oil for 3 minutes insures a burnt product. I found a minute and a half to be just about right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Subvet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4893496/"
                }
            }
        ]
    }
]