[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77874/french-apple-tart-tarte-de-pommes-a-la-normande/",
        "name": "French Apple Tart (Tarte de Pommes a la Normande)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4559217.jpg",
            "width": 1161,
            "height": 960
        },
        "datePublished": "2020-06-19T03:11:34.000Z",
        "description": "My mother used to cook this for us all, usually to go with Sunday dinner.  I was hooked.  Haven't had it in ages and I was wanting to bake something special for a special someone so I asked mum for the recipe.  Tried it out today, and it's just as I remember.  The thing that makes it for me is the frangipane.  Hope you like it as much as me.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ⅓ cups all-purpose flour",
            "1 pinch salt",
            "½ cup butter, softened",
            "1 egg yolk",
            "3 tablespoons cold water, or as needed",
            "½ cup butter, softened",
            "½ cup white sugar",
            "1 egg, beaten",
            "1 egg yolk",
            "1 tablespoon apple brandy",
            "⅔ cup ground almonds",
            "2 tablespoons all-purpose flour",
            "4 medium sweet apples - peeled, cored, halved and thinly sliced",
            "1 teaspoon white sugar for decoration",
            "¼ cup apricot jelly"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together 1 1/3 cups of  flour and salt. Add the butter, 1 egg yolk and water, and stir until the mixture forms large crumbs. If it is too dry to press a handful together, stir in more water. Press the dough into a ball, and wrap in plastic wrap. Flatten slightly, and refrigerate for at least 30 minutes, or until firm. This part can be done up to three days in advance.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the frangipane, cream together the butter and 1/2 cup of sugar in a medium bowl until light and soft. Gradually mix in the egg and the remaining egg yolk one at a time. Stir in the apple brandy. Stir 2 tablespoons of flour into the ground almonds, then mix into the batter. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll the pastry dough out to about a 12 inch circle on a lightly floured surface. Fold loosely into quarters, and center the point in a 10 inch tart or pie pan. Unfold dough, and press into the bottom and up the sides. Prick with a fork all over, and flute the edges. Return pastry to the refrigerator to chill until firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Place a baking sheet inside the oven while it preheats.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon the frangipane into the chilled pastry, and spread into an even layer. Arrange the apple slices in an overlapping spiral pattern. Each slice should have one edge pressed into the frangipane until it touches the pastry base, and then overlap the previous slice. Start at the outside edge, and work towards the center.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the pie plate on top of the baking sheet in the preheated oven. Bake for 15 minutes, or until the filling begins to brown. Reduce the oven temperature to 350 degrees F (175 degrees C). Bake for another 10 minutes, then sprinkle sugar over the top of the tart. Return to the oven for 10 more minutes, or until the sugar caramelizes slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cool the tart on a wire rack. A short time before serving, warm the apricot jelly. Add some  water if necessary to make it a liquid consistency. Brush onto the tart for a nice shine.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Peter Lovering"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.754966887417218,
            "ratingCount": 151,
            "itemReviewed": "French Apple Tart (Tarte de Pommes a la Normande)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "506.8 calories",
            "carbohydrateContent": "50.1 g",
            "cholesterolContent": "135.5 mg",
            "fatContent": "32.3 g",
            "fiberContent": "4 g",
            "proteinContent": "7.3 g",
            "saturatedFatContent": "15.8 g",
            "servingSize": null,
            "sodiumContent": "199.1 mg",
            "sugarContent": "26.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-14T18:05:30.717Z",
                "reviewBody": "This was my first attempt at a tart and I cheated with a pre-bought pastry case from Sainsbury's which was very nice!  The tart was easy to make and I substituted the brandy with vanilla vodka which complements the delicate flavours of the apples and almonds perfectly.  This tart looks very impressive and also tastes lovely so I will definately be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barrygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1556873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-26T14:00:01.64Z",
                "reviewBody": "This was a beautiful addition to my Thanksgiving dinner, and was perfect for those who didn't care for pumpkin pie!  I have made this several times, each time trying to make adjustments to keep it from being so buttery.  Final tweaks to the dough:  1 1/2 cup flour (instead of 1 1/3 cup), 1/4 tsp salt (instead of a pinch), 1/4 cup sugar (if you want it a little sweeter), 1 egg (instead of 1 egg yolk), and NO water.  Refrigerate for at least 1 hour in the plastic wrap.  Tweaks to the frangipane:  add 1/2 tsp. almond extract, and toast the almonds before grinding.  Roll out the pastry dough, fit into the pan, then refrigerate 30 minutes.  Add the frangipane, then the apples (use small apples - makes fitting them in the pan MUCH easier), then refrigerate for 30 minutes.  Bake on the oven rack, not on a baking sheet.  Perfection!  Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-19T19:42:04.73Z",
                "reviewBody": "I have a solution to a lot of bakers who felt that the frangipane (almond filling) was not almondy enough. Toast the almond before grinding them. The flavors of the almonds will reveal themselves. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SANDRINEQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/588496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-04T04:02:50.157Z",
                "reviewBody": "I was very excited to make this tart for a photo project my partner was working on. I chose it based on the reviews I had read here. I'm lucky it came out looking as good as it did because the flavor was just not there. I followed the recipe to the letter aside from cooking an additional 20 minutes. I wish the frangipane had more almond flavor and the crust was less greasy. Its a good start and with a few revisions I think it would be fantastic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Apey!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1926015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-23T20:33:51.413Z",
                "reviewBody": "For those that noted that the tart turned out too greasy, its because the pastry crust was allowed to go to room temperature. As the recipe states, it needs to be chilled - otherwise the fats in the crust sweat a little, making it greasy. I actually let the pastry (in the pie tins) chill in the freezer while I prepare the apples and frangipane. \n\nAs for the frangipane, I substituted the apple brandy with amaretto (Disorono to be specific). It gave it a much more almondy taste (which some reviewers commented was missing) with the special richness that only liquor can give =). Substituting with almond extract, I feel would not be as interesting (though I haven't tried it). As per other reviewers, toasting the almonds before combining in the frangipane is a must! Great recipe - turned out beautiful and was extremely impressive! Love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "knnguyen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6959583/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-11T23:13:09.913Z",
                "reviewBody": "Made this for my daughters french class--and well, lets just say she got an A! This baby comes out beautiful and taste like a trip to Paris!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiecoco",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1552685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-09T23:59:08.483Z",
                "reviewBody": "This tart really looked nice with the apples spiraled together and the browned sugar on top. I didn't have any apple brandy so I omited that and added just a touch of apple juice instead. The almonds and the apples were delicious together and the pastry was nice and flaky. I did have to bake this longer than suggested probably about 15 to 20 minutes longer. My only complaint was that it seemed a little greasy. Other than that a really tasty tart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FRAMBUESA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-18T15:24:02.843Z",
                "reviewBody": "I had a problem with this recipe. Let it be said I am not a good pie/tart baker to begin with though. I used premade pie crust and splenda instad of sugar. Maybe that could have been why but after baking the tart it was VERY VERY greasy. I had to actually drain the tart while it was still warm if I hadnt have done that it would have been ruined! After I drained the tart is was pretty good. Could use more flavor maybe almond liquor or extract?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Leesha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/250353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-08T19:08:55.3Z",
                "reviewBody": "Loved this easy to prepare show stopping gorgeous dessert. I did toast the almonds prior to grinding them in the frangipane. I also didn't happen to have any apple brandy on hand but I did have some Orgeat (almond syrup) to use instead. For the topping I didn't have the apricot jam and instead used orange marmalade mixed with a couple of TBSP of the orgeat to brush on the top. Also used raw sugar to sprinkle on top instead of regular white sugar. This was a huge hit with everyone in my family and guests. Wonderful recipe and easy dough to work with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avon- status quo PRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3326566/"
                }
            }
        ]
    }
]