[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15510/bread/yeast-bread/egg/",
                    "name": "Egg",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212757/pumpkin-brioche/",
        "name": "Pumpkin Brioche",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F306984.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:41:01.000Z",
        "description": "This bread is so good and perfect for the holidays.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT14H30M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "1 pinch white sugar",
            "3 tablespoons warm water",
            "1 cup pumpkin puree",
            "3 ¾ cups unbleached all-purpose flour, divided",
            "½ cup packed light brown sugar",
            "1 teaspoon salt",
            "1 teaspoon ground cinnamon",
            "½ teaspoon ground nutmeg",
            "½ teaspoon ground allspice",
            "4 eggs",
            "1 cup butter, cut into pieces",
            "1 egg yolk",
            "1 tablespoon milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle the yeast and sugar over 3 tablespoons of warm water in a small bowl. The water should be no more than 100 degrees F (40 degrees C). Let stand for 5 minutes until the yeast softens and begins to form a creamy foam. Combine the pumpkin, 1 cup of flour, brown sugar, salt, cinnamon, nutmeg, and allspice in a large bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix yeast mixture into the pumpkin mixture; stir until smooth. Beat in the eggs, one at a time. Stir in 2 cups of flour, mixing well after each addition. Stir in the butter a few pieces at a time, beating until incorporated. Stir in the remaining 3/4 cup of flour, mixing until creamy. Lightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 3 hours. Gently deflate the dough, then cover tightly with plastic wrap. Refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly grease a 9x5-inch loaf pan. Deflate the dough and turn it out onto a lightly floured surface. Use a knife to divide the dough into eight equal pieces-don't tear it. Shape into dough rounds and let rest for 10 minutes. Form the dough into balls, and place each ball into the prepared pan, making two rows of four balls. Whisk the egg yolk and milk together in a small bowl. Brush the top of the dough with the egg wash, then cover the loaf with a damp cloth and let rise until doubled in volume, about 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 20 minutes. Reduce heat to 350 degrees F (175 degrees C) and continue baking until the top is golden brown and the bottom of the loaf sounds hollow when tapped, 10 to 15 minutes.  Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Egg"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "apurpleocean"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2105263157894735,
            "ratingCount": 19,
            "itemReviewed": "Pumpkin Brioche",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "422.2 calories",
            "carbohydrateContent": "49.5 g",
            "cholesterolContent": "143.8 mg",
            "fatContent": "21.5 g",
            "fiberContent": "2.3 g",
            "proteinContent": "8.4 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "456.4 mg",
            "sugarContent": "11.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-09T00:38:08.667Z",
                "reviewBody": "i wanted to just add a note instead of rating my own recipe but it wouldnt let me so i'm giving it 5 stars haha.  i think adding more spice would make it even better. i hope you try it again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "apurpleocean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2772412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-04T23:14:45.053Z",
                "reviewBody": "This bread was so incredible.  I used my breadmachine and layered in ingredients in wet first, dry second order.  Put it on a dough setting.  Once machine was done I floured up my hands and formed it into 2 loaves and let rise again for 20 minutes.  Then baked off as directed.  Turned out so fantastic.  It is very rich and buttery - not for the calorie faint at heart.  I used it on Christmas day for breakfast and my husband has requested it be our new annual tradition. I used it to make into french toast on second day and it was an out of body experience it was so darned good.  Worth every minute you put into it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "romyo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2159553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T16:20:03.383Z",
                "reviewBody": "What a terrific recipe! Brioche is one of my favorite doughs to make it s got an absolutely luxurious texture once all the butter is incorporated. I used this recipe to make pecan sticky buns which were wonderful but I also wanted to taste the plain brioche so I shaped one piece of dough as a brioche à tête. If you re thinking of making this recipe don t expect the bread to taste like a sweet spicy pumpkiny quick bread: the pumpkin flavor is very subtle. It s a perfect rich loaf though for serving with butter and jam or if you re getting fancy for canapés. (I bet it would make absolutely outstanding French toast too). At any rate this is a very wet dough. It firms up after the first rise and then again after refrigeration. I made it into sticky buns by letting it chill for 6 hours. I divided the dough in half rolling each half out and brushing the dough with egg wash sprinkling with about cup sugar mixed with 2 tsp. cinnamon and then a heaping half-cup or so of chopped toasted pecans. I rolled up the logs in parchment and let them chill in the freezer for about 45 minutes before slicing into 2-oz rolls. I arranged the rolls in greased pans filled with a caramel goo topped with more pecans: I think I used 1 cups brown sugar 8 oz. butter and 3 Tbsp golden syrup (dark corn syrup would work too.) I covered the pans with plastic and put them in the fridge overnight letting them rise again at room temp before baking the next morning. It made about 28 rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doughgirl8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doughgirl8/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-09T22:18:57.513Z",
                "reviewBody": "this bread is a very light slightly pumkin flavoured mound of goodness. It is very sticky before you chill it and I forgot about the pan sitting in the oven on the final rise. So it may have risen for 2-3 hours before it was baked. It would be wondrful made up into cinnamon rolls with raisins or pecan rolls. A little time consuming but well worth the effort. I am enjoying some now with cream cheese. I got 9 rolls so I used a 9X13 pan",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "recipes need gluten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3990518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-04T17:32:22.33Z",
                "reviewBody": "This dough was very wet but did end up fine. I really disliked the texture of these warm but once they were cool they were delicious I doubled the cinnamon and used a touch more sugar as I was wanting a sweet bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah-May",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sarah-may/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-05T17:29:19.14Z",
                "reviewBody": "Recipe Group selection of 10/29.  I followed the recipe exactly.  When everything was mixed together I was really concerned because this was a very wet batter, not a dough as I am accustomed to and it didn't get too much firmer with the first rise.  But I proceeded as directed and refrigerated the dough actually for almost 24 hours.  Chilling had firmed it up considerably, but it was still sticky.  I divided into 8 and formed balls, but there was no way all 8 would fit in my 9 x 5 pan so I put the 6 that fit in there and the other two went into a small foil loaf pan.  I baked the small pan for a total of 20 minutes and the large pan for 30, reducing the temperature as instructed.  The result is the most delightful, light, moist, delicately flavored treat.  The spicing is perfect and the pumpkin flavor is subtle.  These little beauties are expensive and time consuming, but oh so worth it!  Thanks for a new holiday treat, purpleocean.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-10T01:00:43.507Z",
                "reviewBody": "I made this for the Recipe Buzz Group Recipe for the week of 11/1. This dough gave me a bit of trouble but it did eventually firm up in the refrigerator. I fit all 8 balls into a 9x5 but I had to really squeeze them. My main issues are 2: #1 The center of the dough was not done after the first baking. I cut it and the first slice was ok the next slice had a doughy unbaked section and I could see further in that the situation was worse so I have it back in the oven now. My rating for flavor is based on the 1st slice so my issue #2 is that I don't like the taste of this. The problem might be the allspice or the lack of sugar or a combination thereof. My husband likes this just fine so overall I'm going to give it a 4 and try it again later after it cools as Sarah-May said she liked the texture better then so maybe. This is our first time making OR eating brioche and that is also probably a huge factor here. This bread loaf bakes up to a beautiful professional appearance. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JARRIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jarrie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-09T00:36:44.75Z",
                "reviewBody": "I have never made a brioche before that said I'm not sure how badly I screwed this up. So I'm extrapolating. I neglected to let the dough rise the last 40 minutes in the pan. Entirely my fault. The flavor however was very mild. I was very nervous about how wet the dough was but after refrigeration it set right up! I would increase the spices and possibly use 2 pans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Katy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2041465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-22T22:37:45.593Z",
                "reviewBody": "This recipe did not work for me at all. I usually use the pumpkin brioche recipe from \"Healthy Bread in Five Minutes a Day \" but since it was going to be used for Xmas gifts I didn't want to make them whole grain. This acts as a batter bread...but it just does not set up. In fact I used some of the dough to make croissants and they basically melted in the oven. the flavor was good (in the bit that was edible but I won't be using this recipe again:( I am an avid bread maker (and have made brioche a few times specifically ) but I just couldn't make this recipe work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "jen8940",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3717828/"
                }
            }
        ]
    }
]