[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/846/desserts/cookies/filled-cookies/",
                    "name": "Filled Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212858/easy-fruit-filled-pastry-heart-cookies/",
        "name": "Easy Fruit-Filled Pastry Heart Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4471127.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "2020-06-19T03:41:07.000Z",
        "description": "These EASY cookies are flaky, tender, and just delicious, whether glazed or sprinkled with sugar. If you roll it out in half batches and keep the dough cold, you will be rewarded with what has turned out to be one of my family's favorite cookies! Sprinkle with regular or coarse pastry sugar.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT3H10M",
        "recipeYield": "18 filled cookies",
        "recipeIngredient": [
            "1 cup all-purpose flour",
            "½ cup cold butter",
            "½ (8 ounce) package cold cream cheese",
            "⅛ teaspoon salt",
            "1 beaten egg",
            "6 tablespoons apricot preserves",
            "2 tablespoons white sugar, for sprinkling"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C). Spray baking sheets with cooking spray, or line with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the flour, butter, cream cheese, and salt in a bowl. Cut it together with 2 knives or a pastry cutter until the butter and cream cheese is the size of small peas. Shape the dough into a ball, wrap with plastic wrap, and refrigerate for at least 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the dough in half and place half in the refrigerator to stay cold. Roll the other half between 2 pieces of wax paper or parchment into a sheet about 1/8 inch thick. Lift off the top sheet, and use a heart-shaped cookie cutter to cut 18 cookies. Before lifting the cutouts from the wax paper, put the dough onto a flat baking sheet and into the freezer for a few minutes to firm up the cookies. Set the 18 cookies aside. Repeat with the other half of the dough, also making 18 heart-shaped cookies.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 18 cookies onto the prepared baking sheets so they don't touch. Carefully brush a little beaten egg around the top of each cookie, and spoon about 1 teaspoon of preserves into the center of the cookie. Top each with another unfilled cookie, press together around the edges, and crimp the edges with a fork to seal in the filling and make a pretty edge. Brush the tops of the filled cookies with beaten egg, and sprinkle with sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cookies are a light golden brown, 10 to 12 minutes. Cool completely before placing in containers.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Filled Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ellen Bancroft Ziegler"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.4,
            "ratingCount": 5,
            "itemReviewed": "Easy Fruit-Filled Pastry Heart Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "117.7 calories",
            "carbohydrateContent": "11.2 g",
            "cholesterolContent": "30.7 mg",
            "fatContent": "7.6 g",
            "fiberContent": "0.2 g",
            "proteinContent": "1.6 g",
            "saturatedFatContent": "4.7 g",
            "servingSize": null,
            "sodiumContent": "77.6 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-21T15:40:07.563Z",
                "reviewBody": "Can't wait to try this recipe but I'm gonna substitute date paste for the apricot filling. Sounds very similar to a recipe my high school Home Ec. teacher used to make for Christmas. I lost my copy and have been searching for AGES! I'm so excited to find this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4339607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-06T00:12:59.547Z",
                "reviewBody": "These could not be more awful or time consuming to make. really dry at first glance and when baked oozed grease and completely tasteless. sorry i made these",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4109463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-30T22:15:24.817Z",
                "reviewBody": "I made this wonderful cookie for Christmas Eve dinner... I only wished I had more... Santa ate 4 of them and from the looks of it he was searching for more! I was looking for a recipe that did not require me to run to the store for MORE ingredients. Luckily I found this - the only thing was I had only STRAWBERRY Preserves... which ended up being PERFECT! My husband and Santa have put in a request for guava paste next time... They were perfect and I chose to use my cookie cutters so we had stars candy canes snowflakes and tree shaped cookies and it was just perfect... GREAT recipe! (oh and since I didn't have a rolling pin - I used a wine bottle) - SO ANYONE can make this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-19T20:31:16.507Z",
                "reviewBody": "This was not an easy recipe to make. I had calculator figure ingredients for 24 cookies. Had trouble figuring how many TBSP of butter equaled 2/3 cup. Finally settled on 12 TBSP. Measurement for cream cheese was a bit confusing. In original recipe of 18 cookies ellenz used \"1/2 (8 oz) pkg. Twenty-four cookies called for 2/3 (8 oz) pkg. I used 10 oz which may have been more than called for. Had a lot of cream cheese and butter with 1-1/3 cups flour. Took a long time to work into pea size. Rolling dough was a good exercise workout trust me. Was going to use 2-1/2 inch wide heart cutout but knew there would not be enough 1/8 inch thick dough so settled on 2 inch wide. Near impossible to put 1 tsp preserves on cookie so ended up using about 1/4 tsp. Dough was so small sealing cookie with fork almost destroyed heart-shapes. After brushing with beaten egg I sprinkled 17 cookies with brown sugar/sugar mixture. Baked light brown after 13 minutes. Watching a video to make this recipe would be a deciding factor to try making these again. Without it I will chalk this experience up as a challenge that didn't work. Sorry I couldn't rate this with a higher score.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "The King's kid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2918241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-12T04:05:06.163Z",
                "reviewBody": "I made these for the Allrecipes Allstars Canada Challenge #allweneedislove This dough or a variaiton of it is very common in European baking whether it be for Rugelachs or Kolaches so I am familiar with how soft it is and how it cannot be manhandled or it will end up tough. I scaled to 23 servings as I only had 5 oz butter. I weigh my dry ingredients after making the cookie dough it was so soft I had to add 8 tbsps of additional flour. I also added 2 tbsps sugar and 1 tsp vanilla. When I cut out the first tray of hearts I put them in the freezer with the dough scraps for about 10 minutes then I rolled the second batch of hearts and placed them in the freezer while I was filling/crimping the first tray. I cooked down my homemade apricot jam the night before to thicken it so it would not be so runny. I used my medium heart cutter which yielded 15 sandwiches that baked in 17 minutes on parchment lined sheets. I thought I had some coarse sugar but was mistaken so I just made a fast vanilla glaze to smear over the tops once cool. The pastry was light and flaky a favourite with my family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "the4taals",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1554570/"
                }
            }
        ]
    }
]