[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/758/desserts/candy/nut-candy/",
                    "name": "Nut Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213126/hazelnut-cups/",
        "name": "Hazelnut Cups",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1968106.jpg",
            "width": 1903,
            "height": 1903
        },
        "datePublished": "2020-06-19T03:41:31.000Z",
        "description": "This is an easy way to have small, impressive desserts. It goes together quickly, and it can be adapted easily. Be sure to allow a good 4 hours in the fridge before serving.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H2M",
        "totalTime": "P0DT5H2M",
        "recipeYield": "24 individual cups",
        "recipeIngredient": [
            "1 ¼ cups bittersweet chocolate chips",
            "1 teaspoon vegetable oil",
            "1 cup heavy cream",
            "1 teaspoon vanilla extract",
            "3 tablespoons coffee flavored liqueur (such as Kahlua®)",
            "2 teaspoons white sugar",
            "½ cup chocolate-hazelnut spread (such as Nutella®)",
            "½ cup heavy cream",
            "1 teaspoon white sugar",
            "2 tablespoons chopped hazelnuts, for garnish",
            "24 chocolate-covered coffee beans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the chocolate chips and oil in a microwave-safe measuring cup or ceramic bowl. Stir until all of the chips are coated with oil. Microwave for 1 minute at 60% power. Stir. Heat at full power at 15-second intervals until the chocolate is melted, stirring after every interval. (This will take between 1 to 3 minutes, depending on your microwave.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange 24 paper bonbon or candy cups on a baking sheet. Pour a small amount (about 2 teaspoons) of the melted chocolate mixture into each cup. Tip the cups to coat the insides fully with chocolate. Transfer the coated cups to the refrigerator. Reserve remaining chocolate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the cup of heavy cream, vanilla extract, and coffee liqueur in a mixing bowl. Beat on high speed until frothy. Add the 2 teaspoons of sugar and continue to beat on high until soft peaks form. Stir in the hazelnut spread and beat on medium speed until combined. Quickly fold in the reserved melted chocolate. (If the chocolate has started to set up, place in microwave again for 10 seconds at 60% power.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a pastry bag with the mousse filling and pipe it into each chocolate cup. (If a pastry bag is unavailable, use a  resealable plastic storage bag and snip off a corner.) You may need to use a spoon to smooth the tops. Chill the filled shells in the refrigerator for at least 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whip the 1/2 cup of cream until frothy; add the teaspoon of sugar and whip until stiff peaks form. Use a pastry bag to top each chocolate cup with a small dollop of whipped cream. Sprinkle with chopped hazelnuts and top with a coffee bean. Refrigerate until serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Nut Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Epcot82Guy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 6,
            "itemReviewed": "Hazelnut Cups",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "463.3 calories",
            "carbohydrateContent": "38.7 g",
            "cholesterolContent": "61.7 mg",
            "fatContent": "34.4 g",
            "fiberContent": "2.4 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "17.9 g",
            "servingSize": null,
            "sodiumContent": "36.1 mg",
            "sugarContent": "32.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-29T23:21:56.067Z",
                "reviewBody": "This is devine. Light and fluffy yummy however if you want your mousse to be smooth you have to temper the nutella and chocolate before you add it to the whipped cream. By temper I mean mix a little of the whipped cream with the nutella until smooth before adding to the whipped cream do the same with the chocolate. This will give you a beautiful smooth mousse. The first time I made this I added the nutella with out tempering and my mousse looked curdled. Good Luck.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mommascookin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4456144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-05T16:29:59.92Z",
                "reviewBody": "I made these for a party - had to be quick so I made a few shortcuts...bought chocolate cordial cups instead of making the shells and used a canned whipped cream for the garnish. Did make the filling exact to recipe and it was fantastic! Everyone raved about them and fought over who would get the last ones. Make sure to keep them chilled an hour into the party the whipped cream and mousse were breaking down a little. I used a decorative tip to fill the mousse in the cups and then the tip on the whipped cream can added a pretty visual along with the chocolate covered coffee bean on top. Looked like something you could buy at the Godiva store. Thanks for sharing - will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DanielleO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4018742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-14T17:48:19.48Z",
                "reviewBody": "Great little dessert everyone loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mo3-mdd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4887851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-01T22:52:29.45Z",
                "reviewBody": "I've not tried this recipe yet but it sounds fantastic! And the way I calculate it turning out should be pretty easy also which is why I gave it such a good rating-so I'm REALLY looking forward to trying this one out!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "purplestardust101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2857284/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-20T00:26:06.443Z",
                "reviewBody": "I wouldn't say these are easy or quick. It took me 3 tries to get the shells right. First I tried little silicone cups then I tried the paper bon bon cups. In both cases I couldn't get them unmolded without breaking them. Then I realized that the sides of the cups need a double coating of chocolate so I coated the insides with the 2 tsp. of chocolate refrigerated them until set then went back and added more chocolate to the sides with a butter knife and let them set again. That did the trick. I was able to unmold them with no problem (I did this with both the silicone cups and the paper liners and both worked but I preferred the shape of the silicone ones best). When incorporating the Nutella and chocolate into the whipped cream - you do need to add some of the cream to the chocolate first to smooth it out before adding it all to the cream (as suggested by mommascookin). This worked great. Because the shells took me so long to make I needed a short-cut to get these done so I ended up using canned whipped cream for the topping. I suggest adding the whipped cream hazelnuts and chocolate covered coffee bean RIGHT before serving (I didn't use the coffee beans as I didn't have any on hand) otherwise the whipped cream kind of weeps a bit even when refrigerated. Next time I will use semi-sweet or milk chocolate for the shells (just a personal preference).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim's Cooking Now",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kimscookingnow/"
                }
            }
        ]
    }
]