[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213200/sourdough-cheese-bread/",
        "name": "Sourdough Cheese Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2498381.jpg",
            "width": 5184,
            "height": 3888
        },
        "datePublished": "2020-06-19T03:41:32.000Z",
        "description": "A very rich, gooey appetizer, but wonderful for football Sundays!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "1 appetizer loaf",
        "recipeIngredient": [
            "1 (1 1/2) pound round loaf sourdough bread",
            "1 cup butter",
            "1 tablespoon Dijon mustard",
            "1 teaspoon lemon juice",
            "1 tablespoon poppy seeds",
            "1 tablespoon seasoned salt (such as Spice Islands® Beau Monde Seasoning)",
            "1 tablespoon minced onion",
            "1 pound Swiss cheese, sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut a checkerboard pattern into the sourdough bread round by cutting 5 or more slices about 1 inch apart into the sourdough bread round with a serrated knife, taking care not to cut all the way through the loaf. Rotate the bread a quarter turn, and cut 5 or more slices going the other way, to finish the checkerboard pattern. The slices will still be attached at the bottom.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter over low heat in a saucepan, and stir in the mustard, lemon juice, poppy seeds, seasoned salt, and onion until the mixture is well combined. Place the bread loaf onto the prepared baking sheet, and carefully pour the butter mixture all over the bread, including in the cracks between squares, letting the butter mixture soak into the bread. Stuff slices of Swiss cheese into the spaces between the bread squares.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cheese is melted and bubbling, and the loaf is browned, about 30 minutes. To serve, let guests pull the bread apart into individual squares.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LISA FRIEND"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 18,
            "itemReviewed": "Sourdough Cheese Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "153.3 calories",
            "carbohydrateContent": "11.9 g",
            "cholesterolContent": "25.7 mg",
            "fatContent": "9.3 g",
            "fiberContent": "0.5 g",
            "proteinContent": "5.8 g",
            "saturatedFatContent": "5.7 g",
            "servingSize": null,
            "sodiumContent": "240.9 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-02-17T22:27:42.61Z",
                "reviewBody": "We have made this several times and our family enjoys it very much. We first saw the recipe in a Taste of Home magazine and had to try it. We use bold and spicy mustard as we don't like the taste of the dijon and vary the cheese to what we havae or sounds good at the time. We also use sliced green onions rather than regular onions. Was served this at a wives group and everyone there enjoyed it too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CURELOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/623741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-05T21:13:28.45Z",
                "reviewBody": "This works with almost any cheese or spice you'd want to use to compliment your meal. For pairing this with chili, I use sharp cheddar and a bit of taco seasoning. For pairing with spaghetti, I use mozzerella and garlic powder. Great thing about this recipe is it takes only a hot minute and you can use all ingredients you have on hand. AND, most of the time, you can find a round sourdough loaf on the discount bread rack of your grocery store OR make it yourself for half the price!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T17:24:40.797Z",
                "reviewBody": "Cheesy and gooey just as promised! There is A LOT of butter in this recipe though and in retrospect I really wish I'd have cut it down a little because me and my boyfriend ate the whole loaf between us in one night calories calories calories!! We didn't eat the bottom of the loaf though because it was TOO soggy from the butter. Fun to eat good tasting but probably won't make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alisha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4159076/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-11-22T18:28:12.083Z",
                "reviewBody": "I am giving this 5 stars because it even works with other loaf types. I will say this is an attention getter. Most often people ask (for a potluck) who made the garlic bread because it tastes similar to garlic bread and looks somewhat like garlic bread. I made two versions with baguette style loaves and recommend if you are using that type of loaf that you use an extra large baking vessel so that your loaf can spread open. It works best with the harder crusted loaves. As an experiment I also tried it with a softer white cheese simply because of my taste preference which I do not recommend since it ends up melted at the bottom of the loaf. The swiss cheese is best because it \"stands up better.\" You may also lay slices flat after dipping one side of the bread in the mixture (two sides may be too gooey) and then placing your cheese on top and baking it that way. No matter what the taste is fabulous although I recommend it for special occasions since there is so much butter in it and like some potato chips it's difficult to limit yourself to just one slice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16817433/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-02T05:18:45.497Z",
                "reviewBody": "Fabulous 5 star idea, but incredibly salty and we didn't really care for the seasoning. Also, half the amount of butter was plenty. Next time I'll use the same concept but use a simple and yummy garlic butter with some of our fave cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Angel Hartline",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/angeltown/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-11T00:00:36.33Z",
                "reviewBody": "I've been making this for years. We call it Porcupine Bread because of how the loaf looks when stuffed with the cheese and mushroom.\nOur variation based on the recipe I use:  \n1 lb loaf of Vienna bread (can't find this in our new state!!  I use any type of soft loaf with crispy crust but family does not prefer sourdough.  It is pretty dense.)\t\n1/2 lb grated Swiss cheese and 1/2 lb grated Monterrey Jack,\n8 oz fresh mushrooms, chopped finely,\t\n3 green onions, chopped,\n1 c butter melted with 1 tsp Lawry’s salt, 1 T dry mustard then 2 T poppy seeds over the top.\nBasically follow the recipe directions here however, the mushrooms and cheese are mixed with a little green onion, then the bread is stuffed.  Finally, pour the butter mixture over all.  Top with additional green onion and sprinkle with poppy seed.  Wrap tightly in heavy foil to bake.  \nEveryone's favorite is the bottom of the bread because it get so crispy.  I think adding the butter after the cheese makes a big difference.\nAnd no, this is not a recipe for the calorie conscious ... but then ... we should all take a break from that from time to time!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lady Jane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15547777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-16T08:42:44.023Z",
                "reviewBody": "Wow. Totally amazing. I've seen recipes like this before but never made one and I finally tried this one tonight to go with some carbonara pasta. AMAZING. It's cheesy tangy flavorful and all around delicious. I literally cannot think of an improvement. My only note is that I used a single package of swiss slices 8 ounces and that was plenty. I don't see how I could have fit in the full pound it called for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Abby Pepin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15250337/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-11-04T21:59:09.887Z",
                "reviewBody": "made it exactly as recipe. The only thing I cut the bread too close and ended up with smaller pieces. Next time will do less cuts. I baked it in my toaster oven instead of heating my big oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shirley E",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3717400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-07T01:01:08.437Z",
                "reviewBody": "This was gone before anything else at my Superbowl party. Easy to make and hard not to like. I used shredded Swiss cheese instead of sliced and omitted the salt. The only downside is my Uncle Ralph is a germophobe and he won't eat bread other people touched when breaking off a piece. I am not inviting him next year.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lizzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lizziggy/"
                }
            }
        ]
    }
]